[[["Education for Sustainable Energy Development (ESED) Scholarship Program 2018 ($23,000 Worth)", "date announced:January 18, 2018", "Application Deadline: March 9th, 2018."], ["Application Deadline: March 9th, 2018.", "The", " Global Sustainable Electricity Partnership (GSEP)", " has had a long-standing commitment to education. In 2001, the Partnership reinforced this commitment by establishing the ", "Education for Sustainable Energy Development (ESED) scholarship program", " to support students from developing countries and economies in transition. The ESED program offers master’s level scholarships to outstanding students for a period of up to two years. In addition to the master’s scholarships offered, the ", "ESED program", " also supports a web-based network of scholars designed to encourage the sharing of information and knowledge among scholars and alumni.", "The purpose of the", " ESED scholarship", " is to support outstanding students pursuing advanced studies in sustainable energy development and to encourage meaningful contributions to the collective body of knowledge about this subject.", "The Global Sustainable Electricity Partnership considers an outstanding student to be one who:", "graduates with excellent grades in the top 20% of her/his class", "is determined to advance her/his knowledge and understanding", "has a history of community involvement", "is committed to sustainable energy", "is committed to return and contribute to her/his home country", "Eligibility Requirements:", "To be eligible for this scholarship, prospective applicants must:", "Undertake master’s-level studies in sustainable energy development", "Be a citizen of a developing country/territory on the ", "List of official development aid recipients identified by the Development Co-operation Directorate (DAC) of the Organisation for Economic Co-operation and Development (OECD)", "Be committed to returning to their home country/territory after their studies to contribute to its development", "Be an outstanding student\n", "Graduates with excellent grades in the top 20% of their class", "Is committed to sustainable energy development", "Has a history of community involvement", "Is determined to advance their knowledge and understanding", "Required Documents:", "You must provide an electronic copy of all the documents listed below.", "Passport (photo page only) or birth certificate", "Curriculum vitae detailing your education, work experience (if applicable), awards, and participation in volunteer and/or extracurricular activities", "Admission letter from your university program of choice\n", "If you have not yet received a letter of admission, you can upload an acknowledgement of receipt from your university showing that you have applied for admission", "If you receive your official admission letter after the scholarship application deadline, it is your responsibility to forward it via email to ", "[email protected]", " by no later than April 20, 2018. If we do not receive your official admission letter by this date, your application will not be considered", "If this application is for the second year of a two-year program, please include proof of enrolment", "Program outline\n", "Upload an outline of the curriculum or the courses you will be taking for your master’s program", "University transcript(s)\n", "If the language of your original transcript is not English, we require a certified translation of the document which includes the name of the translator as well as a copy of the original (untranslated) transcript", "If this application is for the second year of a two-year master’s program, please include your transcript for the first year", "Academic Reference Form\n", "You need to provide a completed copy of the Academic Reference Form. The form must be completed in English.", "The form must be completed by a faculty member or professor at your current or previous university who knows your academic abilities", "Should the referee wish to send the Academic Reference Form directly to the Global Sustainable Electricity Partnership, they can email it to ", "[email protected]", " by March 9, 2018. Once received, it will be indicated in the online application system", "Academic or personal reference letter\n", "You need to provide one reference letter from either an academic or personal referee", "The reference needs to be in letterform (with an official letterhead of the referee’s organization, if possible), written in English, and must be dated and signed by the referee", "An academic referee must be a faculty member or professor at your current or previous university who knows your academic abilities. They cannot be the same person as the individual who completes your Academic Reference Form.", "A personal referee should be a person (e.g. employer, supervisor, mentor, coach) who can discuss other personal qualities or interests that make you specially qualified to receive the scholarship. This referee cannot be a family member", "Please make sure that the referee includes your full name in their letter", "Should the referee wish to send their letter directly to the Global Sustainable Electricity Partnership, they can send email it to ", "[email protected]", " by March 9, 2018. Once received, it will be indicated in the online application system", "For More Information:", "Visit the Official Webpage of the ESED Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/education-for-sustainable-energy-development-esed-scholarship-program-2018/"], [["Transparency International School on Integrity (TISI) 2018 in Vilnius, Lithuania (Scholarships available)", "date announced:January 13, 2018", "Application Deadline:"], ["Application Deadline:", "scholarship applications : ", "1 May 2018", ", non-scholarship applications : ", "20 May 2018", ".", "Transparency International School on Integrity (TISI)", " is", " an annual state-of-the-art anti-corruption and accountability training for future ", "leaders. The upcoming", " TISI 2018", " will take place during ", "2-8 July, 2018", " in Vilnius, Lithuania. TISI exposes its participants to the latest developments in the field of anti-corruption and accountability and offers real opportunities to try and implement their ideas in practice.", "Following a rigorous selection process, selected students spend 7 highly intensive days learning from ", "leading anti-corruption and accountability professionals", ". TISI seeks to create a peer-to-peer learning and integrity-building environment that links theory with practice and helps young leaders to acquire better skills in bringing the anti-corruption message across.", "School lectures, seminars, training and field trips provide TISI participants with a unique blend of international and local know-how, while also challenging students to approach the subject from outside the box and offer novel, previously untested solutions. Since 2010, TISI has welcomed more than ", "900 youth leaders from around 110 countries", " worldwide.", "REQUIREMENTS:", "TISI is for ", "senior students, graduates and young professionals under the age of 35 ", "eager to learn how to make a stand against corruption and to achieve greater transparency in their country.", "The seven-day format offers a powerful mix of an intensive academic schedule, unconference-like atmosphere and continuous peer-to-peer interactions which all make it into an unforgettable one-week-long adventure.", "TISI usually hosts an equal share of participants from private and public sectors, NGOs and academia from Europe, Asia, Africa and the Americas. Such diversity in background and experience further strengthen ", "our applied approach to anti-corruption and transparency", ". Therefore, students not only learn about the causes of corruption but also spend a large part of their time learning practical ways in which societies can become more transparent and accountable.", "SCHOLARSHIPS", "A limited number of scholarships is available for applicants from certain countries. ", "Full scholarships cover international travel, tuition and accommodation expenses.", " Students seeking to receive full or partial scholarships are encouraged to apply as soon as the application process opens. In certain cases, students may be also offered ", "partial tuition fee waivers", " to cover a part of their course expenses.", "Please find the list of countries from which applicants are eligible for full scholarships: Armenia, Azerbaijan, Belarus, Bulgaria, Denmark, Estonia, Finland, Georgia, Greenland, Iceland, Latvia, Moldova, Norway, Poland, Romania, Russia, ", "South Africa,", " Sweden, Turkey and Ukraine.", "What will you learn?", "TISI is organized in cooperation with Mykolas Romeris University in Vilnius. Upon completion of the TISI course, ", "students receive 6 ECTS (European Credit Transfer System) credits", ", which only stresses the fact that participants come to the school to learn and are required to do additional preparatory reading before the School starts. The course reading material is published in advance and students are encouraged to get in touch with TISI organizers for additional reading recommendations.", "The School curriculum is presented through a variety of learning modules such as lectures, seminars, trainings, discussions, field trips, film screenings and social events. The program follows a dynamic schedule which, as the week goes by, gradually moves away from introductory topics to seminars and training aimed to address particular subjects and let participants acquire new skill sets. In short, the goal of the program is to leave all the participants inspired and empowered by creating opportunities to learn in small groups as well as through mentoring hours.", "The School features three teaching modules that cover ", "the", " ", "public sector, the private sector ", "and", " civic empowerment tools. ", "Each module deals both with theory and practice and includes:", "Public sector ", "– grand and petty corruption, measuring corruption, state capture, political party financing, public procurement, etc.", "Private sector", " – international anti-corruption mechanisms, corporate reporting standards and corruption in different industry sectors, such as the media or sports, etc.", "The civic empowerment", " module addresses the role of citizens in monitoring the activities of the state and explores ways in which people can become involved in the public decision-making process, in reporting corruption and in anti-corruption activities.", "For additional questions regarding the application procedure, fees, scholarships or other general inquiries, please contact us at ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the Transparency International School on Integrity (TISI) 2018"], "url : https://www.opportunitiesforafricans.com/transparency-international-school-on-integrity-tisi-2018/"], [["Onsi Sawiris Undergraduate Scholarship Program 2019 for Study in USA (Fully Funded)", "date announced:January 5, 2018", "Application Deadline: July 31st, 2018"], ["Application Deadline: ", "July 31st, 2018", "Apply Now for the", " 2019 Onsi Sawiris Undergraduate Scholarship Program", "Orascom Construction (OC)", " traces its roots back to 1950 when Eng. Onsi Sawiris first founded a construction company with a few friends in Upper Egypt. By digging waterways and paving roads, he built his business into one of Egypt’s largest general contractors. In 1961, the business was nationalized under President Nasser and later became known as the El Nasr Civil Works Company. Not content to be an employee in his own company, Eng. Sawiris left for Libya where he continued his construction career. In 1976, he returned to Egypt and founded Orascom as a general contracting and trading company with five employees. By the early 1990s, Eng. Sawiris had established Orascom as a leading private sector contractor by working in partnership with international companies pursuing projects in Egypt. Today Orascom Construction continues to blend international technical know-how with local resources to undertake even larger, more complex, and demanding projects.", "OC seeks to promote excellence and achievement. OC launched the Onsi Sawiris Program in the year 2000 to invest company resources in educational programs to improve the communities in which it works. Through the Onsi Sawiris Scholarship program, OC provides full tuition scholarships for Egyptian undergraduate students seeking to pursue their Bachelor’s degree in fields that will enhance the economic prosperity of Egypt at prestigious universities in the United States.", "The Onsi Sawiris Scholarships will be awarded based on character and merit as demonstrated through academic excellence, extracurricular activities, and entrepreneurial initiative. The scholarships include full tuition, a living allowance, travel and health insurance. Scholarship recipients will also be given the option of an internship position within the company.", "Eligibility Requirements", "Candidates should:", "Meet the above criteria", "Be planning to start their studies in the U.S.A in the year 2019", "Be Egyptian nationals, who are residents of Egypt (preference will not be given to dual nationality applicants)", "Have not lived more than 3 years abroad", "Be committed to coming back to Egypt for two years directly after the successful completion of their bachelor’s degree", "GPA 3.5 / 90% in Thanaweyya Amma certification (Secondary year) or equivalent certificates", "iBT TOEFL: 100 or above [or equivalent]", "Minimum SAT I Score", "Old SAT (before May 2016)", "New SAT (after May 2016)", "Overall: 2100", "Overall: 1450", "Reading: 700", "Evidence-Based Reading and Writing: 730", "Math: 700", "Math: 730", "Writing: 700", "SAT II in 3 subjects: 600 or above", "Extracurricular Activities", "Fields of Study:", "\nEngineering, Economics, Political Science, Finance and Management.", "Important notes:", "Preference will be given to candidates who have not lived, worked, or studied abroad for a significant period of time.", "The Onsi Sawiris Scholarship Program is only granted to the list of endorsed universities provided in the “", "Approved Universities", "” section of the application.", "Selection as a nominee for the Onsi Sawiris Scholarship Program does not guarantee university acceptance. Applicants will be supported in applying for these universities. If nominated for the scholarship; the Onsi Sawiris Scholarship Program award will be made once university acceptance is obtained.", "Please submit:", "Application form", "Resume", "Copy of test scores (SAT I / or SAT II) & IBT TOEFL", "Copy of transcripts", "Copy of graduation certificate or Thanaweyya Amma certificate (if available)", "Two recommendation letters", "For Inquiries, please contact us at :", "E-Mail:", "[email protected]", "For More Information:", "Visit the Official Webpage of the Onsi Sawiris Undergraduate Scholarship Program 2019"], "url : https://www.opportunitiesforafricans.com/onsi-sawiris-undergraduate-scholarship-program-2019/"], [["ARPPIS-DAAD PhD Scholarships 2018 for study at the International Centre of Insect Physiology and Ecology (icipe),Kenya", "date announced:January 12, 2018", "Application Deadline: 4th February 2018"], ["Application Deadline: ", "4", "th", " February 2018", "The International Centre of Insect Physiology and Ecology ", "(", "icipe", ")", ", Kenya", ",", " in partnership with the ", "German Academic Exchange Service (DAAD", "1", ") In-Country/In-Region Scholarships Programme", " and African university partners, invites applications from suitably qualified candidates for ", "PhD scholarships in the African Regional Postgraduate Programme in Insect Sciences (ARPPIS).", "The primary objective of ARPPIS is to prepare young researchers from Africa to compete in an internationally competitive research environment within national, regional and international research programmes. At ", "icipe", ", ARPPIS scholars are provided with excellent research facilities in an interdisciplinary environment within a structured, three-year PhD programme that includes research, training, developing research partnerships, and scientific meetings and international conferences. Scholars conduct their innovative research at ", "icipe", "’s laboratories and at field sites located in various agro-ecological zones.", "Twelve", " ARPPIS-DAAD PhD scholarships are available to nationals of sub-Saharan countries for the following projects: ", "LIST OF PROJECTS", "The scholarships cover all costs of the PhD programme, including travel, living expenses, medical insurance, university fees and all research and training costs.", "Successful candidates will develop a full proposal and register with an ARPPIS partner university in Africa ", "after", " they start the PhD programme at ", "icipe", ".", "The ARPPIS PhD programme will commence from September 2018.", "Eligibility criteria", "The applicant must be a citizen of a country in sub-Saharan Africa. However, some country restrictions apply. See ", "LIST OF PROJECTS", " for more details.", "A Bachelor’s degree with a minimum pass of second-class, upper division.", "A Master’s degree taken with both coursework and research in the field of natural sciences or other field relevant to the PhD project.", "The Master’s degree must have been completed less than six years ago at the time of application.", "Qualified female candidates and candidates from less privileged regions or groups as well as candidates with disabilities are especially encouraged to apply.", "Qualified nationals of French- and Portuguese-speaking countries in Africa are also encouraged to apply.", "Preference will be given to applicants with a maximum age of 36 years (men) or 40 years (women) by 31", "st", " December 2018.", "Additional specific entrance requirements will be considered for admission depending on the eligible PhD project(s) selected by the candidate. For information on applicant requirements for each project go to: ", "LIST OF PROJECTS", "A working knowledge of English (written & spoken).", "Completed application forms and accompanying supporting documents. ", "Note: ", "please start the application process as soon as possible, especially if some of the supporting documents are difficult to obtain.", "Application Procedure ", "Full instructions and online application: ", "http://cbid.", "icipe", ".org/apps/arppis_application_2018/index.php", "For More Information:", "Visit the Official Webpage of the ARPPIS-DAAD PhD Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/arppis-daad-phd-scholarships-2018-for-study-at-the-international-centre-of-insect-physiology-and-ecology-icipekenya/"], [["DAAD Scholarships for the Master of Research and Public Policy 2018/2019 for Africans.", "date announced:January 12, 2018", "Application Deadline: Friday, February 16, 2018 at 1700hrs."], ["Application Deadline: ", "Friday, February 16, 2018 at 1700hrs", ".", "The Partnership for African Social and Governance Research (PASGR)", " is an independent, non-partisan pan-African not-for-profit organisation working to enhance research excellence in governance and public policy that contributes to the overall wellbeing of women and men.", "In its Higher Education Programme, PASGR works with thirteen universities across seven African countries to implement a collaborative ", "Master of Research and Public Policy", " (MRPP) programme. Seven of the universities are located in East Africa:", "University of Nairobi; Maseno University; Egerton University; Uganda Christian University; Uganda Martyrs University; University of Dar es Salaam; and Mzumbe University.", "PASGR invites applications from eligible candidates for the ", "DA", "AD In-Country/In-Region Scholarships for the MRPP.", " The scholarships include tuition fees to the university according to the submitted fees structure, a monthly stipend to cover living costs and accommodation (at DAAD rates), as well as an annual study and research allowance.", "Eligibility:", "Eligible candidates must be citizens of a country in sub-Saharan Africa, admitted to study the Master of Research and Public Policy (MRPP) programme at any of the universities listed above. Applicants must hold a Bachelor’s and / or Master’s degree qualification with at least a second class honours upper division from any accredited university. The last university degree must have been completed less than six years ago at the time of application.", "Note: Potential candidates who are not enrolled in the programme are advised to ", "contact any of the universities listed above directly", " for admission first. Prospective students may request admission at a university within or outside their home country.", "Duration and commencement:", "Scholarships are available for up to a maximum of two years. The scholarship will be initially granted for one year and may be extended upon individual request and receipt of a complete application using using a form that DAAD will avail on its portal around March 2019.", "Application documents:", "Fully filled and signed", " ", "PASGR Scholarship Application Form", ";", "Signed ", "curriculum vitae ", "scanned in PDF. Please use the Europass CV template: ", "http://europass.cedefop.europa.eu", "Certified", " scanned PDF copies of all ", "university degree certificates", ";", "Certified", " scanned PDF copies of all ", "university transcripts", ";", "Proof of admission to the Master of Research and Public Policy, which may be a temporary ", "admission letter ", "including fee structure of the course (scanned PDF copy);", "Letter of motivation", " (maximum 2 pages in PDF);", "Academic reference ", "from senior lecturer and proof of employment if applicable (scanned PDF copy); and,", "A signed and scanned copy of this document: ", "DAAD Scholars information sheet 2018", "Application procedure and deadline:", "A complete application form must be sent to ", "PASGR ", "– ", "[email protected]", " – together with all the application documents listed above ", "by Friday, February 16, 2018 at 1700hrs", ".", "For More Information:", "Visit the Official Webpage of the DAAD Scholarships for the Master of Research and Public Policy 2018/2019"], "url : https://www.opportunitiesforafricans.com/daad-scholarships-for-the-master-of-research-and-public-policy-2018-2019/"], [["The foundation FUNAGIB 2018 Scholarship for African students working on cassava\u2028\u2028 (Funded to Brazil)", "date announced:January 13, 2018", "Application Deadline: 31st March 2018"], ["Application Deadline: 31st March 2018", "The foundation FUNAGIB", " was established in 2015 by its founder ", "Nagib Nassar", " thanks to ", "Kuwait KFAS (Kuwait Foundation for the Advancement of Science) Prize", " received by him in the same year. FUNAGIB offers three scholarships annually to postgraduate students working with cassava breeding. One of these is dedicated to an African student, while the other two are designated to Brazilians.", "The African scholarship this year is being announced here: application deadline is 31 March 2018, and study should begin at Brasilia by 1st August 2018.", "Eligible Requirements", "Candidates for this scholarship should have completed their course credits and should be in phase of preparing their thesis.", "Major field of his (her) study should be on cassava plant breeding.", "Guidelines", "Applicants must send by e-mail the following documents:", "A recommendation letter from faculty or supervisor", "Curriculum Vitae", "Academic history", "Statement by candidate endorsed by his supervisor declaring commitment of the student to five months of the research on cassava periclinal chimera to improve the crop to be conducted at Brasília, Brazil.", "This subject should be a part of the final thesis.", "Award amount: R$ 20,000 (twenty thousand reais – US$ 1.00 = R$ 3.2 more or less according to real fluctuation), including air ticket.", "\u2028\u2028Contact: Prof. Nagib Nassar (E-mail: ", "[email protected]", " )", "For More Information:", "Visit the Official Webpage of the foundation FUNAGIB 2018 Scholarship "], "url : https://www.opportunitiesforafricans.com/the-foundation-funagib-2018-scholarship-for-african-students-working-on-cassava%e2%80%a8%e2%80%a8-funded-to-brazil/"], [["Association of Commonwealth Universities (ACU) 2018 Commonwealth Scholarships in low and middle income countries (Fully Funded)", "date announced:January 15, 2018", "Application Deadline:  11 March 2018 at midnight GMT."], ["Application Deadline: ", " 11 March 2018", " at midnight GMT.", "These Commonwealth Master’s Scholarships", " ", "allow successful applicants to benefit from the expertise provided by universities in low and middle income countries around the Commonwealth. They are majority funded by the ", "Commonwealth Scholarship and Fellowship Plan (CSFP).", " The scholarships give talented students – who can be from any Commonwealth country other than the host country – the opportunity to gain a Master’s degree while developing new skills and experiencing life in another country.", "Eligibility", "Applicants must be a citizen of a ", "Commonwealth country", ", other than the host country.", "Applicants must hold a Bachelors degree of at least upper second level.", "Benefits", "The scholarships are fully-funded, providing full tuition fees, a return economy flight, an arrival allowance, and a regular stipend (living allowance).", "They are for Master’s courses only and are not applicable to distance learning courses.", "2018 scholarships", "For more information about each scholarship and to apply see the links below.", "Bangladesh – University of Dhaka", ", one scholarship available (all Master’s courses) – ", "find out more"], "url : https://www.opportunitiesforafricans.com/acu-2018-commonwealth-scholarships-in-low-and-middle-income-countries/"], [["Mercedes-Benz South Africa Bursary Programme – 2018 for young South Africans", "date announced:January 3, 2018", "Application Deadline: January 26th 2018"], ["Application Deadline: January 26th 2018", "Get a head-start into the world of work by participating in the ", "Mercedes-Benz South Africa Bursary Programme,", " and transport your career with one of the world’s most successful automotive companies. The Programme aims to harness outstanding achievers at Grade 12 and Tertiary levels into our fold of growing Talent, by offering the participant financial aid for studies as well as experiential learning.", "Why a ", "Mercedes-Benz South Africa Bursary", "?", "\n* Study at a University of choice*", "\n* Tuition fees, meals and textbooks are paid for*", "\n* Work at Mercedes-Benz, East London during your vacations*", "\n* Join the MBSA Graduate Development programme after studying*\u2028* Conditions apply", "Requirements", "South African Citizens, or permanent residents of South Africa", "Grade 12 learners", "Students enrolled for, or currently pursuing, full-time studies (1st, 2nd and 3rd yr students may apply)", "Anyone studying (or intending to study in):", "\n* Engineering", "\n* Mechanical", "\n* Electrical/Electronics", "\n* Industrial", "\n* Mechatronics", "\n* Economics", "\n* Finance/Accounting", "\n* HR", "\n* IT"], "url : https://www.opportunitiesforafricans.com/mercedes-benz-south-africa-bursary-programme-2018-for-young-south-africans/"], [["Aga Khan Foundation International Scholarship Programme 2018/2019 for Postgraduate Studies", "date announced:January 2, 2018", "Application Deadline: March 31st 2018"], ["Application Deadline: March 31st 2018", "The Aga Khan Foundation 2018-2019 International Scholarship Programme", " ", "application cycle opens from January 1, 2018. Application forms can be obtained from the Aga Khan Foundation or Aga Khan Education Board/Service office in the applicant’s country of current residence.", "NOTE:", " For the 2018-19 application cycle, the Foundation will not accept applications from students planning to attend universities in UK, Germany, Sweden, Austria, Denmark, The Netherlands, Italy, Norway and Ireland.", "The Aga Khan Foundation provides a limited number of scholarships each year for postgraduate studies to outstanding students from select developing countries who have no other means of financing their studies, in order to develop effective scholars and leaders and to prepare them for employment, primarily within the AKDN. Scholarships are awarded on a 50% grant : 50% loan basis through a competitive application process once a year in June or July.", "The Foundation gives priority to requests for Master’s level courses but is willing to consider applications for PhD programmes, only in the case of outstanding students who are highly recommended for doctoral studies by their professors and who need a PhD for the fulfilment of their career objectives (academic or research oriented).", "Applications for short-term courses are not considered; neither are applications from students who have already started their course of study.", "ELIGIBILITY", "Geographic Scope", "The Foundation accepts applications from nationals of the following countries:", "Bangladesh, India, Pakistan, Afghanistan, Tajikistan, Kyrgyzstan, Syria,", " Egypt, Kenya, Tanzania, Uganda, Madagascar", " and", " Mozambique.", " In France, Portugal, UK, USA and Canada, applications are accepted from those who are originally from one of the above developing countries, are interested in development-related studies and who have no other means of financing their education.", "Residency Requirement", "The Foundation only accepts applications of eligible nationals listed above who are residing in one of the countries where there are local Aga Khan Foundation (AKF), Aga Khan Education Services (AKES), or Aga Khan Education Board (AKEB) offices which process applications and interview candidates.", "Age Limit", "Preference is given to students under 30 years of age.", "SELECTION CRITERIA", "The main criteria for selecting award winners are: l) consistently excellent academic records, 2) genuine financial need, 3) admission to a highly reputable university or programme of study and 4) relevance of the field of study to AKDN’s focus areas. Candidates are also evaluated on demonstrating thoughtful and coherent educational and career plans, their extra-curricular interests and achievements, potential to achieve their goals and likelihood to succeed in a foreign academic environment. Applicants are expected to have some years of work experience in their field of interest.", "Financial Assistance", "The Foundation assists students with tuition fees and living expenses only. The cost of travel is not included in AKF scholarships. Funding for PhD programmes is only provided for the first two years of study, after which the students are expected to find alternative sources of assistance. Financial assistance is provided according to the needs of students, but the ISP must be considered a lender of last resort. Applicants are requested to make every effort to obtain funding from other sources as well, so that the amount requested from the Foundation can be reduced to a minimum. Preference is given to those who have been able to secure some funding from alternative sources.", "Loan Conditions", "Half of the scholarship amount is considered as a loan, which must be reimbursed with an annual service charge of 5%. A guarantor is required to co-sign the loan agreement. The payback period is five years, starting six months after the study period funded by the Aga Khan Foundation.", "Application Procedures", "The application procedures of AKF’s International Scholarship Programme are decentralised. Students may obtain application forms as of January 1st each year from ", "AKF offices", " or ", "Aga Khan Education Services / Boards", " in their countries of current residence. Completed applications should be returned to the agency from which the form was obtained. They should not be sent to Geneva.", "Application Deadline", "The deadline for submission of entire completed applications is March 31, although in certain countries internal deadlines may be earlier in order to process and review applications.", "Applicants are advised to contact the local offices for internal deadline dates and requirements as these may vary from country to country.", "Late or incomplete applications will not be accepted.", "For More Information:", "Visit the Official Webpage of the Aga Khan Foundation International Scholarship Program 2018/2019"], "url : https://www.opportunitiesforafricans.com/aga-khan-foundation-international-scholarship-programme-2018-2019/"], [["Study an online Diploma in Accounting and Financial Management – Win a 50% scholarship to study for a British Level 6 Diploma", "date announced:January 5, 2018", "Application Deadline: Ongoing"], ["Application Deadline: Ongoing", "Want to be an ACCA Chartered Certified Accountant? ", "Here’s a short cut for you – ", "study online (with invigilated exams) with Unicaf University and receive a quality certification without leaving the comfort of your home.", " This British Level 6 Diploma is approved by Ofqual in the UK and is equivalent to a Bachelor’s degree. Earning this diploma means you’ll be exempted from nine of the fourteen examination papers of the ACCA.", "With the Level 6 Diploma and under certain conditions you can also:", "    Gain direct entry to an MBA Degree from the University of South Wales (UK)", "    Obtain a BSc (Hons) in Applied Accounting from Oxford Brookes University (UK)", "Unicaf University", "Unicaf University", " is an independent university with multiple campuses that offers high-quality, internationally recognized qualifications. Learn at your own pace, while keeping your job and taking care of your family.", "With the Level 6 Diploma and under certain conditions you can also:", "Gain direct entry to an MBA Degree from the University of South Wales (UK)", "Obtain a BSc (Hons) in Applied Accounting from Oxford Brookes University (UK)", "The UNICAF Scholarship Programme is one of the most generous programs available in the world today. More than 9,000 students have already benefited from UNICAF scholarships worth over USD 70 million!", "Requirements:", "Admission Requirements for Unicaf University", "High School Leaving Certificate with an aggregate score of at least 60%", "Proficiency in the English Language", "A copy of the passport or ID", "An updated CV", "English Proficiency", " (one of the below)", "IELTS 6.5 (with a minimum of 6.5 in the writing component and no individual component lower than 6.0)", "English Placement Test with a minimum 6.5 equivalence (provided that the score in each individual component is no less than 6.0).", "Deadline", ": No deadline, Unicaf is accepting students on a rolling basis.", "Program starts:", " New classes start each month", "Duration:", " 18 months – 3 years", "Application Procedure:", "Take the Sqore challenge for a chance to win a scholarship", ".", " Then apply directly to Unicaf University.", "For More Information:", "Visit the Official Webpage of the online Diploma in Accounting and Financial Management "], "url : https://www.opportunitiesforafricans.com/study-an-online-diploma-in-accounting-and-financial-management/"], [["Petroleum Technology Development Fund (PTDF) 2018/2019 Overseas Postgraduate Scholarship Scheme for study in Germany/France/China (Funded)", "date announced:January 10, 2018", "Application Deadline: February 5th 2018"], ["Application Deadline: February 5th 2018", "The Petroleum Technology Development Fund (PTDF),", " the Federal Government agency with the mandate of developing indigenous human capacity and petroleum technology to meet the needs of the oil and gas industry, invites applications from suitably qualified candidates for Overseas MSc and PhD Scholarships to institutions under its strategic partnership initiative. Successful candidates will be awarded scholarships to study in Germany/France/China commencing in the 2018/2019 academic session.", "The Strategic Partnership Scholarship was developed to improve the Funds’ Overseas Scholarship Scheme by offering candidates the opportunity to benefit from a diversified pool of knowledge and the facilities offered by world-class institutions across the globe.", "In recognition of the fact that the best education can be found on numerous shores, the Fund has sought out strategic partnerships in Germany, France and China where candidates are offered the opportunity to study in ", "English-taught classes", " and conduct research in world-class facilities where they will also have the opportunity of experiencing new cultures and work environments.", "Under this scheme, candidates are invited to apply through PTDF to specific programmes at the partner institutions in any of the three countries (full list of sponsored courses is available below). The award includes the provision of flight tickets, payment of health insurance, payment of tuition and bench fees (where applicable) as well as the provision of allowances to meet the costs of accommodation and living expenses. The programmes will also include language classes to aid scholars settle into their new environments. ", "Please note that the Fund will be responsible for obtaining admissions for the candidates to their selected programmes.", " ", "Application Process", "Application Forms can be obtained via this link ", "www.ptdf.flexisaf.com", "  However applicants are advised to read through the requirements below before applying.", " ", "Selection Process, Criteria & Requirements", "PTDF scholarships are highly competitive and only candidates who are outstanding across the board are selected. A selection committee will be constituted to assess applications using the following criteria;", "Academic merit as evidenced by quality of degrees, full academic transcripts, other professional qualifications acquired, and relevant publications to be referenced by applicant ", "(PhD applicants only)", "Membership of professional bodies", "The viability of the study/research plan.", "Applicants are required to make a case for their scholarship by submitting a statement of purpose (maximum 500 words) stating the reason(s) they want to undertake the study, the relevance of the proposed study to the industry and its expected impact on national development.", "Requirements", "MSc", "A minimum of Second Class Upper (2.1) qualification in their first degree or a Second Class Lower (2.2) with relevant industry experience", "Must have completed the mandatory National Youth Service (NYSC)", "Must be computer literate", "Possession of 5 O/level credits including English Language.", " ", "PhD ", "Must have completed the mandatory National Youth Service (NYSC)", "Must be computer literate", "A minimum of Second Class Lower (2.2) in their first degree and a good second degree certificate;", "Must submit a research proposal relevant to the oil and gas industry (of not more than 5 pages) to include: Topic, introduction, objective, methodology and mode of data collection;", "Applicants must also include their masters degree project", " ", "Required Documents ", "Applicants are advised to scan copies of the following documents and attach to their online application forms:", "First Degree Certificate or Statement of Result", "NYSC discharge certificate", "WAEC/GCE/SSCE/NECO results as well as the PIN numbers on the application forms to enable PTDF view the O’level results on the relevant website).", "Recent Passport Photograph", "Local Government Identification Letter", "Master’s Degree Certificate ", "(PhD Applicants only)", "Evidence of membership of professional associations", "*Candidates who successfully scale through the first round of screening will be requested to submit their transcripts; all applicants are therefore advised to prepare their transcripts for submission in anticipation of such a request.", "For More Information:", "Visit the Official Webpage of the PTDF 2018/2019 Overseas Postgraduate Scholarship Scheme"], "url : https://www.opportunitiesforafricans.com/petroleum-technology-development-fund-ptdf-2018-2019-overseas-postgraduate-scholarship-scheme/"], [["King Carl Gustaf Scholarship 2018 for Students from Conflict Areas to study in Sweden.", "date announced:January 17, 2018", "Application Deadline: February 1st 2018"], ["Application Deadline: February 1st 2018", "The King Carl Gustaf Scholarship", " is aimed at students who live in unsafe and dangerous conditions in areas of conflict outside Europe. Scholarships will cover the cost of tuition, but not living expenses, for studies at Uppsala University Master’s programmes offered during the current admission round and commencing 3 September 2018.", "For studies at:", " Master’s programmes", "Eligibility criteria:", "Citizens of: Afghanistan, DR Congo, Ethiopia, India, Iraq, Libya, Mexico, Nigeria, Pakistan, Somalia, South Sudan, Sudan, Syria, Turkey and Yemen.", "Applicants must show why they are particularly vulnerable and therefore in need to belonging to the education environment at Uppsala University as well as having the academic talent required.", "Students can only be awarded a King Carl Gustaf scholarship if a programme at Uppsala University is chosen as first priority.", "You must meet the entrance requirements for the programme you applied to and application fee and supporting documents must have been received before deadline to University Admissions.", "The programme must be delivered on campus.", "Documentation to send:", "No extra documents need to be sent. We will use documentation you submit with your programme application on ", "www.universityadmissions.se", ".", "Your application ID from ", "www.universityadmissions.se", " must be noted on the scholarship application form.", "For More Information:", "Visit the Official Webpage of the King Carl Gustaf Scholarship"], "url : https://www.opportunitiesforafricans.com/king-carl-gustaf-scholarship-2018/"], [["CIFAR Azrieli Global Scholars program 2018 for Early Career Researchers (Funded to Toronto, Canada & CDN $100,000 in Funding)", "date announced:January 10, 2018", "Application Deadline: February 22, 2018 – 11:59 PM Pacific Time Zone (UTC -8)"], ["Application Deadline: February 22, 2018 – 11:59 PM Pacific Time Zone (UTC -8)", "CIFAR invites exceptional early career researchers to join CIFAR’s global network of 370 researchers from 18 countries who together are pursuing answers to some of the most complex challenges facing the world today. The ", "CIFAR Azrieli Global Scholars program", " provides funding, skills training, mentorship, and opportunities to collaborate with outstanding colleagues from diverse disciplines to position scholars as leaders and agents of change within academia and beyond.", "CIFAR Azrieli Global Scholars receive:", "• $100,000 CDN in unrestricted research support", "\n• A two-year membership to a CIFAR research program, with outstanding research leaders from across disciplines.", "Eligibility", "Applicants can be from anywhere in the world, must hold a PhD (or equivalent) and be within the first five years of a full-time academic appointment.", "Please note that postdoctoral fellows are not eligible to apply to the program. Scholars’ research interests must be aligned with the themes of an eligible CIFAR research program.", "In 2018, the eligible programs are:", "• ", "Azrieli Program in Brain, Mind & Consciousness", "• ", "Bio-Inspired Solar Energy", "• ", "Gravity & the Extreme Universe", "• ", "Humans & the Microbiome", "• ", "Molecular Architecture of Life", "Engage in research that complements and contributes to the themes and goals of one of the eligible CIFAR research programs", "• Demonstrate an outstanding level of research achievement and promise of future impact in their field, as evidenced by quality of publications, awards received, and statements by referees.", "• Be interested in engaging across disciplines, as well as sectors beyond academia, to enrich and extend the impact of their research.", "• Have a valid passport, and if required be able to obtain travel visas, to attend CIFAR meetings in Canada and other countries around the world (2-4 times per year).", "• Be available to attend a two-day in-person interview* on June 27-28, 2018 in Toronto, Canada.", "Be fluent in spoken and written English.", "Benefits", "Travel costs will be covered by CIFAR", "Value:", "Scholars receive $100,000 CDN in unrestricted research support.", "The funds are administered through the scholar’s home institution and are intended to support his or her capacity to conduct research. Possible uses include, but are not limited to: teaching release, student support, summer salary (where applicable), and research assistant salaries.", "CIFAR covers the cost of attendance at meetings of a CIFAR research program and the CIFAR Azrieli Global Scholars annual meeting.", "Expectations:", "During the two-year term, scholars are expected to:", "• Attend CIFAR research program meetings (usually 2-3 per year, depending on the program) in Canada and various locations around the world. While at meetings and where appropriate, we encourage scholars to interact and collaborate with fellow program members on research areas of common interest to the program.", "• Attend annual CIFAR Azrieli Global Scholar meetings (usually held in early May).", "• Report on research achievements and related activities annually.", "• Acknowledge CIFAR as part of their title and affiliation (e.g. ‘CIFAR Azrieli Global Scholar’ in professional signature, presentations, website, publications) and as a funder in research publications and presentations supported by this funding.", "How to Apply:", "All applications are submitted online and must include letters of reference. See detailed overview of the ", "CIFAR Azrieli Global Scholars program", ".", "The deadline for applications is February 22, 2018.", " ", "For More Information:", "Visit the Official Webpage of the CIFAR Azrieli Global Scholars program 2018"], "url : https://www.opportunitiesforafricans.com/cifar-azrieli-global-scholars-program-2018/"], [["Yousef Jameel GAPP Public Leadership Program 2018 for young Egyptians (Fully Funded)", "date announced:January 9, 2018", "Application Deadline: February 1st 2018"], ["Application Deadline: February 1st 2018", "In May 2011, Yousef Jameel, working with the School of Global Affairs and Public Policy (GAPP), initiated the ", "Yousef Jameel Public Leadership Program,", " with the overall objective of building the capacity of young competent Egyptian nationals in the areas of public policy and public administration, and preparing them for leadership roles in Egypt after the January 25 Revolution.", "By supporting 300 fellows in 12 cohorts of 25 Egyptian graduate students per year, the Yousef Jameel Public Leadership Program will have contributed to creating a cadre of well educated, competent graduates ready to take on the responsibility of affecting change in the Egyptian society.", "A selected number of exceptional candidates are to receive a complete fellowship to pursue a master’s degree in one of the following six programs at AUC:", "Master of Public Policy (MPP)", "Master of Public Administration (MPA)", "Master of Global Affairs (MGA)", "Master of Arts in Journalism and Mass Communication", "Master of Arts in International Human Rights Law", "Master of Law in International and Comparative Law (LLM)", "Eligibility", "Egyptian nationals", "Bachelor’s degree from an accredited university in social sciences (business administration, management, political science, law, etc.), engineering (mechanical, electrical, construction, etc.) or science (pharmacy, medicine, computer science, chemistry, etc.)", "Minimum grade point average of 3.2 or a rating of gayed geddan.", "Satisfy AUC graduate admissions requirements, including submission of AUC graduate application, needed documents, and any needed additional exams ", "as per AUC’s graduate admissions requirements", "Submit an international TOEFL IBT exam score or an IELTS exam score", " ", "as per the cut-off scores for AUC graduate admissions", "Minimum of two and a maximum of 12 years of relevant professional work  experience after receiving their bachelor’s degree, preferably in public, nonprofit or international development organizations; ", "Graduates of 2006 – 2016​.", "Financial need", "Duration", "Students must complete their master’s degrees within a period of two and a half years including an optional semester as a study-abroad. The fellowship is subject for review every semester.", "Award", "The fellowships covers:", "Tuition fees", "Student services and activities fees", "Remedial English courses", "Book allowance per semester", "Monthly stipend", "Accommodation allowance for non-residents of Cairo", "Bus transportation fees", "Study abroad opportunity for one semester according to AUC student exchange policies (travel and living expenses)", "To Apply", "Step 1: ", "Apply ", "online", " for graduate admission with all supporting documents including the English exam results by ", "February 1, 2018", "Step 2: ", "Take the required English language exam", "International TOEFL Exam (IBT) either online at", " ", "www.ets.org", ", or at AMIDEAST", "\n(tel 19263 – 38 Mohie El Din Abou El Ezz Street, Dokki, Giza) ", "or", "International English Language Testing System (", "IELTS", ") either online", ", or at ", "the British Council", "(tel 19789 – Heliopolis Branch: 4 El Minya Street, Heliopolis, Cairo", " ", "– Agouza Branch: 192 El Nil Street, Agouza, Giza)", "Step 3:", " ", "Complete and submit the ", "online fellowship application", " by ", "February 15, 2018", "Important Note:", " It takes three to seven days once you receive your ID to get the online fellowship web application process started.", "Deadline", "Applications with all supporting documents (including English exam results) should be submitted by ", "February 1, 2018", "Applications received for Spring 2018 will be considered for Fall 2018.", "For more information about the program, contact: ", "[email protected]", ",  tel 20.2.2615.3350/3466", "Instructions to Fellowship Application ", "Apply to Graduate Fellowship", "For More Information:", "Visit the Official Webpage of the Yousef Jameel GAPP Public Leadership Program 2018 "], "url : https://www.opportunitiesforafricans.com/yousef-jameel-gapp-public-leadership-program-2018/"], [["A.S.Hornby Educational Trust scholarships 2018/2019 for study in the UK (Fully Funded)", "date announced:January 13, 2018", "Application Deadline: 12.00 midday UK time on Friday 16th February 2018."], ["Application Deadline: 12.00 midday UK time on Friday 16th February 2018.", "This is to announce the opening of the recruitment process for the", " ", "A.S.Hornby Educational Trust scholarships for study in the UK", " between October 2018 and September 2019.", "The A.S.Hornby Educational Trust scholarships are awarded every year to English language teachers from outside the UK to study for Masters in ELT at the University of Warwick.", "The Trust was set up by A.S.Hornby in 1961 to support English language teaching worldwide. A.S.Hornby had a distinguished career in English language teaching and developed the Oxford Advanced Learners’ Dictionary, which is still published in its 8th edition by Oxford University Press. The Trust is a registered charity in the UK.", "The scholarships fund study on the one-year Masters in TESOL at the University of Warwick", "The scholarships cover all the costs in the UK including a monthly stipend to cover accommodation and living expenses, tuition fees, and return air tickets, tuition fees,  visa and IELTS test costs", "Eligible applicants for the scholarship award must have at least two years’ full-time English language teaching experience and a full university degree. Applicants also require the level of English proficiency required by the university (this is normally assessed according to IELTS – scholars require an overall score of 6.5, with no less than 6.0 in any of the categories). The Hornby Scholarships are intended to support experienced English language teachers who have the potential to make a significant future contribution to English language teaching and teachers in their countries", "Applicants are selected by a four-stage process. In the first stage, the quality of the application form is assessed. In the second stage, selected applicants are invited for an interview at the British Council office in their country of origin. In the third stage, selected applicants apply to the university. In the fourth stage, the successful applicant is accepted by the university. Only at this stage is the scholarship award is confirmed with the applicant.", "Apply Now for the 2018 A.S.Hornby Educational Trust scholarships", "For general inquiries about the scholarships: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the A.S.Hornby Educational Trust scholarships 2018"], "url : https://www.opportunitiesforafricans.com/a-s-hornby-educational-trust-scholarships-2018/"], [["African Water Association (AWA) African Young Water and Sanitation Professionals AfYWSP Scholarships 2018", "date announced:January 11, 2018", "Application Deadline: Wednesday, 28 February 2018"], ["Application Deadline: ", "Wednesday, 28 February 2018", "As part of its Capacity-Building Program for African stakeholders in the ", "water, sanitation and hygiene sector (AfriCap", ") funded by USAID West Africa, the African Water Association is awarding research scholarships to African Young Water and ", "Sanitation", " Definition: ", "A general term used to describe a battery of actions that all aim to reduce the spread of pathogens …", " Professionals.", "Target beneficiaries are master students and engineers at the end of their training and PhD studies. Each scholarship, with a maximum value of USD1,000 (one thousand), will make it possible to carry out a research work sanctioned by a scientific report on a theme related to the WASH sector.", " Application process ", "Candidates for the scholarship program will formulate their research topics in relation to one of the themes proposed in this call for applications. They will also be able to apply to one of the research topics proposed by one of the members of ", "AfWA", "AfWA", "Definition: ", " African Water Association…", ". Topics will be available on ", "AfWA", "AfWA", "Definition: ", " African Water Association…", " website.", "Eligibility Requirements:", "To apply, applicants must fulfill the following requirements:", "Be a citizen of a country in the USAID West Africa desk coverage area and identified on the map of Fig 1 below;", "be in good standing academically with respect to their institution;", "Submit a nomination file including :", "Student card or registration receipt for the current year", "Last completed degree", "Curriculum vitae,", "Three recommendation letters (one should be from the academic supervisor),", "Research proposal form to be downloaded from here", ". ", "Click here", "Financial aspect ", "As part of this scholarship, the maximum amount allocated per recipient is US $ 1,000. Sixty percent (60%) of this amount will be paid to the recipient once the detailed plan of the research project is finalized, approved by the research supervisor and received by ", "AfWA", "AfWA", "Definition: ", " African Water Association…", " Research and Capacity Building Program Coordinator. The remaining forty percent (40%) shall be paid once the recipient submits the electronic version of their final research report.", "Submission ", "Applicants must submit their application electronically at the following addresses simultaneously: ", "[email protected]", " and ", "[email protected]", ".", "The list of successful candidates will be published on ", "AfWA", "AfWA", "Definition: ", " African Water Association…", "website: www.afwa-hq.org and each beneficiary will receive an official notification from ", "AfWA", "AfWA", "Definition: ", " African Water Association…", ".", "Submission deadline ", "Students wishing to participate in the program are requested to submit their full application by February 28, 2018. The list of recipients for the 2017-2018 academic year shall be published by March 31, 2018.", "List of research topics ", "The following themes were selected for this scholarship program for the 2017-2018 academic year:", "Approaches to reducing Non-Revenue Water in water utilities", "Improved Water Quality Control", "Water services in low-income urban areas", "Fecal sludge Management", "Improvement of urban and peri-urban sanitation", "ICT use in water and sanitation services", "For More Information:", "Visit the Official Webpage of the AfYWSP Scholarships 2017/2018"], "url : https://www.opportunitiesforafricans.com/african-water-association-awa-african-young-water-and-sanitation-professionals-afywsp-scholarships-2018/"], [["African Institute of Mathematical Sciences (AIMS) Co-operative Master’s Program 2018/2019 Scholarships (Fully Funded)", "date announced:January 9, 2018", "Application Deadline: 20 March 2018"], ["Application Deadline: 20 March 2018", "The co-operative version of the", " AIMS Structured Master’s program", ",", " offered only at AIMS Senegal, AIMS Cameroon and AIMS Rwanda builds on the core ", "AIMS Master’s program", " and leads to the same ", "AIMS Structured Master’s degree in mathematical sciences.", "The African Institute for Mathematical Sciences (AIMS)", " is an academic network that enables Africa’s brightest students to become innovators that advances scientific, educational and economic self-sufficiency", "The 18-month program takes a work-integrated learning approach by combining course work with practical industry experience. This allows students to apply their scientific knowledge to real world problems while gaining work experience in an industrial environment. The program enables students to develop the necessary professional skills to transition from academic studies to progressive careers in industry (defined as private or public businesses, government, non-governmental organisations, and civil society).", "The Co-operative Master’s program", " includes two work placements of three and four months throughout the regular coursework. Successful completion of all coursework and both work placements is required for graduation.", "The Co-operative Master’s program is designed specifically to prepare students for work in the areas of big data and IT security. Applicants are requested to choose their preferred area of focus.", "Eligibility", "Applicants should hold, or anticipate completing by the start date of the AIMS course, a 4-year university degree in mathematics, or any science or engineering subject with a significant mathematics component.", "Requirements:", "AIMS offers an intensive one-year postgraduate course leading to a Master’s degree in Mathematical Sciences.", "The specific qualifications (and the awarding institution) will depend on which AIMS centre you are attending.", "For more info, visit : AIMS South Africa, AIMS Senegal, AIMS Ghana, AIMS Cameroon and AIMS Tanzania.", "Benefits:", "Thanks to the generous support of our donors, all African students receive full scholarships which provide fully for travel, boarding and a small stipend.", "There are no tuition fees at AIMS", "Application Procedure:", "Applicants will need to complete an online application form (which includes answers to questions about themselves), contact details for two referees (whom AIMS will contact) and provide copies of their academic transcripts.", "For More Information:", "Visit the Official Webpage of the African Institute of Mathematical Sciences (AIMS) Co-operative Master’s Program "], "url : https://www.opportunitiesforafricans.com/african-institute-of-mathematical-sciences-aims-co-operative-masters-program-2018-2019-scholarships/"], [["Study an online Bachelor Degree Program at UNICAF University (Win a 50% scholarship to study a BA in Hospitality Management)", "date announced:January 16, 2018", "Application Deadline: October 22, 2018, 10 PM"], ["Application Deadline: ", "October 22, 2018, 10 PM", "Pursuing higher level international education is a huge commitment. But what if there was an internationally accredited program that is both flexible and affordable?", "Recognised for its outstanding contribution to research and learning,", "UNICAF", " University offers a BA in Hospitality Management which integrates e-learning with traditional classroom sessions.", "This degree offers excellent prospects for future employment in the fields of ", "food and beverage, hotels and resorts, restaurant management and marketing", ".", "Take the Sqore challenge", " for a chance to win a 50% scholarship to study the program. The Scholarships will be awarded on a rolling basis, so don’t wait or you’ll miss out.", "For More Information:", "Visit the Official Webpage of the UNICAF University Scholarships in Hospitality Management"], "url : https://www.opportunitiesforafricans.com/study-an-online-bachelor-degree-program-at-unicaf-university/"], [["Holland Scholarships 2018/2019 for Bachelor’s or Masters Study in the Netherlands (5,000 Euros)", "date announced:January 12, 2018", "Application Deadline: May 1st 2018"], ["Application Deadline: May 1st 2018", "The Holland Scholarship", " is meant for international students from outside the European Economic Area (EEA) who want to do their bachelor’s or master’s in the Netherlands. Are you ready for the chance of a lifetime? Apply for the Holland Scholarship!", "The Holland Scholarship is financed by the Dutch Ministry of Education, Culture and", "Science together with Dutch research universities and universities of applied sciences.", "This scholarship is meant for international students from outside the EEA who want to", "do their bachelor’s or master’s in the Netherlands.", "Scholarship", "The scholarship amounts to € 5,000. You will receive this in the first year of your studies. Please note that this is not a full-tuition scholarship.", "Grant award period", "The grant is awarded for one year and can only be received once.", "Application criteria", "Your nationality is non-EEA.", "You are applying for a full-time bachelor’s or master’s programme at one of the participating Dutch higher education institutions.", "You meet the specific requirements of the institution of your choice. You can find these on the website of the institution.", "You do not have a degree from an education institution in the Netherlands.", "How to apply", "Find your programme in the overview of ", "participating research universities", " or in the overview of ", "participating universities of applied sciences", ". You will find detailed information about the application procedure and deadlines in the links provided in both lists.", "The university will contact you to let you know if you have been awarded a scholarship.", "Deadlines", "You can now apply for the 2018-2019 academic year. The deadline for application is either 1 February 2018 or 1 May 2018. Please check the website of the institution of your choice to confirm the correct deadline.", "For More Information:", "Visit the Official Webpage of the Holland Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/holland-scholarships-2018-2019-for-bachelors-or-masters-study/"], [["Invest Your Talent in Italy Scholarships 2018/2019 for International students (Funded to study in Italy)", "date announced:January 8, 2018", "Application Deadline:FEBRUARY 28th 2018"], ["Application Deadline:FEBRUARY 28th 2018", "Recognizing the importance of the international students as a fundamental instrument for the", "internationalization of the Country, the ", "Ministry of Foreign Affairs and International Cooperation", "-Directorate General for Cultural and Economic Promotion and Innovation, ITA–Italian Trade Agency", ", and ", "Uni-Italia,", " with the support of ", "Unioncamere (Italian Chambers of Commerce),", " and ", "Confindustria (Confederation of Italian Industries),", " will award scholarships for the academic year 2018-2019 in favor of international students interested in attending higher education courses in Italy in the framework of the Program", " “ Invest Your Talent in Italy”. ", "Scholarships", " are awarded for courses of Master’s degree ( Laurea magistrale or Master universitario) at Italian Higher Education Institutes (state-owned institutions or institutions legally recognized by the relevant state authorities) partners of the Invest Your Talent in Italy Program. The program includes the attendance of a mandatory internship at selected Italian companies partners of the initiative.", "The list of the post-graduate courses under this Program is available at the following page:", "The aim of the Program is to foster cooperation among Italian Universities and Italian companies in order to promote their internationalization by sustaining higher education courses tailored to the needs of the labor market. Thanks to this Program, young foreigners, educated in Italy and properly trained in their specific fields of expertise, will have the opportunity to", "make a working experience at selected Italian companies, partners of Invest Your Talent in Italy.", "COUNTRIES ELIGIBLE FOR SCHOLARSHIPS", "Scholarships are awarded to citizens, permanently resident in their home country, of the following list of countries:", "Azerbaijan", "Brazil", "Colombia", "Egypt", "Ethiopia", "India", "Indonesia", "Iran", "Ghana", "Kazakhstan", "Mexico", "People’s Republic of China", "Tunisia", "Turkey", "Vietnam", "ELIGIBILITY CRITERIA", "Applications may be submitted only by those who meet the following requirements by the deadline of this call.", "Academic qualifications", "Applications may only be submitted by those candidates referred to in Article 2 who hold the", "required academic qualifications (Bachelor’s Degree) to enroll in the chosen Master’s degree Program (Laurea Magistrale or Master Universitario).", "Application Only those students who have submitted their application for one of the postgraduate courses (laurea Magistrale or Master) included in the Program can apply for a IYT scholarship: ", "http://www.postgradinitaly.esteri.it/postgradinitaly/en/how-to-apply", "Age Requirements", "Candidates may apply if they are no more than 28 years old on the deadline of this call, except for the only renewals.", "Language skills", "Candidates should submit an English language certificate as proof of their proficiency in English.", "Candidates should hold at least a B2 level certificate within the Common European Framework of Reference for Languages (CEFR).", "Proof of proficiency in Italian is not mandatory but will be taken in consideration in the selection process.", "DURATION OF THE SCHOLARSHIP", "The scholarship will cover a period of study of 9 (nine) months starting from October 1, 2018.", "Students will receive the instalment every three months.", "SUBMISSION OF APPLICATIONS", "Candidates must complete and submit the on-line application form available at the following link: ", "http://investyourtalentapplication.esteri.it/SitoInvestYourTalentApplication/signin.asp", "Applications must be submitted from December 18, 2017, to February 28, 2018 at midday (Italian time).", "Candidates must provide the following documents:", "The final transcript of all previous exams as well as the final grade (Bachelor’s Degree). In case these documents are not available, candidates should submit an updated transcript of the exams; documents need to be translated expect for the titles in English, French and Spanish;", "One or more Reference Letters written by a Tutor/Professor/Employer. Reference Letters must be addressed to the University or to the Invest Your Talent in Italy Technical Committee, properly dated and signed.", "Candidates must also provide full contacts of the Tutor/Professor/Employer;", "A video no more than one minute long about their motivations;", "CV/Resume;", "English language certificate (IELTS or TOEFL);", "Valid Passport or Identity Document.", "Incomplete applications will not be accepted.", "RENEWALS", "Candidates who have received an IYT scholarship in the academic year 2017-2018, must", "upload in the Portal ", "http://investyourtalentapplication.esteri.it/SitoInvestYourTalentApplication/signin.asp ", "the following documents within June 30th 2018:", "University transcript of the exams (Certificato Universitario degli Esami sostenuti CFU)", "Attendance certificate of the Italian language course offered by the host University", "Renewals of the scholarship and the exemption from the payment of enrollment and tuition fees for the second academic year will be confirmed only under the presentation of the following requirements:", "a) complete a minimum of 30 credits by June 30th 2018", "b) proof of regular attendance of the courses", "c) proof of regular attendance of Italian language classes", "d) validation of the internship program", "Selection procedures", "The candidatures will be examined and evaluated by a Technical Committee composed by representatives of the Italian Ministry of Foreign Affairs and International Cooperation, the Italian Trade Agency and Uni-Italia.", "PAYMENT OF THE SCHOLARSHIP", "Grantees will receive 888 euros monthly a llowance every three months on their Italian bank account.", "The first installment of the scholarship can only be received after the University enrollment according to the necessary administrative procedures.", "The last installment of the scholarship can only be received after verification of conditions established under Article 6.2 of this Call. The scholarship only covers courses attended in Italy.", "For More Information:", "Visit the Official Webpage of the Government of Italy Invest Your Talent Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/invest-your-talent-in-italy-scholarships-2018-2019/"], [["DAAD In-Country/In-Region Scholarship Progamme 2018 for Master & PhD studies at the University of Ghana (Funded)", "date announced:January 17, 2018", "Application Deadline: 31st March, 2018"], ["Application Deadline: ", "31st March, 2018", "The DAAD (German Academic Exchange Service),", " as a publicly funded, self-governing organisation of the institutions of higher education in Germany, promotes international academic exchange as well as educational co-operation with developing countries through a variety of funding and scholarship programmes.", "As part of the “", "In-Country/In-Region Scholarship Progamme", "” DAAD offers scholarships for PhD and Master studies. The programme is funded by the ", "German Federal Ministry of Economic Cooperation and Development (BMZ)", " and aims at university staff in the first line, without neglecting the public sector demand of academically trained personnel. ", "The target group for scholarships are graduates and postgraduates from Sub- Saharan Africa with a first academic degree if applying for a master’s programme, or with a Master’s degree if applying for a doctoral programme who want to pursue Master’s or PhD courses in their home country (so called In-Country scholarships) or in another Sub-Saharan African country (In-Region scholarships). It has been agreed upon that DAAD cooperates with the", " Institute of Statistical, Social and Economic Research (ISSER),", " University of Ghana by offering up to 5 In-Region and 2 In-Country scholarships for PhD at ISSER for the intake 2018.", "Eligibility Requirements:", "Applicants", "have successfully completed generally a three-year university degree (Master candidates) or a two-year university degree (doctoral candidates) with above average results (upper forth of class)", "clearly show motivation and strong commitment", "have thorough knowledge of the language of instruction", "have completed their last university degree not more than 6 years ago at the time of application", "must be nationals or permanent residents of a Sub-Saharan African country", "should generally be\n", "a) staff member of a public or private university,", "b) candidate considered for teaching or research staff recruitment,", "c) from the public sector or", "d) DAFI-Alumni (Albert Einstein German Academic Refugee Initiative)", "What can be funded:", "The scholarships at ISSER are available in the following fields: Development Studies. ", "Duration:", "The duration of the PhD Programme four years", "For More Information:", "Visit the Official Webpage of the DAAD In-Country/In-Region Scholarship Progamme 2018 "], "url : https://www.opportunitiesforafricans.com/daad-in-country-in-region-scholarship-progamme-2018/"], [["DAAD German Egyptian Research Short-Term Scholarship Program (GERSS) 2018/2019 for Egyptians study in Germany.", "date announced:January 15, 2018", "Application Deadline: May 15th 2018"], ["Application Deadline: May 15th 2018", "The GERSS scholarships", " offer young Egyptian scientists and academics the opportunity to travel to Germany. The scholarship shall enable advanced graduate students and young scientists to pursue part of their master’s, doctoral or post-doctoral research in a specific research project at German universities, archives, libraries or research institutes.", "Requirements:", "The programme is aimed at Master’s students, doctoral candidates and young postdocs.", "\nThe application is also open to non-public university staff members; however, all GERSS applicants should be affiliated to a private or public Egyptian university or Egyptian research institute.", "Scholarships are not awarded for general-information gathering, visits or for the participation in scientific meetings.", " ", "Applicants must be enrolled at a private or state university or research institute in Egypt.", "Applicants for a GERSS scholarship must have a Bachelor, Master or PhD degree.", "Age Limits", "\n– Graduates: should not be older than 26 years", "\n– Medicine / Dentistry Graduates: should not be older than 29 years", "\n– PhD candidates: should not exceed 36 years", "\n– Post doc candidates should not be older than 40 years", "Generally, candidates residing outside Egypt for a period longer than 6 months are not allowed to apply for GERSS", "Candidates who have been granted the GERLS scholarship may apply for GERSS – at least – one year after returning from Germany", "Applicants who have been rejected 3 times in the GERSS programme, are not entitled to reapply", " ", "This programme funds research visits to a research institute, a state or state-recognised private university in Germany.", "Duration of the funding", "The scholarships are awarded for a period of 3-6 months.", "\nScholarship periods are not extendable.", "Value", "Travel allowance for scholarship holders:", "A lump sum will be paid for travel and an accident and liability insurance will be provided", "Monthly scholarship payment according to academic status:", "Post-Doctoral scholarship holders will be granted an amount of Euro 2.145 (two thousand one hundred forty-five Euros) per month", "Doctoral and MSc scholarship holders will be granted an amount of Euro 1069 (one thousand and sixty-nine Euros) per month", "GERSS scholarship does not include family allowances", "Health insurance:", "The amounts for the DAAD health insurance will be deducted from the monthly stipend of each scholarship holder", "One additional insurance installment will be added and will begin 15 days prior to the arrival to Germany and end 15 days after the scheduled departure date to Egypt", "Selection", "Selection will take place at the ", "DAAD-Branch Office Cairo", ".", "\nThe candidates will be selected in two rounds. First, a pre-selection is a paper-based procedure which will identify the group of applicants who will be invited for the second phase consisting of a personal interview with the GERSS independent selection committee. Pre- and final selection of the candidates should be conducted according to, but not limited to the following criteria:", "Excellent Research proposal", "Scientific merits, including:", "\n– Quality of the proposal", "\n– Preparation and feasibility of the project", "\n– Quality of the acceptance letter", "Excellent study achievement", "Application Procedure:", "Application documents from the public university/research institute staff members", "\nA complete application consists of the following documents (13 items) that must be uploaded on the DAAD Portal:", "The online application form which is available on the DAAD Portal", "\n(When you enter your desired travel date in the online application, please make sure that your first travel day either starts on the 1st day of the month or on the 15th day of the months)", "A research proposal including the reference list. Please refer to the document ", "“Research Proposal”", ", which contains questions to be answered concerning your proposal and insert the reference list on the last page", "A detailed CV", "Complete list of publications, if available", "Acceptance letter or an email from a German host professor showing that the research project under preparation is feasible and can be conducted in Germany under his supervision. The acceptance letter should state the title, the time frame and the objectives of the project. The acceptance letter should not be older than six months", "Copies of the B.A. or B.Sc. certificate and the M.A. or M.Sc. and PhD certificate, if applicable", "All applicants have to submit proof of English language skills/abilities. The proof should be either IELTS (band 6) certificate or institutional TOEFL ITP (minimum score 550) or international TOEFL IBT (minimum score 80). Sufficient proof of English skills is an eligibility criterion", "For More Information:", "Visit the Official Webpage of the German Egyptian Research Short-Term Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/daad-german-egyptian-research-short-term-scholarship-program/"], [["FirstRand International postgraduate study Scholarships 2018 for young South Africans", "date announced:January 8, 2018", "Application Deadline: February 22nd 2018"], ["Application Deadline: February 22nd 2018", "There are five scholarships available to South African citizens, all of which are for i", "nternational postgraduate study.", " These are:", "FirstRand Laurie Dippenaar scholarship;", "FirstRand Foundation scholarship;", "FirstRand Oxford African Studies scholarship to the University of Oxford;", "FirstRand FNB Fund Oxford education scholarship;", " and", "FirstRand FNB Fund scholarship for education study.", "Applications, including all attachments and reference letters, must be completed online and applicants must have applied directly to the university of their choice by the time the application is submitted.", "Applications will be treated in the strictest confidence.", "\nThe decisions of the adjudication panels are final and correspondence regarding their decision will not be entered into. The panels reserve the right not to make an award.", "Criteria:", "The successful candidates will have excelled academically in their chosen field and will have been able to demonstrate:", "leadership qualities;", "strength of character;", "community involvement; and", "the potential to be a destiny changer in his or her chosen field.", "candidates who are currently, or have been studying overseas, will not be considered for this scholarship; and.", "successful candidates are required to return to South Africa for at least five years after completing their studies.", "Application Process:", "Confirmation of each received application will be emailed to the applicant upon receipt of his or her application.", "All applications are evaluated by at least three preliminary evaluators from FirstRand, FNB, RMB, TSI and previous winners of the scholarship. A long list of around 40 applicants is then drawn up and interviewed in person in Cape Town or Sandton.", "Four shortlisted candidates are selected for the two education scholarships and should be available for final interviews held in Sandton on Friday 20 April 2018.", "Ten shortlisted candidates are selected for the FirstRand Laurie Dippenaar and FirstRand Foundation international postgraduate scholarships and the FirstRand Oxford African Studies Scholarship and should be available for final interviews held in Sandton on Monday 23 April 2018.", "A final announcement will be made before the end of ", "May 2018", ".", "Email queries can be sent for attention Beth van Heerden at ", "[email protected]", "For More Information:", "Visit the Official Webpage of the FirstRand International postgraduate study Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/firstrand-scholarship-2018-for-postgraduate-international-study/"], [["Anita Borg Institute Grace Hopper Celebration of Women in Computing Scholarships 2018 (Funded to Attend GHC Conference 2018, Houston, Texas USA)", "date announced:January 18, 2018", "Application Deadline:  March 7, 2018 at 5 p.m. PT."], ["Grace Hopper Celebration\nSep. 26–28, 2018\nHouston, Texas", "Application Deadline: ", " March 7, 2018 at 5 p.m. PT.", "Grace Hopper Celebration", "\nSep. 26–28, 2018", "\nHouston, Texas", "AnitaB.org", " finds sponsors to award hundreds of student and faculty scholarships to attend the Grace Hopper Celebration. This once in a lifetime chance, allows academics to connect with other women in computing, hear stories from peers and experts in computing, and get quality career advice specific to their needs needs. The application process is very competitive.", "GHC scholarships provide funds for undergraduate students, graduate students, and faculty to attend the three-day celebration. In 2017, over 650 Scholars attended GHC where they gained access to career and academic workshops, networking opportunities, and memories that will last a lifetime.", "Student Eligibility", "You must be a full-time student enrolled in an accredited degree program at a college or university at the time of the celebration (September 2018). ", "Those graduating prior to the celebration are not eligible", " unless accepted to another related degree program (such as a M.S. or Ph.D. program).", "Show satisfactory progress toward a degree such as, ", "but not limited to", ", computer science, computer engineering, or a related technical discipline such as electrical engineering, human-computer interaction, math, physics, or management information systems.", "Be able to demonstrate an interest in computing.", "You cannot have been an AnitaB.org-GHC Scholarship recipient in 2017.", "You must be at least 18 years of age by September 24, 2018.", "You cannot accept more than one scholarship to attend GHC.", "If you receive a scholarship and do not notify AnitaB.org that you cannot attend prior to the celebration, you will not be eligible in future years as this takes a scholarship away from another student that could have attended.", "Faculty Eligibility", "You must be teaching at an accredited college or university at the time of the conference. We do not award scholarships to High School teachers, as the conference does not provide programming for K-12.", "You must teach in a degree program such as, but not limited to, computer science, computer engineering, or a related technical discipline such as electrical engineering, human-computer interaction, math, physics, or management information systems.", "If you receive a scholarship and do not notify AnitaB.org that you cannot attend prior to the celebration, you will not be eligible in future years as this takes a scholarship away from another faculty that could have attended.", "Eligibility Requirements:", " ", "Undergraduate, graduate students, and post-doctoral fellows", " from around the world are encouraged to apply. The GHC Scholarship Grants for students typically cover all expenses for attending the conference, including conference registration, meals, lodging, and fixed amount of travel reimbursement funds. GHC Scholarship grants for students are made possible by industry sponsors, AnitaB.org, and individual donations.", "Faculty", ", at all levels, are encouraged to apply.", "Scholarship Details", "Student and Faculty Scholarships include:", "Individual Registration for the three day celebration", "Hotel accommodations (arranged by AnitaB.org). Student Scholars will be assigned a roommate. Faculty Scholars will be assigned their own room", "Airfare booked and paid for by AnitaB.org Travel Consultant", "Travel stipend (if used wisely, stipend will cover transportation costs to and from the airport, baggage fees, meals, and other travel incidentals)", "We will provide the stipend when you pick up your badge at GHC. Scholars pay upfront for travel day meals and taxis/shuttles to the GHC venue.", "Benefits:", "The GHC Scholarship for faculty covers conference registration, hotel accommodations, and a stipend for meals and travel. Faculty scholarships are made possible by AnitaB.org and industry sponsors.", "For More Information:", "Visit the Official Webpage of the Anita Borg Institute Grace Hopper Celebration of Women in Computing Scholarships 2018", " "], "url : https://www.opportunitiesforafricans.com/anita-borg-institute-grace-hopper-celebration-of-women-in-computing-scholarships-2018/"]]