[[["Dan David Prize/Scholarships 2019 for Students & Researchers around the world.", "date announced:September 24, 2019", "Application Deadline: March 10, 2020 "], ["Application Deadline: March 10, 2020 ", " The", " Dan David Prize a", "wards scholarships", " to", " doctoral and post-doctoral", " researchers, carrying out research in one of the ", "selected fields", " for the current year. ", "Registered", " doctoral and post-doctoral researchers who study at recognized universities throughout the world, and whose ", "research has been approved", ", are eligible to apply. ", "The Dan David Prize laureates annually donate twenty scholarships of US$15,000 each to outstanding doctoral students and postdoctoral researchers of exceptional promise in the ", "selected fields", " for the current year. ", "Ten scholarships are awarded to students at universities throughout the world and ten scholarships to students at Tel Aviv University. The Dan David Prize scholarships are granted according to merit, without discrimination based on gender, race, religion, nationality or political affiliation. ", "Application Form Information", "The application process, including the uploading of required documents, must be completed ", "online", " ", "only", " via the Dan David Prize website.", "The requested application form and all documentation must be completed in ", "English only", ".", "For inquiries, please contact ", "[email protected]", ", tel: +972-3-6406614", "The following information and documentation is required for the completion of the Scholarship Application process:", "Applicant’s Details", "Title, First Name, Middle Name, Last Name", "Applicant’s institution and department of study", "Postal address of institution of study", "Educational Status: Ph.D. student or postdoctoral researcher", "Commencement date of Ph.D. studies or postdoctoral research period", "Date of approval of Ph.D. research project (Postdoc: Not Applicable)", "Title of Ph.D./postdoctoral research project", "Postal address of applicant", "Telephone numbers: work, home and mobile", "Email", "Supervisor’s Details", "Title, First Name, Last Name", "Supervisor’s institution and department of affiliation ", "Work telephone number", "Email", "Attachments ", "(Supported formats: doc|rtf|docx|pdf, max size: 5MB)", "A full curriculum vitae of the applicant including a list of publications.", "A ", "one to two page", " description of the applicant’s doctoral/postdoctoral research project.", "Two ", "separate letters of recommendation, on official\nletterhead and signed by recognized scholars in the field, one of which\nmust be the doctoral/postdoctoral supervisor.", "All recommendation letters must be uploaded via the online ", "Recommendation Submission Form", ". ", "In addition, originals must be mailed", " to", ": Ms. Charlotte Hallé, Director, Dan David Prize, P.O. Box 39040, Tel Aviv University, Tel Aviv 6997801, Israel. ", "Signed", " authorization by the University, on official\nletterhead, stating that the applicant is a registered doctoral\nstudent/postdoctoral researcher, ", "whose research has been approved", ". ", "In addition, originals must be mailed", " to", ": Ms. Charlotte Hallé, Director, Dan David Prize, P.O. Box 39040, Tel Aviv University, Tel Aviv 6997801, Israel. ", "Confirmation of a successful submission is provided\nelectronically and a copy of the application material sent to the\napplicant by email.", "For More Information:", "Visit the Official Webpage of the Dan David Prize/Scholarships 2019 "], "url : https://www.opportunitiesforafricans.com/dan-david-prize-scholarships-2019/"], [["MasterCard Foundation Scholars Program 2020 at McGill University in Canada (Fully Funded)", "date announced:September 13, 2019", "Application Deadline: January 31, 2020 "], ["Application Deadline: January 31, 2020 ", " McGill University and the Mastercard Foundation are pleased to offer full scholarships to economically challenged, academically gifted Master’s students from Sub-Saharan Africa through the ", "Mastercard Foundation Scholars Program.", " ", "This scholarship program is designed to sponsor outstanding, community engaged students to attend university who otherwise would not have the opportunity, thereby, fostering the development of future Sub-Saharan African leaders and entrepreneurs.", " In addition to financial support, Scholars are provided with a comprehensive support network that includes an array of mentoring and support services to ensure each student’s academic success, community service engagement and transition to socially relevant employment opportunities.", "To be eligible for consideration for the Mastercard Foundation Scholars Master’s Program at McGill, you must:", "1.Be admissible to one of the eligible programs at McGill University (see Program List below);", "2.Have never registered for /completed any graduate studies;", "3.Be nominated by a current McGill Professor or Staff Member from the department you wish to apply to (see Nomination Form);", "4.Be a citizen of and have lived a significant part of your life in a Sub-Saharan African Country (see List of Eligible Countries);", "5.Have an exceptional record of service and activity in your school and/or community;", "6.Have an intent to return to your country immediately upon the completion of your degree with the goal of transforming your community through social and economic development;", "7.Demonstrate that your financial status is in the lowest two quintiles of your country.", "8.Must be less than 35 years old at the time of application ", "Application Deadline:", " Deadline to submit the Application for Admission : Your program’s deadline ", " Deadline to submit MCF Supporting Documentsi: January 31, 2020 ", " Mastercard Foundation Scholars Selection Committee begins to make scholarship offers April 1, 2020 ", "Application Procedure:", " Please read the following steps carefully: ", "1.Prospective applicants can find the full list of MCF eligible programs here: ", "https://www.mcgill.ca/mastercardfdn-scholars/apply-program", "Once a program of interest has been identified, the applicant must consult the departmental requirements as well as the standard graduate admission requirements,to verify that they are eligible to apply. Please note that meeting the minimum graduate admissions requirements does not guarantee nomination for the Mastercard Foundation Scholarship Program or admission to McGill University.", "2.If the minimum requirements are met, the applicant may request nomination from the department via email. This request should have the following information enclosed:", " -University Transcript ", "-Curriculum Vitae (CV) ", "-Short Personal Statement (max. 350 words). ", "3.The nomination made by the department acts as a verification step. If an applicant has been nominated, they will be prompted to create an account on the uApply portal and share the username with the nominating department. ", "The applicant MUST wait until they have been nominated before creatingan account in order for the application to be considered for the MCF scholarship.Please note that being nominated does not guarantee admission to McGill University.", "4.Once nominated(department must send the completed nomination form to ", "[email protected]", "),the applicant will be issued a fee waiver and should complete the admission application in uApply. They should upload the Mastercard Foundation Scholars Program Application Form, sponsor letter and bank statement to the uApply checklist.", "5.The applicant should request their Referee complete the MCFSP Recommendation form and return the completed form by email ", "[email protected]", "6.Once all of the requested documents have been received,the department will review the application.-If the applicant is admitted to their program of study, their MCFSP application is pre-screened. Ifselected at the pre-screening stage,the application moves on to the MCFSP Selection Committee for review. -If the applicant isrefused admission, they are no longer eligible for the scholarship. ", "7.Successful applicants will be notified in April 2020 if they have been selected for the ", "2020 Cohort of the Mastercard Foundation Scholarship Program at McGill University. ", "Documents:", " ", "Mastercard Foundation Scholars Program – Step by Step Instructions 2020", " ", "Mastercard Foundation Scholars Program – Eligibility Criteria 2020", " ", "List of Eligible Programs of Study 2020", " ", "List of Eligible Countries 2020", " ", "Nomination Form", "For More Information:", "Visit the Official Webpage of the MasterCard Foundation Scholars Program 2020 "], "url : https://www.opportunitiesforafricans.com/mastercard-foundation-scholars-program-2020-at-mcgill-university-in-canada-fully-funded/"], [["WAAW Foundation 2019/2020 STEM Scholarship for Need-Based African Female Students.", "date announced:September 3, 2019", "Application Deadline:November 15, 2019"], ["Application Deadline:", "November 15, 2019", "WAAW foundation’s annual scholarship initiative", " is aimed at supporting need based African female STEM-focused college education. Please read the eligibility criteria before you apply. All non qualifying applications will be automatically deleted! Criteria for eligibility includes:", "Female", " students of ", "African", " origin, ", "living and studying", " in Africa.", "Currently enrolled in ", "undergraduate B.S.degree", " program.", "Studying ", "STEM related courses", " in a ", "University", " or ", "college", " in ", "Africa", ".", "Demonstrable financial need, and", "Excellent Academic Record.", "Below the age of ", "32 years", ".", "How to Apply", "Your application will include the following:", "Application form filled out completely. We will only accept online\napplications this year. NO PAPER APPLICATIONS WILL BE ACCEPTED*.", "Personal and Contact Information.", "Educational background and Family Information.", "Statement of need should describe why scholarship funds are needed and what the funds will be used for if received.", "Essays are a strong criteria in determining candidates who are short listed. Responses to essay ", "where to buy modafinil online reddit", "\nquestions that address career goals and how you expect the WAAW\nscholarship will assist in your education. Please have you essay\nresponses ready before you begin the application.\n", "Two academic/professional references. Note recommendations and\ntranscripts ARE NOT REQUIRED AT THIS TIME. ONLY after a candidate has\nbeen shortlisted. However, you must provide the names of 2 references in\nyour application.", "Submitting your application", "Please complete all sections of the application form\nand submit all required materials to WAAW foundation by the deadline.\nApplication may be completed online. ", "Click Here to Begin your application.", " or follow this link:", "For further information or inquiries please email:", "[email protected]", " or ", "[email protected]", "Please do not email inquiries until you have\nreviewed all the requirements above,  including the list of accepted and\nunaccepted course in the FAQ link above.", "ONLY Shortlisted candidates will be required to send the following additional items in order to complete this process.", "2 references; one MUST be written by a professor from your\ninstitution of study and the other from an academic supervisor/advisor\nor mentor. Reference forms should be downloaded from ", "2019_ScholarshipReferenceLetter", " and emailed to ", "[email protected]", "A copy of a current signed and sealed transcript from your University to be emailed to", "[email protected]", ", faxed to 1.888.519.4269 or to be mailed to:", "\nWAAW Foundation Scholarship Committee", "\nP.O. Box 1691, Wylie. Texas 75098.", "\n*Scanned copies of original transcripts may be emailed to ", "[email protected]", ".", "A copy of the student’s School identity card must be scanned and emailed to us", "For More Information:", "Visit the Official Webpage of the WAAW Foundation 2019/2020 STEM Scholarship"], "url : https://www.opportunitiesforafricans.com/waaw-foundation-2019-2020-stem-scholarship/"], [["Sappi Bursary and Scholarship 2019/2020 for young South Africans", "date announced:September 10, 2019", "Application Deadline: September 30th 2019"], ["Application Deadline: September 30th 2019", " At Sappi, we want to encourage the brightest young talent to join our ever evolving industry. That’s why we’ve created a bursary scheme in partnership with accredited universities, so innovative young South Africans are supported throughout their studies in line with real world business needs. ", "Eligibility", "If you’re a school leaver or university student between 18 and 25\nyears old, and are studying (or intending to study) full time at any\nSouth African accredited university, you could be eligible for our\nbursary scheme. You should be studying in one of the below fields:", "Bachelor of Engineering/Bachelor of Science – Mechanical Engineering", "Bachelor of Engineering/Bachelor of Science – Electrical Engineering", "Bachelor of Engineering/Bachelor of Science – Chemical Engineering", "Bachelor of Engineering/Bachelor of Science – Industrial Engineering", "Bachelor of Engineering/Bachelor of Science – Civil Engineering", "Bachelor of Engineering/Bachelor of Science – Mechatronics", "Bachelor of Engineering/Bachelor of Science – Forestry and Wood Sciences", "National Diploma – Pulp and Paper", "National Diploma in Forestry.", "In addition, you must also have:", "South African citizenship", "an average of 70-80% in Mathematics (not Maths Literacy), 70-80% in Physical Science, and 60% in English, and", "qualifying points for entrance at the university, or acceptance confirmation.", "Current university results will be considered for undergraduate\nstudents. Note that preference will be given to learners with an average\nof 75% and above in Mathematics and Physical Science.", "When to apply", "Applications for bursaries are open from 01 June to 30 September\nevery year. If you meet the minimum criteria, you may be invited to a\nselection interview.", "For More Information:", "Visit the Official Webpage of the Sappi Bursary and Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/sappi-bursary-and-scholarship-2019-2020/"], [["The Microsoft Research PhD Scholarship Programme 2020 in EMEA (Europe, Middle East, Africa)", "date announced:September 3, 2019", "Application Deadline: September 21, 2019 17:00 GMT "], ["Application Deadline: September 21, 2019 17:00 GMT ", "Each year, PhD supervisors from academic institutions in EMEA are\ninvited to submit their proposals for collaborative research projects\nwith Microsoft Research Cambridge. Applications are then peer reviewed\nand a number of projects selected for\nfunding. PhD students are appointed to the selected projects and begin\ntheir research in the following academic year under the supervision of\ntheir academic supervisor, with co-supervision from a researcher at\nMicrosoft Research Cambridge.", "The Microsoft Research PhD Scholarship Programme in EMEA (Europe, Middle East, Africa)", " was launched in 2004 and has so far supported more than 200 PhD students from more than 18 countries and 51 institutions.", "Some of the Scholars may also be offered—at the sole discretion of Microsoft Research—an internship in one of the Microsoft Research laboratories. Internships involve working on a project alongside and as part of a team of Microsoft researchers. Scholars are paid during their internship—in addition to their scholarship bursary. ", "Eligibility criteria", "Applications must not be made by students but by PhD supervisors, who\nmust have been nominated by Microsoft Research prior to the submission\ndeadline. Only applications from institutions in Europe, the Middle\nEast, and Africa will be considered.", "For an application to be considered, the following key requirements apply:", "The institute agrees to the terms and conditions in the ", "PhD Term Sheet", " and ", "EPSRC Term Sheet", " where appropriate and there will be no negotiation once the selections have been made and communicated.", "Applicants must be nominated by a Microsoft supervisor  to be eligible to submit an application.", "The proposed research must be closely related to our research themes at Microsoft Research in Cambridge:", "All Data AI", "Cloud Infrastructure", "Confidential Computing", "Future of Work", "Game Intelligence", "Healthcare Intelligence", "Biological Computation", "Timeline:", "For 2020 Applications", "Nominations from Microsoft Researchers Open August 30, 2019 and close September 21, 2019 17:00 GMT", "Faculty nominees receive a request to submit their proposal  September 24, 2019", "Proposals accepted through November 5, 2019 17:00 GMT", "Recipients announced by January 31, 2020", "For More Information:", "Visit the Official Webpage of the Microsoft Research PhD Scholarship Programme 2020 in EMEA"], "url : https://www.opportunitiesforafricans.com/the-microsoft-research-phd-scholarship-programme-2020/"], [["DAAD In-Region PhD 2019/2020 Scholarship Programme at AIMS South Africa", "date announced:September 10, 2019", "Application Deadline: 8 November 2019 "], ["Application Deadline: ", "8 November 2019", " ", "DAAD (German Academic Exchange Service), ", "as a publicly funded, selfgoverning organisation of the institutions of higher education in Germany, promotes international academic exchange as well as educational co-operation with developing countries through a variety of funding and scholarship programmes.", "As part of the “In-Region Scholarship Progamme” DAAD offers\nscholarships for PhD studies. The programme is funded by the German\nFederal Ministry of Economic Cooperation and Development (BMZ) and is\naimed at university staff in the first line, without neglecting the\npublic sector demand of academically trained personnel.", "The target group for scholarships are postgraduates from Sub-Saharan\nAfrica (excluding South Africa) with a Master’s degree who want to\npursue PhD courses in South Africa (In-Region scholarships). It has been\nagreed upon that DAAD cooperates with AIMS by offering up to six\nIn-Region Scholarships for PhD studies in the field of Mathematical\nSciences. Students although registered at UWC, UCT or Stellenbosch\nUniversity will need to be affiliated to AIMS South Africa either\nthrough co-supervision or research collaboration. Students will be\nrequired to spend some time at AIMS South Africa throughout their\nstudies.", "Eligibility", "Applicants must", "have successfully completed generally a two-year university degree\n(doctoral candidates) with above average results (upper forth of class)", "clearly show motivation and strong commitment", "have thorough knowledge of the language of instruction", "have completed their last university degree not more than 6 years\nago at the time of application must be nationals or permanent resident\nof a Sub-Saharan African Country, excluding South Africa", "should generally be", "\na) staff member of a public university,", "\nb) candidate considered for teaching or research staff recruitment,", "\nc) from the public sector", "Female applicants and candidates from less privileged regions or\ngroups are especially encouraged to participate in the programme.", "PhD-scholarships are initially granted for one year and can be\nextended upon receipt of an application for extension. Scholars must\ndemonstrate satisfactory progress before an extension is granted.", "Applications", "Closing date 8 November 2019", "Please click ", "here", " for\nmore information supplied by DAAD about the programme.  It is important\nthat you take careful note of all the instructions regarding forms that\nneed to be completed and supplied.", "Incomplete applications will not be considered.", "Contact", "For related queries, please email ", "[email protected]", "For More Information:", "Visit the Official Webpage of the DAAD In-Region PhD Scholarship Programme at AIMS South Africa"], "url : https://www.opportunitiesforafricans.com/daad-in-region-phd-2019-2020-scholarship-programme-at-aims-south-africa/"], [["Mexican Government’s Merit Awards for International Students 2020", "date announced:September 4, 2019", "Application Deadline: September 27th, 2019, at 15:00 (Local Time in Mexico City) "], ["Application Deadline: September 27th, 2019, at 15:00 (Local Time in Mexico City) ", " Based on the Law for International Cooperation, and with the purpose of maintaining the position of Mexico as an actor with global responsibility, the Mexican Ministry of Foreign Affairs (SRE), through the", " ", "Mexican Agency for International Development Cooperation (AMEXCID)", ",", " calls for foreigners interested in conducting studies in Mexico.This call is open to citizens ofmore than 180 countries within the framework of various bilateral conventions, multilateral programs and special agreements. ", "More than 100Mexican Higher Education Institutions participate,all of them offering academic programs registered in the National Program of Quality Graduate Degrees (PNPC) of the National Council for Science and Technology (CONACYT). These programs demonstrate the advancements that the country has made in the fields of sciences and humanities. ", " MAIN OBJECTIVE:", "To offer scholarships for the training of foreign professionals at Bachelor, Specialty, Specialization, Master’s, Doctorate and Postgraduate Research levels, as well as student mobility programs for Undergraduate, Postgraduate, Specialties and Medical Sub specialties, in the form of training scholarships, in full-time taught or research programs in Mexico, with the purpose of strengthening the links of academic collaboration with partner countries; the training of human resources and the internationalization of Higher Education Institutions (HEIs).", " ELIGIBILITY", "a)How to apply", "1.The application is made in a personal capacity and only one application per person will be accepted.", "2.Applicants with more than one nationality may only submit one application. The nomination must come from the same country as the nationality chosen by the applicant to use while in Mexico", "3.Applicants who have already begun their studies in Mexico,in the HEIs and in the academic programs indicated in this Call, are eligible to participate in this Call.", "4.The AMEXCID scholarship is not retroactive, that is, it does not cover any expenses (including air transport) that have been made prior to granting the scholarship ", " APPLICATIONS", "1.All applications must comply with the provisions of this Call, including the documents referred to in it and the corresponding formats.", "2.Applications must be submitted as follows:a)Paper ApplicationsOnly applicants from Cuba, Saint Lucia, the Dominican Republic, Antigua and Barbuda, Trinidad and Tobago, Dominica, Barbados, Surinam, Guyana, Jamaica, Haiti, Nicaragua, Slovakia, Slovenia, Lithuania, Latvia, Turkey, Venezuela, New Zealand, the Palestineand the countries of the African continent may submit paper or online applications. ", "All paper applications, must be submitted to Mexican Embassyin the applicant’s country or at the concurrent Embassy. ", " Online Applications", "Applications must be submitted online through the Academic Cooperation Management System (SIGCA) (https://sigca.sre.gob.mx), during the duration of the Call. ", "For More Information:", "Visit the Official Webpage of the Mexican Government’s Merit Awards for International Students 2020"], "url : https://www.opportunitiesforafricans.com/mexican-governments-merit-awards-for-international-students-2020/"], [["National Student Financial Aid Scheme (NSFAS) 2020– Financial Assistance to Study at a tertiary institution in South Africa.", "date announced:September 6, 2019", "Application Deadline: November 30th 2019"], ["Application Deadline: November 30th 2019", " Applications for the", " NSFAS funding", " of the 2020 academic year are now open. You will need the following to complete your funding application. ", "The South African Government is aware most households struggle to pay the hefty academic costs for their kids to complete their desired qualifications. This is why the ", "National Student Financial Aid scheme (NSFAS)", " is tasked with ensuring that no deserving student is barred from achieving their dreams due to their poor financial background. NSFAS administers funding for potential professionals from poor and working-class families who can’t afford study fees on behalf of the Department of Higher Education, Science and Technology.", "Requirements:", "Any South African citizen who is currently studying or plans on studying at a public university or TVET college.", "The combined household income of the applicant who has registered at a public institution from 2018or plans to register in 2020 for the first time must not exceed R350 000 per annum", "The combined household income of an applicant who has registered prior to 2018 must not exceed R122 000 per annum", "The combined household income of persons with disabilities must not exceeding R600 000 per annum", "Application Procedure", "You will need the following supporting documents to apply:", "All applicants are required to submit:", "Certified copy of your ID, not older than 3 months", "A signed and completed consent form", "For More Information:", "Visit the Official Webpage of the National Student Financial Aid Scheme (NSFAS) 2020"], "url : https://www.opportunitiesforafricans.com/nsfas-2020-financial-assistance-to-study-at-a-tertiary-institution-in-south-africa/"], [["Investec Tertiary Bursary Programme 2020 for Young South Africans.", "date announced:September 3, 2019", "Application Deadline: 30 September 2019. "], ["Application Deadline: 30 September 2019. ", "Investec", ", in partnership with StudyTrust, provides the funding necessary to see young South Africans with academic potential get to university. With our assistance, they are able to study towards financial sector related degrees at various local universities.", "Requirements:", "Applications are open to: All young SA citizens with academic potential who are in need of financial assistance.", " Pupils holding or working towards a matric exemption with a minimum of 70% in English and Mathematics (not Maths Literacy) and a 60% pass rate in all other subjects.", "Benefits", " Investec offers a full bursary per year towards study-related expenses. Terms and Conditions apply. ", "For More Information:", "Visit the Official Webpage of the Investec Tertiary Bursary Programme 2020"], "url : https://www.opportunitiesforafricans.com/investec-tertiary-bursary-programme-2020-2/"], [["Investec Information Technology (IT) Scholarship Programme 2020 for young South Africans", "date announced:September 2, 2019", "Application Deadline: 30 September 2019 "], ["Application Deadline: 30 September 2019 ", "If you’re a dedicated undergraduate or honours student studying towards a degree in IT and need financial assistance, the ", "Investec IT Scholarship Programme", " is for you. You’ll get to take part in the IT Explore hackathon and the IT Careers Fair.", "Requirements:", "\nYou can apply for an IT Scholarship if you meet the following criteria:", "You are a student in your 2nd to final year, studying towards a\nBachelor of Science (BSc or BS) in Computer Science, a Business\nComputing or Computer Engineering, a Bachelor of Commerce (BCom) in\nInformatics or Information Systems or a Bachelor of Business Science\n(BBusSc) in Information Systems degree. ", "You have achieved a 70% average for your final (year-end) result.", "You are ambitious, creative and academically talented ", "You are a South African citizen", " Our selection of candidates is based on merit and not financial need because we believe in those who are driven to consistently better themselves in the work place. ", "How to Apply", "\nApplications for the 2020 academic year are open from 1 – 30 September 2019.", "\nDue to the volume of applications, we kindly request that you do not submit your documents outside of the application period.", "\nWhen applications open, please complete the application form and upload the following documents:", "Your CV", "Your matric certificate", "Your university academic transcripts (all courses completed to date)", "A clear copy of your ID", "A recent photograph of yourself", "\nPlease ensure you submit all of the above. If you are unable to do so, your application will not be considered.\n", "For More Information:", "Visit the Official Webpage of the Investec Information Technology (IT) Scholarship Programme 2020 "], "url : https://www.opportunitiesforafricans.com/investec-information-technology-it-scholarship-programme-2020/"], [["Obama Foundation Scholars Program 2020/2021 for emerging leaders to study at the University of Columbia (Fully Funded)", "date announced:September 13, 2019", "Application Deadline: 12:00pm EST on December 13 2020"], ["Application Deadline: ", "12:00pm EST on December 13", " 2020", "The application for the 2020-2021 Obama Foundation Scholars Program is now open. ", " ", "The Obama Foundation Scholars Program at Columbia University", " brings together rising leaders from around the world who have demonstrated a commitment to finding solutions to challenges in their communities, countries and regions. Over the course of an academic year, the Obama Foundation Scholars will have the opportunity to deepen their knowledge and skills and to build new capacities and networks that will accelerate their impact in their home countries. ", "Eligibility Requirements", "The Obama Foundation Scholars Program at Columbia University seeks\nrising leaders from around the world who meet the following criteria:", "Have a proven commitment to service and leadership within a community, region or country outside the United States, coupled with a demonstrated commitment to return to these communities following their completion of the program and apply their enhanced training, skills and connections on a long-term basis for the benefit of these communities", "  ", "Are emerging leaders who have made meaningful contributions to their field and are now at a “tipping point” in their careers", "  ", "Are fluent in English (verbal, written and spoken)", "  ", "Have the ability and inclination to positively shape the future of their community", "  ", "Have a demonstrated commitment to humility, integrity, inclusivity, stewardship, fearlessness, imagination and teamwork", "Scholar Benefits", "Monthly stipend", " to assist with living expenses in New York City", "  ", "A ", "furnished studio apartment", " within walking distance of Columbia University", "  ", "All ", "tuition and fees", " for up to four courses at Columbia University", "  ", "Basic medical, dental and life insurance", " for the duration of the program", "  ", "Air travel", " to and from home country and any program-related activities", "  ", "Leadership development", " programming led by the Obama Foundation that will help scholars gain the real-world skills, tools and experiences to expand the impact of their work when they return home ", "Application", "A complete application, submitted entirely online, includes the following materials:", "Complete online application form", "Complete the online application form", ".", "Resume/curriculum vitae", "The resume/curriculum vitae should be a chronological listing of your\nemployment and academic history, and other significant activities,\nincluding any awards, publications, or other achievements․﻿﻿﻿", "Personal video statement", "The personal video statement should be a short video (no longer than\nfive minutes in length) introducing the applicant and their work to the\nselection committee. Applicants will upload their video statement to a\nvideo hosting service, like YouTube or Vimeo, and will include a link to\ntheir video in the online application. Additional information on the\nrequirements for the personal video statement can be found in the online\napplication.", "Responses to short essay questions", "The short essay questions help the selection committee understand the\napplicant’s work, their motivation and how the program fits into their\ncareer trajectory. Applicants will submit their essay questions in the\nonline application.", "Proof of English proficiency", "Applicants whose native language is not English are required to\ndemonstrate proficiency in the English language by submitting scores\nfrom one of three exams: The internet-based or paper-based exams of the\nTest of English as a Foreign Language (TOEFL); the International English\nLanguage Testing System (IELTS); or the Pearson Test of English\nAcademic (PTE Academic). ", "No other exams will be accepted.", "This requirement is waived for applicants who:", "have completed an undergraduate degree – not a master’s or graduate degree – in a country where English is an official language;", "OR", "have previously taken the TOEFL, IELTS, or PTE exams ", "in the last five years", " and scored at or above the minimum requirement of 100 (TOEFL-IBT), 600 (TOEFL-PBT), 7.0 (IELTS), or 68 (PTE Academic). ", "If\napplicants qualify for a waiver under this exception, they must upload a\nscanned copy of their score report to the online application to ensure\ntheir application is eligible for review. If they did not score at or\nabove the required minimum or no longer have a copy of their old\nresults, they must retake an English proficiency exam.", "For More Information:", "Visit the Official Webpage of the Obama Foundation Scholars Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/obama-foundation-scholars-program-2020-2021-for-emerging-leaders/"], [["Joint Japan/World Bank Graduate Scholarship Program 2020 for Developing Countries Nationals (Fully Funded to Japan)", "date announced:September 11, 2019", "Application Deadline:  October 24, 2019. "], ["Application Deadline: ", " October 24, 2019", ". ", "The Joint Japan/World Bank Graduate Scholarship Program (JJ/WBGSP)", "\nis open to women and men from developing countries with relevant\nprofessional experience and a history of supporting their countries’\ndevelopment efforts who are applying to a master degree program in a\ndevelopment-related topic.   \n", " Since 1996, the Graduate School of Business and Commerce of Keio University has been training promising tax personnel in the field of tax policy and administration with its Master’s Degree Program in Taxation Policy and Management. This program brings together the cooperation of Keio University, the National Tax Agency of Japan (NTA), and the World Bank in an alliance between public and private institutions. ", "Funded by the GOVERNMENT OF JAPAN and administered by the WORLD BANK", " Keio University, a leading private university in Japan, established the program as one of the partnership programs of the", " Joint Japan /World Bank Graduate Scholarship Program (JJ/WBGSP). ", "Funded by the Government of Japan and administered by the World Bank, the JJ/WBGSP is a personnel training project which awards scholarships to help developing countries strengthen their human resources.", " Application Eligibility", " Be a national of a Bank member country that is eligible to receive Bank financing and not be a national of any country that is not eligible to receive the Bank financing. For the list of eligible World Bank countries, see", " eligible country list", ".", " Not hold dual citizen of any developed country.", " Be in good health with respect to the capacity to be a productive scholar for the duration of the Graduate Program, as certified by a medical doctor.", " Hold a Bachelor’s degree or its equivalent with superior academic achievement earned at least three (3) years  prior to the Scholarship Application Deadline.", " Not received any scholarship funding to earn a Graduate degree or its equivalent from any sources funded by the government of Japan.", " Be employed in a paid and full time position at the time of the Scholarship Application Deadline unless the applicant is from a country identified in the World Bank’s “", "Harmonized List of Fragile Situations", "”. ", " Have, by  the time of  the Scholarship Application Deadline, ", "at  least three（3）years of recent full time paid professional experience in the field of tax policy and administration at a public body (institution) after a Bachelor’s degree or its equivalent in the applicant’s home country or in another developing country", "; If the applicant is from a country identified in the World Bank’s “", "Harmonized List of Fragile Situations", "” at the time of the Scholarship Application Deadline, the recent professional experience does not have to be full time or paid.", " Not be  an  Executive Director,  his / her alternate, staff of  the World  Bank Group（the  World Bank, International Development Association, International Finance Corporation, Multilateral Investment Guarantee Agency, and International Center for Settlement of Investment Disputes）, or a close relative of the aforementioned by blood or adoption with the term “close relative” defined as: Mother, Father, Sister, Half-sister, Brother, Half-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew.", " Accepted to the University unconditionally or conditionally only upon securing financing.", " Demonstrate proficiency in the English language at the level of a TOEFL score of 79 (iBT) or  better, or an IELTS score of 6.0 or better.", " Meet any other criteria for admission established by Keio University.", " Applicants must not be currently pursuing a Master’s or Ph.D. program in industrialized countries.", " Applicants must not have had one or more years of training / studies and / or residency in an industrialized  country.", " Applicants must not be permanent residents / nationals of industrialized countries.", "Scholarship Worth", " A Monthly stipend: JPY 152,000  ", " *To cover all living expenses (accommodations, food, etc., including books). ", "Application Fee, Admission Fee, and Tuition Economy-class air travel between your home country and Japan at the start of your study program at Keio and immediately following the end of the scholarship period. ", "In addition to the two-way air travel, scholars will receive a USD500 travel allowance for each trip; ", "\nApplication Procedure", "\nApplications are accepted upon completion of ", "Online Registration ", "and ", "Submission of Application Documents", ".", "Online Registration", " must be completed ", "by October 24, 2019", ".   ", "\nApplication documents must be submitted by mail and must reach the Keio University ", "by October 31, 2019. ", "We do not accept applications via fax or email.", "\nSend the original copy of the application documents. Copies of the application will not be accepted.", "\nPlease make a copy of all the application documents for your records.\nThe World Bank may ask you to submit the copy in the selection process\nby the World Bank.", "\nLate applications and incomplete applications will not be accepted. Keio will not notify applicants of missing  documents.", "\nApplication documents may also be downloaded from the homepage of ", "the Master’s Degree Program in Taxation Policy and  Management", ".", "Applicants who have applied for a program offered by Keio and\nhave passed the selection process by Keio will be asked to complete\nadditional online application by the World Bank, which will make the\nfinal admission  decision.", "For More Information:", "Visit the Official Webpage of the Joint Japan/World Bank Graduate Scholarship Program 2020"], "url : https://www.opportunitiesforafricans.com/joint-japan-world-bank-graduate-scholarship-program-2020/"], [["Johnson & Johnson WiSTEM2D Scholars Award Program 2020 for female leaders in STEM discipline ( $150,000 award)", "date announced:September 4, 2019", "Application Deadline: AM HST (Honolulu Standard Time) on October 3, 2019. "], ["Application Deadline: AM HST (Honolulu Standard Time) on October 3, 2019. ", "The Johnson & Johnson Scholars Award Program", " aims to fuel development of female STEM", "2", "D leaders and feed the STEM", "2", "D talent pipeline by awarding and sponsoring women at critical points in their careers, in each of the STEM", "2", "D disciplines: Science, Technology, Engineering, Math, Manufacturing and Design.", " The awards will fund one woman per STEM", "2", "D discipline who has completed her advanced degree, who is working as an assistant professor (or global equivalent faculty position) and who is not yet tenured at an accredited university, institution or design school. The goal is to fuel the research passion of the awarded women and inspire career paths in their respective STEM", "2", "D fields. Johnson & Johnson is looking to identify global women leading in both their research fields and leading as mentors, to be a vision for girls and other women in STEM", "2", "D. ", "Requirements:", "You must be a woman working in the field(s) of Science, Technology, Engineering, Mathematics, Manufacturing and Design (STEM", "2", "D).", "You\nmust be an assistant female professor or global equivalent faculty\nposition at the time of application at an accredited academic\nuniversity, institution or design school.", "The female scholar should have a minimum degree for the appropriate field:", "Science; M.D., Ph.D.", "Technology; Ph.D.", "Engineering; Ph.D.", "Math; M.S., Ph.D.", "Manufacturing; Ph.D.", "Design; M.A., M.S., MDes, MArch, MFA, MLA, Ph.D", "\nApplication Process\n", "In addition to general contact details and demographics, the scholar\napplicant is responsible for the provision of documents into the ", "application ", "system, including non-confidential letters of recommendation.", "Submit\na university or school department head letter of recommendation (Note:\neach university / institution can support one applicant per STEM", "2", "D discipline; six applicants in total).", "Write 1,000 words detailing your proposed area of research. One additional page can be added for images, or references.", "Submit\nyour resume (three pages, font size 11), including a list of\npublications, presentations, abstracts, current financial support\nalready obtained, other folio work and two references.", "Submit a brief outline of your budget for proposed research. (Note: a template is provided if needed.)", "For More Information:", "Visit the Official Webpage of the Johnson & Johnson WiSTEM2D Scholars Award Program 2020"], "url : https://www.opportunitiesforafricans.com/johnson-johnson-wistem2d-scholars-award-program-2020/"], [["Holland Government Scholarship 2020 for study at Rotterdam School of Management, Erasmus University", "date announced:September 24, 2019", "Application Deadline: 1 February 2020. "], ["Application Deadline: ", "1 February 2020.", " ", "The Erasmus University Holland Scholarship", " is financed by the Dutch Ministry of Education, Culture and Science as well as Rotterdam School of Management, Erasmus University. This scholarship is meant for international students from outside the European Economic Area (EEA) who want to start their ", "bachelor’s or master’s", " at RSM. ", "Amount", "The scholarship amounts to ", "€ 5,000", " for maximum 12 months, one academic year;", "You will receive this in the first year of your studies;", "The scholarship amount will be paid per month after you have paid the full tuition fee amount;", "Requirements:", "Your nationality is non-EEA;", "You are a prospective student, starting your studies in the academic year 2020/2021;", "You are applying for a full-time bachelor’s or master’s programme at RSM; ", "You meet the specific requirements of the programme you are applying for;", "You do not have a degree from an educational institution in the Netherlands (excluding exchange programmes in the Netherlands).", "In principle, a fair distribution of scholarships\nover the various programmes will take place. This principle may be\ndeviated from and priority may be given to applicants for certain\nprogrammes. Additionally, the school may strive for a certain\ndistribution over the continents.", "Selection criteria", "Prospective students for the IBA programme at\nRSM need to prove their excellence. Excellence in previous education is\nproven if the grade point average achieved at secondary school (measured\nto date) is at least the equivalent of the Dutch grade of 8.0 on the\nDutch grading scale 1 – 10;", "For prospective students who have also attended\nhigher education after secondary education grades obtained in higher\neducation will be considered as well. The RSM Scholarship Committee will\ndecide on the local grade equivalents for the Dutch grade of 8.0 using\n(a.o.) the grade information included in the ", "Nuffic country modules", ";", "Only students who are not recipients of any\nother scholarships exceeding the amount € 5,000 in total in that same\nacademic year can apply for the scholarship;", "By accepting this scholarship you agree to\nassist the RSM Recruitment and Admissions Office in the role of an\nAmbassador with promotional and support activities for approximately 8\nhours per month during the academic year;", "By accepting this scholarship, you agree to\nstart your visa procedure before 1 June 2020. RSM holds the right to\ncancel your scholarship if you have not started your visa procedure and\nholds the right to offer the scholarship to a student on the waiting\nlist.", "Application procedure", " ", "First step is to register for the Bachelor International Business Administration programme in ", "Studielink", ". Once you have registered yourself, you will receive a link to our Online Application Form (OLAF).", "It is not possible to choose a specific\nscholarship in OLAF. RSM will choose recipients for specific\nscholarships. RSM will take your scholarship application into\nconsideration as long as you meet the minimum requirements and meet the\ndeadline(s).", "Required documents:", "A scholarship application letter in OLAF of\nmaximum 1 A4 size page, including the following information: an\nexplanation why you would ", "need", " a scholarship, comprising a\ndescription of your current financial situation; an explanation why you\nwould deserve a scholarship, comprising a description of academic\nexcellence and if applicable other merits", "A budget plan using ", "this template", ", explaining how you are going to finance year 1, 2 and 3 of the IBA programme", "If applicable: certified copies of other scholarships granted", "For More Information:", "Visit the Official Webpage of the ", "Erasmus University Holland Scholarship", " "], "url : https://www.opportunitiesforafricans.com/holland-government-scholarship-2020-for-study-at-rotterdam-school-of-management-erasmus-university/"], [["Sciences Po Eiffel Scholarships 2019/2020 for study in France (Funded)", "date announced:September 24, 2019", "Application Deadline: November 3rd 2019"], ["Application Deadline: November 3rd 2019", "The Ministry of Foreign Affairs gives priority to candidates from\nemerging countries and above all to those who are underrepresented in\nFrench universities and higher education institutions: Asia, Latin\nAmerica, Eastern Europe and new members of the EU and the Middle East.", "Sciences Po only presents applications from candidates ", "with profiles that match the priorities of the", " Eiffel scholarship", ".", " If you are offered a place to study at Sciences Po, we will inform you whether your application will be proposed to ", "Campus France", " (the organisation in charge of this scholarship).", "Applications received from students currently studying abroad are prioritised over those from students already living in France.", "Students cannot apply directly for the Eiffel Scholarship. Applications must be made through a higher education institution.", " \nIf you are studying in two higher education institutions, you can only\nsubmit a single application. In order to apply, you must have already\nbeen accepted to a programme at Sciences Po. For your application to be\nsuccessful, it is essential that you respect our deadlines.", " The\nEiffel scholarship programme, launched in January 1999 by the French\nMinistry of Foreign and European Affairs, is aimed at foreign students\nwhose outstanding ability has been recognised by French institutions of\nhigher education who wish to sponsor these students for the rest of\ntheir studies.", " The programme is primarily designed to provide an\neducation in France to future decision makers in both the private sector\nand in the national administrations of emerging countries.", "Eligibility", "Are eligible to the Eiffel Scholarship", "Candidates must be ", "under 30 years old", ".", "Sciences Po candidates", "Applicants for our graduate programmes", "Applicants for the dual degree in Journalism / Columbia (BAMA) (who\nare already first year students at Columbia’s university School of\nJournalism)", "Sciences Po students", "Third year Sciences Po students", "Second year undergraduate students in one of our partnership programmes at Poitiers campus", "First year graduate student at Science Po", "Students admitted last year in their first year as a graduate student who requested a deferral", "Students admitted last year who have received a conditional offer of\nadmission if they submit an English test before the scholarship\napplication deadline.", "PhD students who are co-supervised or presenting a joint thesis with a partner university", "Students admitted to the following dual degree programme (other\nSciences Po dual degree programme are not eligible for this\nscholarship):", "Journalism Sciences Po/Columbia University (candidates for this programme are eligible)", "Sciences et Politiques de l’Environnement Sciences Po/Sorbonne Université (only first year students are eligible)", "Quantitative Economics Sciences Po/Panthéon Sorbonne Paris I (only first year students are eligible)", "The Eiffel laureates who graduated in June 2019 and wish to submit an Eiffel application for the PhD.", "Not eligible to the Eiffel Scholarship", "Students who already received a grant or scholarship from the French government", "Students who have previously applied for an Eiffel scholarship and\nwho have been unsuccessful, even if they change their field of studies.", "Candidates for the 1year Master’s programmes", "Candidates for the Joint Master in Journalism and International Affairs (Except candidates in their first year)", "Students admitted to a Sciences Po dual degree programme (except for the 3 dual degrees mentioned above)", "Amount awarded", "The ", "monthly grant amount for Master programmes", " amounts to €1,181", " (€1,031 scholarship + €150 additional monthly amount).", "The Eiffel Scholarship ", "does not cover tuition fees", ". \nStudents offered a place to study at Sciences Po who receive the\nscholarship are therefore responsible for paying the annual tuition\nfees.", "Length of the scholarship", "The Eiffel Scholarship is awarded ", "for the length of time needed to complete the course ", "for\nwhich students have applied.  This is subject to students fulfilling\nthe academic obligations during each year of the course.", "Application", "Reminder", ": Students cannot apply directly for the\nEiffel Scholarship. Applications must be made through a higher education\ninstitution.  If you are studying in two higher education institutions,\nyou can only submit a single application.", "First time applicants", " who wish to be presented for\nthe Eiffel scholarship by Sciences Po must indicate so in the “Financial\nInformation” section of their Sciences Po application form and must\nprovide the required documents. Please note that your scholarship\nrequest will be taken into account only in case of admission.", "Students already admitted at Sciences Po,", "\nstudents admitted last year who have received a conditional offer of\nadmission or students admitted last year in their first graduate year\nwho requested a deferral", " have to send their Eiffel Scholarship\napplication by email to the Admissions office by October 20th, 2019, by\nattaching the required documents : ", "Admissions contact form", "Sciences Po will select the applications that it wishes to present to\nCampus France. Please note that applying for the Eiffel grant does not\nguarantee the presentation of your ", "application", " to Campus France.", "NB : We reserve the right not to consider incomplete applications.", "Required documents", "All candidates must attach the following documents to their scholarship application :", "CV, including information on the applicant’s level\n(distinction/honours, ranking or position in the promotion, number of\nstudents in the promotion, diploma with information on specialisation,\ndate of the diploma, final grades)", "professional project, one or two pages. The applicant must explain\nthe reasons for studying in France as opposed to their home country,\ntheir interest for the selected programme and how this will help them\nachieve their career goals and objectives.", "academic transcripts all of the years of higher education (including periods spent abroad on exchange programmes)", "ID/passport.", "Language test certificates (french and/or english) if necessary", "Deadlines", "Students already admitted at Sciences Po (including applicants who\ndeferred their arrival or those who received conditional offer last\nyear): ", "October 20th, 2019", "First time applicants:", " November 3, 2019", "The deadline for applications set by Sciences Po ", "is not the date at which applications must be received by Campus France.", " Indeed,\nit is necessary to have been offered a place at Sciences Po in order to\nbe eligible for the Eiffel Scholarship. Applications received after\nthis date will not be processed.These dates are mandatory and cannot be modified.", "Students already admitted at Sciences Po must send their\nEiffel Scholarship application by email, directly to the Admissions\ndepartment by October 20th, 2019", " ", "at the latest: ", "Admissions contact form", " ", "Information on the selection of your application will be communicated in January 2020.", "Eiffel scholarship results will be published on Campus France’s website (2020 schedule will be confirmed soon by Campus France).", "For any further information: ", "Admissions contact form ", "(01.45.49.50.82).", "For More Information:", "Visit the Official Webpage of the Sciences Po Eiffel Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/sciences-po-eiffel-scholarships-2019-2020/"], [["UNU-WIDER/SA-TIED Young Scholars programme 2019 for Master’s-level university students based in South Africa (Fully Funded)", "date announced:September 21, 2019", "Application Deadline: 3:59 UCT+3 27 September 2019. "], ["Application Deadline: 3:59 UCT+3 27 September 2019. ", "The United Nations University World Institute for Development Economics Research (UNU-WIDER),", " together with its partners, now invites interested participants to apply for the ", "Southern Africa – Towards Inclusive Economic Development (SA-TIED) Young Scholars programme.", "Expectations", "The Young Scholars programme", " supports the research careers of promising current and future Master’s-level university students based in South Africa. You are expected to submit a research proposal as a part of your application based on your Master’s thesis research or an independent research project. Your proposal is expected to align thematically with at least one of ", "the SA-TIED work streams", ". If accepted to the programme, you will work with top academics and policy officials in your field to develop and complete an original research project.", "During the course of the programme, you will build a lasting network\nwith local and international experts and officials and your work will\nbecome a part of the SA-TIED programme’s body of research on important,\npolicy-relevant topics in inclusive economic development. Finally, your\nwork will be published as a SA-TIED Young Scholars Working Paper, making\nan important contribution to your growing portfolio. ", "As you complete your studies, SA-TIED will facilitate your ongoing dialogue with other students, academics, and government officials in South Africa and will provide exposure to the breadth and depth of public sector research and analytical work which is ongoing within government.", " Proposal submission details", "You should be a South Africa-based Master’s student or an individual with an intention to enrol in a Master’s degree in 2020 with a keen interest in conducting research on development economics topics relevant to Southern Africa and the scope of the SA-TIED programme.", " To apply, please submit the following documents through the online portal which can be accessed here.", " 1 Maximum 2-page CV ", "2 Maximum 2-page research proposal and the name and contact details of your supervisor or another academic reference. You are expected to identify which of the thematic work streams of SA-TIED your project relates to in your application, so familiarize yourself with different work streams on the programme website. ", " Selected Young Scholars are expected to:", "1 Attend the kick-off workshop in Pretoria on Saturday 7 December 2019, to present work-in-progress towards your final research paper or Master’s thesis to other young scholars and research experts in attendance.", " 2 Be available to present your thesis or final paper, in poster format, at a dissemination event tentatively planned for May 2020. You will receive a separate invitation to this event if you are selected to present. ", "3 Convert a main element of your thesis or final paper into a working paper (of about 8,000 words) by July 2020. ", "This working paper, which needs to satisfy a set of quality requirements, will be published as a part of the", " SA-TIED Young Scholars ", "Working Paper Series and will be available open access on the SA-TIED website. For successful proposals:", "1 Selected Young Scholars will sign a contract with UNU-WIDER. ", "2 The contract will include an honorarium of US$600 payable upon submission of the finalized working paper of sufficient quality to merit publication as a SA-TIED Young Scholars paper. ", "The costs for attending Young Scholars related meetings and activities will be borne by UNU-WIDER in accordance with the UNU travel policy and are subject to prior approval of the UNU-WIDER Director. ", "How to Apply:", "Apply by reading ", "the full invitation to apply", " and submitting your application materials ", "through the online portal", " by 23:59 UCT+3 27 September 2019.", "Please address questions to ", "[email protected]", "For More Information:", "Visit the Official Webpage of the SA-TIED Young Scholars programme 2019"], "url : https://www.opportunitiesforafricans.com/unu-wider-sa-tied-young-scholars-programme-2019/"], [["Reach Oxford Undergraduate Scholarships 2020/2021 for Study in the United Kingdom (Funded)", "date announced:September 10, 2019", "Application Deadline: 15 October 2019 "], ["Application Deadline: 15 October 2019 ", "Students\nshould note they must apply for admission to the University before they\ncan be considered for a Reach Oxford Scholarship. The University is\nunable to consider any scholarship applications from students who have\nnot been offered a place at Oxford. The University is not responsible\nfor the content of external sites advertising the scheme and would\nencourage applicants to read the following details to check their\neligibility.", "A number of Reach Oxford scholarships (formerly Oxford Student Scholarships) are offered to students from low-income countries who, for political or financial reasons, or because suitable educational facilities do not exist, cannot study for a degree in their own countries.", "Requirements:", "Applicants must be nationals of countries who receive official development assistance from the Development Assistance Committee (DAC) of the Organisation for Economic Co-operation and Development (OECD):", "Afghanistan; Albania; Algeria; Angola; Antigua and Barbuda; Argentina; Armenia; Azerbaijan; Bangladesh; Belarus; Belize; Benin; Bhutan; Bolivia; Bosnia and Herzegovina; Botswana; Brazil; Burkina Faso; Burundi; Cambodia; Cameroon; Cape Verde; Central African Rep.; Chad; China; Colombia; Comoros; Congo, Dem. Rep.; Congo, Rep.; Cook Islands; Costa Rica; Côte d’Ivoire; Cuba; Djibouti; Dominica; Dominican Republic; Ecuador; Egypt; El Salvador; Equatorial Guinea; Eritrea; Eswatini; Ethiopia; Fiji; Gabon; Gambia; Georgia; Ghana; Grenada; Guatemala; Guinea; Guinea-Bissau; Guyana; Haiti; Honduras; India; Indonesia; Iran; Iraq; Jamaica; Jordan; Kazakhstan; Kenya; Kiribati; Korea, Dem. People’s Rep.; Kosovo; Kyrgyz Rep.; Laos; Lebanon; Lesotho; Liberia; Libya; Madagascar; Malawi; Malaysia; Maldives; Mali; Marshall Islands; Mauritania; Mauritius; Mexico; Micronesia, Federated States; Moldova; Mongolia; Montenegro; Montserrat; Morocco; Mozambique; Myanmar; Namibia; Nauru; Nepal; Nicaragua; Niger; Nigeria; Niue; North Macedonia; Pakistan; Palau; Panama; Papua New Guinea; Paraguay; Peru; Philippines; Rwanda; Saint Helena; Samoa; São Tomé and Príncipe; Senegal; Serbia; Sierra Leone; Solomon Islands; Somalia; South Africa; South Sudan; Sri Lanka; St. Lucia; St. Vincent and Grenadines; Sudan; Suriname; Syria; Tajikistan; Tanzania; Thailand; Timor-Leste; Togo; Tokelau; Tonga; Tunisia; Turkey; Turkmenistan; Tuvalu; Uganda; Ukraine; Uzbekistan; Vanuatu; Venezuela; Vietnam; Wallis and Futuna; West Bank and Gaza Strip; Yemen; Zambia; Zimbabwe.", "\nFee status: Overseas ", "\nLevel of study: Undergraduate ", "\nYear of study: New students ", "\nSubject: All subjects in the course listing, except medicine ", "\nCollege: Not all colleges are able to offer Reach Oxford Scholarships every year. If you are accepted by a college that is not participating in the scheme, this will not prevent you from applying for and being awarded a scholarship. If your application is successful, arrangements will be made to transfer you between colleges.", "\nOther criteria: ", "This scheme is only suitable for candidates who have received an offer and who are of the highest academic ability. Financial need and social commitment are also major criteria for selection. Applicants should be intending to return to their country of ordinary residence following their studies. Priority will be given to students who have not studied at undergraduate level before.", "How do I apply?", "You must\nmake an application to the University of Oxford for an undergraduate\ncourse through UCAS by 15 October 2019, and be successful in gaining a\nplace.", "Details on how to apply for a scholarship for 2020 entry will be made available on this page in January 2020.", "For\n2020 entry applicants who apply by the 12 February 2020 scholarship\ndeadline, the selection process will be undertaken in March 2020.", "Applicants will be informed of the outcome of their application in April 2020.", "Further information", "Scholars\nwill be expected to write an annual report about their academic and\nsocial activities, and achievements at the University.", "Receipt of the award in subsequent years is subject to satisfactory academic progress.", "Applicants\nshould be aware that competition for the scheme is very high and the\nUniversity does not have additional funding for those candidates who are\nnot offered a scholarship.", "For More Information:", "Visit the Official Webpage of the Reach Oxford Undergraduate Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/reach-oxford-undergraduate-scholarships-2020-2021/"], [["Korean Government Scholarship Program 2020/2021 for study in South Korea (Fully Funded)", "date announced:September 6, 2019", "Korean Government Scholarship Program are open to international students for pursuing undergraduate programme at higher educational institutions in Korea. The scholarship will contribute to promoting the international exchange in education and to deepening the mutual friendship among countries.\n"], ["Korean Government Scholarship Program", " are open to international students for pursuing undergraduate programme at higher educational institutions in Korea. The scholarship will contribute to promoting the international exchange in education and to deepening the mutual friendship among countries.\n", " To provide international students with opportunities to conduct advanced studies in undergraduate & graduate programs at higher educational institutions in the Republic of Korea in order to promote international exchanges in education and mutual friendship between countries. Available Options in Universities Undergraduate course: 4-year courses at designated universities", " ※ Transferring between universities is not allowed. (e.g. Starting studies at the junior year is not allowed.)", " Graduate course: Master’s or Ph.D. courses at general graduate schools of Korean universities Total Candidates to be Selected 170 persons (undergraduate course), 700 persons (graduate course) Korea Language Training Grantees are required to take Korean language training courses for 1 year at a language institution located on-campus of the domestic universities. (Those who have attained a Korean language fluency score higher than level 5 in TOPIK are exempt from this requirement.) Application Procedure ", "Time line", "Undergraduate", "Graduate", "Announcement released", "Sept. in the year prior to planned studies in Korea", "Feb. in the year of planned studies in Korea", "Recommend candidates", "(Korean Embassies, designated universities)", "Oct.-Nov. in the year prior to planned studies in Korea", "Mar.-Apr. in the year of planned studies in Korea", "Results released", "Jan. in the year of planned studies in Korea", "June in the year of planned studies in Korea", "Arrival in Korea", "Late Feb. in the year of planned studies in Korea", "Late Aug. in the year of planned studies", "\nScholarship Benefit\n", "Categories", "Airfare", "Resettlement", " Allowance", "Living Allowance", "Medical ", " Insurance", "Language", " Courses", "Tuition", " Fees", "Award for ", "Excellent ", "Korean ", "Language", " Proficiency", "Research", " Support", "Printing", " Costs", " (Dissertation)", "Completion", " Grant", "Amount", "(KRW)", "Actual cost", "KRW 200,000", "Under", "graduate:", "800,000 ", "Graduate:", "900,000", "KRW 20,000", "(per month)", "KRW 800,000", " per quarter", "Actual ", "cost ", "(No more ", "than 5 million", " KRW per semester)", "KRW ", "100,000", "KRW ", "210,000 – ", "240,000", "(per semester)", "KRW", " 500,000 –", " 800,000", "KRW ", "100,000", "(Once)", "\nQualifications\nBoth an applicant and his/her parents must be citizens of their country of origin.", "\n※ Applicants should not hold Korean citizenship.", "\n– Applicants should have adequate health, both mentally and physically, to stay in a foreign country for a long time.", "\n– Should be under 25 years of age at the date of entrance. (Undergraduate)", "\n– Should be under 40 years of age at the date of entrance. (Graduate)", "\n– Have finished or be scheduled to finish formal education of all\nelementary, middle, high school courses by the date of arrival.\n(Undergraduate)", "\n– Possess a grade point average (G.P.A.) above 80% from the last educational institution attended.", "\n– Hold a Bachelor’s degree or a Master’s degree by the date of arrival. (Graduate)", "\n※ Applicants who have previously acheived in any undergraduate\nprogram, master’s program, or doctoral program in Korea cannot apply for\nthis program. ", "\nHowever, a former or current KGSP scholar who hold the overall grade\nof 90% or above can reapply to this program once either through the\nembassy or university track.", "\nProcedure for the Scholarship Award\nNIIED invites the Korean Embassy in the invited country or a domestic university to recommend potential candidates.", "\nApplicants should submit all documents related to their scholarship\napplication to the Korean Embassy in their country of residence to or\nthe domestic university concerned.", "\nThe Korean Embassy or the domestic university sends proper candidates to NIIED with the required documents.", "\nNIIED evaluates potential candidates and notifies the Korean Embassy of the final selected KGSP grantees.\n", "For More Information:", "Visit the Official Webpage of the Korean Government Scholarship Program 2020/2021", " "], "url : https://www.opportunitiesforafricans.com/korean-government-scholarship-program-2020-2021/"], [["The Engineering for Development (E4D) Continuing Education Scholarship Programme 2020", "date announced:September 6, 2019", "Application Deadline: 30 November 2019 "], ["Application Deadline: 30 November 2019 ", "The Engineering for Development (E4D) Continuing Education Scholarship Programme", " awards scholarships for travel and living expenses to candidates from low-income countries to attend continuing education programmes at ETH Zurich.", "The goal of the programme is to enhance the knowledge and skills of future leaders with the perspective of contributing to capacity development and poverty reduction in their home countries.", "Eligibility of the candidate", "The candidate must hold a completed and recognised Master’s degree from a university and proof professional working experience of at least 2 years. ", " ", "The minimal English standard is TOEFL level C1.", "The scholarship is open to candidates from countries classified as Least Developed Countries, Low Income Countries and Lower Middle Income Countries according to the ", "DAC-list of the OECD", ". ", " ", "Candidates need to be accepted by the School for Continuing Education, ETH Zurich as well as the MAS, DAS or CAS programme office.", "Financial Support", "The following expenses will be covered by the scholarship:", "Economy roundtrip ticket (max. 2’000 CHF)", "Visa fees", "Living allowance for the duration of the programme ", " ", "ETH general tuition fee waiver (660 CHF per semester)", "Important", "Only candidates who are admitted to an ETH MAS, DAS or CAS\nprogramme based on his/her academic and professional qualifications are\nconsidered for a scholarship. Candidates must apply to both (I) a\ncontinuing education programme and (II) to the E4D scholarship.  ", "Application Deadline", "30 November 2019", "Submit your application documentation in one single pdf-file to ", "[email protected]", ".", "Application Documents", "CV of the candidate ", "MSc or Masters Diploma and academic transcript(s)", "1-2 page application letter, stating the motivation to\nattend the programme and the impact for the candidate’s career\ndevelopment and beyond.", "Two professional references", "Formal admission letter by the School for Continuing\nEducation confirming that the candidate is admitted to the MAS, DAS or\nCAS programme.", "Certificate of employment. The certificate of employment\nletter must be sent to the E4D programme office directly through the\nemployer (and not the candidate)", "Detailed application criteria can be downloaded ", "here (PDF, 193 KB)", ".", "For More Information:", "Visit the Official Webpage of the E4D Continuing Education Scholarship Programme 2020"], "url : https://www.opportunitiesforafricans.com/the-engineering-for-development-e4d-continuing-education-scholarship-programme-2020/"], [["Government of Ireland (Masters & PhD) Postgraduate Scholarship Programme 2020 for study in Ireland", "date announced:September 5, 2019", "Application Deadline: 24 October 2019 "], ["Repro Free:Thursday 22nd October 2015. Picture Jason Clarke", "Application Deadline: 24 October 2019 ", "The Government of Ireland Postgraduate Scholarship Programme", " is an established national initiative, funded by the Department of Education and Skills and managed by the Council.", "In 2018, we invested in a total of 1,193 postgraduate scholars, with\nover 5,000 individual scholarships for excellent research awarded to\ndate.", "The Government of Ireland Postgraduate Scholarship Programme is\nunique in the Irish research landscape and complements other channels\nfor funded postgraduate education in the Irish eco-system. Among its\nfeatures are:", "individual, prestigious awards for excellent research in the name of the applicant;", "an objective selection process using international, independent expert peer review;", "funding across all disciplines, from archaeology to zoology;", "awards for bottom-up, non-directed research, with the exception of those funded by our strategic funding partners.", "The programme provides outstanding students with the opportunity to\ndirect their own research at the early-career stage, working with a\nsupervisor, in their chosen area of interest. Pioneering proposals\naddressing new and emerging fields of research or those introducing\ncreative, innovative approaches are welcomed. Proposals of an\ninterdisciplinary nature are also encouraged as it is recognised that\nadvancing fundamental understanding is achieved by integrating\ninformation, techniques, tools and perspectives from two or more\ndisciplines.", "The Government of Ireland Postgraduate Scholarship Programme is highly competitive, with an average success rate of 18% over the past five years. Successful applicants who become scholars under the programme are recognised as demonstrating world-class potential as future research leaders and in the quality of their ideas.", "Benefits", "a stipend of €16,000 per annum", "a contribution to fees, including non-EU fees, up to a maximum of €5,750 per annum", "eligible direct research expenses of €2,250 per annum", "Key dates", "Deadline ", "Date", "Call open", "5 September 2019", "FAQ deadline ", "24 October 2019", "Applicant deadline", "16:00 (Irish time) 31 October 2019", "Supervisor and referee deadline", "16:00 (Irish time) 7 November 2019", "Research office endorsement deadline", "16:00 (Irish time) 14 November 2019", "Call outcome", "End of March 2020", "Scholarship start date", "1 September 2020", "For More Information:", "Visit the Official Webpage of the Government of Ireland Postgraduate Scholarship Programme 2020 "], "url : https://www.opportunitiesforafricans.com/government-of-ireland-masters-phd-postgraduate-scholarship-programme-2020/"], [["DAAD/PLAAS NELGA Scholarship 2020 for study in the University of Western Cape, South Africa (Funded)", "date announced:September 18, 2019", "Application Deadline: 30 November 2019. "], ["Application Deadline: ", "30 November 2019", ". ", " The German Academic Exchange Service (DAAD)", " in collaboration with the Institute for Poverty, Land & Agrarian Studies (PLAAS), University of the Western Cape (UWC), is offering in-country/in-region scholarships, within the Network of Excellence for Land Governance in Africa (NELGA).", " This forms part of the Strengthening Advisory Capacities for Land Governance in Africa (SLGA) programme funded by the German Federal Ministry of Economic Cooperation and Development (MBZ).DAAD is offering competitive scholarships for Masters and Doctoral Studies in Poverty, Land & Agrarian Studies, offered at PLAAS, UWC. These scholarships are aimed at young candidates, mid-career professionals, researchers and university staff. Female applicants and candidates from less privileged regions or groups are especially encouraged to participate in the programme. ", " The target group for scholarships are graduates and postgraduates from Africa with a first academic degree if applying for a Master’s programme, or with a Master’s degree if applying for a doctoral programme who want to pursue Master’s or PhD courses in their home country (so called In-Country scholarships) or in another African country (In-Region scholarships).", " DAAD offers up to 3 scholarships for Master studiesand 3 scholarships for PhD studiesat PLAAS for the intake 2020.", "Application Requirements", "Applicants ", "•have successfully completed generally a three-year university degree (Master candidates) or a two-year university degree (doctoral candidates) with above average results (upper third of class)", "•clearly show motivation and strong commitment", "•have thorough knowledge of the language of instruction", "•must be nationalsor permanent resident of an African country", "•hold a SAQA Certificate of Evaluation or be in the process of obtaining one if they hold a non-South African university degree;", "•should generally be a) staff member of a public university, ", "b) candidate considered for teaching or research staff recruitment,", " c) from the public sector.Female applicantsand candidates from less privileged regions or groups are especially encouraged to participate in the programme. ", " The scholarship covers:", "Research Areas", "The\nprogramme supports those in subject areas with strong relevance to land\ngovernance/land management. We propose the following topic areas for\nscholarships:", "Land tenure, including customary tenure, titling and land markets", "Water, forestry, fisheries and ecosystems management", "Farming systems, agricultural development and the rural non-farm economy", "Agricultural investment and inclusive business models", "Governance, policy frameworks and investment standards", "Population, migration and urbanisation", "Climate change mitigation and adaptation", "Agro-food systems, food prices and food security", "Regional cooperation and integration and the agro-food system", "How to Apply?", "The application process contains two steps. Your attention is drawn towards the two application deadlines.", "Step One:", "Applicants\nare required to apply for the respective programme at PLAAS, UWC and\nare subject to their application procedures. Click here for more\ninformation on the ", "PLAAS MPhil & PhD Information Sheet_2020", ". The PLAAS application deadline is ", "31 October 2019", ".", "Step Two:", "Once shortlisted, PLAAS, UWC will provide a link to the DAAD-Portal. The DAAD application deadline is ", "30 November 2019", ".", "For More Information:", "Visit the Official Webpage of the DAAD PLAAS NELGA Scholarship 2020"], "url : https://www.opportunitiesforafricans.com/daad-plaas-nelga-scholarship-2020/"], [["Commonwealth Split-site (PhD) Scholarships 2020 (for low and middle income countries) to Study in the United Kingdom (Fully Funded)", "date announced:September 19, 2019", "Application Deadline: 16:00 (GMT) on 06 November 2019 "], ["Application Deadline: ", "16:00 (GMT) ", "on ", "06 November 2019", " ", "Commonwealth Split-site Scholarships ", "are for PhD candidates from low and middle income Commonwealth countries, to spend up to 12 months at a UK university as part of their doctoral studies in their home country.", "Funded by the UK Department for International Development (DFID), Commonwealth Split-site Scholarships enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those who could not otherwise afford to study in the UK. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "These scholarships are for:", "12 months study at a UK university as part of an applicant’s doctoral studies in their home country, starting in October 2020", "Applicants who are registered (or will be registered by September 2020) for a PhD at a university in an ", "eligible Commonwealth country", "Study at a UK university with which your home university has an established institutional or departmental link", "Study at a UK university which has a part funding agreement with the CSC. View a full list of ", "UK universities with part funding agreements", "Requirements:", " Be permanently resident in an eligible Commonwealth country ", "Be registered for a PhD at a university in aneligible Commonwealth country by the time your scholarship is confirmed (September 2020)", "Be available to start your academic studies inthe UK by the start of the UK academic year in September/October 2020 ", "By October 2020, hold a first degree of at least upper second class (2:1) honours standard, or a second class degree and are levant postgraduate qualification (usually a Master’s degree).", "·Be unable to afford to study in the UK without this scholarship ", "Scholarship Worth", "Each scholarship provides: ", "· Approved airfare from your home country to the UK\nand return at the end of your award (the CSC will not reimburse the cost of\nfares for dependants, nor the cost of journeys made before your award is\nconfirmed) ", "· Approved tuition fees ", "· Stipend (living allowance) at the rate of £1,110 per month, or £1,362", "per  month for those at universities in the London metropolitan area (rates quoted  at 2019-2020 levels) ", "· Warm clothing allowance, where applicable ", "· Study travel grant towards the cost of study-related\ntravel within the UK or overseas ", "· If you are widowed, divorced, or a single parent, child allowance of £ 476 per  month for the first child, and £ 117  per month for the second and third child under the age of 16, if you are accompanied by your children and they are  living with you at the same address in the UK (rates quoted  at 2019-2020 levels) ", "How to apply", "\nYou must make your application directly to the CSC using the CSC’s\nonline application system. The CSC will not accept any applications that\nare not submitted via the online application system. You are not\nrequired to apply via a nominating body for these scholarships.", "Only one application per applicant for these scholarships will be accepted.", "Application deadline: Your application must be submitted by ", "16:00 (GMT) ", "on ", "06 November 2019", " at the latest.", "You are advised to complete and submit your application as soon as\npossible, as the online application system will be very busy in the days\nleading up to the application deadline.", "Supporting documentation: Your application must include the following supporting documentation by ", "16:00 (GMT) ", "on ", "27 November 2019", "For More Information:", "Visit the Official Webpage of the Commonwealth Split-site (PhD) Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/commonwealth-split-site-phd-scholarships-2020/"], [["2019 SAWISE Angus Scholarships for female students from sub-Saharan Africa.", "date announced:September 16, 2019", "Application Deadline: November 15th 2019"], ["Application Deadline: November 15th 2019", "The Association of South African Women in Science and Engineering (SAWISE)", " ", "is awarding scholarship for black female from sub-Saharan Africa. Scholarship is awarded only for studies at Honours level (or 4th year equivalent e.g. in engineering) in any field of science and engineering. ", "Eligibility criteria include for SAWISE Angus Scholarship include:", "i. A sub-Saharan black female.", "\nii. Must have achieved 70% or above grade average in her subject of study.", "\niii. Only for studies at Honours level (or 4th year equivalent e.g. in engineering).", "\niv. In any field of science and engineering.", "Applications for these scholarships must include copies of the following:", "\na. Curriculum vitae.", "\nb. An official academic transcript (record).", "\nc. A letter of motivation (~350 words).", "\nd. A certified copy of your ID.", "\ne. A completed ", "online application form", ".", "For More Information:", "Visit the Official Webpage of the 2019 SAWISE Angus Scholarships "], "url : https://www.opportunitiesforafricans.com/2019-sawise-angus-scholarships-for-female-students-from-sub-saharan-africa/"], [["The Institute of International Education’s Scholar Rescue Fund (IIE-SRF) 2020 for Threatened Scholars worldwide", "date announced:September 8, 2019", "Application Deadline: September 30th 2019"], ["Application Deadline: September 30th 2019", " The Institute of International Education’s Scholar Rescue Fund (IIE-SRF) ", "is the only global program that arranges and funds fellowships for threatened and displaced scholars at partnering higher education institutions worldwide. These year-long fellowships of $25,000USD support temporary academic positions at institutions of higher learning anywhere in the world where IIE-SRF fellows can continue their work in safety. In most cases, IIE-SRF fellows are eligible to apply for a second and final year of fellowship support. ", "Eligibility Criteria", "IIE-SRF accepts applications from professors, researchers,\nand public intellectuals who face threats and cannot continue their work\nin their home countries.", " Scholars from any country and in any\nacademic field or discipline may qualify. Applicants are assessed based\non academic qualifications and experience, the quality and/or potential\nof their work, and the urgency of the threats that they face.", "Preference is given to scholars who:", "hold a Ph.D. or highest degree in their field and have significant teaching and/or research experience at a university, college, or other institution of higher learning;", "have an established record of published research;", "demonstrate superior academic accomplishment or promise;", "are facing or have recently fled from immediate, targeted threats to their lives and/or careers in their home countries or countries of residence;", "will benefit their home and/or host academic communities.", "Benefit:", "The IIE-SRF fellowship award", " includes a grant of up to US$25,000, along with individual health insurance, to support a visiting academic appointment of up to one year (renewable for a second year). The final fellowship amount is dependent upon several factors, including the location of the host institution, the cost of living, and the value of any additional contributions from the host institution of other source(s).", "IIE-SRF typically requires that the hosting institution provide financial support that is equal to or greater than the IIE-SRF fellowship award. This support generally takes the form of a stipend or other direct funding for the visiting fellow such as housing, airfare, and meal programs. In-kind contributions – office space, computers, language, or other training fees, etc. – are encouraged for a complete fellow support package but do not qualify as part of the matching contribution.", " In host countries where the cost of living is lower and the funding requirement is prohibitive, IIE-SRF may consider on a case-by-case basis a waiver of the full host funding requirement.", "For More Information:", "Visit the Official Webpage of the Institute of International Education’s Scholar Rescue Fund (IIE-SRF) 2020"], "url : https://www.opportunitiesforafricans.com/the-institute-of-international-educations-scholar-rescue-fund-iie-srf-2020/"]]