[[["Road Traffic Infringement Agency (RTIA) bursary program 2018 for unemployed South Africans", "date announced:June 13, 2018", "Application Deadline: October 1st 2018"], ["Application Deadline: October 1st 2018", "The ", "Road Traffic Infringement Agency", " invites applications for bursaries from the ", "unemployed South African", " citizens for the 2019 academic year in the following fields of study:", "* LLB", "\n* B-Com: Finance", "\n* Road Traffic Management Degree or National Diploma", "Requirements:", "Applicants must: be South African citizens, be studying at an accredited South African Educational Institution in one of the above mentioned field of study, be prepared to enter into an agreement with the Road Traffic Infringement Agency and do counter-service in the Road Traffic Infringement Agency upon completion of the qualification and do not have any other bursary funding.", "Applicants must note the following:", "Application forms must be posted or hand delivered by not later than 31 October 2018.", "Applicants should not be older than 35 years of age.", "Applicants must complete bursary application forms available on the Agency website, attach certified copies of qualifications, recent academic records, Identity Document, proof of registration, proof of guardian’s income, and motivational letter.", "Application forms are available on or at the reception of the Road Traffic Infringement Agency (RTIA). www.rtia.co.za", "Only first year students will be considered.", "Correspondence will be limited to the successful candidates.", "Applications must be addressed to: or", "\nThe Human Resources Division, RTIA,", "\nP O Box 6341, Halfway House, 1685 or ", "[email protected]", " hand delivered to Waterfall Edge B,Howick Close, Waterfall Office Park, Bekker Road, Midrand", "Enquiries: Mr I M Chavalala 087 287 7998 or Mr C Barties 087 287 7983", " External Bursary Opportunity – 2019", " ", " Application Form", "For More Information:", "Visit the Official Webpage of the Road Traffic Infringement Agency (RTIA) bursary program 2018"], "url : https://www.opportunitiesforafricans.com/road-traffic-infringement-agency-rtia-bursary-program-2018/"], [["Konrad- Adenauer -Stiftung (KAS) Media Africa Scholarship 2019 for young sub-Saharan African journalist (Fully Funded to study in South Africa)", "date announced:June 20, 2018", "Application Deadline: July 13th 2018"], ["Application Deadline: July 13th 2018", "KAS Media Programme Sub-Sahara Africa", " is offering a university scholarship to a promising, ", "young sub-Saharan African journalist", " to do a ", "full-time Honours or Masters Degree at the University of Witwatersrand’s Journalism Programme", " in Johannesburg in 2019. The scholarship includes the university fees, return flight to Johannesburg, accommodation costs for student housing and a monthly stipend.", "KAS Media Programme Sub-Sahara Africa", " is offering a university scholarship to a promising, young sub-Saharan African journalist to do a full-time Honours or Masters Degree at the University of Witwatersrand’s Journalism Programme in Johannesburg in 2019.", "Benefits", "The scholarship includes the university fees, return flight to Johannesburg, accommodation costs for student housing and a monthly stipend.", "Requirements:", "• Candidates should be under 30 years old, working as a journalist in a sub-Saharan African country and fluent in English.", "\n• For Honours, candidates must have at least three years’ working experience and either an undergraduate degree or pass an entrance test.", "\n• For Masters, candidates must have a degree equivalent to the BA Honours in Journalism (or related field) and at least three years’ working experience.", "\n• Candidates must work closely with KAS Media Africa during their stay in Johannesburg and write a bi-monthly narrative report on their study progress.", "Applicants need to submit:", "• A one page motivation letter", "\n• A CV", "\n• Two examples of published work (article / broadcast piece)", "\n• Two letters of nomination/reference from a senior journalist, publisher or academic", "Timeline:", "• Closing date for applications is 13 July 2018.", "\n• Applications should be emailed to ", "[email protected]", " with “KAS scholarship” in the subject heading.", "\n• Candidates should make themselves available in early-August for an interview by skype or telephone and be willing to sit a test exam.", "\n• The decision on the award will be made before the end of August 2018.", "\n• Successful candidates will be expected to complete an online student application and supply all the necessary documentation, including a SAQA assessment.", "\n• The application for a student visa will be the responsibility of the candidate, who must begin the process before the end of October 2018.", "\n• The academic year starts in the beginning of February 2019, and ends with the submission of research in November or the following February. The successful candidate should plan to travel in late January 2019.", "For More Information:", "Visit the Official Webpage of the KAS Media Africa Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/konrad-adenauer-stiftung-kas-media-africa-scholarship-2019/"], [["Chilean Government Nelson Mandela Masters Scholarships 2018/2019 for Southern African students (Fully Funded)", "date announced:June 19, 2018", "Application Deadline: October 31st 2018"], ["Application Deadline: October 31st 2018", "For the academic year 2019,", " the Chilean Agency for International Cooperation and Development (AGCID)", " offers scholarships to perform accredited Master Degree studies in Chilean Universities or other higher education institutions. These scholarships are offered to professionals who are citizens of ", "South", " ", "Africa, Mozambique, and Angola.", "AGCID’s Horizontal Cooperation Scholarship Program", " began in 1993 and, to date, more than 1,000 Latin American and Caribbean professionals have completed post-graduate programs in various fields of specialization offered by Chilean universities or higher education institutions, and, as of the year 2015, the Scholarship Program has been extended to citizens of South Africa, Mozambique, and Angola.", "PROGRAM OBJECTIVES.", "The purpose of ", "AGCID’s Scholarship Program", " is to contribute to the formation of advanced human capital, through the participation of professionals in Master Degree programs imparted by accredited Chilean universities or higher education institutions, with a high level of excellence.", "Scholarships are awarded, depending on the duration of the studies program chosen, up to a maximum period of thirty (30) months, including the immersion course in the Spanish language that must be completed and approved in this period, detailed below. If the scholarship holder does not participate in the Spanish language immersion course, by having certified Spanish language proficiency beforehand, the maximum period of the scholarship will be twenty-four (24) months.", "This scholarship includes a Spanish Language Immersion Course which shall be imparted as follows:", "Spanish Language Immersion Course as of March 2019, for those who enter the Masters Studies Program between August 1, 2019 and September 30, 2019,", "Spanish Language Immersion Course as of the month of October 2019, for those who enter the Masters Studies Program between March 1, 2020 and May 31, 2020.", "Eligibility", "The scholarship program is offered to professionals who are citizens of South Africa, Mozambique and Angola and preferably work in the public or academic sectors in their home country. Applicants must have:", "– experience in the subjects they choose to pursue Master’s studies in", "– unconditional acceptance offer at a Chilean higher education institution", "– 4-year university degree", "– if employed already, you will need a letter of support, indicating that you will be released for the duration of your studies.", "Fields of Study", "A wide range of fields are available including fields related to:", "– Agriculture", "– Energy", "– Public Policy Management", "– Environment", "– Mining and Geology", "– Astronomy", "– Information technology", "– Education", "– Engineering", "– Business and economics", "– Public health", "– Science", "The full list of available courses can be viewed ", "here", ".", "What the scholarship offers", "• Spanish language course (can be in parallel with studies or before the beginning of the studies)", "• Return airfare", "• Tuition fees", "• Graduation costs", "• Medical insurance", "• Monthly allowance", "Successful applicants will be required to take funds with them to Chile to cover initial costs while administration of stipend payments is being finalized an amount of at least US$ 500 is recommended.", "Application process", "Applicants must submit the AGCID Scholarship application form both in original copy on paper and in compact disc format (CD), together with application documents to the Chilean Embassy in South Africa, see ANNEX 3 for List of Focal Points. More information on the application process can be accessed through: ", "[email protected]", "Please read the Call document carefully to ensure that you comply with all requirements and processes.", "The Embassy of Chile in South Africa is available to assist any applicants who struggle to navigate the application process, particularly applying to Chilean higher education institutions.", "Contact ", "Questions and queries must be directed to ", "www.agci.gob.cl", " or ", "[email protected]", "Deadline", "The application deadline for all documents to be submitted to the Chilean Embassy in South Africa is 31 October 2018.", "No late applications will be accepted.", "It is recommended that interested applicants start the process early to ensure that all requirements are fulfilled before the deadline.", "Documents and links", "-Chilean Agency for International Cooperation and Development Horizontal Cooperation Scholarship Program Republic of Chile – Nelson Mandela Call for Applications 2019", "-Brochure", "-Annexure 1: List of Master Programs Accredited by the National Accreditation Board", "-Annexure 2: Preliminary form of the Scholarship Granting and Acceptance Agreement that regulates the relationship between AGCID and the scholarship recipients. ", "-Annexure 4: AGCID Application Form", "-Annexure 5: Affidavit to be submitted by the selected candidates", "-Annexure 6: Recommended Health and Pre-existing Conditions Statement Form", " ", "For More Information:", "Visit the Official Webpage of the Chilean Government Nelson Mandela Masters Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/chilean-government-nelson-mandela-masters-scholarships-2018-2019/"], [["World Bank/African Railway Center of Excellence (ARCE) MSc and PhD Scholarships 2018/2019", "date announced:June 18, 2018", "Application Deadline: 5th of July 2018"], ["Application Deadline: 5", "th", " of July 2018", "African Railway Center of Excellence (ARCE)", " is one of the African Center of Excellence II projects supported by the World Bank. Through this support from the WB, the center aspires to become sustainable regional hub for training and research in Railway Engineering and Management, capable of leading efforts to address priority development challenges and improve lives in South and Eastern Africa. The aim of the center is to strengthen railway professionals’ development through short-term training,", " MSc and PhD", " level education, and research in Ethiopia and the region at large.", "To this effect, ARCE is offering scholarships to citizens in Sub-Saharan African countries to pursue MSc/PhD studies in Railway Engineering specializing in “", "Civil Infrastructure", "”, “", "Rolling Stock", "” and “", "Traction and Train Control", "” for the 2018/19 academic year.", "Eligible Applicants", "Applicants have to:-", "Have completed their last degree less than six years ago during the time of application", "Be Citizens of African countries", "For MSc applicants: Applicants should have Bachelor’s degree qualification with at least a CGPA of 3.00/4.00 for males and 2.5/4.00 for females (grading shall be converted to 4.00 scale).", "For PhD applicants: Applicants should have MSc degree qualification with at least a CGPA of 3.50 for males and 3.25 for females (grading shall be converted to 4.00 scale).", "The applicant should write a personal statement/motivation letter describing the candidate`s interest to join the program.", "The applicant should have two letters of recommendations of advisors/ supervisors from previous educational institutions.", "PhD applicants should submit research proposal including a detailed work plan (10 to 15 pages).", "Female candidates and candidates from underprivileged regions or groups as well as candidates with disabilities are especially encouraged to apply.", "Eligible Fields", "For MSc in Railway Engineering (Civil Infrastructure)", "Applications may come from engineering subject areas with strong relevance in Civil Engineering including Structural, Geotechnical, and Construction Technology, or related fields.", "For MSc in Railway Engineering (Rolling Stock)", "Applications may come from engineering subject areas with strong relevance in Mechanical Engineering including Mechanical Design, Industrial Engineering, and Thermal Engineering, or related fields.", "For MSc in Railway Engineering (Traction and Train Control)", "Applications may come from engineering subject areas with strong relevance in Electrical Engineering including  Electronic Communication Engineering, Power Engineering, Industrial Control Engineering, Computer Engineering, Microelectronics Engineering, or related fields.", "For PhD in Railway Engineering", "MSc in Railway Electrical, Mechanical or Civil Engineering or related fields", "Place of Study", "Addis Ababa University (AAU), Addis Ababa Institute of Technology (AAiT)", "Duration and Commencement", "Scholarships are available for two years for Masters and four years for PhD. The scholarship will be initially granted for one semester and may be extended for those who completed the first semester successfully.", "Application Procedure", "The applicants should submit their document in a single pdf file through email addresses; – ", "[email protected]", " and ", "[email protected]", " (please send your documents to both addresses). The application will only be complete if the following documents are submitted.", "Filled ", "ARCE 2018/2019 ", "Scholarship form ", "Signed curriculum vitae scanned in PDF; please use the Europass CV template (", "http://europass.cedefop.europa.eu", ")", "Scanned copies of all ", "university degree certificates ", "Scanned copies of all ", "university transcripts", "Letter of motivation (Maximum 2 pages)", "Academic reference from senior lecturer and proof of employment if applicable (scanned copy)", "All the documents listed above should be scanned in a single PDF document. Applications submitted separately will be considered incomplete.", "Scholarship Type", "Type A. Full Scholarship: Covers monthly stipend (USD800 for PhD students and USD600 for MSc students), tuition fee, health insurance and", "\ntransportation cost.", "Type B. Half Scholarship: Covers monthly stipend (USD400 for PhD and USD350 for MSc) and tuition fee.", "Type C. Part Timer Scholarship: Covers tuition fee only.", "Type D. Self-Sponsored Students: Student should cover all the expenses.", "Application Deadline", "No.", "Activities", "Deadline", "1", "Deadline of Application", "5", "th", " of July 2018", "2", "Announcement for short listed candidates", "25", "th", " of July 2018", "3", "Last date for Interview and Written Exam", "24", "st", " of September 2018", "4", "Registration at Addis Ababa University (for selected candidates) – applicants should fulfill additional requirements expected by university registrar which includes having transcripts sent from applicants prior university", "1", "st", " of October 2018", " ", "Contact", "Railway Engineering Center", "Addis Ababa University, Addis Ababa Institute of Technology (AAiT)", "Samsung Building first floor, N-135", "Office hours: 8:30 am – 5:30 pm EAT Monday to Friday", "Tel: +251 111 2612 94", "For More Information:", "Visit the Official Webpage of the World Bank/African Railway Center of Excellence Scholarships"], "url : https://www.opportunitiesforafricans.com/world-bank-african-railway-center-of-excellence-arce-msc-and-phd-scholarships-2018-2019/"], [["RNTC Scholarships 2019 for media and communications professionals to study in Netherland (Fully Funded)", "date announced:July 2, 2018", "Application Deadline: 13 JULY 2018"], ["Application Deadline: ", "13 JULY 2018", "The Dutch Ministry of Foreign Affairs provides ", "OKP", " (formerly known as NFP) and MSP scholarships for the ", "RNTC courses for media and communications professionals", " from a variety of partner countries. The scholarships include a contribution towards the cost of living, the course fees, visa, travel and insurance. If applicable, the scholarship holder is expected to cover the difference between actual costs and the OKP or MSP scholarship amount.", "The scholarships are administered by Nuffic, the Netherlands Organisation for International Cooperation in Higher Education. OKP stands for ‘Orange Knowledge Programme’ and these scholarships are available for ", "52 countries", ". MSP stands for ‘MENA (Middle East and North Africa) Scholarship Programme’ and is available for ", "10* countries", ".  Please check below whether you meet the criteria to apply for a OKP or MSP scholarship.", "Application Procedure:", "1.    First apply to RNTC to check that you are eligible for the course you would like to do. You can apply for a course by selecting a course. Make clear in your application to RNTC that you are intending to apply for an ", "OKP ", "or ", "MSP ", "fellowship. The option is included in the RNTC application form (only available for ‘OKP’ and ‘MSP’ courses before the OKP/MSP deadline).", "2.    Once you have submitted your application, RNTC will inform you by email whether you are eligible or not (usually within 10 working days).", "3.    If you are eligible for the course, RNTC will send you a link by email to apply for a OKP or MSP fellowship in ATLAS; the online system for your OKP or MSP scholarship application.", "4.      Then apply for an ", "OKP", " or ", "MSP", " fellowship.", "Please note that your OKP or MSP application has to be completed and submitted in one go! Once you have submitted your application, you will not be able to make changes or additions.", "5.    If you are eligible according to RNTC and you meet the OKP or MSP criteria, you can apply for a scholarship in the Nuffic system which is called ATLAS, using the link mentioned in step 3.", "6.    Note that you can ", "only ", "apply for a scholarship for your chosen course during the application window for that course. There are two of these windows every year.", "7.    Before applying for a OKP or MSP scholarship, make sure you have all the documents mentioned below ready. This is because your application has to be completed and submitted in one go. Please use the formats provided by Nuffic and submit all the required documents EXACTLY as specified. Otherwise, your application will be rejected by Nuffic! The file format should be PDF and your document must not exceed 2 MB.", "Copy of a valid passport. The passport needs to be still valid at least ", "three months ", "after the submission date of the registration form.", "A Letter of motivation. Have this prepared so you can copy/paste it into the online application form. This can be more or less the same motivation as you prepared for your RNTC application. This motivation will weigh heavily in the selection procedure. Make sure you address the following questions:", "​What is the issue or problem you want to address in your country?", "How will this course enable you to address this issue?", "How will you address this issue considering your position within your organisation?", "An Employer’s Statement. This is a very important document, please fill it out EXACTLY as specified by Nuffic and use this ", "format provided by Nuffic", ". PLEASE NOTE THAT THIS DOCUMENT CONSISTS OF TWO PAGES, BOTH HAVE TO BE FILLED IN, SIGNED & STAMPED.", "A Government Statement (if applicable for your country). A number of governments of KOP and MSP countries require a government statement before candidates can apply for a scholarship. In this statement, the government expresses its support for the scholarship application. Please ", "check this overview", " to see if this applies for your country. Also, it’s always good to check this with your government and/or the Netherlands embassy. If a government statement is required for your country, please use ", "this format", " provided by Nuffic for OKP countries and ", "this format", ", if you are from a MSP country.", "8.    If you are certain that you are eligible for an OKP or MSP scholarship and you have collected all the necessary information and documentation, you can start with your application in Nuffic’s ATLAS online application system using the online application form link that was sent to you.", "9.     Also download and read the ", "OKP and MSP registration instructions for ATLAS.", "For More Information:", "Visit the Official Webpage of the RNTC Scholarships 2019 for media and communications professionals"], "url : https://www.opportunitiesforafricans.com/rntc-scholarships-2019/"], [["Mexican Government Scholarship Program 2019 for International Students (Fully Funded Study in Mexico)", "date announced:July 3, 2018", "Application Deadline: September 28th 2018"], ["Application Deadline: September 28th 2018", "On behalf of the", " Ministry of Foreign Affairs, the Mexican Agency for International Development Cooperation (AMEXCID)", " invites foreign citizens who are interested in studying for a specialization, master’s degree or doctorate, conducting graduate or postdoctoral research, or taking part in an undergraduate or graduate-level academic mobility program, to participate in the", " ", "2019 Mexican Government Scholarship Program for International Students.", "The scholarships are offered to more than 180 countries through a series of bilateral conventions, multilateral programs and special agreements. More than 70 Mexican institutions participate and all offer academic programs registered with the ", "National Council for Science and Technology (CONACYT)", " as ", "National Quality Graduate Programs.", " These programs demonstrate the progress made by Mexico in the sciences and humanities.", "By offering Mexican government scholarships for international students, Mexico strengthens its role as an actor with global responsibility and renews its commitment to cooperation programs that help create highly-skilled human capital. The presence in Mexico of international students, academics and scientists helps build permanent bridges of dialogue that enrich the long-term foreign policy agenda through contributions of exceptional value for the country and its partners abroad. In addition, the Mexican institutions and academic community benefit from the increased internationalization.", "Requirements:", "The scholarships for academic studies are offered to take complete programs for Specialization, Master’s or PhD Degrees, and Postgraduate Researches. Likewise, the offer includes academic mobility for Bachelor’s and Postgraduate Degree. On the other hand, the scholarships for special programs are offered Preferred to take short-term fellowships addressed to Visiting Professors, Researchers in Mexico’s issues, Media Contributors, Art Production Fellowships, etc.", "Candidates cannot be living in Mexico at the time of application.", "Except in special cases, scholarships cannot begin in November or December.", "Requests for information and all scholarship applications must be submitted to the Mexican embassy or concurrent embassy of the applicant’s country or to the designated Mexican institution. Only applications that fulfill all of the requirements will be considered.", "All documents and forms must be in Spanish or submitted with translations into Spanish.", "Candidates will be informed of the results by the corresponding Mexican embassy or designated Mexican institution.", "The scholarships are not transferable and cannot be deferred to future years.", "Scholarship Duration:", "Undergraduate and graduate academic mobility programs- one academic term (quarter, trimester or semester)", "Graduate research and postdoctoral fellowships-12 months (1 month minimum)", "Specialization-1 year", "Master’s degree- 2 Years", "Doctorate- 3 years", "Medical specialties and sub specialties- 3 Years", "Scholarship Benefits", "Monthly stipend of 4 (four) times the value of the unit of Measure and Actualization (UMA) for Undergraduate mobility scholarships, Specializations, Master’s degrees or Master’s-level research, Spanish language or Mexican culture courses. During 2018, the stipend was calculated with the minimum salary in Mexico City and was equivalent of $9,604.80 pesos (approximately USD 529.77)", "Monthly stipend of 5 (five) times the value of The Unit of Measure and Actualization (UMA) for Doctoral programs and Research periods, Postdoctoral fellowships and Medical specialities and subspecialties. During 2018, the stipend was calculated with the minimum salary in Mexico City and was equivalent of $12,066.00 Mexican pesos (approximately USD $665.52).", "Monthly stipends are not divisible or partial. The Scholarships will be paid at the end of each month.", "Registration fees and tuition, as established by the program at each institution ,subject to the final decision of the participating HEI, established in the letter of acceptance.", "Health insurance from the Mexican Social Security Institute (IMSS), starting the third month of the scholarship. The Scholarship recipient must have health insurance that covers both major and minor medical expenses and provides international coverage for the first three months in mexico.", "The cost of the temporary resident/student visa issuance, for stays longer than 180 days.", "Depending on the reciprocity with the partner country, it will be included a round-trip international airfare at the beginning and/or satisfactory term of the scholarship. The air ticket will be purchased in economy class and will be considered the most convenient flight route for the Academic Exchange Office.", "Should the recipient of the scholarship is pursuing studies outside Mexico City, transportation from Mexico City to the host institution and back will be provided, at the start and end of his/her academic activities.", "Important Notes: ", "Candidates will be informed of the results by the corresponding Mexican embassy or designated Mexican institution.", "Documentation:", "2019 Mexican Government Scholarships for International Students", "List of Institutions and Academic Programs", " ", "Download Application Form", "For More Information", "Visit the Official Webpage of the Mexican Government Scholarship Program 2019"], "url : https://www.opportunitiesforafricans.com/mexican-government-scholarship-program-2019/"], [["Seplat Joint Venture (JV) National Undergraduate Scholarship 2018/2019 for young Nigerians", "date announced:June 22, 2018", "Seplat Joint Venture has announced the commencement of its Undergraduate Scholarship Programme for the next academic session. The scholarship award is open to deserving undergraduate students of Federal and State Universities in Nigeria. The Seplat JV scholarship Scheme is one of Seplat’s educational Corporate Social Responsibility programmes and it is designed to promote educational development and human capacity building."], ["Seplat Joint Venture", " has announced the commencement of its Undergraduate Scholarship Programme for the next academic session. The scholarship award is open to deserving undergraduate students of Federal and State Universities in Nigeria. The Seplat JV scholarship Scheme is one of Seplat’s educational Corporate Social Responsibility programmes and it is designed to promote educational development and human capacity building.", "Eligibility Criteria:", "Applicants must be in their second year of study or above.", "Applicants must have at least 5 O’ level credit passes (English and Mathematics inclusive) at one sitting.", "Applicants must not hold any other scholarship award", "Only students studying any of the following courses should apply:", "Accountancy", "Agriculture", "Architecture", "Business Administration", "Chemical Engineering", "Civil Engineering", "Computer Engineering", "Computer Science", "Economics", "Electrical / Electronic Engineering", "Geology", "Geophysics", "Medicine", "Law", "Mass Communication", "Mechanical Engineering", "Metallurgical Engineering", "Petroleum Engineering", "How to apply:", "Eligible students must complete and submit an online application form – please click ", "here", ".", "All applicants are expected to have a valid personal email account for ease of communication.", "Only the shortlisted applicants will be contacted.", "Applications are subject to Seplat JV Scholarship Award Terms and Conditions.", "Application for the Seplat 2018/19 National Undergraduate Scholarship Scheme is ongoing.", "For More Information:", "Visit the Official Webpage of the Seplat Joint Venture (JV) National Undergraduate Scholarship 2018/2019"], "url : https://www.opportunitiesforafricans.com/seplat-joint-venture-jv-national-undergraduate-scholarship-2018-2019/"], [["OFID Development Leaders Scholarships 2018 (Fully Funded to the One Young World Summit 2018 in The Hague, Netherlands)", "date announced:June 29, 2018", "Application Deadline: midnight GMT 20 July 2018."], ["Application Deadline: midnight GMT 20 July 2018.", "The OPEC Fund for International Development (OFID)", " is the development finance institution established by the Member States of OPEC in 1976 as a channel of aid to the developing countries. OFID works in cooperation with developing country partners and the international donor community to stimulate economic growth and alleviate poverty in all disadvantaged regions of the world. It does this by providing financing to build essential infrastructure, strengthen social services delivery and promote productivity, competitiveness and trade. OFID’s work is people-centered, focusing on projects that meet basic needs – such as food, energy, clean water and sanitation, healthcare and education – with the aim of encouraging self-reliance and inspiring hope for the future.", "OFID is a long standing supporter of One Young World and has enabled more than 165 young leaders to participate in the One Young World Summit since 2011.", "This year OFID will sponsor 20 young leaders who are active in international development to participate in the One Young World Summit 2018 which takes place in The Hague, Netherlands from 17 – 20 October.", "Requirements:", "In order to apply you must be:", "Aged 18 – 30", "A national of one of the listed eligible countries. ", "Click here", " to view list", ".", "Successful candidates will excel in the following areas:", "Evidenced commitment to the sustainable development of their country. This commitment can come in many forms; ranging from a high level of involvement in community initiatives to social entrepreneurship or from leading responsible business practices to public service.", "Leadership ability", "Concern for local or global issues", "Ability to generate and articulate impactful ideas", "Teamwork", "Benefits:", "Access to the One Young World Summit 2018 in The Hague, Netherlands", "Hotel accommodation on a shared basis between 17 October and 20 October", "Catering which includes breakfast, lunch and dinner.", "Transport between the Summit accommodation and the Summit venue.", "Summit hand-outs and support materials.", "The cost of travel to and from The Hague.", "In addition to attend to attending the Summit, all OFID scholars will be able to apply for a €5,000 grant to support their development work.", "How to apply", "Submit an online application in English before midnight GMT 20 July 2018.", "For More Information:", "Visit the Official Webpage of the OFID Development Leaders Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/ofid-development-leaders-scholarships-2018/"], [["The Chemical Industries Education & Training Authority (CHIETA) Bursary Programme 2018 for South Africans", "date announced:June 22, 2018", "Application Deadline: July 31st 2018"], ["Application Deadline: July 31st 2018", "The Chemical Industries Education & Training Authority (CHIETA)", " is delighted to offer bursary programme to offer financial assistance to young South Africans who qualify to undertake full-time studies at any accredited South African Public Tertiary Institution.", "The Chemical Industries Education & Training Authority (", "CHIETA", ") is a statutory body established by the Skills Development Act (1998). The Chemical SETA was established to facilitate skills development in the chemical industries sector and ensure that skills needs are identified and addressed through a number of initiatives by the SETA and the sector. World-class education and training for the chemical industries sector.", "Eligibility Requirements:", "Entrance Requirements: ", "Applicants must meet the following criteria:", "South African citizen", "Youth between the age of 16 to 35 who do not have any other bursary funding", "Youth between the age of 16 to 35 who do not have any other bursary funding", "Applicants who have recently completed Grade 12/ Matric with Mathematics and Physical Science or", "Applicants who registered with a Tertiary Institution and have passed all their modules of their previous semester or year.", "Such applicants must already be studying an accredited South African Tertiary Institution in one of the mentioned fields of study.", "Application Procedure: ", "How to Apply: ", "All interested party must download the application form or send an e-mail to bursary-at-chieta.org.za.", "Applicants must complete in full the Bursary Application form which is available on the CHIETA website", "Attach a certified ID copy (not older than 3 months)", "Attach a certified copy of final Grade 12 results or recent statement of results", "Certified proof of registration from a Tertiary Institution to be submitted before contract signing if awarded the Bursary.", "Fill Out the Application Form", "For More Information:", "Visit the Official Webpage of the ", "CHIETA", " Bursary Programme 2018"], "url : https://www.opportunitiesforafricans.com/the-chemical-industries-education-training-authority-chieta-bursary-programme-2018-for-south-africans/"], [["The Barclays-F.G. Mogae Scholarship Fund 2018/2019 for Botswana citizens.", "date announced:July 4, 2018", "Application Deadline: July 13th 2018"], ["Application Deadline: July 13th 2018", "The Barclays – F.G. Mogae Scholarship Fund", " ", "was established in 2008 in honour of the former president of Botswana Mr. Festus Mogae.", "Scholarships are available for individuals who wish to pursue a Masters Degree at a recognized institute of higher learning in Botswana. The desired courses of study are: Accounting; Economics; Engineering; Finance; Human Resources; Information Technology; Law; Marketing; Mathematics; and Business Management. Students from other fields of study may be considered at the discretion of the governing committe.", "Eligible Applicants", "Citizens of Botswana- People with disabilities are encouraged to apply.", "Registered for a Masters degree on a full time basis and not on secondment with a company", "Falls within the top 20% of her/his respective class in the final two years of undergraduate studies and should have achieved an overall aggregate pass rate of 75%", "Clean criminal record", "Primary Award Criteria", "Academic Achievements which will include grades and GPA and class rank.", "Financial Need", "Involvement in community and extracurricular activities", "Personal attributes", "Criteria for Barclays Colleagues", "Employees who have completed their probationary period", "A very strong performer", "Award Restrictions", "Non-renewable- This means that one individual can only benefit once", "Other Requirements", "Completed application form- available at all Barclays Branches", "Police Clearance", "Three letters of reference", "Motivation Letter", "Transcripts", "Financial information summary", "Acceptance Letter from an institution of Higher Learning", "Institutions:", "Botswana Accountancy college Barclays-F.G. Mogae Scholarship Fund", "University of Botswana Barclays-F.G. Mogae Scholarship Fund", "For More Information:", "Visit the Official Webpage of the", " Barclays-F.G. Mogae Scholarship Fund", " 2018/2019"], "url : https://www.opportunitiesforafricans.com/the-barclays-f-g-mogae-scholarship-fund-2018-2019/"], [["Allan Gray Orbis Foundation High School Scholarships 2018/2019 for young South Africans", "date announced:June 22, 2018", "Application Deadline: 20 September 2018."], ["Application Deadline: 20 September 2018.", "The Allan Gray Orbis Foundation", " offers", " high school Scholarships", " to learners who are in financial need, have a curious, entrepreneurial mindset and the potential to excel academically.", "Scholarship recipients, known as", " Allan Gray Orbis Scholars,", " receive funding for high school in addition to access to support and programmes to develop their entrepreneurial talents. We aim to develop a community of young, entrepreneurially minded leaders so that our Scholars have the opportunity to go to university through the Fellowship Programme.", "The Scholarship Programme focuses on the cultivation of an entrepreneurial mindset, personal mastery and academic excellence. We believe an entrepreneurial mindset will enable our Scholars to attain academic success and effective personal leadership.", "This Scholarship is offered in three countries, however the models differ in each country.", "South Africa – The Scholarship is available to learners entering high school. Learners in Grade 6 may apply.", "Botswana / Swaziland – This Scholarship is available to Grade 12 learners who need a post-Matric to gain access to a South African University. Please apply through the ", "Fellowship", " page.", "Here is the full list of our partner placement schools:", "Eastern Cape:", "Clarendon High School for Girls", "Selborne College High School", "Collegiate Girls’ High School", "Grey High School", "St Andrew’s College (Grahamstown)", "Diocesan School for Girls", "Gauteng:", "St Alban’s College", "King Edward VII School", "St Andrew’s School for Girls", "St Mary’s School, Waverly", "St Stithians College", "Roedean School (SA)", "Pretoria Boys High School", "KwaZulu-Natal:", "Michaelhouse", "Epworth Independent High School", "Pietermaritzburg Girls’ High School", "Maritzburg College", "Western Cape:", "Bishops Diocesan College", "St Cyprian’s High School", "Rustenburg Girls’ High School", "Rondebosch Boys’ High School", "Rhenish Girls’ High School", "Scholarship Benefits:", "The Scholarship programme provides access to quality high school education. We aim to establish passion in the selected Scholars and develop their potential to become self-starting, high-impact entrepreneurs.", "The Scholarship covers the following:", "Full tuition and boarding fees", "A monthly allowance (pocket money)", "A travel subsidy", "Stationery and prescribed books", "Toiletries, school uniforms and casual clothing", "Support for extra-mural activities", "The Criteria", "For South Africa:", "Applicant has to be a South African citizen", "Applicant must be in Grade 6 this year (2018) to apply", "A minimum of 70% in English and mathematics (Grade 5-6)", "A minimum of 70% in Numeracy and Literacy in the Foundation’s Scholarship exam. (After the application process, we select eligible candidates and invite them to write the Scholarship exam. We then use the exam results with the primary school results to shortlist for interviews.)", "Demonstrate financial need", "Demonstrate the following entrepreneurial characteristics:\n", "Intellectual Imagination", ": enjoys being creative and innovative", "Achievement Excellence", ": sets high standards for self", "Courageous Commitment", ": must be courageous and determined, brave and persistent", "Spirit of Significance", ": wants to impact others and make a difference", "Personal Initiative", ": prepared to take action to address challenges", "The Process", "Complete and submit your application forms and all supporting documentation by 20 September 2018.", "All applicants will receive an SMS to acknowledge receipt of their application within a month after the closing date.", "Applicants will be shortlisted based on academic performance and financial need.", "Successful candidates will be called within two months after the closing date and invited to write an exam. Unsuccessful applicants will be notified via sms.", "Succesful candidates will be invited for interviews. One-on-one interviews take place between January and March 2019", "Thereafter, successful candidates will be invited to for psychometric testing", "If successful at the psychometric phase, the Foundation will recommend the candidates to the placement schools.", "Recommended candidates will be invited to the placement schools for interviews.", "Candidates whose recommendations are approved by the placement schools will be awarded the Scholarship.", "Once the Scholarship is awarded, the Foundation, placement school and the Scholar’s custodian sign a Memorandum of Agreement.", "All successful candidates will know which school they will be attending the following year by August 2019.", "For More Information:", "Visit the Official Webpage of the Allan Gray Orbis Foundation high school Scholarships"], "url : https://www.opportunitiesforafricans.com/allan-gray-orbis-foundation-high-school-scholarships-2018-2019-for-young-south-africans/"], [["University of Cape Town MasterCard Foundation Scholars Program 2019 for study in South Africa (Fully Funded)", "date announced:June 16, 2018", "Application Deadline: August 31st 2018"], ["Application Deadline: August 31st 2018", "The ", "Mastercard Foundation Scholars Program at the University of Cape Town (UCT)", "The ", "Mastercard Foundation", " has partnered with the ", "University of Cape Town (UCT)", " to provide 338 scholarships over 10 years to academically talented yet economically disadvantaged students from Sub-Saharan Africa for study at UCT.", "The Scholars Program is a $700 million initiative to educate young people – particularly from Africa – to lead change and make a positive social impact in their communities. Scholars will receive comprehensive scholarships, academic support, peer mentorship, career guidance, internship opportunities, transition-to-work support and access to a global alumni network.", "Over the 10-year period (2014 – 2024), sixty students will be awarded scholarships to complete an undergraduate qualification and 240 students will be awarded support to obtain qualifications at Honours (as of 2016) and Masters level. In order to be considered for the scholarship, applicants must meet all the eligibility criteria, including the admission criteria for their chosen course of study at UCT.", "Eligibility Requirements:", "In order to be considered for the MasterCard Foundation Scholars Program at the University of Cape Town, applicants must be:", "Academically talented", ", must value learning and be driven to complete their education.", "Economically disadvantaged", " and facing significant financial barriers to accessing education.", "Committed to ", "giving back to their own communities", " once studies are completed, to return to their home countries and take a leadership role in promoting social and economic improvement.", "Future leaders committed to embracing ", "ethical leadership", " to improve the lives of others.", "Commitment to ", "community service", " through previous and/or past engagements with community outreach activities", "Citizens and residents of a ", "Sub-Saharan African", " country.", "Wanting to study at ", "undergraduate or postgraduate level", " (Masters by research and coursework or research Masters, only). Honours applicants will be considered from 2016.", "Applying to study in the ", "fields", " of Commerce, Engineering and Built Environment, Health Sciences, Humanities, Law or Sciences at the University of Cape Town.", "All prospective Scholars must first be ", "admitted to the University of Cape Town", " to be considered for the Scholarship. Although each academic department has its own criteria, a minimum of 60% for the Honours, or equivalent degree is the overall academic criterion required for entry into the Masters’ degree.", "Preference will be given to ", "‘first-generation’", " students, i.e. those who are the first ones in their families to go to university.", "Benefits:", "The scholarship’s tenure is for the full period of the academic program for which the Undergraduate Scholar has enrolled, with the second and subsequent years dependent on satisfactory academic progress and co-curricular involvement.", "Tenure for the Honours level scholarships is one year. For Masters level the scholarships tenure is two years, dependent on academic progress and co-curricular participation of the Scholar.", "Application", "Applicants must have applied to and been accepted for a course of study at UCT before they apply for the Scholars Program. If you fulfil the eligibility requirements please follow the process below to apply:", "Review the study options and admissions requirements at UCT and decide which faculty and degree programme you wish to apply to.", "Obtain proof of English language proficiency (see How to Apply for further instructions).", "Write the National Benchmark Tests (for applicants from South Africa, or if you are an applicant from any country and intent to the Faculty of Health Sciences).", "Collate the necessary documentation to support your application, including evaluation of any previous university level qualification by the South African Qualifications Authority, additional portfolio requirements for degrees in Fine Art or Architecture, and matriculation exemption documentation.", "Apply online", " to UCT.", "Apply online for ", "[email protected]", " for assistance.", "For More Information:", "Visit the Official Webpage of the University of Cape Town MasterCard Foundation Scholars Program 2019"], "url : https://www.opportunitiesforafricans.com/university-of-cape-town-mastercard-foundation-scholars-program-2019/"], [["NIIT NIGERIA 19th NATIONAL IT SCHOLARSHIP 2018 for Young Nigerians.", "date announced:June 8, 2018", "Scholarship test date 14th July, 2018\nLast date to fill form 13th July, 2018"], ["Scholarship test date 14th July, 2018", "\nLast date to fill form 13th July, 2018", "The 19th NIIT NIGERIA NATIONAL SCHOLARSHIP", " is being announced to provide Scholarship assistance to deserving and meritorious students across various disciplines – School Leavers, Under Graduates, Graduates [Unemployed, Under-Employed], Individuals desirous of enhancing their technical skill-sets and students in general who aspire to know about I.T. and career in I.T. The offer is to enable them realize their dream of a successful career in the field of Information Technology and related Industries.", "For the first time NIIT is launching latest in-demand Digital Transformation Programs like DIGINXT-MMS Software Engineering: Full Stack Developer (Python, REST, Angular JS, REACT), Data Analytics (Machine Learning using R & Python, Artificial Intelligence, Business Intelligence), Digital Marketing (SEO, SEM, Mobile & Email Marketing, ORM), Big Data, Java Enterprise Apps with Dev Ops, in Nigeria, to cater to the changing future-skill-sets requirement of the industry and help create Job-ready talent pool for the fast evolving global economy.", "NIIT, a global leader in skills & talent development, established its presence in Nigeria by setting up an education centre in Ikeja, Lagos in 1999 and since then affirmed its support to prepare the youth in the country for lucrative IT careers. The scholarship has reached out to nearly 1.9 million students in the past 19 years. Since 1999 NIIT has been involved in creation of skilled ICT workforce and has launched several initiatives in the country.", "Latest in-demand Digital Transformation Technology Programs for Graduates and Undergraduates", "digiNXT- MMS (Software Engineering): Full Stack Developer", "Intensive 1- 2 ½ year program aimed at creating Full Stack Developers. Builds specific skillset in Python, REST, Angular JS, REACT and DevOps", "Data Analytics", "Data Analytics course is designed to make one proficient in Data Analytics tools and techniques starting from the fundamentals of statistics going onto advanced use of tools like R and Python Artificial Intelligence, Business Intelligence.", "digiNxt- Digital Marketing", "Professional Diploma in Digital Transformation – Digital Marketing helps learners to understand how to plan, implement and manage a comprehensive digital marketing strategy in SEO, SEM, Mobile and Email Marketing, ORM.", "digiNxt- Big Data", "Big Data", " is high volume, high velocity information to process to enable enhanced decision making. It consist of Hadoop, Zookeeper, Hbase, Hive, Storm Distributed Live Computing and Sqoop.", "digiNxt- Java Enterprise Apps with DevOps", "Producing software for multiple platforms using JAVA , With DevOps model, you are bringing together your development team and your operations team, and their work is no longer in silos", "For More Information:", "Visit the Official Webpage of the NIIT NIGERIA 19th NATIONAL IT SCHOLARSHIP 2018"], "url : https://www.opportunitiesforafricans.com/niit-nigeria-19th-national-it-scholarship-2018-for-young-nigerians/"], [["Carole Stone Foundation One Young World Scholarship 2018 (Fully Funded to attend the One Young World Summit 2018 in The Hague, Netherlands)", "date announced:June 25, 2018", "Application Deadline: 18 July 2018"], ["Application Deadline: ", "18 July 2018", "One Young World Counsellor, Carole Stone CBE,", " will again sponsor a young leader to participate in the One Young World Summit – this year in The Hague. Carole believes that connecting people, exchanging ideas and building friendships around the world is essential to help make a fairer society. If you would like to apply for the ", "Carole Stone Foundation One Young World Scholarship", " let us know what issue you want to focus on and why?", "Requirements:", "In order to apply you must be:", "Aged 18 – 30", "Successful candidates will excel in the following areas:", "Proven leadership ability", "Evidenced creating a fairer society", "Benefits:", "Scholars will receive:", "Access to the One Young World Summit 2018 in The Hague, Netherlands", "Hotel accommodation on a shared basis (inclusive) October 17-20, 2018", "The cost of travel to and from The Hague (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "For More Information:", "Visit the Official Webpage of the Carole Stone Foundation One Young World Scholarship 2018", " "], "url : https://www.opportunitiesforafricans.com/carole-stone-foundation-one-young-world-scholarship-2018/"], [["London School of Hygiene & Tropical Medicine (LSHTM) Commonwealth Distance Learning Scholarships 2018/2019", "date announced:June 14, 2018", "Application Deadline: 23.59 (BST) on 20 June 2018"], ["Application Deadline: ", "23.59 (BST) ", "on ", "20 June 2018", "The London School of Hygiene & Tropical Medicine", " ", "is delighted to offer ", "10 new scholarships", " to study a master’s degree by distance learning.", "Funded by the ", "UK Department for International Development (DFID),", " C", "ommonwealth Distance Learning Scholarships", " enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those unable to study in the UK for financial and other reasons.", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an eligible Commonwealth country, or be a British Protected Person", "Be permanently resident in an eligible Commonwealth country", "Hold a first degree of at least upper second class (2:1) standard; a lower qualification and sufficient relevant experience may be considered in certain cases", "Be unable to afford to study your chosen course without this scholarship", "Hold an offer of admission to one of the eligible programmes before the deadline of 20 June 2018.", "Eligible programmes", "MSc Clinical Trials (distance learning)", "MSc Demography & Health (distance learning)", "MSc Epidemiology (distance learning)", "MSc Infectious Diseases (distance learning)", "Eligible Commonwealth countries", "Bangladesh", "\nCameroon", "\nThe Gambia", "\nGhana", "\nGuyana", "\nIndia", "\nKenya", "\nKiribat", "\nLesotho", "Lesotho", "\nMalawi", "\nMozambique", "\nNigeria", "\nPakistan", "\nPapua New Guinea", "\nRwanda", "\nSamoa", "\nSierra Leone", "Solomon Islands", "\nSri Lanka", "\nSwaziland", "\nTanzania", "\nTuvalu", "\nUganda", "\nVanuatu", "\nZambia", "How to apply", "To apply for this funding, applicants must:", "1)", " Submit a complete application for study for one of the eligible programmes for 2018-19 (", "MSc Clinical Trials, ", "MSc Demography & Health", ", ", "MSc Epidemiology, ", "MSc Infectious Diseases)", "and", "2)", " Submit a complete application to the Commonwealth Scholarship Commission using the ", "CSC’s application system (click here)", "Deadline: ", "all applications must be submitted by ", "23.59 (BST) ", "on ", "20 June 2018 ", "at the latest.", "Please note that to be eligible, applicants must hold an offer of admission to one of the eligible programme.", "For More Information:", "Visit the Official Webpage of the LSHTM Commonwealth Distance Learning Scholarships"], "url : https://www.opportunitiesforafricans.com/london-school-of-hygiene-tropical-medicine-lshtm-commonwealth-distance-learning-scholarships/"], [["Academic Mobility for African Sustainable Development (AMAS) Masters & PhD Scholarships 2018/2019 for young Africans", "date announced:June 25, 2018", "Application Deadline: July 11th 2018"], ["Application Deadline: July 11th 2018", "The Intra-Africa Academic Mobility Scheme", " supports higher education cooperation between countries in Africa. The scheme aims to promote sustainable development and ultimately contribute to poverty reduction by increasing the availability of trained and qualified high-level professional manpower in Africa. The programme’s objective is to improve the skills and competencies of students and staff through enhanced mobility between African countries.", "Strengthening cooperation between Higher Education Institutions (HEIs) in Africa will increase", "access to quality education and will encourage and enable African students to undertake postgraduate studies in the African continent. Furthermore, mobility of staff (academic and administrative) will enhance the international cooperation capacity of HEIs in Africa. More precisely,the Intra-Africa Academic Mobility Scheme aims to:", "Contribute to the improvement of the quality of higher education through the promotion of internationalisation and harmonisation of programmes and curricula within participating institutions.", "Enable students, academics and staff to benefit linguistically, culturally and professionally from the experience gained in the context of mobility to another African country.", "Participating African Universities", "1. Moi University (MU), Kenya", "2. Université Mohammed V de Rabat (UM5R), Morocco", "3. Addis Ababa University (AAU), Ethiopia", "4. Université d’Abomey-Calavi (UAC), Benin", "5. Universidade Eduardo Mondlane (UEM), Mozambique", "Technical Partner University", "Universität Bayreuth (UBT), German", "Master and Doctoral Mobility Flow", "Cohort 2- Mobility starts between September 2018 and March 2019, as found suitable for each university", "Eligibility Requirements:", "Target I- Master and PhD student registered in one of the 5 African Partner Universities (PU), OR;", "Target II- Master and PhD student registered in any recognizable university, outside the 5 Partner Universities", "Master Students-undertake a minimum of 6months studies (credit seeking) or 24 months (degree seeking) in any of the 4 Partner Universities outside their home university", "PhD Students- undertake a minimum of 6 months and a maximum of 48 months studies. Apply for any duration within the 6– 48 months mostly to seek credits and engage in research, but not apply for a full PhD engagement in any of the 4 Partner Universities outside their home/registered university", "For both Master and PhD, willingness to study the prescribed CFS and SBP Courses listed on Doc T1- Table of Mobility Courses offered at the recipient Partner University", "Both females and males are given equal eligibility statusesApplicants from disadvantaged backgrounds and populations are encouraged to apply", "Benefits:", "Sponsorship!", "Master Students- maximum of 25,000 € to cover subsistence, insurance, travel, visa, tuition/participation and research cost", "PhD Candidates-maximum of 71,700 € to cover subsistence, insurance, travel, visa, tuition/participation and research costs", "Application Deadline:", "Competence in language of course delivery at recipient (Partner) University.", "Both Master and Doctorate applicants should submit;", "i. Certified academic certificates and transcripts", "ii. Certified proof of registration/admission at a University in Africa (see Target I and II above)", "iii. Proof of nationality", "iv. Completed application form Doc AF1-Application Form", "v.Letter of reference from two academic referees", "vi. Two passport size photographs", "The complete application dossier should be submitted as indicated on Doc ADP1-", "Application Details & Procedures", "Applications are called on Monday 11th June 2018 and closed on Wednesday 25th July 2018 at midnight (45 days)", "Both successful and unsuccessful applicants will be notified in August 2018", "For More Information:", "Visit the Official Webpage of the AMAS Masters & PhD Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/academic-mobility-for-african-sustainable-development-amas-masters-phd-scholarships-2018-2019-for-young-africans/"], [["SAAO Prize Scholarship 2019 for South African PhD students (R180,000 per year (plus support for tuition, equipment and travel).", "date announced:July 2, 2018", "Application Deadline: 3rd August 2018"], ["Application Deadline: 3rd August 2018", "Degree Funded: 3-year PhD", "\nFunding Amount: R180,000 per year (plus support for tuition, equipment and travel).", "\nStart of Funding: 2019", "The SAAO Prize Scholarship", " is a prestigious annually awarded scholarship offered to a top ", "South African student", " to work on a PhD project supervised by researchers at the SAAO. The scholarship is for a 3-year PhD registered at a South African university and the student will be required to spend a minimum of 60% of their time at the SAAO. The scholarship will cover tuition and a generous stipend for living expenses. Additional support for conference travel and equipment will be provided.  .", "Projects Offered:", "Probing galaxy evolution through diffuse light in dense environments", "\nSupervisors: Ros Skelton (", "[email protected]", ") and Sarah Blyth (UCT)/Ilani Loubser (NWU) : ", "Project details", "Observational studies of Centaurs, interesting and transitional minor planets", "\nSupervisor: Amanda Sickafoose (", "[email protected]", ") : ", "Project details", "Discovery and Characterization of Near-Earth Asteroids", "\nSupervisors: Amanda Sickafoose (", "[email protected]", ") and Nicolas Erasmus (", "[email protected]", ") : ", "Project details", "Optical and radio transient sources", "\nSupervisors: Retha Pretorius (", "[email protected]", "), David Buckley (", "[email protected]", "), and Alida Odendaal (UFS; ", "[email protected]", ") : ", "Project details", "Eligibility:", "The scholarship is currently open to South African citizens who hold, or are studying towards, an MSc degree in physics, astrophysics, or a closely related area (ideally with some astronomy background), and must be ready to register for a PhD at the start of the 2019 academic year.", "Application Procedure:", "The applicant should send their CV, a letter of motivation and academic transcript to ", "[email protected]", ", and arrange for 2 letters of reference to be sent directly to ", "[email protected]", " by the closing date.", "The selection criteria will be academic merit, motivation, aptitude for research, transformation considerations, and results of the interview", "For More Information:", "Visit the Official Webpage of the SAAO Prize Scholarship 2019 "], "url : https://www.opportunitiesforafricans.com/saao-prize-scholarship-2019-for-south-african-phd-students/"], [["Stanford Africa MBA Fellowship Program 2018/2019 for Africans to study at Stanford University, USA (Fully Funded)", "date announced:June 18, 2018", "Application Deadline: 13 December 2018"], ["Application Deadline: 13 December 2018", "The Stanford Africa MBA Fellowship Program", " pays for tuition and associated fees (approximately US $170,000) for citizens of African countries with financial need who wish to obtain an MBA at Stanford GSB. Stanford will award up to six Stanford Africa MBA Fellowships annually. For those who are applying and make less than US$20,000, the Stanford Graduate School of Business Admissions will waive your application fee.", "Within two years of graduation from ", "Stanford GSB, Stanford Africa MBA Fellows", " are required to return to Africa to work for at least two years in a professional role that contributes positively to the continent’s development; thus fellows must live and work in Africa for at least two years by the time they are four years out of the Stanford MBA Program.", "Fellowship Eligibility", "You must demonstrate strong ties to Africa, including the following:", "You must be a citizen of an African country. Dual citizens are eligible for the fellowship as long as you hold citizenship in an African nation. Residents of an African country who do not have citizenship in an African country are ineligible.", "You must have completed, or be in the final year of completing, your university studies. If you studied at an undergraduate or graduate institution in Africa, we especially encourage you to consider applying for the Stanford Africa MBA Fellowship Program. African citizens who studied in countries outside of Africa are also eligible for the fellowship.", "Application Process", "To be considered for the Stanford Africa MBA Fellowship, you must apply to the Stanford MBA Program in either Round 1 or Round 2. We cannot consider you for the fellowship in Round 3. If you have already been admitted to the GSB and have deferred enrollment, you must apply to the Stanford Africa MBA Fellowship the year prior to your enrollment. Learn more about fellowships and ", "deferred enrollment", ".", "In the MBA application, you will indicate that you are applying for the Stanford Africa MBA Fellowship; doing so will trigger a prompt for an additional essay (listed below). You must submit the essay with your complete MBA Program application by the appropriate application deadline. Suggested essay length is 250 words. Follow the formatting requirements as outlined in the ", "Essay Instructions", ".", "Essay Topic", "Tell us about your strong ties and commitment to Africa, including how you plan to make an impact (250 words).", "Evaluation Criteria", "Commitment to developing Africa: In addition to being citizen of an African nation (including dual citizens), you must show commitment to developing Africa. This includes returning to work in Africa within two years of graduation, for a period of at least two years.", "Demonstrated financial need is preferred, as assessed through the Stanford GSB financial aid process.", "Merit, determined by the three criteria used to consider candidates: intellectual vitality, demonstrated leadership potential, and personal qualities and contributions that will add to the class.", "Important Dates", "Round 1 (18 Sept 2018) or Round 2 (10 Jan 2019)", "Stanford Africa Fellowship Program finalists prepare and submit Stanford MBA application (which includes a separate essay for the Stanford Africa Fellowship)", "Round 1 (13 Dec 2018) or Round 2 (28 March 2019)", "Stanford releases admission decisions, including those for Stanford Africa Fellows", "September 2019", "Stanford Africa Fellows matriculate in Stanford MBA Program", "For More Information:", "Visit the Official Webpage of the ", "Stanford Africa MBA Fellowship Program", " "], "url : https://www.opportunitiesforafricans.com/stanford-africa-mba-fellowship-program-2018-2019/"], [["David Oyedepo Foundation scholarship program 2018 for Undergraduate African Students", "date announced:June 11, 2018", "Application Deadline: July 15th 2018"], ["Application Deadline: July 15th 2018", "The David Oyedepo Foundation scholarship program", " ", "is our major platform for promoting our vision and goals. The scholarship program awards scholarships to qualified individuals who are indigenes and residents of African countries, and have been offered admission to specific universities in Nigeria.", "The DOF scholars program grants individuals the opportunity to acquire a first degree at top schools in the African continent. It grants individuals the opportunity to build up the leadership potentials that are so evidently lacking in the leaders of our today’s society, through the yearly programs and community development initiatives.", "Application Categories", "New Student Application", "This category is for applicants who have just been granted admission into an institution.", "Returning Student Application", "This category is for applicants who are already admitted into an institution and have academic record.", "ELIGIBILITY REQUIREMENTS", "\nThe David Oyedepo Foundation Scholarship program is open to Young Africans who meet the following criteria:", "Are citizens and permanent residents of any African Nation", "Are between the ages of 18 and 25 at the time of application submission", "Are eligible to receive a Nigerian student visa", "Are proficient in reading, writing and speaking English", "Have a record of exceptional performance at the secondary school level which is benchmarked by:", "\n1. At least 20 points above JAMB cut off points (for Nigerians only)", "\n2. 80% recorded average or 4.0GPA/5.0 in Secondary/High School Transcript", "\n3. Already have begun admission applications to Covenant or Landmark University", "Benefits:", "FINANCIAL PROVISIONS OF THE SCHOLARSHIP", "Full Academic fees for a maximum of 5 years. (In accordance to the University stipulated time for duration of chosen course).", "\nThe scholarship does not cover;", "Travel allowances", "Feeding allowances", "Medical/Health Insurance or allowance", "Any other fees outside University generated Academic fees for a course at any level.", "SELECTION PROCESS AND CRITERIA", "\nThe David Oyedepo Foundation Scholarship Program selection process is a need dependent, merit based open competition. After the deadline, all eligible applications will be reviewed by a selection panel. Following this review, chosen finalists will be interviewed by the David Oyedepo Foundation team, through an online video conferencing platform. If advanced to the final round, applicant must provide;", "Proof of application to Covenant or Landmark University", "Proof of citizenship", "All original copies of documents uploaded during application.", "Selection panels will use the following criteria to evaluate applications (not in order of importance):", "A proven record of superior scholastic ability", "Displayed financial need", "Outstanding character", "A proven record of leadership and community involvement", "A commitment to influence home community with skills learned", "For More Information:", "Visit the Official Webpage of the David Oyedepo Foundation scholarship program 2018"], "url : https://www.opportunitiesforafricans.com/david-oyedepo-foundation-scholarship-program-2018/"], [["World Nomads Travel Film Scholarship 2018 for aspiring travel filmmakers (Win a 12-day Travel Filmmaking Trip to Tanzania)", "date announced:June 12, 2018", "Application Deadline: July 10th 2018 at 11:59 PM (EDT)"], ["Application Deadline: July 10th 2018 at 11:59 PM (EDT)", "This year, ", "World Nomads", " ", "want to send one passionate individual to capture the diverse people, places and wildlife that make Tanzania an adventure hot-spot. You could be filming in the shadows of Mt. Kilimanjaro and exploring the landscape with the locals to tell the stories of community, sustainability and tourism in this unique part of the world.", "Requirements:", "You need to be over 18 at the time of the application deadline (before July 10, 2018)", "Benefits:", "Free Flights", "Receive round-trip airfare from your closest international airport to Tanzania.", " ", "Professional Mentorship", "Improve your skills on the field and during post-production under the mentorship of professional filmmaker Brian Rapsey.", " ", "12-day Trip", "Capture the wildlife and communities of the Serengeti with help from adventure experts, OneSeed Expeditions.", " ", "Audio Gear", "Record superior sound for your film with new microphones courtesy of RØDE Microphones.", " ", "Camera Bags", "Protect your gear with style with specialised camera bags and accessories from Langly.", " ", "Travel Insurance", "As always, travel insurance for the trip provided by World Nomads.", "How to Apply:", "Make a 3-minute documentary", "Our challenge to you is to go out and interview an amazing adventurer or inspiring traveler and bring to life their compelling travel story around one of the following themes:", "‘Courage’", "‘Kindness’", "‘Acceptance’", "Upload your film to YouTube or Vimeo", "Please make sure your video is publicly accessible.", "Complete the application form", "In 1500 characters or less, tell us why you should be the scholarship recipient and what winning this opportunity would mean to you. Your answer will hold considerable weight in the judging process.", "Strictly one application per person. The application must be submitted in English or with English subtitles.", "For More Information:", "Visit the Official Webpage of the World Nomads Travel Film Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/world-nomads-travel-film-scholarship-2018-for-aspiring-travel-filmmakers/"], [["Miles Morland Foundation 2018 Morland Writing Scholarships for African writers (£100,000 in Scholarships)", "date announced:July 2, 2018", "Application Deadline: 30th September 2018"], ["Application Deadline: 30th September 2018", "The Miles Morland Foundation is pleased to announce that the ", "2018 Morland Writing Scholarships for African writers.", "It can be difficult for writers, before they become established, to write while simultaneously earning a living. To help meet this need the MMF awards annually a small number of Morland Writing Scholarships, with the aim being  to allow each Scholar the time to produce the first draft of a completed book. The Scholarships are open to anyone writing in the English language who was born in Africa or both of whose parents were born in Africa.", "​", "The purpose of the Scholarships is to promote literature and good writing. Submissions, including non-fiction submissions, will be judged solely on literary merit. Before you submit an entry ask yourself, or ask an objective friend, “does my entry show literary merit?” If the answer is “no” please do not make a submission.", "Requirements:", "2,000 – 5,000 words. Please note it should be a single submission from one piece of published work. Please do not send two or more submissions.", "A scan of the information page of your passport or another official document evidencing your place of birth.", "You will be expected to submit a proposal of up to 1,000 words of the work you intend to write during your scholarship year. The judges give close scrutiny to these proposals.", "Format:", "Excerpts from your previously published work must be sent as a complete Word document. Anything sent not in Word, will not be accepted. If you want to accompany the Word document with a scan of your book or the magazine in which you were published to establish the published status of your work that can be helpful.", "Winners Announcement:", "The shortlist will be published in November and the winners announced in December 2018. At that time we will send an email to unsuccessful candidates, thanking them for their submission and informing them of the judges’ decision.", "Shortlisted candidates will be contacted in November and asked to supply us with further information regarding their personal circumstances as well as their writing plans.", "Submission:", "They should be sent by e-mail to ", "[email protected]", " Please do not submit anything in hard copy or by terrestrial post.", "For More Information:", "Visit the Official Webpage of the Miles Morland Foundation 2018 Morland Writing Scholarship"], "url : https://www.opportunitiesforafricans.com/miles-morland-foundation-2018-morland-writing-scholarships-for-african-writers/"], [["The Vanier Canada Graduate Scholarship (Vanier CGS) program 2018/2019 for doctoral study in Canada ($50,000 per year)", "date announced:June 22, 2018", "Application Deadline: October 31st 2018"], ["Application Deadline: October 31st 2018", "The Vanier Canada Graduate Scholarship (Vanier CGS) program", " helps ", "Canadian institutions", " attract highly qualified doctoral students.", "Valued at $50,000 per year for three years during doctoral studies", "Eligibility", "Citizenship:", "Canadian citizens", "Permanent residents of Canada", "Foreign citizens", "Areas of research:", "Health research", "Natural sciences and/or engineering research", "Social sciences and humanities research", "Duration", "3 years (non-renewable)", "Scholarships are distributed equally between the three federal granting agencies:", "Canadian Institutes of Health Research (CIHR)", "Natural Sciences and Engineering Research Council (NSERC)", "Social Sciences and Humanities Research Council (SSHRC)", "Citizenship", "Canadian citizens, permanent residents of Canada ", "and", " foreign citizens are eligible to be nominated for a Vanier CGS.", "To be considered for a Vanier CGS, you must: ", "be nominated by ", "only one", " Canadian institution, which must have received a ", "Vanier CGS quota", ";", "be pursuing your first doctoral degree (including joint undergraduate/graduate research program such as: MD/PhD, DVM/PhD, JD/PhD – if it has a demonstrated and significant research component). Note that only the PhD portion of a combined degree is eligible for funding;", "intend to pursue, in the summer semester or the academic year following the announcement of results, full-time doctoral (or a joint graduate program such as: MD/PhD, DVM/PhD, JD/PhD) studies and research at the nominating institution; Note that only the PhD portion of a combined degree is eligible for funding;", "not have completed more than 20 months of doctoral studies as of May 1, 2019 (see ", "calculating months of doctoral studies", " below);", "have achieved a first-class average, as determined by your institution, in each of the last two years of full-time study or equivalent. Candidates are encouraged to contact the institution for its definition of a first-class average; and", "must not hold, or have held, a doctoral-level scholarship or fellowship from ", "CIHR", ", ", "NSERC", " or ", "SSHRC", " to undertake or complete a doctoral degree.", "Eligibility of Degree Programs", "Doctoral awards are tenable only in degree programs that have a significant research component. The research component must be a requirement for completion of the program, and is considered to be significant original, autonomous research that leads to the completion of a dissertation, major scholarly publication, performance, recital and/or exhibit that is merit reviewed at the institutional level. Clinically-oriented programs of study, including clinical psychology, are also eligible programs if they have a significant research component, as described above.", "Note:", " ResearchNet will only allow the creation of one application per applicant. Applicants should only seek a nomination from the institution at which they want to study and are advised to discuss their decision with the nominating institution ", "before", " they submit the application through ResearchNet.", "Deadlines", "There are ", "two deadlines", " pertaining to the 2018-2019 competition:", "Institution internal deadline:", " Following the student’s identification in ResearchNet of the institution proposed for doctoral study (see Task 10), ", "an additional deadline date and time will appear at the top of each page.", " This is the deadline by which your application must be submitted to the institution through ResearchNet. This deadline is set and controlled by each institution. You will not be able to submit your application past this precise date and time.", "Program deadline: ", "Institutions must forward their selected nominations to the Vanier CGS program by ", " October 31, 2018 (20:00 Eastern Time).", "For More Information:", "Visit the Official Webpage of the Vanier Canada Graduate Scholarship program 2018/2019"], "url : https://www.opportunitiesforafricans.com/the-vanier-canada-graduate-scholarship-vanier-cgs-program-2018-2019-for-doctoral-study-in-canada/"], [["CERAAS/DAAD In-Country/In-Region PhD and Master Scholarships 2018/2019 for study in Senegal (Funded)", "date announced:June 28, 2018", "Application Deadline: 30th July 2018"], ["Application Deadline: 30th July 2018", "The DAAD (German Academic Exchange Service)", ", as a publicly funded, self-governing organisation of the institutions of higher education in Germany, promotes international academic exchange as well as educational co-operation with developing countries through a variety of funding and scholarship programmes.", "As part of the „In-Country/In-Region Scholarship Progamme“ DAAD offers scholarships for PhD and Master studies. The programme is funded by the ", "German Federal Ministry of Economic Cooperation and Development (BMZ)", " and aims at university staff in the first line, without neglecting the public sector demand of academically trained personnel.", "The target group for scholarships are graduates and postgraduates from Sub-Saharan Africa with a first academic degree if applying for a master’s programme, or with a Master’s degree if applying for a doctoral programme who want to pursue Master’s or PhD courses in their home country (so called In-Country scholarships) or in another Sub-Saharan African country (In-Region scholarships).", "It has been agreed upon that DAAD cooperates with", " Centre d’Etude Régional pour l’Amélioration de l’Adaptation à la Sécheresse (CERAAS)", " by offering up to 2 In-Region and In-Country scholarships for PhD and up to 3 In-Region and 1 In-Country scholarships for Master studies at CERAAS for the intake 2018.", "Requirements:", "Applicants", "• have successfully completed generally a three-year university degree (Master candidates) or a two-year university degree (doctoral candidates) with above average results ( second class upper division)", "• clearly show motivation and strong commitment", "• have thorough knowledge of the language of instruction", "• have completed their last university degree not more than 6 years ago at the time of application", "• must be nationals or permanent residents of a Sub-Saharan African country", "• should generally be a) staff member of a public or private university, b) candidate considered for teaching or research staff recruitment, c) from the public sector or d) DAFI-Alumni (Albert Einstein German Academic Refugee Initiative)", "Female applicants and candidates from less privileged regions or groups are especially encouraged to participate in the programme.", "Eligible Fields", "The In-Country/ In-Region Scholarship Programme Scholarships", " supports studies in subject areas with strong relevance to national development. The scholarships at CERAAS are available in the following fields:", "• Physiology", "• Genetics", "• Genomics", "• Agronomy", "• Plant Breeding", "• Plant Health", "• Agroforestry", "Duration and Commencement", "The duration", "• of the PhD programme is up to three years", "• of the Master programme is up to two years starting in December 2018.", "Scholarship Benefits:", "Additional Benefits:", "The short-term research scholarship includes:", "• a monthly scholarship payment for living costs which amounts to 1.000 € per month", "• health/accident/personal liability insurance", "• a flat-rate travel allowance", "Application and Selection Procedure", "First step: Applicants must apply for their studies at CERAAS using the contacts and the method that is prescribed by the institution. CERAAS has set their own deadlines. CERAAS will screen, pre-select (according to DAAD selection criteria) and short-list the applicants.", "A detailed report consisting of the shortlisting procedure, the entire list of applicants, the ranked shortlist and the shortlisting panel members will also be availed to DAAD. The ranked shortlist will contain at least double or triple (optional) the number of scholarships that have been attributed to the institution.", "DAAD reserves the right of final selection.", "Second step: Pre-selected candidates are asked to log into the DAAD portal and register", "themselves and submit an DAAD application. The institution is requested to communicate the following information to the shortlisted candidates:", "1. Register online via the DAAD-Portal (if not already registered): https://portal.daad.de", "2. Apply online via the DAAD-Portal under the tab “Personal Funding“/ “Application“ Documents to be submitted:", "DAAD application form duly filled (available in the DAAD-Portal)", "Hand signed curriculum vitae (please use the European specimen form at http://europass.cedefop. Europa.eu), including a list of publications (if applicable).", "Recommendation letter by university lecturers (Master 1, PhD 2)", "Contact:", "Eva Rothenpieler", "Programme Officer, Section ST32 Africa", "DAAD Bonn", "\nE-Mail: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the CERAAS/DAAD In-Country/In-Region PhD and Master Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/ceraas-daad-in-country-in-region-phd-and-master-scholarships-2018-2019/"], [["TU Dortmund University DAAD STIBET Graduation Scholarships 2019 for Doctoral & International students.", "date announced:June 27, 2018", "Application Deadline: August 6th 2018"], ["Application Deadline: August 6th 2018", "Quaterly, ", "TU Dortmund University", " offers graduation scholarships to international students from the DAAD", " project STIBET I", ". The graduation scholarship is meant to support international students finishing their studies who are in financial hardships by no fault of their own.", "Requirements:", "Graduation scholarships can only be provided to international students and doctoral candidates who achieved good academic performance, have registered their thesis and are in financial crisis.", "To apply, please submit the following documents:", "Completed ", "application form", "Confirmation of registration for your final paper (", "page 9", " of the application; to be filled out by the Examinations Office) ", "(Prüfungsamt)", "Current certificate of enrollment", "Current overview of your grades", "Copy of your residency permit", "Bank statements for the last three months (", "June to August 2018)", "Proof of a blocked account, legal obligation to pay, scholarship or earnings", "If applicable, credit card statements for the last three months", "If applicable, bank statements from your spouse", "If applicable, a copy of your current work contract", "Please submit your application to the International Office on time via ", "mail (Emil- Figge Str. 61, 44227 Dortmund)", ". You can also drop your application off at the after-hours mailbox located next to the main building of the International Office or at room 2019B or personally to Ms.", " Wasila Al-Dubai.", "For More Information:", "Visit the Official Webpage of the DAAD STIBET Graduation Scholarships 2019 "], "url : https://www.opportunitiesforafricans.com/tu-dortmund-university-daad-stibet-graduation-scholarships-2019/"]]