[[["Sasol Bursary Programme 2019/2020 for young South Africans (Fully Funded)", "date announced:March 7, 2019", "Application Deadline: 30th April 2019"], ["Application Deadline: 30th April 2019", " Sasol has established a reputation in the market as an employer of choice. The bursaries programme does not differ, it is one of the most sought after bursary programmes in South Africa.   With the scarcity of talent in South Africa and globally it is essential for Sasol to ensure continuous availability of skills to sustain our growth. ", "The Sasol bursary programme", " is a critical talent lever to enable us to meet our strategic and transformation objectives. It is a talent-based scheme for South African citizens, where applicants who meet the minimum criteria may be invited to a selection interview.   ", "The Sasol Bursary Scheme comprises a comprehensive package that covers both financial as well as developmental support throughout the study period. Bursaries awarded are for full-time university studies in engineering, science and accounting. Upon successful completion of the study period, students may be employed within the Sasol Group through the Graduate Development Programme.   ", "All applications are done electronically, in order to speed up the selection process as well as to enable electronic tracking of applications received within a particular period. The number of bursaries awarded each year is dependent on the business need. Consequently, failure to secure a Sasol bursary is not necessarily due to poor performance on the part of the applicant but may be a reflection of insufficient business demand.  ", "Requirements:", "Grade 12 learners must have achieved the following marks in:", "BEng and BSc", "Required subjects", "%", "Level", "\nMaths\n", "\n 70\n", "\n6\n", "\nScience\n", "\n 70\n", "\n6\n", "\nEnglish\n", "\n 60\n", "\n5\n", "B Com  Accounting", "Required subjects", "%", "Level", "\nMaths\n", "\n60\n", "\n5\n", "\nAccounting\n", "\n60\n", "\n5\n", "\nEnglish\n", "\n60\n", "\n5\n", "If you are already studying towards the degree course for which you\nare applying for a bursary, you must have passed all courses for which\nyou have registered at the university for the study period already\ncompleted.", "Applications must be for full-time studies towards an academic degree at an accredited South African university.", "Applicants must be South African citizens with a valid ID number.", "All applicants invited to attend an interview must be willing to undergo psychometric testing.", "Benefits:", "The Sasol bursary is a comprehensive bursary which includes the following:", "100% of the prescribed university tuition fees, registration fees and exam fees.", "An amount equal to the average rate for accommodation in a single\nroom at a university residence at the university at which the Sasol\nbursar is studying. This rate is determined by Sasol in conjunction with\nthe university.", "An amount for meals based on three meals per day, as determined by the university.", "An amount of approximately R12 000,00 per annum, towards book and pocket money", "Note:", "Prescribed tuition fees, registration fees and exam fees are paid directly to the university.", "Fees for accommodation are paid directly to the university if the\nstudent is staying in university-administered accommodation Students\nwill be required to pay for any repeat subjects.", "In cases where the student elects to stay in non-university\nadministered accommodation, monies in lieu of accommodation and meals\nwill be paid directly to the individual. In such instances, the amounts\nwill be limited to that prescribed in points 2 and 3 above.", "Book and pocket money will be paid directly to the individual.", "Payments in respect of the above are made twice a year. The first\npayment is made at the beginning of the first semester, and the second\npayment is made at the beginning of the second semester.", "Full details of the payment process and the requirements which must\nbe met are communicated to successful applicants once a bursary has been\nawarded.", "Successful applicants will be bound contractually to work at Sasol\nafter graduation for a period equal to the tenure of the bursary.", "What does a Sasol Postgraduate bursary include?", "Postgraduate students receive a monthly allowance around R10 000 for\nthe duration of their studies (24 months Masters Degree and 36 months\nPhD degree).", "Fields of study", "The Sasol Bursary Programme offers bursaries on the basis of a\nservice-binding (work back obligation after graduation) contract.\nApplications may be submitted for one of the following fields of study:", "Undergraduate studies:", "B Eng or BSc Engineering", "B Sc", "B Com", "\nChemical\n", "\nChemistry (Masters compulsory)\n", "\nB Com Accounting  CA Stream (CTA, PGDA compulsory)\n", "\nMechanical\n", "\nGeology (Hons compulsory)\n", "\nElectrical\n", "\nMetallurgy (Hons compulsory)\n", "\nCivil\n", "\nIndustrial\n", "\nElectronic\n", "\nMining\n", "Postgraduate studies:", "Masters and PhD bursaries in Chemistry and Chemical Engineering", "University of Technology:", "Electrical Engineering", "Process Instrumentation", "Mechanical Engineering", "Mine Surveying ", "Note: ", "No bursaries are awarded in fields of study not listed above. Bursaries are not necessarily awarded in each field of study every year. Applicants should submit an application based on a real interest in the field and must be a South African citizen.", "Selection Criteria:", "Undergraduate, University of Technology and Postgraduate\napplications should be submitted to Sasol by no later than 30 April\n2019, for the 2020 academic year.", "Applications should be submitted online. For more info go to the ", "How do I Apply", " page", "Applicants, who do not have internet access or access to an internet\ncafe in their area, may contact our Sasol Bursary Application Helpline\nat ", "086 010 6235 ", "for support.", "All applicants short-listed to attend an interview will be notified by the ", "end of May 2019", ". Notification is done telephonically as well as via written correspondence.", " Selection interviews usually take place during the June/July public\nschool holidays each year. Applicants will be assessed by means of a\nstructured panel interview as well as psychometric tests and therefore\nit will be required of them to stay over in Secunda for one night.", "Applicants will be reimbursed for travel expenses to attend the selection day up to a maximum amount, as predetermined by Sasol.", "The outcome of the selection event will be communicated to applicants ", "by the end-of August", ". Please note that no correspondence in this regard will be entered into prior to this date.", "Successful candidates will be provided with comprehensive\ndocumentation relating to the Sasol Bursary Programme, as well as a\nwritten contract and other documentation for completion.", "Bursaries are awarded for commencement in the following academic\nyear and no payments are made in respect of studies already completed.", "For More Information:", "Visit the Official Webpage of the Sasol Bursary Programme"], "url : https://www.opportunitiesforafricans.com/sasol-bursary-programme-2019-2020/"], [["The Fulbright Foreign Language Teaching Assistant (FLTA) Program 2019/2020 for young Nigerians (Fully Funded to USA)", "date announced:March 5, 2019", "Application Deadline:April 30 2019"], ["Application Deadline:", "April 30 2019", "the-fulbright-foreign-language-teaching-assistant-flta-program-2019-2020 invites applications from qualified Nigerians wishing to teach Hausa or Yoruba languages and cultures to American students in U.S. universities and colleges.", "The Foreign Language Teaching Assistant (FLTA) program", " is a nine month non-degree course funded by the Bureau of Educational and Cultural Affairs and administered by the Institute of International Education. The objective of the program is to strengthen foreign language instruction at U.S. colleges, universities, and some high schools, while providing future teachers from abroad the opportunity to refine their skills, increase their English language proficiency, and expand their knowledge of U.S. society and culture.  FLTA fellows must return to their home countries upon completion of their programs to teach English at the secondary or university level.", " All applications must meet the following criteria:", "Applications must be completed and submitted online.", "Applicants should request that the academic office of their\ninstitution send a stamped copy of their transcripts in a sealed\nenvelope to: The Public Affairs Section, U.S. Embassy, Plot 1075\nDiplomatic Drive, Central Area, Abuja, Attention: Cultural Affairs\nOfficer.", "Other documents to be submitted include academic credentials, signed\nand stamped letters of reference, and the photo page of a valid\nNigerian passport.", "The application can be accessed at: ", "http://apply.embark.com/student/fulbright/flta", ".", "Applicants must be teachers of English or in training to become teachers of English.", "Applicants must possess a university degree in English, Language Arts, or combined honors.", "Applicants must be fluent in English, demonstrated by a TOEFL score\nof 79-80 (Internet based testing) or 6.0 (overall score International\nEnglish Language Testing System-IELTS).", "Applicants must be between 21 and 29 years old at the time of application.", "Applicants must demonstrate maturity, dependability, integrity and professionalism.", "Applicants must be physically present in their home country throughout the nomination and selection process.", "For further inquiries, please contact Cultural Affairs Assistant,\nU.S. Embassy, Plot 1075 Diplomatic Drive, Central Area, Abuja: email: ", "[email protected]", " or U.S. Consulate General, #2 Walter Carrington Crescent, Victoria Island, Lagos;", "For More Information:", "Visit the Official Webpage of the FLTA Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/the-fulbright-foreign-language-teaching-assistant-flta-program-2019-2020/"], [["Western Union Foundation Global Scholarship Program 2019 for Post-Secondary Education (USD $2,500)", "date announced:March 6, 2019", "Application Deadline: Tuesday, April 30, 2019 at 11:59pm EST "], ["Application Deadline: Tuesday, April 30, 2019 at 11:59pm EST ", "The Western Union Foundation Global Scholarship Program", ",", " also referred to as ", "WU Scholars,", " is a program designed to support young people and their efforts to pursue a post-secondary education.", "Selected scholarship recipients will receive USD $2,500 each to\ncontribute toward tuition or school fees at an accredited post-secondary\ninstitution and will be selected based on criteria relating to the\nprogram’s three pillars: Perseverance, Aspiration, and\nCommunity-Mindedness.", "The Institute of International Education, Inc. (IIE), a US non-profit, administers the program on behalf of the Western Union Foundation and its contributors.", "Requirements:", " Scholarships must be used at an accredited post-secondary institution seeking an undergraduate degree. ", "All applicants must be pursuing a degree/field of study in one of the following categories: science, technology, engineering, mathematics, and business/entrepreneurship. ", "All applicants for scholarships must be between the ages of 18 – 26 years of age on June 1, 2019. ", " Application must be submitted in English.", " Translation services may be used to help non-English speakers submit. You will not be penalized for basic errors. Must be able to demonstrate admittance to an accredited post-secondary institution or have applied for admittance. Must provide a letter of recommendation from a teacher or professor.", " If a teacher or professor is unable to submit a recommendation on your behalf, you may also use someone who has supervised you in a youth/community group, volunteer position, job/employment situation, etc. ", "Scholarships must be used on programs resulting in an undergraduate degree. Specialized academic programs (study abroad term, stand-alone language acquisition course, service learning, etc.) are not permitted. ", " Scholarships may not be used for advanced degrees, such as Masters, PhD, JD, etc. ", "Timeline", "\nApplication Period Closes: Tuesday, April 30, 2019 at 11:59pm EST\nSelection and Notification to All Applicants: July 2018\n", "For More Information:", "Visit the Official Webpage of the Western Union Foundation Global Scholarship Program 2019 "], "url : https://www.opportunitiesforafricans.com/western-union-foundation-global-scholarship-program-2019/"], [["Mandela Rhodes Postgraduate Scholarships 2019/2020 for young Africans to study in South Africa (Fully Funded)", "date announced:March 8, 2019", "Application Deadline: 15 April 2019 "], ["Application Deadline: ", "15 April 2019", " ", "The central purpose of The Mandela Rhodes Foundation is to build exceptional leadership capacity in Africa. The ", "Mandela Rhodes Scholarship ", "is a combination of ", "financial support for postgraduate studies", " and a high quality ", "Leadership Development Programme", ".", "Eligibility", "Who can apply for a Mandela Rhodes Scholarship? ", "The Scholarship is open to ", "citizens", " of ", "all African countries", " and is for postgraduate study", " at South African universities", " or tertiary institutions.", "Full funding is for ", "Honours (maximum one year) or Masters (up to a maximum of two years)", " or their equivalents (MBA’s excluded).", "Any individual who will be", " between the ages of 19 and 30 years", " at the time of taking up the Scholarship may apply.", "Applicants ", "must possess a first degree", " or its equivalent or must be in the process of completing one by 31 January 2020.", "Applicants should have a", " history of well above average academic results", " and reflect in their character a", " commitment to the four principles", " of Education, Reconciliation, Leadership and Entrepreneurship.", "Applicants ", "must be able to attend", " all compulsory elements of our leadership development programme. These activities can occur during the week or on weekends", "Application Procedure:", ". Please be advised that as part of your application, three letters of recommendation are required.", " Your application will be considered incomplete without them", ". Start your application as soon as possible to give your Recommenders time to submit.", "The closing date is ", "15 April 2019. ", " Your Recommenders will have to upload their letters directly to our online platform by this date.", "For More Information:", "Visit the Official Webpage of the Mandela Rhodes Postgraduate Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/mandela-rhodes-postgraduate-scholarships-2019-2020/"], [["Swedish Institute Scholarships for Global Professionals (SISGP) 2019/2020 for Master’s Level Studies in Sweden (Fully Funded)", "date announced:February 12, 2019", "Application Deadline: 23:59 CET 14 February 2019. "], ["Application Deadline: 23:59 CET 14 February 2019. ", " Have you applied for master’s studies starting in the autumn semester 2019? You can now apply for an SI scholarship to fund your studies in Sweden. ", " Do you have ambition, leadership experience and a strong professional background? You could study for a master’s degree in Sweden on a fully-funded Swedish Institute scholarship. Find out if you can apply. ", "The Swedish Institute (SI) is now launching ", "the ", "Swedish Institute Scholarships for Global Professionals (SISGP", ")", ", a new scholarship programme which replaces ", "Swedish Institute Study Scholarships (SISS)", ".", "The Swedish Institute Scholarships for Global Professionals (SISGP) programme ", "is part of the Swedish government’s international awards scheme aimed at developing global leaders who will contribute to ", "the United Nations 2030 Agenda for Sustainable Development", ". It is funded by the", " Ministry for Foreign Affairs of Sweden", " and administered by the Swedish Institute (SI).", " The programme offers a unique opportunity for global professionals to develop professionally and academically, to experience Swedish society and culture, and to build a long-lasting relationship with Sweden and with each other.", "The goal is to enable the scholarship holders to play an active role\nin the positive development of the societies in which they live. Ideal\ncandidates are ambitious young professionals with academic\nqualifications, demonstrated work and leadership experience, ambition to\nmake a difference by working with issues which contribute to a just and\nsustainable development in their country in a long term perspective,\nand a clear idea of how a study programme in Sweden would benefit their\ncountry.", "Benefits:", "The scholarship covers:", "Tuition fees: directly paid to the Swedish university by us", "Living expenses of SEK 10,000/month", "Travel grant of SEK 15,000 *", "Insurance against illness and accident", "Membership of ", "the SI Network for Future Global Leaders", "(NFGL) – a platform to grow professionally and build your network while in Sweden", "Membership of ", "the SI Alumni Network", " after your scholarship period – a platform for continued networking and further professional development", "* The travel grant is a one-time payment for the entire study period. The grant is not applicable to students already living in Sweden.", "The scholarship does not cover:", "Additional grants for family members", "Application fee to University Admissions", "Scholarship period", "The scholarship is intended for full-time one-year or two-year\nmaster’s programmes, and is only awarded for programmes starting in the\nautumn semester. The scholarship is granted for one academic year (two\nsemesters) at a time. It will be extended for programmes longer than two\nsemesters, provided that the student has passed his/her\ncourses/credits.", "The scholarship period cannot be changed or extended beyond the awarded scholarship period, nor can the scholarship be transferred to a study programme other than the awarded master’s programme.", "Criteria", " Work experience ", "You must have minimum of 3,000 hours of demonstrated employment.", "Read more about the criteria for work experience", "\nLeadership experience\n", "You must have demonstrated leadership experience from your current or previous employment.", "Read more about the leadership experience criteria", "\nUniversity admissions\n", "You must be liable to pay\ntuition fees to Swedish universities, have followed the steps of\nuniversity admission, and be admitted to one of the eligible master’s\nprogrammes by 4 April 2019.", "Read more about our criteria regarding University Admissions", "\nCountry of citizenship\n", "You must be a citizen of a country that is eligible for the scholarship programme.", "Read more about country of citizenship", "\nOther eligibility criteria\n", "There are also conditions regarding dual citizenship, previous residence and studies in Sweden, and more.", "SISGP offers scholarships to a large number of master’s programmes starting in the autumn semester 2019. ", "Check the list of master’s programmes that are eligible for SISGP", ".", "To begin with, apply for a master’s programme at ", "universityadmissions.se", ", between 16 October 2018 – 15 January 2019.", "Apply for an SI scholarship between 4-14 February 2019, follow the instructions below.", "An estimated 300 scholarships will be available for full-time master’s studies in Sweden starting in the autumn semester 2019. Usually 1-3 % of the applicants are awarded a SISGP scholarship.", "Required documents", "You should only submit the required documents listed below in your\nonline scholarship application. We will not consider any other documents\nthan the required ones. You must complete your application in English.\nUse our forms and templates provided below, and complete them according\nto the instructions both below and in the templates/forms, or else your\napplications will be disqualified. Kindly note the length limitation for\nyour answers and the documents.", "A motivation letter", ": you must use ", "the SISGP form for motivation letter 2019/2020", ". You need to fill in and upload the motivation letter as a PDF-file on the application portal during the application period.", "A Curriculum Vitae (CV)", ": you must use ", "the SISGP template for CV 2019/2020", "\nand the CV should not exceed three pages. It’s up to you to decide\nwhich parts are relevant for your application. Additional pages will not\nbe considered.", "Two different letters of reference", ": you must use ", "the SISGP form for letter of reference 2019/2020", ". At\nleast one letter of reference must be based on your work experience. It\nwill be a merit if the second letter of reference is based on your\ninvolvement in networks or civil society organisations ", "outside", "\nof your regular work. The letters should be signed by the referee and\nstamped with an official stamp of the referred organisation or a notary\noffice. The form(s) should be typed, then printed, signed and stamped;\nand then be uploaded as one PDF-file. You can find more information in\nthe instruction in the form and in our ", "FAQ", ".", "Proof of work and leadership experience", ": you must use ", "the SISGP form for proof of work and leadership experience 2019/2020", ".\nThe work and leadership form should be signed by the referee and\nstamped with an official stamp of the referred organisation or a notary\noffice. The form(s) should be typed, then printed, signed and stamped;\nand then be uploaded as one PDF-file. You can find more information in\nthe instruction in the form and in our ", "FAQ", ".", "A copy of your passport", ": your personal data\nincluding name, citizenship and photograph must be shown clearly. Copy\nof passport should be included together with the CV as a last fourth\npage. It is your responsibility to ensure that you have a copy of your\nvalid passport to include.", "Make sure you have a complete application", "A complete application must consist of:", "a completed motivation letter", "a CV", "two valid and completed letters of reference", "valid and completed proof of work and leadership experience", "a copy of your valid passport", "For More Information:", "Visit the Official Webpage of the Swedish Institute Scholarships for Global Professionals (SISGP) 2019/2020"], "url : https://www.opportunitiesforafricans.com/swedish-institute-scholarships-for-global-professionals-sisgp-2019-2020/"], [["Kwame Nkrumah University of Science and Technology (KNUST) MasterCard Foundation Scholars Program 2019/2020 for young Africans (Fully Funded)", "date announced:February 19, 2019", "Application Deadline: 17:00GMT, Friday, 29th March, 2019 "], ["Application Deadline: ", "17:00GMT, Friday, 29th March, 2019", " ", "The Mastercard Foundation Scholars Program at KNUST", " provides academically talented yet economically disadvantaged young people in Ghana and Africa with access to quality and relevant University education. The Scholars Program embodies an array of mentoring and cultural transition services to ensure the scholar’s academic success, community engagement and transition to employment opportunities which will further the goal of social and economic transformation of Africa.", "THE SCHOLARSHIP INCLUDES:", "Comprehensive financial support (full tuition, fully paid\non-campus accommodation, learning materials, transportation and monthly\nstipend).", "Regular group meetings with other scholars that focus on personal\nand professional development opportunities and activities tailored to\nbuild societal relationships and scholars’ capacity.", "Continued academic support through academic mentoring, virtual learning, life and career coaching, and tutoring.", "Opportunities to participate in leadership congresses, community services and mentoring ", "(Go-back Give-Back)", ", and uniquely sourced internships.", "An academic environment where faculty and students engage with global issues.", "The prestige of becoming part of the growing family of the\nMastercard Foundation Scholars Alumni and the Global Scholars Community.", "The opportunity to be enrolled on an accelerated Master’s Degree\nafter undergraduate studies with an MCF Partner institution in the USA.", "ELIGIBILITY:", "For the 2019/2020 Academic year, the opportunity is open to;", "All Applicants with ", "WASSCE or GBCE or ABCE or GCE O’Level and A’Level or their equivalent Results", " from an accredited/recognised institution and Certificate Ready and Satisfies KNUST’s Admission Requirements. ", "NO AWAITING RESULTS", " candidate will be accepted.", "The Applicant must have Critical Economic Needs.", "The Applicant must have Proven Records of Leadership and Community Engagement(s).", "Females and Physically Challenged Applicants shall be given top priority.", "All Subjects are considered; however, there is Preference for Science Students.", "The Applicant must be prepared to ", "Go-Back and Give-Back", " to his or her Community.", "HOW TO APPLY:", "Download a copy of the 2019/2020 application form ", "here", "!", "Submit the completed application form THROUGH EMS/ any other courier mail to:", "The Program Manager", "\nMastercard Foundation Scholars Program at KNUST Secretariat", "\n℅ Office of the Dean of Students", "\nPrivate Mail Bag", "\nKNUST, Kumasi, Ghana", "INTERNATIONAL APPLICANTS", "When submitting your scholarship application form to the Secretariat, submit these additional documents", "The print out of KNUST’s online admission", "Original Certificates for both O’Level and A’Level results or their equivalent.", "Applications close at 17:00GMT, Friday, 29th March, 2019", "For More Information:", "Visit the Official Webpage of the KNUST MasterCard Foundation Scholars Program 2019/2020", " "], "url : https://www.opportunitiesforafricans.com/knust-mastercard-foundation-scholars-program-2019-2020/"], [["Joint Japan/World Bank Graduate Scholarship Program 2019/2020 for developing countries Nationals (Fully Funded)", "date announced:March 7, 2019", "Application Deadline: April 11th 2019"], ["Application Deadline: April 11th 2019", "The Joint Japan/World Bank Graduate Scholarship Program (JJ/WBGSP)", " is open to women and men from developing countries with relevant professional experience and a history of supporting their countries’ development efforts who are applying to a master degree program in a development-related topic.   ", "Requirements:", "Broadly speaking, Developing Country nationals must:", "Be a national of a ", "World Bank member developing country", ";", "Not hold dual citizenship of any developed country;", "Be in good health;", "Hold a Bachelor’s (or equivalent) degree earned at least 3 years prior to the Application Deadline date;", "Have 3 years or more of recent development-related work experience after earning a Bachelor’s (or equivalent) degree;", "Be employed in development-related work in a paid full- time\nposition at the time of submitting the scholarship application.  The\nonly exception to this criterion is for developing country nationals\nfrom a country that will be on the updated list of Fragile and Conflict\nStates provided to applicants in the Application Guidelines for each\ncall for scholarships.", "On or before the Scholarship Application Deadline date, be admitted\nunconditionally (except for funding) for the upcoming academic year to\nat least one of the ", "JJ/WBGSP ", "preferred university master’s programs", " located\noutside of the applicant’s country of citizenship and country of\nresidence listed at the time the call for scholarship applications\nopens. The letter of admission must be uploaded before submitting your\napplication. For details, see “How to Apply”.", "Not be an Executive Director, his/her alternate, and/or staff of any\ntype of appointment of the World Bank Group or a close relative of the\naforementioned by blood or adoption with the term “close relative”\ndefined as: Mother, Father, Sister, Half-sister, Brother, Half-brother,\nSon, Daughter, Aunt, Uncle, Niece, or Nephew.", "Please note: All eligibility criteria are strictly adhered to. No exceptions are made. Eligibility criteria WILL NOT change during an open call for applications. However, this information is subject to change between the close of one application process and the opening of the next.", "Scholarship Benefits", "The JJ/WBGSP scholarship", " provides the recipient with the following benefits:", "Economy class air travel between your home country and the host\nuniversity at the start of your study program and immediately following\nthe end of the scholarship period. In addition to the two-way air\ntravel, scholars will receive a US $500 travel allowance for each trip;", "Tuition for your graduate program and the cost of basic medical insurance obtained through the university.", "While on campus during the scholarship period, a monthly subsistence\nallowance to cover all living expenses (accommodations, food, etc.,\nincluding books). The amount of the allowance varies depending on the\nhost country.", "Please note all JJ/WBGSP scholarships cover the duration of the graduate program or two years, whichever is less.", "The JJ/WBGSP scholarship does not cover:", "VISA application(s) costs", "Expenses to bring and/or support a scholar’s family members;", "Extra-curricular courses or training;", "Courses that do not meet the minimum credits required to earn the graduate degree;", "Language training not provided by the graduate program;", "Additional travel during the course of the study program;", "Expenses related to research, supplementary educational materials,\nfield trips, participation in workshops/seminars, or internships; or", "Educational equipment such as computers.", "Resident permit fee", "Note: The JJ/WBGSP scholarship may only supplement, and does not\nduplicate, any other source of financial support/fellowship you might\nhave. If you are notified to be a semi-finalist or if you are awarded a\nscholarship, you must inform and document to the JJ/WBGSP at that time\nif you have other sources of scholarship funds", "Selection Process", "The JJ/WBGSP uses the following process to review eligible\nscholarship applications from developing country nationals, with the aim\nof identifying the candidates with the highest potential, after\ncompletion of their graduate studies, to impact the development of their\ncountries.", "Two qualified assessors independently review each eligible\napplication and score the application on a scale of 1 to 10, taking into\naccount four main factors and the degree of cohesion among them:", "Quality of Professional Experience (30% weight)", "Quality of Professional Recommendations (30% weight)", "Quality of Commitment to your Home Country (30% weight)", "Quality of Education Background (10% weight)", "The JJ/WBGSP Secretariat uses the average score of the two assessors and the following criteria to select the finalists:", "Maintaining a reasonably wide geographical distribution of awards;", "Maintaining a reasonable distribution of awards across gender;", "Unusual circumstances/hardships, when assessing the employment experience and other aspects of an application;", "Giving scholarships to those applicants who, other things being\nequal, have limited access to financial resources for graduate studies\nabroad.", "How to Apply", "Applicants can apply for scholarships to both Preferred and Partner\nPrograms. The process to apply to a Preferred Program and to a Partner\nProgram differs:", "See our Announcements posted on the right side of this website for\nupcoming calls for scholarship applications for developing country\nnationals to study at one of our partner master programs, as these calls\nare announced on a rolling basis throughout the calendar year.", "Those seeking a ", "JJ/WBGSP Partner Program scholarship", "\n(.xlsx 15 KB) must first apply for admission to one or more of the\nPartner Master’s Degree Program(s). Inquiries on how to submit an\nadmission application to a partner program should be submitted to the\nrespective university.", "After reviewing submitted applications, each Partner Master Degree\nProgram will identify a short list of eligible candidates who will then\nbe invited by the JJWBGSP Secretariat to apply for a JJ/WBGSP\nscholarship. View the ", "complete list of JJ/WBGSP Partner", " (.xlsx 15 KB) master degrees offered.", "Those seeking a JJ/WBGSP ", "Preferred Program scholarship", "(.xlsx 49 KB) must apply directly and be admitted unconditionally to one or more of the Preferred Program(s) before submitting a JJWBGSP scholarship through an open call typically announced within the first two months of a calendar year.", " The next call for applications for a JJWBGSP Scholarship to one of our Preferred Programs is scheduled to open in March 2019.", " View ", "the complete list of JJ/WBGSP Preferred", " (.xlsx 49 KB) Master Degrees currently offered", ".  ", "For More Information:", "Visit the Official Webpage of the Joint Japan/World Bank Graduate Scholarship Program 2019/2020 "], "url : https://www.opportunitiesforafricans.com/joint-japan-world-bank-graduate-scholarship-program-2019-2020/"], [["Mwalimu Nyerere African Union Scholarship Scheme 2019 for Refugees and Displaced Persons in Africa (Fully Funded)", "date announced:February 8, 2019", "Application Deadline: April 30th 2019"], ["Application Deadline: April 30th 2019", " ", "The Mwalimu Nyerere African Union Scholarship Scheme", " ", " was launched in 2007 with the aim to contribute in the production and retention of high level African human resources for sustainable development of the continent incritical development areas, while promoting regional integration through intra-Africa mobility of students. ", " The Scholarship Scheme is intended to enable young Africans to study in reputable African Universities with a binding agreement that beneficiaries will work in any African country for at least the same duration of scholarship period after graduation.The African continent hosts one of the largest number of displaced persons in the world. Over a third of the world’s forcibly displaced persons are found in Africa, including 6.3 million refugees and 14.5 million internally displaced persons. ", "Access to higher education for many refugees has remained a challenge due to a number of reasons including the high cost of higher education and lack of appropriate documentation to facilitate enrollment of refugees into various institutions of higher learning.Only 1% of refugees and displaced people get access to higher education. ", "Promoting access to higher education is essential to enable refugees and forcibly displaced persons build their capacity to lead a normal life and contribute to regional integration and sustainable development in Africa. It is therefore necessary to enhance opportunities to effectively educate and integrate refugees and displaced persons.", " To encourage the participation of young African Refugees and Internally Displaced Persons at Masters programmes in the fields of Natural Sciences, Agriculture, Health, Education, Engineering,and Social Sciences;the African Union Commission is offering a Call for Scholarship Applications.", "The 2019 Scholarship offer is aimed to provide an important opportunity for enhancing the knowledge, professional skills and capacity of refugees and displaced persons;and there by streamline their integration to contribute for sustainable development in Africa. ", "Eligibility Requirements:", " To be eligible for the Scholarship, a candidate must: ", "i.Be a Citizen of an African Union Member State.", "ii.Be a formally registered refugee/displaced person with a UNHCR registration number or be able to demonstrate confirmed refugee status in an African Union Member State.", "iii.Be under the age of thirty five (35) years.", "iv.Be a holder of a Bachelor’s Degree in the relevant field, at least at the level of Upper Second Class Honours. The degree must be from a recognised University.", "v.Have demonstrated outstanding academic achievement as evidenced by academic transcripts, and academic awards if any. ", "vi.Have proof of admission to undertake a full time Masters programme in a recognised university in an African Union Member State.", "vii.Be willing to commit to work in an African Union Member State on completion of studies for at least three (3) years. No application will be considered without an admission letter from a university, and an official registration as a refugee or displaced person. ", " ELIGIBLE FIELDS OF STUDY", "The following fields of study are eligible:Natural Sciences, Agriculture, Health, Education, Engineering,and Social Sciences ", "Scholarship Worth:", " The scholarship award covers the following:", "Tuition Fees:", "According to an official invoice from the Host University.", "Stipend: ", "500 US$monthly,to support living expenses such as housing, food, utilities, local transportation and medication.", "Book Allowance: ", "An allowance of 500US$per year for the purchase of books.Air ticket: A round-trip economy fare (as applicable).", "Travel Allowance:", "One-off payment of 250 US$ to contribute towards ground transportation and settling-in costs ", "One-off payment of 350US$ to assist with shipping and other terminal expenses; upon departure from the host Institution after successful completion of the study.", "Computer Allowance: ", "One-off payment of1,000 US$ for the purchase of laptop computer and accessories.Note:Candidates must complete their study within the specified period of the programme as the scholarship cannot be extended. ", "Application Procedure:", " Applicants can submit their applications by post after completing the Scholarship Application Form, which is available on the Africa Union website:www.au.int/en/scholarship", "The application documents should include the following:", "i.Completed application form", "ii.A proof of refugee/displaced person status,indicating citizenship", "iii.Recent passport-size photograph", " iv.CV indicating applicant’s academic background and work experience", "v.Certified copies of academic certificates and transcripts ", "vi.Copy of admission letter from a recognised African University", "vii.Two (2) Reference Letters with contact addresses and telephone numbers.", "viii.A Letter of Motivation of not more than 500words (maximum 2 pages) that explains why the candidate has chosen the particular field of study and its importance to Africa’s development", "Applicants applying on-line should produce electronic copies of the above documents and submit as attachments.Applicants who submit their applications by post should make two (2) sets of hard copies of all the above documents. ", "The Application must be sent to the address below:", " Department of Human Resources, Science and Technology", "African Union Commission", "P.O. Box 3243", "Addis Ababa, Ethiopia ", "For More Information:", "Visit the Official Webpage of the Mwalimu Nyerere African Union Scholarship Scheme 2019"], "url : https://www.opportunitiesforafricans.com/mwalimu-nyerere-african-union-scholarship-scheme-2019/"], [["Swedish Institute Study Scholarships (SISS) 2019/2020 for South African Citizens (Fully Funded to Sweden)", "date announced:February 12, 2019", "Application Deadline: February 14th 2019"], ["Application Deadline: February 14th 2019", " Are you a talented and ambitious citizen of South Africa and want to study for a master’s degree in Sweden on a fully-funded scholarship? Find out if you can apply to the Swedish Institute Scholarships for South Africa. ", "The Swedish Institute Scholarships for South Africa (SISSA) programme", " ", " is part of the Swedish government’s international awards scheme aimed at developing global leaders who will contribute to ", "the United Nations 2030 Agenda for Sustainable Development", ". It is funded by the Ministry for Foreign Affairs of Sweden and administered by the ", "Swedish Institute (SI). ", "The programme offers a unique opportunity for future leaders to develop professionally and academically, to experience Swedish society and culture, and to build a long-lasting relationship with Sweden and with each other. SISSA is a special initiative in connection with the Binational Commission agreement between Sweden and South Africa.", "The goal is to enable the scholarship holders to play an active role\nin the positive development of the societies in which they live. Ideal\ncandidates are ambitious young professionals with academic\nqualifications, demonstrated leadership experience, ambition to make a\ndifference by working with issues which contribute to a just and\nsustainable development in their country in a long term perspective, and\na clear idea of how a study programme in Sweden would benefit their\ncountry.", "Criteria", "Country of citizenship ", "Only citizens of South Africa are eligible for SISSA.", "Read more about country of citizenship", "\nUniversity admissions\n", "You must be liable to pay tuition fees to Swedish universities, followed the steps of university admission, and be admitted to one of the eligible master’s programmes by 4 April 2019.", "Priority will be given to applicants who", "have completed bachelor’s with honours or equivalent from a South African university, and", "choosing study programmes with an emphasis on one of the following\nsubject areas (listed in alphabetical order, no priority or ranking is\nimplied):", "Computer science and IT", "Design (industrial design, architecture, urban/regional planning)", "Engineering", "Environmental technology/Sustainable development", "Gender studies", "Nanotechnology", "Public health", "The scholarship covers", "Tuition fees: directly paid to the Swedish university by us", "Living expenses of SEK 10,000/month", "Travel grant of SEK 15,000 *", "Insurance against illness and accident", "Membership of ", "the SI Network for Future Global Leaders (NFGL)", " – a platform to grow professionally and build your network and experience, while in Sweden", "Membership of ", "the SI Alumni Network", " after your scholarship period – a platform for continued networking and further professional development", "*The travel grant is a one-time payment for the entire scholarship\nperiod. The grant is not applicable to students already living in\nSweden.", "The scholarship does not cover", "Additional grants for family members.", "Application fee to University Admissions.", "Scholarship period", "The scholarship is intended for full-time one-year or two-year\nmaster’s programmes, and is only awarded for programmes starting in the\nautumn semester. The scholarship is granted for one academic year (two\nsemesters) at a time. It will be extended for programmes longer than two\nsemesters, provided that the student has passed his/her\ncourses/credits.", "The scholarship period cannot be changed or extended beyond the awarded scholarship period, nor can the scholarship be transferred to a study programme other than the awarded master’s programme.", "Required documents", "You should only submit the required documents listed below in your\nonline scholarship application. We will not consider any other documents\nthan the required ones. You must complete your applications in English.\nUse our forms and templates provided below and complete them according\nto the instructions, otherwise your applications will be disqualified.", "The compulsory documents required are:", "A motivation letter", ": you must use ", "the SISSA form for motivation letter 2019/2020", ". You need to fill in and upload the motivation letter as a PDF-file on the application portal during the application period.", "A Curriculum Vitae (CV)", ": you must use ", "the SISSA template for CV 2019/2020", " and the CV should not exceed three pages. It’s up to you to decide which parts are relevant for your application. Additional pages will not be considered.", "A copy of your passport", ": your personal data including name, citizenship and photograph must be shown clearly. Copy of passport should be included together with the CV as a last fourth page. It is your responsibility to ensure that you have a copy of your valid passport showing that your citizenship is South Africa, to include in your application.", "Make sure you have a complete application", "A complete application must consist of:", "a completed motivation letter", "a CV", "a copy of your valid passport", "If your application is missing one of the required documents above, it will be disqualified.", "For More Information:", "Visit the Official Webpage of the Swedish Institute Study Scholarships (SISS) 2019/2020"], "url : https://www.opportunitiesforafricans.com/swedish-institute-study-scholarships-siss-2019-2020/"], [["TU Delft Sub-Saharan Africa Summer School Scholarship 2019 for young Africans (Fully Funded to ﻿Amsterdam, The Netherlands)", "date announced:March 12, 2019", "Application Deadline: 30 APRIL 2019.  "], ["Application Deadline: ", "30 APRIL 2019. ", " ", " The ", "Department of Urbanism of the TU Delft", "  and the ", "Chair of Spatial Planning and Strategy", " will promote the ", "sixth", " edition of the Summer School Planning and Design with Water for Sustainability in July 2019. ", "\nThe Summer School combines spatial planning, urban design and\nenvironmental technology to tackle issues of sustainability, climate\nadaptation and water management in urban environments. It invites\nstudents to understand the theories and practices that bring together\nwater management, urban sustainability and spatial justice and to apply\nthe knowledge acquired in the elaboration of a vision and a spatial plan\nand design for an area in the city of The Hague in The Netherlands.\n", "The Summer School focuses on the ", "UN Sustainable Development Goals ", "(SDGs) and ", "The New Urban Agenda", ", launched in Quito in 2016 as frameworks for sustainable urbanisation.", "The aim of the Summer School is to explore the ", "Dutch tradition", "\nof planning and design with water and the integration of water\nmanagement and sustainability into urban development within the\nframework of the Sustainable Development Goals and the New Urban Agenda.", "The Summer School is led by the Delft University of Technology, in\ncollaboration with national and international partners, including the\nCity of The Hague, the Dutch Ministry of Infrastructure and the\nEnvironment, the Dutch Delta Programme, ARCADIS, Deltares and others\nprivate and public partners.", "This school includes site visits, talks with professionals and academics and a short studio-based exercise, where students and teachers will explore possibilities through the elaboration of ", "a spatial vision,", " the design of ", "a spatial strategy", " and ", "spatial interventions", " in the city of the Hague, located in one of the most important ", "Urbanised Delta Regions", " of the world.", "TU Delft Sub-Saharan Africa Summer School Scholarship 2019 ", "This scholarship is intended for passport holders of countries in\nSub-Saharan Africa between 22 and 28 years of age, studying in the\nfollowing areas:", "Architecture", "Urban design", "Spatial planning (town, urban and regional planning)", "Environmental engineering", "Water engineering", "Urban law and management", "Political sciences", "Public administration", "Areas that have a close relationship with planning and design of sustainable cities and communities.", "You have to follow the instructions carefully in order to apply for\nthe scholarship. If you fail to deliver one of the items required, we\nwill not be able to take your candidacy into account.", "The scholarship includes", "A round-trip ticket between your country of origin and Amsterdam.\nThe ticket will be organised and bought by TU Delft upon selection of\nthe candidate and the granting of a Dutch visa.", "The fees for the SummerSchool (400 euros) will be waived.", "A small amount of pocket money, enough for meals and transport during 20 days in the Netherlands.", "Accommodation during  your stay (you might be housed with a TU Delft student during the period of the Summer School).", "The scholarship does not include", "The fee for the Dutch visa in your country.", "Your health insurance (mandatory for students coming to\nthe Netherlands. Please, ask us for instructions on how to get a\nhealth insurance).", "Any extra costs incurring from your stay (trips, transfers or\nother activities not included in the Summer School programme, including\nfines resulting from breaches of the law, damage to others and\naccidents. You must be insured).", "If you have any questions, please contact Roberto Rocco at ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the TU Delft Sub-Saharan Africa Summer School Scholarship 2019 "], "url : https://www.opportunitiesforafricans.com/tu-delft-sub-saharan-africa-summer-school-scholarship-2019/"], [["UCL Institute for Global Health African Graduate Scholarships 2019/2020 for young Africans (Funded)", "date announced:February 27, 2019", "Application Deadline: 29 April 2019 "], ["Application Deadline: 29 April 2019 ", "The UCL Institute for Global Health African Graduate Scholarships", " exist to support African nationals with a high-quality academic and professional background who would not be able to study at UCL without financial assistance.  The Scholarship is a one-off award for the academic year September-September to study at the UCL Institute for Global Health on the MSc in Global Health and Development programme.", "Candidates must meet the following criteria:", "The candidate must be an African national and a permanent resident of an African  nation at the time of application.", "The\ncandidate must have made an application and been accepted to UCL to\nstudy the MSc in Global Health and Development full time. Click ", "this link", " to apply to the MSc.", "The scheme offers a substantial scholarship towards UCL tuition fees, accommodation and some living costs. The candidate must also be able to provide evidence that he/she has secured other sources of funding for travelling to and from the UK.", "\nPlease submit an application form to ", "[email protected]", " by 29 April 2019. IGH is unable to consider any applications submitted after this deadline.\n", "For More Information:", "Visit the Official Webpage of the UCL InstituteAfrican Graduate Scholarships"], "url : https://www.opportunitiesforafricans.com/ucl-institute-for-global-health-african-graduate-scholarships-2019-2020/"], [["One Young World Leading Scholarships to attend the OYW Summit 2019 in London, the United Kingdom (Fully Funded)", "date announced:February 26, 2019", "Application Deadline:  15 April 2019"], ["Application Deadline: ", " 15 April 2019", "Since 2010, ", "One Young World", " has worked to guarantee young people from all 196 countries in the world are represented at OYW Summits, regardless of their ability to pay. To ensure this, fully-funded scholarship places are awarded to outstanding young leaders with a range of backgrounds, skill sets and nationalities. ", "This year, OYW has launched the flagship ‘Leading Scholarships’ which seek applicants from 6 key regions. If you are a young leader, apply now:", "1. ", "Leading Europe", "2. ", "Leading Asia", "3. ", "Leading The Americas", "4.", " Leading The Middle East", "5. ", "Leading Africa", "6. ", "Leading The Pacific", "The Leading Africa Scholarship", " is an initiative designed to ensure that outstanding young people from Africa are represented at the One Young World Summit 2019 in London.", "Africa\nis host to the largest population of young people in the world, with\nover 60% of its population under the age of 25. With 72% of its labour\nforce in “vulnerable” employment and several countries experiencing\nchallenges of governance and violent extremism, the Fourth Industrial\nRevolution could provide a lifeline to this young, eager population.\nGiven their sheer numbers, they have the ability to transform their\nregions, whether it be in governance, energy, infrastructure, medicine\nand beyond.", "In the midst of these challenges and opportunities, it is young leaders who are devising meaningful strategies to build a more sustainable region. Are you one of those leaders? If so, One Young World is looking to bring you to the next annual Summit in London.", "Benefits:", "Access to the One Young World Summit 2019 in London, the United Kingdom.", "Hotel accommodation on a shared basis between 22 October and 25 October 2019.", "Catering which includes breakfast, lunch and dinner.", "Transport between the Summit accommodation and the Summit venue.", "Summit handouts and support materials.", "The\ncost of travel to and from London. Your flight to and from London must\ndepart from and return to one and the same international airport.", "Please note that if you are ultimately selected for a Scholarship and require a visa to enter the UK to attend the One Young World Summit 2019, you will be required to pay the UK visa fee yourself. The UK visa costs £93 GBP plus the applicable service charge of your local visa application centre. The costs of the visa and the applicable service charge as well as any further costs associated with the visa application (including travel to and from the visa application centre) fall on you as the participant.", "You are eligible for sponsorship if you:", "Are between the ages of 18 – 30", "Have an evidenced commitment to delivering positive change", "Demonstrate capacity for leadership", "Are addressing key local and/or global issues in your work", "Have a track record of generating impactful and innovative ideas ", "Are a national (passport holding citizen) of one of the countries listed below:", "Algeria", "Angola", "Benin", "Botswana", "Burkina Faso", "Burundi", "Cameroon", "Cape Verde", "Central African Republic", "Chad", "Comoros", "Congo, The Democratic Republic of the", "Cote d’Ivoire", "Djibouti", "Egypt", "Equatorial Guinea", "Eritrea", "Ethiopia", "Gabon", "Gambia, The", "Ghana", "Guinea", "Guinea-Bissau", "Kenya", "Kingdom of eSwatini", "Lesotho", "Liberia", "Libya, State of", "Madagascar", "Malawi", "Mali", "Mauritania", "Mauritius", "Morocco", "Mozambique", "Namibia", "Niger", "Nigeria", "Rwanda", "Sao Tome and Principe", "Senegal", "Seychelles", "Sierra Leone", "Somalia", "South Africa", "South Sudan", "Sudan", "Togo", "Tunisia", "Uganda", "United Republic of Tanzania", "Zambia", "Zimbabwe", "The selection process:", "The\nstrongest applicants will be shortlisted by the end of May. You will be\ncontacted individually by a member of the One Young World team if you\nhave been shortlisted.", "Please note:", "We cannot\nguarantee any applicant that they will be shortlisted or that we will\nsecure sponsorship for any shortlisted applicant.", "Priority will be given to applicants from countries that have been less represented at previous One Young World Summits.", "Priority will also be given to first-time Summit attendees (not OYW Ambassadors).", "Due\nto the overwhelming amount of applications we receive, One Young World\nis unable to respond to individual emails enquiring about the outcome of\nthe Leading Africa selection process.", "We do not provide feedback as to why candidates are not selected.", "Tips for applying:", " check out our ", "helpful guidelines", " for submitting a successful application. ", "Application deadline: Monday 15 April 2019, 5PM BST", "For More Information:", "Visit the Official Webpage of the One Young World Leading Scholarships", " "], "url : https://www.opportunitiesforafricans.com/one-young-world-leading-scholarships-to-attend-the-oyw-summit-2019/"], [["Middle East Partnership Initiative (MEPI) Tomorrow’s Leaders Scholarship Program 2019 for Students from MENA Region (Fully Funded)", "date announced:February 15, 2019", "Application Deadline: March 31, 2019"], ["Application Deadline: ", "March 31, 2019", "The Lebanese American University (LAU) has launched the", " ", "Tomorrow’s Leaders Graduate (TLG) Scholarship Program", " funded by the ", "U.S. Department of State U.S.-Middle East Partnership Initiative (MEPI).", "The\nprogram offers students from the Middle East and North Africa region a\nunique scholarship opportunity to pursue quality higher education and\nearn a master’s degree in one of the following fields:", "M.A. in Applied Economics – 30 credits (Beirut Campus)", "M.A. in Interdisciplinary Gender Studies – 30 credits (Beirut Campus)", "M.A. in International Affairs – 30 credits (Beirut or Byblos Campus)", "M.A. in Migration Studies – 30 credits (Beirut Campus)", "Requirements:", "To be eligible to apply, you must:", "Be committed to complete your Master’s degree within two-years-starting Fall 2019", "Be committed to pursue hands-on public policy research and work as a part of your Master’s program.", "Demonstrate academic excellence.", "Be a citizen of: Algeria, Jordan, Lebanon, Libya, Morocco, Syria, Tunisia, or Yemen.", "Demonstrate\nfinancial need status per MEPI and LAU’s Financial Aid policies.\nApplicants should be underrepresented or economically disadvantaged\nstudents and should submit the relevant Financial Aid application as per\nthe below.", "Note: American citizens and Green Card holders are not eligible to apply.", "Benefits:", "If you are accepted, the scholarship will cover the following:", "Full tuition fees", "Medical insurance", "A $500 USD monthly stipend while registering on a full-time basis", "Student housing during school months", "Laptop", "Internship opportunity", "Annual round-trip economy air ticket from home to campus", "How to Apply:", "To apply, complete and submit parts A & B below by ", "March 31, 2019", ":", "A. Email the below required documents to: ", "[email protected]", "Completed LAU-TLG admission application at ", "A recent passport-size photo.", "Identity card or passport (should be the same as the nationality to be used in the registration process at LAU).", "Educational certificates or diplomas (Bachelor, License, etc).", "Official transcript(s) of grades from all colleges or universities attended. ", "Upon acceptance, applicants will be requested to present the official transcript(s) in a sealed envelope(s). Failure\nto declare enrollment at other institutions could result in an\ninvalidation of admission, and any credits or degrees earned.", "Personal\nEssay, of at least 1,000 words, describing your background and your\nreasons for wishing to pursue graduate studies, how your character and\nexperiences have formed you into someone who will contribute positively\nand effectively to not only the department but the academic discipline\nas a whole. Provide details of social, educational, cultural, or\neconomic obstacles you have overcome in your journey to get to where you\nare today and your future objectives. Please highlight what is unique\nabout you and how you will advance diversity within the institution.", "A\nresearch statement describing your research interests and professional\ngoals, how you plan to accomplish them, and why one of the four programs\nis best suited for you to do so. Be specific about your specialized\ninterests within your major field and how it relates to the description\nlisted in the below programs description and research focus. ", "Be\nclear about the kind of program you expect to undertake, and explain how\nyour study plan connects with your previous training and future goals.", "Recommendation letters from two professors who are familiar with your academic performance.", "Certificate(s) of employment with a CV, if you have relevant work experience(s).", "Official scores of English proficiency test (depending on the university/college attended) by submitting one of the below:", "Internet-based TOEFL (IBT), with a minimum score of 90. The code for LAU is  ", "2595", ". The institutional TOEFL is not accepted. ", "Academic IELTS with a minimum score of 7.", "Applicants\nwith Internet –based TOEFL (IBT) scores between 80 and 89 and IELTS\nscores of 6.5, have to register for ENG009 Remedial English, a\nthree-credit course, or retake and ", "pass the English test within the first year of enrollment. ", "IBT and IELTS scores below 80 and 6.5 respectively are not acceptable.", "N.B.", " English\nproficiency exams may not be required from applicants from universities\nrecognized by LAU where the language of instruction is English.", "B. Download and complete the compulsory financial aid application", "Fill out the ", "MEPI Financial AID Application", "Email it with all financial aid supporting documents to: ", "[email protected]", " (make sure you indicate “TLG-MEPI applicant” in the subject line).", "For More Information:", "Visit the Official Webpage of the MEPI Tomorrow’s Leaders Scholarship Program 2019"], "url : https://www.opportunitiesforafricans.com/middle-east-partnership-initiative-mepi-tomorrows-leaders-scholarship-program-2019/"], [["The Engineering for Development (E4D) Continuing Education Scholarship Programme 2019", "date announced:February 11, 2019", "Application Deadline: 30 November 2019 "], ["Application Deadline: 30 November 2019 ", " ", "The Engineering for Development (E4D) Continuing Education Scholarship Programme", " awards scholarships to candidates from low-income countries to attend continuing education programmes at ETH Zurich. The goal of the programme is to enhance the knowledge and skills of future leaders with the perspective of contributing to capacity development and poverty reduction in their home countries. The E4D programme is funded through the Sawiris Foundation for Social Development.", "The E4D Continuing Education Scholarship Programme covers ETH Master of Advanced Studies (MAS), Diploma of Advanced Studies (DAS) and Certificate ofAdvanced Studies (CAS) programmes. ", " Type of programmes eligible for the E4D scholarship", "All MAS, DAS and CAS programmes at ETH Zurich are open for E4D Continuing Education Scholarships", " Financial Support", "The E4D Continuing Education Scholarship covers the following expenses:", "•Economy roundtrip ticket (max. 2’000 CHF) ", "•Visa fees", "•Living allowance for the duration of the programme: 2’000 CHF per month if the programme is longer than 3 weeks (full-time programme). 800 CHF per week if the programme duration is up to 3 weeks.", "•ETH general tuition fee: 580 CHF per semester (in the form of a tuition fee waiver) ", " Note: Programme fees cannot be covered by the E4D Continuing Education Scholarship. Some of the programmes offer a fee reduction for candidates from low-income countries. Please get in touch with the programme management to inquire whether a fee reduction can be granted. ", "Eligibility ", "The candidate must hold a completed and recognised Master’s degree from a university and proof of professional working experience of at least 2 years. ", " The minimal English standard is TOEFL level C1.", "The scholarship is open to candidates from countries classified as Least Developed Countries, Low Income Countries and Lower Middle Income Countries according to the DAC-list of the OECD5. ", "A list of eligible countries can be found in Attachment 1. ", "Moreover, the candidate must have been accepted to an ETH MAS, DAS or CAS programme based on his/her academic and professional qualifications.", "Application Process", " The application process comprises two steps.", "1. Application to the selected MAS, DAS or CAS programme.", " 2. Application to the E4D Continuing Education Scholarship Programme. ", "Note: Candidates will only be considered for an E4D Continuing Education Scholarship if admitted to an ETH MAS, DAS or CAS programme. ", "Deadlines", "30 April 2019 ", " 30 November 2019", "Please submit your application to ", "[email protected]", ".", " ", " Application Criteria", " Motivation\nletter, stating the motivation to attend the programme and the impact\nfor the candidate’s career development and beyond", " Curriculum Vitae", " University Diploma and transcripts", " Two professional references", " Certificate of employment", "For More Information:", "Visit the Official Webpage of the E4D Continuing Education Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/the-engineering-for-development-e4d-continuing-education-scholarship-programme-2019/"], [["The Spanish National Cancer Research Centre (CNIO) Summer Laboratory Training Programme 2019 for Undergraduate Students – Madrid, Spain (Fully Funded)", "date announced:March 5, 2019", "Application Deadline: March 31st 2019"], ["Application Deadline: March 31st 2019", "The Spanish National Cancer Research Centre (CNIO)", " announces up to 8 vacancies for undergraduate students to work in a lab at the CNIO over the summer.", "The programme runs from June, 24 to August 16, 2019, and is open to undergraduate students of any nationality who have passed at least 2/3 of the total credit points (courses or exams) required for a Life Sciences or Biomedicine-related undergraduate degree (e.g. Biology, Biomedicine, Biochemistry, Pharmacology, Bioinformatics).", " APPLICATION REQUIREMENTS 1", "-You must have passed at least 2/3 of the total credit points (courses or exams) required for a Life Sciences or Biomedicine-related undergraduate degree (in any country). ", "2-You must maintain your undergraduate student status throughout thewhole summer programme (June 24 to August 16, 2019).", "3-You must have an excellent academic track record witha Grade Point Average (GPA) above 0.75 (with your GPA as the numerator and the highest possible GPA as the denominator).", "4-You must have a good knowledge of English.", "5-You must be available from June 24 to August 16 (8 weeks) to attend the training programme. If you cannot be at the CNIO during this period,you will not be eligible for the programme ", "Benefits:", "Travel\nexpenses and meals at the CNIO cafeteria will be covered for summer\ntraining programme students during their stay at the centre. In\naddition, students without public health assistance benefits in Spain\nwill be covered with a private health insurance provided by the CNIO for\nthe same period of time (8 weeks).", "Each student will be matched\nwith a specific laboratory based on the student’s interest and\nbackground. The student will be working under the supervision of the\ngroup/unit leader or a member of the research group. The participants\nwill attend a series of seminars given by faculty members and\nresearchers from the CNIO. Students will be required to present the\nresults of their summer projects at the end of the programme.", "Fellowships will be awarded on a competitive basis taking into consideration the student’s academic record and letter of motivation", " APPLICATION PROCEDURE", "Only online applications will be considered. ", "To apply go to https://www.cnio.es/en/education-and-career-development/career-development-programmes/laboratory-training-programme-undergraduate-summer-sessio/and complete the application form, choosing threelaboratories in the order of preference.", " Please attach your CV in pdf format;doc and rtf formats are also accepted. Please note that the size of this document must not exceed 1MB.", "Only shortlisted candidateswill be asked tosend the following documents by e-mail to ", "[email protected]", ": ", "1.Two letters of recommendation", "2.Copy of an official Transcript of Records, Academic Transcript or Certification, stating the number of credits passed", "3.Copy of the National Identity Card or Passport4.Proof of having a valid health insurance, whether public or private, during the whole summer stay. Citizens from countries issuing the European Health Card (EHC), including Spanish nationals, must present this documentation. ", "For More Information:", "Visit the Official Webpage of the CNIO Summer Laboratory Training Programme 2019 "], "url : https://www.opportunitiesforafricans.com/the-spanish-national-cancer-research-centre-cnio-summer-laboratory-training-programme-2019/"], [["The Mandela Institute for Development Studies (MINDS) Old Mutual Post-graduate Scholarships 2019 for young Africans", "date announced:February 19, 2019", "Application Deadline: Ongoing"], ["Application Deadline: Ongoing", "The Mandela Institute for Development Studies (MINDS)", " offers scholarships to African students who wish to pursue post-graduate studies within Africa, but outside of their own countries. Through tailored leadership development activities, the ", "MINDS Scholarship Programme", " ", "nurtures leaders who have a continental development mindset; leaders who will facilitate greater cooperation between African countries.", "MINDS Scholarships are applicable to full-time studies of a one or\ntwo-year Honours or Master’s degree at one of the MINDS preferred\ninstitutions in Africa. As one of the partners of the programme, Old\nMutual sponsors studies related to Actuarial Sciences, Finance, Business\nSciences and Accounting for students studying in South African, Kenyan\nand Nigerian institutions.", "Each scholarship covers the expenses below, depending on whether a partial or full scholarship is awarded:", "Tuition", "Accommodation and meals", "One return ticket per duration of studies", "A fixed stipend", "Individuals with a Pan-African outlook, demonstrated leadership\nability and an excellent academic record who wish to study elsewhere on\nthe African continent, but outside their home country, are invited to\napply for the scholarships.", "Institutions ", "Strathmore University, Kenya", "University of Cape Town, South Africa", "University of Witwatersrand, South Africa", "Kwame Nkrumah University of Science & Technology, Ghana", "University of Ibadan, Nigeria", "University of Development Studies, Ghana", "Scholarships will be awarded to meritorious applicants following a rigorous selection process.", "To be considered for a MINDS Scholarship, you must:", "Be a national of an African country, residing in any African country;", "Have been formally accepted by one or more MINDS preferred\ninstitution/s outside of your country of citizenship and/ or residency;", "Have been formally accepted by one or more MINDS preferred\ninstitution/s to pursue postgraduate studies within the following year;", "Have obtained at least 70% in each subject/ course in the last two completed years of study;", "Produce evidence of demonstrated leadership abilities or potential\nguided by the questions/ requirements set out in the application form;", "Submit a complete application form with the required supporting documentation as set out on the application form.", "For More Information:", "Visit the Official Webpage of the MINDS Old Mutual Post-graduate Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/minds-old-mutual-post-graduate-scholarships-2019/"], [["OPEC Fund for International Development (OFID) 2019/2020 Scholarships for Students from Developing Countries (Fully Funded)", "date announced:March 15, 2019", "Application Deadline: April 14, 2019. "], ["Application Deadline: ", "April 14, 2019. ", " ", "The OFID Scholarship Award", " supports outstanding young individuals from developing countries so that they are able to pursue graduate studies in a development-related field. The program, which is currently in its thirteenth year of operation, has to date helped over 50 young people complete their education. Last year, OFID received close to 9,000 applications. ", "The Scholarship portal is now open to receive applications. ", "Benefits:", "\nThe tuition fees, including any supplementary examination fees, as may\nbe required by the academic institution, will be paid by OFID directly\nto the academic institution. Health insurance will be paid in accordance\nwith the institution’s own standard medical scheme.", "\nA monthly allowance to cover living expenses, books and accommodation,\nwill be transferred to the student’s own personal bank account.", "\nPrior to the start of his/her first year studies, the student will be\npaid a relocation grant. OFID will also pay for travel costs from the\nnearest airport to the student’s place of residence, to the nearest\nairport to the chosen place of study. Upon completion of the studies,\nthe student will be paid the cost of one-way air ticket to his/her home\ncountry.\n", "Eligibility", "Must be between the ages of 23-32 at the time of submitting his/her application.", "Must\nhave obtained or be on the verge of completing their undergraduate\ndegree with a Baccalaureate from an accredited college/university, or\nits equivalent.", "Must have a minimum cumulative GPA of 3.0 or higher on a 4.0 rating system, or its equivalent.", "Must\nbe matriculated at an accredited university for the upcoming academic\nyear starting August/September 2018, and must maintain full-time status\nfor the duration of the Master’s Degree.", "Must\nbe a national of a developing country—please refer to the list of\neligible countries. Please note that nationals of OFID Member Countries\n(Algeria, Ecuador, Gabon, Indonesia,  Iran, Iraq, Kuwait,  Libya,\nNigeria, Qatar, Saudi Arabia, United Arab Emirates, Venezuela) are\nineligible to apply. ", "Must\nselect a subject of study that pertains to OFID’s core mission, such\nas: economics of development (poverty reduction, energy and sustainable\ndevelopment), environment (desertification), or other related science\nand technology fields.", "PLEASE NOTE", ": Kindly read ALL of the directions below before proceeding with the application process:", " ", " Applicants are responsible for gathering and submitting all necessary information. Applications will be evaluated based on the information provided. Therefore, all questions should be answered as thoroughly as possible. ", "Incomplete applications will not be considered.", " Once an application has been submitted, no changes will be allowed.", "Required Documents", "A completed on-line application form.", "A scanned copy of the applicant’s passport.", "A scanned copy of the transcripts/certificates from the highest level of education completed.", "A scanned letter of acceptance from chosen educational\ninstitution, confirming your admission, subject of study and duration of\nthe Master’s degree program. ", "A proof of meeting any prerequisites, including language proficiency.", "A short essay – of about 500 words in English – giving reasons\nfor applying for the OFID scholarship, explaining your educational\ngoals, and clearly describing how\nyou will use the experience gained from your Master’s degree studies\nto help in the development of your home country.", "Two letters of recommendation from professors and/or lecturers at applicant’s present university (or present employer).", "Curriculum Vitae (CV).", "Application Procedure:", "STEP 1: ", "Ensure that you fulfill the OFID Scholarship Award Eligibility Criteria and all necessary documents are ready for submission.", "STEP 2:", " Register within the OFID Scholarship\nPortal by using your email address. Please note you can log onto the\nportal as many times as required before finally submitting the\napplication.", "STEP 3:", " Fill out the application form. Make\nsure to save data each time you update your application. Once you are\nlogged in, if the page remains inactive for more than two hours, your\nsession will time-out and you may lose unsaved data. Do not submit your\napplication until you have completed the entire application process!", "STEP 4:", " Upload necessary documents: CV, two\nrecommendation letters, certificates/transcripts from the highest level\nof completed education, acceptance letter into postgraduate program,\npassport copy and personal essay.", "STEP 5: ", "When your application is complete, and\nall additional documents are uploaded, your application is ready to be\nsubmitted. Once your application is submitted, you can no longer make\nany changes or upload any more documents.", "\nThe application deadline is April 14th , 2019", ". Please do not\ncall or email OFID to see if your application has been received or to\ninquire about your status. You will receive an automated confirmation\nonce your application has been submitted. Only the winners will be\nnotified by ", "June  2019 ", "and announced on our website.", "For More Information:", "Visit the Official Webpage of the OFID 2019/2020 Scholarships "], "url : https://www.opportunitiesforafricans.com/ofid-2019-2020-scholarships/"], [["AfDB Next African Global IT Leaders Program 2019 for young Africans (Fully Funded Masters degree in South Korea)", "date announced:February 9, 2019", "Application Deadline: 1700 hrs on 9th April, 2019 (Seoul time). "], ["Application Deadline: 1700 hrs on 9", "th", " April, 2019 (Seoul time). ", "The African Development Institute of the African Development Bank", " is implementing the next", " African Global IT Leaders Programme", " under the aegis of the ", "Korea-Africa Economic Cooperation (KOAFEC) Knowledge Sharing Programme (KSP)", ". The objective of the programme is to create across the African continent a critical mass of global IT experts: highly trained professionals in ICT.", "The secondary objective of\nthe programme is to expose mid-career professionals in African countries\nto the latest techniques and knowledge available through graduate\nstudies at higher educational institutions in Korea. Upon completion of\ntheir studies, the scholars are expected to return to their home\ncountries to apply and disseminate their newly acquired knowledge and\nskills to enhance the development of their countries.", "This two-year Masters degree programme in Information Technology provides integrated courses focused on the IT technologies and Korean business strategies. It also offers opportunities for networking with Korean IT industrial companies through classes and seminars; field trips to traditional sites to experience Korean culture and history; and on-site workshops at IT companies.", " ", " The rigorous student selection focuses on employees working in the field of ICT in public and private sector in the Bank’s regional member countries. Applicants should additionally have the following qualifications:", " 1. A certified Bachelors degree in an IT-related area", " 2. A certificate of English proficiency: TOEFL (iBT 83, PBT 560, CBT 220), IELTS 6.5, TEPS 599, TOEIC 720 or higher). These should have been taken at most two years before the deadline of the application", " 3. A public official, employee of public institutions or senior-level researcher at national research institutes working in IT fields (employees from private companies will not be considered)", " 4. Korean citizens are excluded – this also applies to Korean citizens with dual citizenship. ", "Application Procedure:", "\nPlease apply online on ", "https://apply.kaist.ac.kr/intergradapply", " before 1700 hrs on 9", "th", " April, 2019 (Seoul time). Further details are available in the ", "attached guideline", ". \n", "For More Information:", "Visit the Official Webpage of the AfDB Next African Global IT Leaders Program 2019"], "url : https://www.opportunitiesforafricans.com/afdb-next-african-global-it-leaders-program-2019/"], [["DAAD In-Region Masters & PhD Scholarships 2019/2020 for study in East Africa (Funded)", "date announced:March 3, 2019", "Application Deadline: March 31st 2019"], ["Application Deadline: March 31st 2019", "The DAAD awards", " funding to Sub-Saharan African students for Master or PhD degrees in their home country or in another Sub-Saharan African country outside their home country. These In-Region scholarships lead to mobility of researchers between Sub-Saharan African countries and capacity building at African universities.", "DAAD In-Region scholarships are generally awarded for specific fields of study. In South Africa, for instance, other Sub-Saharan African Nationals can obtain a Master degree in human rights law with an In-Region scholarship at the ", "Centre for Human Rights", " (CHR) based at the University of Pretoria. Likewise, a South African citizen may apply for a ", "In-Region scholarship for a PhD in Development Studies at the ", "Institute of Statistical, Social and Economic Research", " (ISSER) ", "based at the University of Ghana. Some of the In-Region scholarships in certain countries, however, are awarded to citizens of those same countries.", " ", "DAAD In-Region scholarship", " holders are eligible for exciting funding opportunities in addition to the scholarship they have received for their full-time Master or PhD degree in Sub-Saharan Africa. They may choose to apply for DAAD funding for a Short-Term Research Visit of 2 – 6 months to Germany and/or attend one of six summer schools on offer in Germany during their funding period with the DAAD. They are thus able to gain experience and network in African countries as well as in Germany. ", "In-Region Scholarships in South Africa", "The centres or departments at the South African universities below\nhave DAAD In-Region scholarships available for postgraduate study. The\nscholarships at the centres below are generally only open to other\nAfrican Nationals. South Africans may apply for the ", "DAAD-NRF In-Country Scholarship", " for postgraduate studies in South Africa.", "There are currently no calls open for applications for In-Region scholarships in South Africa.", "AIMS | Mathematics", "CHR | Law, Human Rights", "Rhodes University | Biochemistry and Microbiology", "Stellenbosch University | Management and Economics Sciences", "UCT | African Paediatric Fellowship Programme", "UNISA | Nanosciences", "University of Pretoria | Agriculture and Environmental Sciences", "In-Region Scholarships in Sub-Saharan Africa", "Below are open calls for applications for In-Region Scholarships in\nSub-Saharan African countries outside South Africa. All Sub-Saharan\nAfrican Nationals may apply for these scholarships.", " ", "Download: 31 March 2019 | African Economic Research Consortium | PhD | Agriculture Economics (pdf, 175.91 KB)", " ", "Download: 31 March 2019 | Ethiopia | Master | Agroforestry and Soil Management (pdf, 191.47 KB)", " ", "Download: 31 March 2019 | Ethiopia | PhD | Peace and Security Studies (pdf, 174.33 KB)", " ", "Download: 31 March 2019 | Kenya | Master | Medical-Surgical Nursing, Public Health (pdf, 176.05 KB)", " ", "Download: 31 March 2019 | Kenya | Master/PhD | Biotechnology, Environmental Planning, Renewable Energy (pdf, 177.37 KB)", " ", "Download: 31 March 2019 | Kenya | Master/PhD | Computer Science/Information Technology, Mathematical Sciences and Finances (pdf, 176.73 KB)", " ", "Download: 31 March 2019 | Kenya | Master/PhD | Education (pdf, 176.78 KB)", " ", "Download: 31 March 2019 | Kenya | PhD | Health Management (pdf, 175.79 KB)", " ", "Download: 31 March 2019 | Kenya | PhD | Insect Science (pdf, 175.93 KB)", " ", "Download: 31 March 2019 | Kenya | PhD | Mathematics (pdf, 192.37 KB)", " ", "Download: 31 March 2019 | Kenya | PhD | Mechanical Engineering, Information Technology (pdf, 176.84 KB)", " ", "Download: 31 March 2019 | Sudan | Master | Family Medicine (pdf, 179.79 KB)", " ", "Download: 31 March 2019 | Tanzania | Master | Law (pdf, 175.89 KB)", " ", "Download: 31 March 2019 | Tanzania | PhD | Urban Planning, Housing, Built Environment Analysis (pdf, 212.26 KB)", " ", "Download: 31 March 2019 | Uganda | Master | Public Health (pdf, 191.08 KB)", " ", "Download: 31 March 2019 | Uganda | Master/PhD | Plant Breeding, Environmental and Natural Resource Management (pdf, 178.14 KB)", "For More Information:", "Visit the Official Webpage of the DAAD In-Region Masters & PhD Scholarships 2019/2020 "], "url : https://www.opportunitiesforafricans.com/daad-in-region-masters-phd-scholarships-2019-2020/"], [["The Intergovernmental Panel on Climate Change (IPCC) Scholarships 2019 for PhD students from developing countries.", "date announced:February 27, 2019", "Application Deadline: 22 March 2019. "], ["Application Deadline: 22 March 2019. ", "The IPCC Scholarship Programme ", "provides scholarships for ", "PhD students from developing countries ", "for research that advances the understanding of the scientific basis of risks of climate change, its potential impacts and options for adaptation and mitigation.", " ", "The Intergovernmental Panel on Climate Change (IPCC)", " has launched a call for a  applications for the 5th round of scholarship awards. ", "The IPCC will accept applications from PhD students that have been\nenrolled for at least a year or are undertaking post-doctoral research.\nApplicants should be citizens of a developing country with priority\ngiven to students from Least Developed Countries (LDCs) and Small Island\nDeveloping States (SIDS).", "The IPCC created its scholarship programme with the prize money from\nthe Nobel Peace Prize that it was jointly awarded in 2007 for its work\nin building up and disseminating knowledge about climate change and\nlaying foundations for response options. The IPCC decided to invest the\nNoble Prize money in post-graduate education for early career\nscientists.", "Research proposals are encouraged from, but are not limited to, the\nfollowing fields of study: underlying science of climate change; climate\nand water; climate and oceans; socio-economic modelling related to\nclimate change; regional climate change, vulnerability, impacts and\nadaptation; attaining the goals of the Paris Agreement; synergies\nbetween adaptation and mitigation; and climate solutions in the context\nof the sustainable development goals (SDGs).", "Each scholarship award is for a maximum amount of 15,000 Euros per year for up to two years during the period 2019-2021.", "Applicants should register via the application portal here: ", "https://apps.ipcc.ch/scholarship/applicant/", "   The deadline is ", "midnight CET ", "on", "  22 March 2019. ", "Applicants will need to complete and upload an application form,\ntheir research proposal, scanned copies of national identity card and\npassport, a provisional budget and proof of completion of at least one\nyear of PhD studies or proof of initial work as a post-doctoral\nresearcher and supervisor’s support letter. The forms are available via\nthe portal, once registered. ", "For More Information:", "Visit the Official Webpage of the ", "IPCC Scholarship Programme", " "], "url : https://www.opportunitiesforafricans.com/ipcc-scholarships-2019-for-phd-students-from-developing-countries/"], [["IMU/CDC Graduate Research Assistantships in Developing Countries (GRAID) Program 2019", "date announced:February 14, 2019", "Application Deadline: March 15th, 2019. "], ["Application Deadline: March 15th, 2019. ", "IMU/CDC ", "has established the ", "Graduate Research Assistantships in Developing Countries (GRAID) Program.", "The Program provides research assistantships to graduate – PhD and\nMaster – students of emerging research groups working in a developing\ncountry listed in Priority 1 or 2 of the ", "IMU CDC Definition of Developing Countries", ".\nIt provides modest support for emerging research groups, making it\npossible for them to fund their most talented students as graduate\nresearch assistants, thereby fostering the growth of a mathematics\ncommunity.", "It is assumed that the emerging research group has an ongoing\ncollaboration with an international mathematician. The students will\nreceive a monthly stipend to study full-time and pursue a Master or PhD\ngraduate degree in mathematics and they will be supported additionally\nby linking their research with an international mathematician.", "Funding for the graduate research assistantships will be provided by voluntary donations from mathematicians or mathematical institutions worldwide.", "Worth:", "The amount of the\nstipend per graduate research assistant should not exceed USD 3,500 per\nyear. The exact amount will be decided by the GRAID Committee on a\ncase-by-case basis depending on the local cost of living. One Team can\napply for up to 3 graduate research assistantships.", "The following costs can be covered by the stipend:", "Accommodation expenses of the graduate research assistant", "Basic living expenses", "Duration of the Support", "For PhD students the\nstipend will typically cover 4 years depending on satisfactory progress\nbased on annual reports. Extensions for up to 6 months will be decided\nat the discretion of the GRAID Committee.", "Master students will typically be funded for 1 year. Extensions for\nup to 6 months will be decided at the discretion of the GRAID Committee", "Application Process", "We invite applications from Teams consisting of:", "the ", "Principal Investigator (PI)", " plus his or her research group, and", "the ", "International Partner", ".", "For More Information:", "Visit the Official Webpage of the GRAID Program 2019"], "url : https://www.opportunitiesforafricans.com/imu-cdc-graduate-research-assistantships-in-developing-countries-graid-program-2019/"], [["Standard Bank Chartered Accounting CA(SA) Programme 2019 for Young South Africans", "date announced:March 13, 2019", "Application Deadline: 14 June 2019 "], ["Application Deadline: ", "14 June 2019", " ", "If you think you’ve got what it takes to be one of the best and brightest in the accounting field, the", " ", "Chartered Accounting CA(SA) graduate programme", " ", " will help you gain the essential financial management skills, commercial exposure and leadership capabilities needed to further a stellar career. We are looking for future leaders with innovative and creative mind-sets that will keep on moving forward. ", " ", "By rotating through our different business areas, you’ll fulfil the requirements of the South African Institute of Chartered Accountants (SAICA), and maybe even travel a little on the side by working outside of South Africa. ", "Key qualifications: Completed or completing SAICA-accredited Certificate in the ", "– Theory of Accounting,\n", "– Honours (HNS) in Accounting\n", "– Graduate Diploma in Accounting (GDA) or equivalent. ", "Citizenship:", " South African", "Duration:", " 36 months ", "For any further information please contact Ziyaad Khan | ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Standard Bank Chartered Accounting CA(SA) Programme 2019"], "url : https://www.opportunitiesforafricans.com/standard-bank-chartered-accounting-casa-programme-2019/"], [["Makerere University MasterCard Foundation Scholars Program 2019/2020 for Undergraduate Study in Uganda (Funded)", "date announced:February 8, 2019", "Application Deadline: 5.00pm on Friday 10th May 2019. "], ["Application Deadline: 5.00pm on Friday 10th May 2019. ", " Since 2014, ", " Makerere University ", "in partnership with Mastercard Foundation, has provided scholarships at the undergraduate level to academically talented, yet financially disadvantaged students from Sub-Saharan Africa. Recipients of this scholarship are provided with comprehensive financial, academic as well as social and leadership development support for the entire period of their study at the University. ", "Makerere University is now pleased to announce 455 undergraduate scholarship opportunities (388 young women and 67 young men) for national (89%) and international (11%) students joining the University for academic year 2019/2020. ", "Eligibility Requirements:", " The applicant", "a. Must be admitted to study at Makerere University main campus in the academic year 2019/2020. This means that in order to fit within the Makerere University admission guidelines, all Scholarship applicants should endeavour to apply for admission when Makerere University advertises for private sponsorship. ", "b. Must be from an economically disadvantaged background, and a citizen of any country in Africa.", "c. Should exhibit academic excellence in either Sciences or Arts with a minimum of 11 points for young women and 15 Points for young men obtained in Uganda Advanced Certificate of Education (U.A.C.E) or its equivalent from 2016, 2017, and 2018.", " d. Must demonstrate leadership potential and commitment  to social betterment.", "e. Must have a record of community service.", "f. Should not be a holder of any other Scholarship.", "g. Should not have completed any Diploma or Undergraduate studies.", "h. Should not be a registered student of any university or tertiary ", "Application Procedure:", " Applicants should obtain and complete the Scholarship Application Forms at no cost from ", "Makerere University, Senate Building Level 4, Room 402, or Download the application forms from the Mastercard Foundation Scholars Program at Makerere website on", " http://mcfsp.mak.ac.ug or visit Makerere University website at http://mak.ac.ugSubmit completed application forms to the address in (1) above by 5.00pm on Friday 10th May 2019.", "If submitting by email as an attachment, ensure the scanned copy of the scholarship application form is clearly legible and send to ", "[email protected]", "/ ", "[email protected]", "Downloadable Resources", " Full Advert – Call for Applications Academic Year 2019/2020", " Scholarship Application Form – 2019", " Application Guidelines 2019", "For More Information:", "Visit the Official Webpage of the Makerere University MasterCard Foundation Scholars Program 2019/2020 "], "url : https://www.opportunitiesforafricans.com/makerere-university-mastercard-foundation-scholars-program-2019-2020/"], [["Qalaa Holdings Foundation Scholarships 2019/2020 for Young Egyptians (Fully Funded)", "date announced:February 15, 2019", "Application Deadline: April 15th 2019"], ["Application Deadline: ", "April 15th 2019", " ", "The Qalaa Holdings Scholarship Foundation", " ", "was created in 2007, out of a strong will to contribute to national development through creating high caliber professionals to help enhance Egypt’s growth in all sectors. The Foundation is funded by an endowment from Qalaa Holdings to grant academic scholarships for talented and promising young Egyptian men and women to pursue master degrees abroad in all fields of study. ", "Benefits:", "\nThe QHSF funds under two schemes: the full scholarship covering tuition\nand living expenses and the partial scholarship covering tuition only.\nThe ceiling for tuition fees is 50,000 USD per annum.\n", "Eligibility criteria for application:", "Applicant must be under the age of 35.", "Must be an Egyptian national and residing in Egypt.", "Applicant must have a minimum of two years of work experience post-graduation.", "Is planning to pursue his/her studies at one of the top universities abroad in their discipline of choice.", "Must have been accepted at the university and program of interest.", "Applicant must submit an unconditional acceptance letter (with the exception of a funding condition).", "Excellent command of language of study. Good command of the English language.", "Involvement with activities in civic, public or international affairs (NGOs, volunteer work, etc) will be an asset.", "Must have a genuine financial need.", "Not a beneficiary of any other partial scholarship or grants (with exception to waivers from the university of choice itself).", "Upon completion of program, graduates must be committed to return to work in Egypt for a minimum of 2 years.", "Military service status must be clear (for males).", "QHSF reserves the right to require\nadditional conditions as seen necessary. QHSF also retains the right to\nwithdraw scholarships at its own discretion.", "Timeline:", "January 15th:", "Beginning of round. Applicants can begin submitting applications. Application form made available online.", "April 15th:", "Deadline for submitting applications.", "May:", "Shortlisting completed. Semi-finalists contacted for personal interviews.", "June:", "Scholarship recipients announced.", "July – August:", "Placement and departure of scholars", "For More Information:", "Visit the Official Webpage of the Qalaa Holdings Foundation Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/qalaa-holdings-foundation-scholarships-2019-2020/"]]