[[["Queen Elizabeth Commonwealth Scholarships Scheme 2019 for students in Commonwealth Nations (Fully Funded)", "date announced:December 12, 2018", "Application Deadline: 4pm GMT on 6 February 2019. "], ["Application Deadline: ", "4pm GMT on 6 February 2019. ", "Applications for ", "Queen Elizabeth Commonwealth Scholarships 2019 ", "are now open. ", "Queen Elizabeth Commonwealth Scholarships ", "give talented students from anywhere in the Commonwealth the opportunity to gain a Master’s degree, while developing new skills, experiencing life in another country, and building their global networks.", "Scholarships are for students committed to creating change in their communities and contributing to the ", "Sustainable Development Goals", " (SDGs). The scholarships are named in honour of ", "Her Majesty The Queen, Head of the Commonwealth", " and ", "ACU Patron", ", and are fully funded and supported by numerous Commonwealth governments.", "By 2025, ", "the Queen Elizabeth Commonwealth Scholarship scheme", " will have created opportunities for up to 150 future leaders, by offering fully-funded scholarships at leading ACU member universities in low and middle income countries (LMICs) across the Commonwealth.", "Scholars will join an active international alumni network of more than 35,000 individuals who have benefitted from the life-changing opportunities a Commonwealth Scholarship offers, and will contribute to the development of the future Commonwealth.", "Requirements:", "\nCitizens (or those who hold refugee status) in a Commonwealth country are welcome to apply.\n", "Benefits:", "·  Queen Elizabeth Commonwealth Scholarshipsoffer a life-changing opportunity for cultural exchange and academiccollaboration in unique environments across the globe ", "·  Awards are fully funded, providing tuition\nfees, a return economy flight, an arrival allowance, and a regular stipend\n(living allowance) ", "·  Awards are for Master’s degrees and are not\napplicable to distance learning courses ", "·  Awards are open to citizens of all\nCommonwealth countries, other than the host country ", "·  Award holders will build deeper and stronger\nlinks across the Commonwealth network, acting as ambassadors between home and\nhost countries", "How to Apply:", " Click on your preferred subject area below to apply:", "Arts and humanities", "Medicine, health and life sciences", "Physical sciences, engineering and mathematics", "Social sciences﻿", "For More Information:", "Visit the Official Webpage of the Queen Elizabeth Commonwealth Scholarships Scheme 2019 "], "url : https://www.opportunitiesforafricans.com/queen-elizabeth-commonwealth-scholarships-scheme-2019/"], [["Al Ghurair STEM Scholars Program 2019/2020 for young Arab Citizens (Funded)", "date announced:December 17, 2018", "Application Deadline: January 27th 2019"], ["Application Deadline: January 27th 2019", "Applications for the", " Al Ghurair STEM Scholars Program 2019", " ", " are now being accepted", "Getting a top quality Bachelor’s or Master’s degree is not always possible for young Arabs, especially if finances are a barrier. If you are an exceptional student with a passion for", " Science, Technology, Engineering or Math (STEM) ", "and you are curious, creative, and determined to pursue your dreams regardless of your circumstances, the", " Al Ghurair STEM Scholars Program ", "can offer you the scholarship and support system you need to realize your goals.", "Requirements:", "Arab Citizen", "You must hold no other passport. Preference given to residents of Arab world for at least 12 years.", "15-30 years old for undergraduate applicants, you must have graduated from high school within the last 4 years.", "Academically high-achieving", "You must have a cumulative GPA of no less than 85% in high school or 3.0 in university.", "REQUIRE FINANCIAL SUPPORT", "You must be willing and able to show proof of your financial need in your application.", "Applying to a Partner University", "You must be planning to apply or currently attending one of our partner universities.", "Benefits:", "Financial support", ": The scholarship includes support towards:\n", "University tuition and other mandatory university fees", "Health insurance, as per the university plan", "Housing costs, travel airfare and visa costs for students living away from family", "Transportation, books, and other living expenses", "Non-financial support:", " The program also offers scholars a number of opportunities provided both through the university and/or through the Foundation. These include:\n", "Access to a network of Al Ghurair Scholars around the world", "Community service experience", "Hands-on experiences", "Academic advising, career counseling and mentorship", "All Al Ghurair STEM Scholars are expected to fulfill certain academic and non-academic responsibilities. Once scholars are selected, they will be required to sign a student agreement with the Foundation that outlines a number of conditions. Most importantly, these include:\n", "Academic", " – maintaining a semester and cumulative GPA of 3.0, taking a minimum load of credits/semester as advised by the Foundation, not failing any courses, and maintaining a high level of discipline, attendance and engagement in class", "Other activities", " – participating in community service activities, completing an internship, taking part in mentorship programs and other leadership workshops, making use of the university career services office, and participating in extracurricular activities", "Communication and reporting", " – regularly engaging with the university student coordinator as well as reporting and sharing information with the Foundation through the scholars’ online portal", "Timeline:", "\nAPPLICATION CYCLE OPENS\n16/12/2018\n", "\nAPPLICATIONS CLOSE\n27/01/2019\n", "\nAPPLICATION CYCLE FOR ALL OTHER UNIVERSITIES\n10/02/2019\n", "\nINTERVIEWS COMMENCE\n05/03/2019\n", "\nSCHOLARS ANNOUNCED\n 11/04/2019\nThe 2019 Al Ghurair STEM Scholars are announced at AUB, AUC, and AUS.\n11/04/2019\n", "For More Information:", "Visit the Official Webpage of the Al Ghurair STEM Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/al-ghurair-stem-scholars-program-2019-2020/"], [["University of Dundee LLM International Energy Law and Policy (£5,000 scholarship Available)", "date announced:December 13, 2018", "Application Deadline: May 30th 2019"], ["Application Deadline: May 30th 2019", "Are you a Bachelor student looking to study a Master of Law? Want to shape the future of the international energy industry?", "The University of Dundee,", " rated 3rd in the ", "UK for Law by the Guardian University Guide 2019,", " trains lawyers and non-lawyers to meet future challenges in the international energy sector. Gain skills to critically review policy issues, and draft agreements and regulations.", "With the ", "LLM International Energy Law and Policy programme, ", "you could build a successful career in the Oil & Gas Industry or at a Global Consultancy.", "BONUS: ", "Successfully enroll into the programme, and you’ll have the chance to earn a £5,000 scholarship.", "What to do next:", "◦ ", "Sign up on Sqore", " and take a 5-min quiz to learn more about the programme", "◦ If you meet the school’s eligibility criteria, you’ll receive guidance with your decision.", "For More Information:", "Visit the Official Webpage of the University of LLM International Law & Policy Programme"], "url : https://www.opportunitiesforafricans.com/university-of-dundee-llm-international-energy-law-and-policy-scholarships/"], [["Japan Foundation United Nations University PhD Scholarships 2019/2020 for doctoral students (Fully Funded)", "date announced:December 15, 2018", "Application Deadline: 19 April 2019"], ["Application Deadline: ", "19 April 2019", "The PhD programme in Sustainability Science", " is a three-year programme that aims to produce scholars who will become key researchers in the field of sustainability science. The programme takes an innovative approach to sustainability, seeking to promote a better understanding of the issues by incorporating global change perspectives, specifically those related to climate change and biodiversity.", "The programme will equip graduates with comprehensive, multidisciplinary knowledge of sustainability problems, and deepen their understanding of the role of environmental sustainability in addressing current issues related to global change. The programme provides students with unique opportunities to interact with leading scholars and policymakers through lectures, international conferences, and workshops. ", "Students undertake problem-oriented research by playing an active role in UNU-IAS research projects, and acquire the quantitative and qualitative analytical skills necessary to understand the underlying principles of various systems involved in sustainability issues and debates. Through coursework and research, PhD students gain critical thinking and problem-solving skills, as well as the technical literacy required to address sustainability problems. ", "The programme starts in September, and by July of their third year students are expected to complete all of the course requirements, obtaining at least 14 credits. Students can select courses from those offered by UNU-IAS, while also enjoying the opportunity to take courses at other leading universities in Japan such as the", " University of Tokyo, Sophia University, and International Christian University", ".", "Requirements:", "Admission Requirements", "Applicants for the PhD in Sustainability Science are\nrequired to have met ALL of the following requirements by the\napplication deadline in order to be considered:", "1. A strong interest in sustainability studies;", "2. A demonstrated commitment to study and understand global issues;", "3. A completed Master’s degree in disciplines related to sustainability studies;", "4. A minimum of 2 years of practical field\nexperience related to UNU-IAS research themes which was acquired after\nobtaining a university degree", "OR", "Two completed Master’s degrees, at least one of which must be in a discipline related to sustainability studies;", "*Those who expect to receive a second Master’s degree before the entrance period – September 2019 – may also apply.", "5. A GPA of 3.5 or above on a 4.0 scale for at least one of the Master’s degrees earned; and", "6. English language proficiency", "The minimum score requirements for English language qualifications required by UNU-IAS are:", "600 on TOEFL – Paper-Based Testing (PBT) OR", "100 on TOEFL – Internet-Based Testing (IBT) OR", "7.0 on IELTS – Academic format", "Applicants, except for the cases below, must submit original TOEFL or\nIELTS score reports (from a test taken within the last two years) to\nthe Admissions Office at the time of application:", "Applicants whose native language is English.", "Applicants who graduated from a university or a postgraduate school located in an English speaking country.", "Applicants who completed an undergraduate or postgraduate degree programme where the language of instruction and examination was English. In this case, an official statement from the academic institution will be required, confirming the use of English as the language of instruction and examination.", "Scholarships", "The award of the scholarship below is based on application selection results. Only applicants that are accepted for enrolment in the ", "UNU-IAS PhD in Sustainability Science programme", " can be considered as candidates for the scholarship. There is no separate application form for the scholarship as it is a part of the online application for admission. Interested applicants must provide necessary information and documents for the scholarship together with the required documents for admission to the PhD degree programme.", "Scholarships provided through the Japan Foundation for UNU (JFUNU)", "Coverage", "The JFUNU scholarship provides a monthly allowance of 120,000 JPY*\nfor living expenses for a maximum of 36 months. However, travel costs to\nand from Japan, visa handling fees, and health/accident insurance costs\nmust be covered by the student. The tuition fees are fully waived for\nthe scholarship recipients.", "\n*The amount of monthly allowance has been changed to 120,000 JPY effective 2017.", "Eligibility Requirements", "Applicants must be from developing countries* who can demonstrate a need for financial assistance.", "Applicants who are currently living in Japan under a working visa are NOT eligible for the scholarship.", "Applicants who want to pursue a second PhD degree at UNU-IAS are not eligible for the scholarship.", "*Developing countries included in the latest OECD DAC list.", "For More Information:", "Visit the Official Webpage of the Japan Foundation United Nations University PhD Scholarships 2019/2020 "], "url : https://www.opportunitiesforafricans.com/japan-foundation-unu-phd-scholarships-2019-2020/"], [["Islamic Development Bank ( IsDB) Undergraduate, Masters & PhD Scholarship Programme 2019/2020 (Fully Funded)", "date announced:December 18, 2018", "Application Deadline: February 28th 2019 "], ["Application Deadline: February 28th 2019 ", "The Islamic Development Bank ( IsDB)", " is pleased to announce that calls for scholarship applications for the academic year 2019-2020 are ", "now opened through a new portal", " to receive online applications for the following programmes:", "Undergraduate Scholarship Programme", "Master Scholarship Programme", "PhD Scholarship Programme", "Post-Doctoral Research Programme", "IsDB/ISFD Scholarship Programme for Vocational Education and Training (VET)", "Joint Programme with The World Academy of Science (TWAS) in Trieste, Italy for Sustainability Science, Technology and Innovation", "The Islamic Development Bank (IDB) Scholarship Programmes", " are an important tool in the development initiatives led by the IsDB since 1983 to foster technology and knowledge sharing among member countries and Muslim communities in non-member countries. ", "The Programmes are designed to attract talented male and female students and build the right competence required to empower communities with a special focus on “Sustainability Science” in line with the approved fields to support the achievement of the Sustainable Development Goals (SDGs).", "For over (3) three decades, the Bank has been funding the following programmes for studies and researches in development-related fields and has helped to form a pool of over 9,000 well-trained and experienced development professionals and researchers transforming their countries and positively impacting future generations:", "1.", "Undergraduate Scholarship Programme", ": ", "Since 1983, the programme has offered scholarship opportunities to 13996 students to study first degree-level education. So far, 8,987 have graduated and 2,379 are currently pursuing their study.", "Benefits and facilities", " The programme covers full tuition to be paid directly to the university, monthly living and books clothing allowances commensurate with the cost of living in the country of study, health insurance, etc. ", "For the students who are selected to study outside of their own countries, the IsDB also provides them with economic class tickets to and from the countries of study (once at the beginning and at the end of study).", "To help students prepare themselves for their future leading role in the development of their communities and countries, the IsDB also provides them with extra-curricular activities under a special programme called “Mentorship Programme” to ensure their academic progress and social and psychological integration in the university as well as the local community environment", "Obligations ", "Candidates granted the Scholarship are expected to:", "1.Commit to cover, after graduation either the cost of the first year of his/her master’s degree. In this case, the IsDB will support him/her by covering the costs to complete his/her master’s degree or the tuition fees of the first year’s study for a new Undergraduate student from the same community he/she belongs to.", "2.Sign a Surety Bond stating their commitment to their studies, their return to their countries upon completion of their studies and continuing work and services to “Sustainability Science, Technology and Innovation”in their countries;", "3.Devote themselves to their studies on a full-time basis and without interruption and provide the IsDB with reports on their academic studies and activities on a regular basis;", "4.Seek or accept no other scholarship or remunerated work during their studies under the Programme which may interfere with their studies or make fulfillment of their other obligations difficult unless otherwise agreed to in writing by the IsDB;", "2.", "Master Scholarship Programme", ": ", "Since 1998, the programme has offered scholarship opportunities to 710 students to study master’s programme. So far, 364 have graduated and 142 are currently pursuing their study.", "Benefits and facilities", "The programme covers full tuition fees to be paid directly to the university, living allowance on single-status basis, health insurance, computer allowance, etc. and round-trip air-ticket and installation allowance for study abroad.", " To help students prepare themselves for their future leading role in the development of their communities and countries, the IsDB also provides them with extra-curricular activities under a special programme called “Mentorship Programme” to ensure their academic progress and social and psychological integration in the university as well as the local community environment.", "Obligations ", "Candidates granted the Scholarship are expected to:", "1.Sign a Surety Bond stating their commitment to their studies, their return to their countries upon completion of their studies and continuing work and services to “Sustainability Science, Technology and Innovation”in their countries;", "2.Devote themselves to their studies on a full-time basis and without interruption and provide the IsDB with reports on their academic studies and activities on a regular basis;", "3.Seek or accept no other scholarship or remunerated work during their studies under the Programme which may interfere with their studies or make fulfillment of their other obligations difficult unless otherwise agreed to in writing by the IsDB", "4.Respect the laws of the country of study and maintain good personal and professional conduct consistent with the rules, regulations and objectives of the Programme and the overall mission of the IsDB.", "3. ", "PhD and Post-doctoral research Programme", " :", "Since 1993, the programme has offered scholarship opportunities to 1,201 students to study PhD and undertake post-doctoral research. So far, 581 have graduated and 277 are currently pursuing their study/research.", "Concept", "The Programme offers scholarships and is designed to help promising professionals and researchers to pursue a full-time Ph.D. study and/or Post-doctoral research in key areas of development with a special focus on “Sustainability Science”in linewith the IsDB President’s new strategy to empower communities to achieve the SDGs.", "The programme study may be through course work, research or a combination of both. Whichever the mode, it must be completed within the specified three-year time frame and there is no possibility of extension with the IsDB funding.", "Benefits and Facilities", "The programme covers full tuition fees to be paid directly to the university, living allowance on single-status basis, health insurance, computer allowance, conference allowance etc. and round-trip air-ticket and installation allowance for scholar studying abroad. ", "To help students/scholars prepare themselves for their future leading role in the development of their communities and countries, the IsDB also provides them withextra-curricular activities under a special programme called “Mentorship Programme” to ensure their academic progress and social and psychological integration in the university as well as the local community environment.", "4.", " IsDB/ISFD Programme for Vocational Training and Undergraduate Studies", ": ", "This programme is an IsDB new initiative for 21 LDMCs funded by the Islamic Solidarity Fund for Development (ISFD) for the next ten years, starting from 2018 aiming at promoting entrepreneurships and reducing poverty.", "The Programme aims at providing opportunities to financially impoverished, but academically successful young men and women to pursue bachelor degree and/or technical diploma in the scientific and social disciplines. ", " The ultimate aim is to improve their socio-economic conditions and enable them to make a meaningful contribution to the development of their countries.", "Concept", "The scholarship is awarded as an interest-free Flex-Pay Installment Loan (Qard Hasan) to the students. Repayment will take place once the students finish their study and secure a gainful employment, to a", " Local Education Trust Fund (LETF)", " established in each member country benefiting from the Programme.", "Benefits and Facilities", "The programmecovers full tuition fees to be paid directly to the university, living allowance on single-status basis, health insurance, computer allowance, conference allowance etc. and round-trip air-ticket and installation allowance for scholar studying abroad.", "To help students prepare themselves for their future leading role in the development of their communities and countries, the IsDB also provides them with extra-curricular activities under a special programme called “Mentorship Programme” to ensure their academic progress and social and psychological integration in the university as well as the local community environment.", "5. ", "Joint Programme with The World Academy of Science (TWAS) in Trieste, Italy for Sustainability Science, Technology and Innovation", ": ", "This programme started in 2017 as an IsDB initiative for capacity building aiming at building critical mass in the fields of Science, Technology and Innovation (STI) to address sustainable development challenges of its member countries.", "Scope:", "The programme offers:", "Post-Doctoral Fellowships: ", "The Fellowships will support scientists for research visits of 3 months in selected Centers of Excellence. Fellowships will be awarded to scientists who will have a role in empowering their society.", "Grants for Joint Research and Technology Transfer Projects", "•The Grants will fund joint projects to bring together complementary expertise that will tackle complex global challenges that often require an interdisciplinary approach.", "•One joint project will be selected. The project will see two research groups from different IDB countries. The research question will likely focus on anissue relevant to both countries involved. Grants will be assigned on a competitive basis to those projects which actually produce a major and real-time impact.", "High Level Training Workshops on the Science-Policy-Diplomacy Nexus: It aims to conduct high level training workshops on the Science-Policy-Diplomacy Nexus that would bring together scientists, policy-makers and diplomats to focus on issues of high priority for the region and within the context of the Sustainable Development Goals.Support for Refugee Scientists and Other Scientists at risk in IsDB Member Countries", "•It aims to support refugee scientists and other scientists at risk in IsDB member countries that are being affected by civil strife or war.", "•Efforts will be made to support them at universities and research centres in other IsDB member countries, but also in other countrie", "For More Information:", "Visit the Official Webpage of the IsDB Undergraduate, Masters & PhD Scholarship Programme "], "url : https://www.opportunitiesforafricans.com/isdb-scholarship-programme-2019-2020/"], [["The American University of Beirut (AUB) Mastercard Foundation Scholars Program 2019/2020 for Graduate & Undergraduate study in Lebanon (Fully Funded)", "date announced:December 13, 2018", "Application Deadline: March 18th 2019"], ["Application Deadline: March 18th 2019", "The American University of Beirut (AUB)", " is offering full scholarships for ", "graduate", " and ", "undergraduate", " education for the academic year ", "2019-20", " in partnership with the Mastercard Foundation.", "The Mastercard Foundation Scholars Program at AUB", " aims to prepare young people to be agents of change in their communities, countries, and regions. ", "The program requires scholars to attend a series of workshops, courses and field work in addition to the courses for their degree.", "Eligibility and Admission Criteria", "Graduate scholarships are open to:", "Nationals of Africa", "Nationals of Lebanon", "R​​​efugee and displaced living in Lebanon ", "Undergraduate scholarships are open to ", "nationals of Lebanon ", "or", " refugee and displaced living in Lebanon", "Selection and admission are based on: ", "Academic promise", "Financial disadvantage", "Leadership potential", "Desire to give back and go back to one’s community", "Application Procedure:", "Complete  the AUB\n", "Online Graduate Application Form", " after creating an account.", "Upload supporting documents as per the requirements indicated on the online application.", "If\nresiding in Lebanon (Lebanese and non-Lebanese), fill out t​he online\nGraduate Financial Application specific to the Mastercard Foundation\nScholars Program (available here) by\n", "March 18, 2019.", "If applying\nfrom Africa, fill out the online Graduate Financial Application specific\nto the Mastercard Foundation Scholars Program (", "available here", ") by March 18, 2019.​", "For More Information:", "Visit the Official Webpage of the AUB Mastercard Foundation Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/aub-mastercard-foundation-scholars-program-2019-2020/"], [["Ghent University Doctoral Scholarships 2019 for Candidates from Developing Countries to study in Belgium (Funded)", "date announced:December 10, 2018", "Application Deadline: March 4th 2019"], ["Application Deadline: March 4th 2019", "With support from its ", "“Special Research Fund” (BOF), Ghent University grants PhD scholarships", " to promising PhD students from developing countries who wish to carry out ", "half of their PhD research at Ghent University and half in a university in a developing country.", "Funding", "PhD scholarship", " at Ghent University  (", "24 months", ").", "24 months of PhD research will be executed at the partner university in the South, for which ", "no", " funding is provided through this scholarship. ", "This\npart of the research (24 months) must be funded (e.g. local PhD\nscholarship or salary) at the partner institution in the South.", "\nThe Ghent University promoter receives a ", "bench fee", "\nof €15.440 to cover (part of) the operational costs, as well as part of\nthe travelling costs of the student and both the Ghent University and\nthe local promoter.\n", "Requirements:", "Before applying for a PhD scholarship at Ghent university\nstudents Always need to find a professor from Ghent University who is\nwilling to act as the supervisor (‘promoter’) of their doctoral", " ", "research and who agrees to support their application", ".", " The best way to do this is by browsing the list of faculties and research topics available on our ", "research directory", "The proposals must be ", "jointly", " submitted by a candidate, a promoter at Ghent University and a supervisor at the partner university.", "No restrictions are imposed on the field of research, nevertheless  preference will be given to topics that are", " relevant for development", "\nDevelopment relevance relates to the extent to\nwhich the proposals’ objectives are consistent with beneficiaries’\nrequirements, country needs, synergy opportunities, global priorities\nand partners’ and donors’ policies.\n", "Candidates need to", " come from", " – and have the ", "nationality", " of – a developing country (see ", "country list", ");", "There must be a ", "guarantee", " that the candidate will be able to work ", "fulltime on the PhD project", " for a period of ", "24 months", " at the ", "partner university", " in a selected developing country (South). This implies that the following conditions needs to be fulfilled:", "there must be a ", "local PhD supervisor at the partner university", " or research center in the South;", "A ", "written  statement", " is requested stating that the candidate is either a ", "funded fulltime PhD student or a staff member at this partner university", "and will be ", "sufficiently exempted", " from teaching or other assignments as to be able to fully concentrate on the ", "PhD research in the South.", "This statement should also mention that the candidate ", "receives a local PhD scholarship or salary", " for a period of ", "24 months", " when working on the PhD at the partner university in the South.", "This cofunding is only intended for students who  want to obtain", " a (joint ) PhD degree at Ghent University .", "Duration and start date:", "The earliest starting date of the scholarship at Ghent University is ", "1 October 2019", ";", "The candidate obtains a scholarship for ", "24 months to study at Ghent university", ";", "24 months", " of the PhD research/study must be ", "cofinanced ", "at the partner university;", "Students are obliged to divide the Ghent University scholarship into minimum ", "2 different research stays", " in Ghent (North) and need to return at least ", "once to their home university (South) ", " in between (= ", "‘sandwich- schedule’", ");", "At least 12 months", " of the ", "research stay in the South", " must be scheduled ", "after", " ", "the first BOF funded stay in Ghent (North)", " (earliest possible starting date of the BOF funding = 1 October 2019).", "How to apply", "Applications must be submitted on the application forms provided for this purpose.", "The Research Council makes a selection of the applications based in\npart on the recommendations obtained from members of the Council for\nDevelopment Cooperation.", "Selection criteria:", "the qualifications of the applicant;", "the doctoral project;", "the relevance of the research topic for development;", "the scientific/scholarly potential of the promoter’s research group(s);", "the partnership between Ghent University and the local institute;", "the scientific/scholarly potential of the local institute.", "For More Information:", "Visit the Official Webpage of the Ghent University Doctoral Scholarships 2019 "], "url : https://www.opportunitiesforafricans.com/ghent-university-doctoral-scholarships-2019-2/"], [["Romanian Government Scholarships 2019/2020 for Foreign Citizens to study in Romania (Fully Funded)", "date announced:December 19, 2018", "Application Deadline:15 March 2019."], ["Application Deadline:", "15 March 2019.", "Scholarships offered by the Romanian State to foreign citizens through the MFA", "The scholarship program offered by the\nRomanian state, through the Ministry of Foreign Affairs, to foreign\ncitizens, based on G.D. 288/1993, for the academic year 2019 – 2020", "General conditions for awarding scholarships", "Number of scholarships", ": 85 scholarships for under-\nand post-graduate studies in Romania, by means of selection of\napplication files, organized by the Ministry of Foreign Affairs (MFA)\nand the Ministry of National Education (hereafter, MNE), in keeping with\nRomanian current legislation.", "Qualification criteria", ":", "Foreign citizens coming from all the states of the world, except\nfor EU member states. Foreign citizens of Romanian origin and those\nbelonging to the neighbouring historic Romanian communities benefit from\nother scholarship programs.", "The applicant for the scholarship must not hold Romanian\ncitizenship, did not request or did not obtain a form of protection in\nRomania, is not a stateless person whose residence on Romanian territory\nis officially recognized according to the law, is not a member of the\ndiplomatic corps accredited to Bucharest or member of family of the\ndiplomatic corps accredited in Romania, has not benefited from a\nscholarship from the Romanian state on the same course of study.", "The applicant for the scholarship must present study papers issued by accredited / recognized educational institutions, have ", "good results in education", ", ", "respectively\nan average of the study years of at least 7 (seven) corresponding to\nthe scoring system in Romania or the “Good” score", ", ", "as the case.", "The applicant for the scholarship ", "is not, until 31 December of\nthe year in which he / she was nominated, more than 35 years of age –\nfor bachelor and master studies and 45 years respectively – for doctoral\nstudies or for postgraduate studies", ".", "The scholarships are awarded for ", "3 study cycles", ":", "a) for the first cycle (undergraduate): This scheme is dedicated to\ngraduates of high schools or of equivalent pre-university studies, as\nwell as to candidates who require the continuation of their studies in\nRomania. The complete cycle of university studies lasts for 3 to 6\nyears, according to the specific requirements of the chosen faculty, and\nends with a final examination (", "licență", ").", "b) for the 2nd cycle (master): This scheme is dedicated to graduates\nof university/post-graduate studies; it lasts for 1,5 to 2 years and\nends with the defence of a dissertation.", "c) for the 3rd cycle (doctorate) this scheme is dedicated to the graduates of university/postgraduate studies (i.e. master); it lasts for 3-4 years, in keeping with the specific requirements of the chosen faculty, and ends with a doctor’s thesis. Admission to a PhD course is conditioned by an entrance examination.", "Steps to submit the application files", "Application files must be submitted through diplomatic\nmissions. Application files submitted by post or directly to the MFA or\nto the MNE, as well as application files received after the announced\ndeadline will NOT be taken into consideration.", "3. Enrolment Calendar", "The registration period begins on 14 December 2018.\nThe candidate should enquire at the diplomatic mission where he intends\nto submit the application file about the enrolment calendar. The\ndeadline for submitting the application files is established by each\ndiplomatic mission.", "Foreign diplomatic missions accredited in Bucharest will submit their\napplication files to the MFA – Public Diplomacy, Cultural and\nScientific Directorate (DDPCŞ), accompanied by a verbal note, by ", "15 March 2019.", "Incomplete or non-compliant dossiers with the fields of study\nand methodology are considered disqualified and will not be evaluated\nby the MFA committee. The files of the rejected candidates following the\nevaluation of the MFA and MNE committees are not returned.", "Dossiers filed directly with the MFA or MNE registration offices are not considered", ".", "4. ", "Documents required for the application", "The application file must contain the following documents:", "4.1. ", "Official letter issued by the diplomatic mission", " of the country of origin accredited to Bucharest or the diplomatic mission of Romania in the country of origin or residence", "; ", "4.2. The MFA application form (", "Appendix 1", ")", " for a scholarship in Romania, filled in correctly;", "4.3. The MNE application form (", "Appendix 2", ") ", "for the issue of the Letter of acceptance to study in Romania;", "4.4. ", "Legalized copies of the ", "obtained study diplomas", "\n(baccalaureate diploma or its equivalent + bachelor’s, master’s and\ndoctor’s degrees, if any) and their legalized translation into one of\nthe following languages: English, French or Romanian, if required", ";", "4.5. ", "Legalized copies of ", "matriculation sheets", " / diploma supplements related to graduate studies and their legalized translation, if applicable;", "4.6. ", "Legalized copy of ", "the birth certificate ", "and certified translation in one of the following languages: English, French or Romanian", ";", "4.7. ", "Copy of the ", "first 3 pages of the passport", ";", "4.8. The medical certificate", " attesting to the fact\nthat the person enrolling in the study does not have contagious diseases\nor other conditions incompatible with the required studies;", "4.9. Curriculum Vitae", " of the applicant", ";", "4.10. Recent photos", " – 2 pieces, passport format", ".", "The application file will also contain the following\ndocuments (only for candidates falling within the specific category\nmentioned for each document):", "Proof of name change (if applicable) – copy and legalized translation;", "The certificate attesting the passing of the baccalaureate,\nbachelor’s, master’s or doctoral exam, as the case may be, for current\nyear’s graduates – copy and certified translation;", "Certificate of graduation of the Romanian preparatory year or Language Proficiency Certificate, if applicable;", "Declaration on parental consent in case of juvenile candidates (in one of the following languages: English, French or Romanian).", "5. ", "Procedure for file analysis and selection of scholars ", "The MFA checks the application files and presents the files that are\neligible to the MFA Selection Board. The files selected by the MFA\nCommission will be forwarded to the MNE Selection Board. ", "The members of the two commissions evaluate the application files\naccording to the scientific competencies of the candidates, as well as\nthe chosen field of study.", "The Boards will approve, within the number of places, the list of accepted candidates.", "6. ", "Announcement of results", "The selection results will be announced by 17 June 2019, to each diplomatic mission that has submitted application files to the MFA. ", "See Appendix 3", ".", "For More Information:", "Visit the Official Webpage of the Romanian Government Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/romanian-government-scholarships-2019-2020/"], [["American College of Surgeons International Guest Scholarships 2019/2020 for young surgeons to study in USA (funded)", "date announced:December 17, 2018", "Application Deadline: July 1st, 2019"], ["Application Deadline: ", "July 1st, 2019", "The American College of Surgeons", " offers ", "International Guest Scholarships to young surgeons from countries other than the United States or Canada", " who have demonstrated strong interests in teaching and research. The scholarships, in the amount of $10,000 each, provide the scholars with an opportunity to visit clinical, teaching, and research activities in the U.S. and Canada and to attend and participate fully in the educational opportunities and activities of the American College of Surgeons Clinical Congress.", "This scholarship endowment was originally provided through the legacy\nleft to the College by Paul R. Hawley, MD (FACS Hon), former College\nDirector. More recently, gifts from the family of Abdol Islami, MD\n(FACS), the Stavros Niarchos Foundation, and others to the International\nGuest Scholarship endowment have enabled the College to expand the\nnumber of scholarship awards.", "Basic Requirements", "Applicants must be graduates of\nschools of medicine who have\ncompleted their surgical training.", "Applicants must be at least 35 years\nold, but under 50, on the date that the\ncompleted application is filed.", "Applicants must submit their applications from\ntheir intended permanent location. Applications\nwill be accepted for processing only when\nthe applicants have been in surgical practice,\nteaching, or research for a minimum of one\nyear at their intended permanent location,\nfollowing completion of all formal training\n(including fellowships and scholarships).", "Applicants must have demonstrated a commitment\nto teaching and/or research in accordance with\nthe standards of the applicant’s country.", "Early careerists are deemed more\nsuitable than those who are serving in\nsenior academic appointments.", "Applicants must submit a fully completed\napplication form provided by the\nCollege on its website. The application\nand accompanying materials must be\nsubmitted in English. Submission of a\ncurriculum vitae only is not acceptable.", "Applicants must provide a list of all of their\npublications and must submit, in addition,\nthree complete publications (reprints or\nmanuscripts) of their choice from that list.", "Preference may be given to applicants who\nhave not already experienced training or\nsurgical fellowships in the U.S. or Canada.", "Applicants must submit independently prepared\nletters of recommendation from three of their\ncolleagues. One letter must be from the chair of\nthe department in which they hold an academic\nappointment or a Fellow of the American College\nof Surgeons residing in their country. The chair’s or\nthe Fellow’s letter is to include a specific statement\ndetailing the nature and extent of the teaching\nand other academic involvement of the applicant.\nLetters of recommendation should be submitted\nby the person making the recommendation.", "The online application form is structured\nto assist the Scholarship Selection\nSubcommittee and assists the applicant in\nsubmitting a structured curriculum vitae.", "The International Guest Scholarships must\nbe used in the year for which they are\ndesignated. They cannot be postponed.", "Applicants who are awarded scholarships\nwill provide a full written report of the\nexperiences provided through the scholarships\nupon completion of their tours.", "An unsuccessful applicant may reapply\nonly twice and only by completing and\nsubmitting a new application together\nwith new supporting documentation.", "Financial Support", "The scholarships provide successful applicants with the privilege of participating in the College’s annual Clinical Congress held in Chicago, IL, October 4–8,2020, with public recognition of their presence.", " They will receive gratis admission to selected postgraduate courses plus admission to all lectures, demonstrations,and exhibits, which are an integral part of the Clinical Congress. ", "Assistance will be provided in arranging visits, following the Clinical Congress, to various clinics and universities of their choice.", "Apply Online", "Completed applications for the International Guest Scholarships for the year 2020 and all of the supporting documentation must be received online prior to ", "July 1, 2019", ", in order for an applicant to receive consideration by the selection committee.", "All applicants will be notified of the selection committee’s decision in November 2019. ", "Applicants are urged to submit their completed applications and supporting documents as early as possible in order to provide sufficient time for processing.", "Questions about and application materials for this scholarship should be sent to ", "[email protected]", ".", "Requirements and overview", "Apply online", "For More Information:", "Visit the Official Webpage of the American College of Surgeons International Guest Scholarships 2019/2020 "], "url : https://www.opportunitiesforafricans.com/american-college-of-surgeons-international-guest-scholarships-2019-2020/"], [["International Brain Research Organization African Regional Committee (IBRO-ARC) Bursaries 2019 for young African Researchers", "date announced:December 11, 2018", "Application Deadline: February 20, 2019 (11:59 p.m. CET)"], ["Application Deadline: ", "February 20, 2019 (11:59 p.m. CET)", "The IBRO African Regional Committee (IBRO-ARC)", " offers awards of up to €4000 each to ", "young African researchers ", "who have graduated with a Ph.D. or equivalent degree (in fundamental or clinical research) and who have demonstrated their ability to carry out independent research.", "Potential candidates should look for a host institution (within\nAfrica or abroad) and provide a research proposal and detailed\ninformation on how the funds will be spent. Selection criteria include\nacademic credentials of the applicant and the host, as well as the\nquality of the research proposal (complete with a structured research\nplan). The duration of such exchanges should be a ", "minimum of four weeks", ".", "Strong justification must be provided ensuring the applicant will\nreturn home after the exchange, in addition to an explanation of how the\nnewly gained knowledge and skills will be used to advance neuroscience\nresearch in their home country.", "Eligibility", "The candidate should be:", " – resident in Africa", " – 45 years or younger", " – have published significant research achievements in fundamental or clinical neuroscience", "Apply Now for the IBRO-ARC Bursaries 2019.", "For all enquiries please contact Samir Ahboucha (", "[email protected]", ")", "For More Information:", "Visit the Official Webpage of the ", "IBRO-ARC Bursaries 2019"], "url : https://www.opportunitiesforafricans.com/ibro-arc-bursaries-2019/"], [["UONGOZI Institute Postgraduate Diploma in Leadership Scholarships 2019/2020 for Senior Leaders in the Public, Private and Civil Society Organisations.", "date announced:December 28, 2018", "Application Deadline: Friday, 8th February, 2019 at 5:00pm. "], ["Application Deadline: Friday, 8", "th ", "February, 2019 at 5:00pm. ", "UONGOZI Institute", " invites applications for a", " one-year Executive Programme (Postgraduate Diploma in Leadership) from Senior Leaders in the Public, Private and Civil Society Organisations. ", "The Programme, undertaken in collaboration with Aalto University Executive Education of Finland, aims to develop leadership competencies in three areas; Making Strategic Choices, Leading People and Other Resources and Excelling in Personal Leadership Qualities. This is the third cohort to undertake this programme.", "Facilitated by world-class professors and experts in leadership from\naround the world, the Programme is designed to encourage participants to\nchallenge their thinking as they broaden their competencies in\nvisioning, planning and inspiring others through advanced strategic\ncommunication. It will motivate the participants to become better\ndesigners and innovators of effective structures and systems for better\nresults.", "Each module runs for between 2-3 days of in-class workshops and online individual or group assignments.", "Postgraduate Diploma Requirements", "Completion of the Programme requires attending all modules and\ncompleting several written pre- and post-assignments and four graded\nexams. On successful completion, candidates will earn 18 European\ncredits; all of which are eligible to be transferred towards the Aalto\nExecutive MBA or Aalto MBA Program.", "Tentative Schedule of the Programme", "April 2019: Opening, Reflective and Inspirational Leader", "May 2019: Strategy Formulation and Implementation", "August 2019: Developing Financial Skills", "September 2019: Leading for Results", "October 2019: Design Thinking for Organizational Development", "November 2019: Sustainable Development", "January 2020: Ethical Leadership", "February 2020: Strategic Communication", "March 2020: Human Resource Management for Executives", "April 2020: Leading Change, Graduation", "Tuition & Costs*:", "The tuition fees for the Postgraduate Diploma in Leadership are EUR 4,000. This covers:", "All facilitation costs and learning and training materials, including stationery", "All meals during training hours", "The participants or their sponsors will also be responsible for:", "Daily Subsistence Allowance (Per Diem) for each module", "Transportation allowance to attend each module", "On-transit expenses, incidentals and medical coverage", "*A limited number of full scholarships will be available for Government employees.", "Selection Criteria and Qualifications:", "The candidates need to meet with the following entry requirements:", "Minimum five years of work experience in a managerial or senior specialist position", "Bachelor’s degree or equivalent", "Good command of written and spoken English", "Recommendation from employer", "Requirements:", "An official recommendation and commitment letter from the employer to\nconfirm the participant’s commitment and employer’s full support to\nparticipate in the Programme for one year.", "Required Documents from the Candidate:", "Candidate’s Curriculum Vitae (not exceeding 2 pages)", "Cover letter (not exceeding one page)", "An essay (between 450- 500 words) explaining the candidate’s\nleadership successes, challenges and motivation for applying for the\nProgramme", "Reference and commitment letter signed by the candidate and his/her employer", "Certified copies of original academic certificates", "Venue: ", "Dar es Salaam and Arusha (Specific location will be determined for each module).", "Submit your applications or the names of selected candidates to:", "The Chief Executive Officer", "UONGOZI Institute", "P.O. Box 105753", "Dar es Salaam", "Or email to ", "[email protected]", "Deadline for Receiving Applications: ", "Friday, 8", "th ", "February, 2019 at 5:00pm.", "Applications received after this deadline will not be considered. For\nmore information on the Post-graduate Diploma in Leadership, go to ", "www.uongozi.or.tz/postgraduate-diploma", "For More Information:", "Visit the Official Webpage of the UONGOZI Institute 2019/2020 Postgraduate Diploma in Leadership"], "url : https://www.opportunitiesforafricans.com/uongozi-institute-2019-2020-postgraduate-diploma-in-leadership/"], [["2019/2020 Skoll MBA Scholarship in Social Entrepreneurship at the University of oxford’s Saïd Business School (Fully Funded)", "date announced:December 16, 2018", "Application Deadline: January 11th 2019"], ["Application Deadline: January 11th 2019", "The Skoll Scholarship", " provides full funding plus a living stipend to complete the ", "one-year Masters of Business Administration (MBA) at the University of Oxford’s Saïd Business School.", " This Scholarship is provided by the ", "Skoll Centre for Social Entrepreneurship at Oxford Saïd", "Benefits:", "Receive exclusive opportunities to meet with world-renowned entrepreneurs, thought-leaders, and investors", "Take your social impact to the next level", "Gain professional leadership and business skills", "Become part of the Skoll Scholar community, a group of leaders who are positively impacting the world through innovation and systems change", "Eligibility Requirements:", "You are eligible if…", "• You are taking entrepreneurial action to create positive impact. ", "You have spent preferably at least three years driving change, for example you could have started or grown a social venture; led the expansion of a social impact initiative within an organisation; or been tackling a specific social/environmental issue, through a core thread that unites your work.", "• You are creating impact with a focus on systems change and you can demonstrate the outcomes and impact.", "• You embody the personal qualities of a social entrepreneur, for example, bias towards action, persistence, resourceful, willingness to take risks, and have a deep understanding of the problem you are trying to solve.", "• You can demonstrate why the Oxford MBA is critical to your career trajectory in helping to develop your work/impact at this stage.", "• You have the financial need, as the cost of programme would be a significant financial burden due to previous work experiences or personal circumstances", "How to apply", "• Apply to the MBA programme at Saïd Business School, University of Oxford which includes your Skoll Scholarship essays.", "• You must apply during specific MBA application stages to be considered for the Scholarship. Consult the Skoll Scholarship website for more information, www.skollscholarship.org.", "• Complete the online application to the Skoll Scholarship, which will be sent to you once you are accepted onto the MBA programme.", "• Participate in the interview process (note: not all candidates will be offered an interview", "Timelines", "Candidates must apply to the Oxford MBA programme during specific\nstages of the School’s application rounds to be considered for the Skoll\nScholarship.", "Timelines for the 2019-20 academic year are as follows:", "Apply for the Oxford Saïd MBA during stages 1, 2, or 3 (including submitting your Skoll Scholarship essays)", "Apply by 11 January 2019 (at the latest)", "MBA final decision from Oxford Saïd", "22 March 2019 (at the latest)", "Skoll Scholarship online application sent to candidates", "26 March 2019", "Skoll Scholarship online application deadline", "1 April 2019", "Skoll Scholarship skype interview decision announced", "9 April 2018", "Skype interviews", "Mid-April 2019 (to be confirmed)", "In person interviews in Oxford", "Mid-June 2019 (to be confirmed)", "Skoll Scholarship final decision", "20 June 2019 (to be confirmed)", "For More Information:", "Visit the Official Webpage of the 2019/2020 Skoll MBA Scholarship in Social Entrepreneurship"], "url : https://www.opportunitiesforafricans.com/2019-2020-skoll-mba-scholarship-in-social-entrepreneurship/"], [["Equity Group Foundation Mastercard Foundation Scholarships 2019 for young (orphan or vulnerable) Kenyan students", "date announced:December 13, 2018", "In 2011, the Equity Group Foundation launched the Wings To Fly program with the generous support of The MasterCard Foundation with the aim of granting over 10,000 comprehensive secondary school scholarships and leadership training to academically gifted yet economically and socially marginalized young Kenyans. The program defines social and economic vulnerability to include students who have lost of one or both parents, students whose parents are living with HIV or chronic illnesses and who are unable to educate their children, and families affected by disaster such as famine"], ["In 2011, the ", "Equity Group Foundation", " launched the Wings To Fly program with the generous support of ", "The MasterCard Foundation", " with the aim of granting over 10,000 comprehensive secondary school scholarships and leadership training to academically gifted yet economically and socially marginalized young Kenyans. The program defines social and economic vulnerability to include students who have lost of one or both parents, students whose parents are living with HIV or chronic illnesses and who are unable to educate their children, and families affected by disaster such as famine", "The Program has been designed to give hope to bright,\ndeserving children by giving them the opportunity to obtain an education\nand resultant benefits including better educational outcomes, improved\nchances of success in life, increased gender equality in secondary\neducation, new opportunities for students from rural areas to access\neducation and greater social integration among students.", "In addition to a focus on academic excellence and achievement, the program’s curriculum places an emphasis on skills development and networks to help students succeed in secondary school and beyond. Upon graduation, scholars with high academic achievements will be selected for internships with Equity Bank. They will be part of an alumni program that hosts annual conferences and facilitates networking with industry leaders. ", "Eligibility", "l", "The Wings To Fly program targets high achieving yet needy ", "(orphan or vulnerable) students", " identified by assessing their performance at the nationally administered Kenya Certificate of Primary Education examinations (KCPE). ", "EGF, through the District Scholarship Selection Boards (DSSB), uses the following selection criteria for the scholarship: ", "Must be Academically Promising – Prospective scholars\nmust be in the top 5 percentile performing students in their District\nin the Kenya Certificate of Primary Education (KCPE) examination. ", "Must be a bona fide Orphan or Vulnerable Child (as defined below); ", "Children who have lost one or both parents and have no guardian or sponsor to provide for their education; OR ", "Children whose parents are physically or mentally disabled and are unable to educate their children; OR ", "Children whose parents are living with HIV/AIDS or other chronic debilitating illness and are unable to educate their children; OR ", "Children from families affected by natural disasters such as flooding, drought, and famine or civil conflict and are unable to educate their children; OR ", "Children who have suffered neglect and/or abandonment; OR", "Children with parents living under extreme poverty and are unable to educate their children.", "Benefits:", "\nThe program offers a comprehensive scholarship package that includes\ntuition, books, uniforms, transportation and pocket money\nfor all four years of the student’s secondary\neducation. Scholars also receive leadership development, career\nguidance and mentoring to\nensure they achieve their full potential.\n", "For More Information:", "Visit the Official Webpage of the Equity Group Foundation Mastercard Foundation Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/equity-group-foundation-mastercard-foundation-scholarships-2019/"], [["CIFAR Azrieli Global Scholars program 2019 for Early Career Researchers (Funded to Toronto, Canada & CDN $100,000 in Funding)", "date announced:December 14, 2018", "Application Deadline: February 5, 2019. "], ["Application Deadline: ", "February 5, 2019. ", "The CIFAR Azrieli Global Scholars program", " ", "provides funding and support to help Scholars build their network and develop essential skills to become the next generation of research leaders. Researchers within the first five years of a full-time academic position from anywhere in the world are eligible to apply.", "CIFAR invites exceptional early career researchers to participate in CIFAR’s network of nearly 400 researchers from over 16 countries, who together are pursuing answers to some of the most complex challenges facing the world today.", " The CIFAR Azrieli Global Scholars program ", "provides funding, skills training, mentorship, and opportunities to collaborate with outstanding colleagues from diverse disciplines, positioning scholars as research leaders and agents of change. ", "Eligibility", "Applicants can be from anywhere in the world, must hold a PhD (or equivalent) and be within the first five years of a full-time academic position. Scholars’ research interests must be aligned with the themes of an eligible CIFAR research program. See the ", "detailed program overview", " for full eligibility requirements. ", "NOTE: Postdoctoral fellows are not eligible to apply.", " ", "Benefits:", "CIFAR Azrieli Global Scholars receive: ", "  $100,000 CAD in unrestricted research support", "  A two-year term in a CIFAR research program, a global network of top-tier research leaders. ", "Learn what it’s like to be a CIFAR Fellow", "  Opportunities to network, collaborate and form a community with colleagues from diverse disciplines", "  Mentorship from a senior researcher within a CIFAR research program", "  Specialized leadership and communication skills training, and support to put their skills into action", "How to apply", "All applications are submitted through an ", "online application portal", " and must include two letters of reference.  See ", "detailed overview", " of the CIFAR Azrieli Global Scholars program for more information. ", "Submit an application now", "The 2019 Call for Applications opens on December 3, 2018. The deadline for applications is February 5, 2019. \n", "\nPlease ", "contact us", " with any questions.\n", "For More Information:", "Visit the Official Webpage of the CIFAR Azrieli Global Scholars program 2019"], "url : https://www.opportunitiesforafricans.com/cifar-azrieli-global-scholars-program-2019/"], [["UNICAF Scholarship 2018/2019 to study an online degree from the University of South Wales or UNICAF University", "date announced:December 10, 2018", "Looking for an online degree with scholarship? UNICAF Scholarship Programme has got you covered: the UNICAF Scholarship Programme is one of the most generous programmes available in the world today. Over USD 75 million worth of scholarships have been awarded!You can earn up to 60% UNICAF Scholarship to study an online degree from the University of South Wales or UNICAF University , at an affordable price that fits around your busy schedule."], ["Looking for an online degree with scholarship?", " UNICAF Scholarship Programme", " has got you covered: the UNICAF Scholarship Programme is one of the most generous programmes available in the world today. Over USD 75 million worth of scholarships have been awarded!", "You can earn up to 60% ", "UNICAF Scholarship to study an online degree from the University of South Wales or UNICAF University ", ", at an affordable price that fits around your busy schedule.", "Programmes on offer:", "● Bachelor’s in Computer Science, Accounting and Finance, Hospitality, etc.", "● Master’s in Education, Public Administration, etc.", "● MBA Finance, Health Management, Oil and Gas Management, etc.", "● LLM Master’s of Law", "● PhD programmes", "Scholarships are open to candidates from the following countries:", "● Bangladesh", "● Benin", "● Botswana", "● Brazil", "● Colombia", "● Ghana", "● Jamaica", "● Kenya", "● Malawi", "● Namibia", "● Nigeria", "● Philippines", "● Rwanda", "● Saudi Arabia", "● Sierra Leone", "● South Africa", "● Tanzania", "● Uganda", "● United Kingdom", "● Zambia", "● Zimbabwe", "The Scholarships will be awarded on a rolling basis, so don’t wait, APPLY NOW:", "○", " Sign up", " on Sqore.", "○ Take a 5-min fun quiz to learn more about the scholarship.", "○ Fill in your details.", "○ If you meet the school’s eligibility criteria, an admissions expert will be in touch to guide", "you with your decision.", "For More Information:", "Visit the Official Webpage of the UNICAF Scholarships"], "url : https://www.opportunitiesforafricans.com/unicaf-scholarship-2018-2019-online-degree/"], [["IHE DELFT Orange Knowledge Scholarship Programme 2019 for water Professionals", "date announced:December 28, 2018", "Application Deadline: February 10th 2019"], ["Application Deadline: February 10th 2019", " Are you a", " water professional,", " a national of, and working and living in one of the 53 countries on the OKP country list? Consider applying for admission to a ", "Master of Science study programme at IHE Delft", " and a ", "OKP scholarship. ", " ", "The Orange Knowledge Programme", " promotes capacity building within organisations in ", "53 countries", " by providing training and education through scholarships for professionals. An OKP Scholarship covers all costs associated with completing an 18-month Master of Science study programme at IHE Delft.", "IHE Delft offers four accredited Master of Science programmes which start in October 2019. ", "Water Management and Governance", " – The scientific study of water resources with practical planning and management skills", "Urban Water and Sanitation", " – Water supply, sanitation and water engineering and management, particularly in urban areas", "Environmental Science", " – Conservation and prudent use of natural resources for the benefit of society", "Water Science & Engineering", " – Hydrological and hydraulic processes and modelling tools for improved water management in coastal zones, river basins and agricultural areas.", "Eligibility ", "Here you can read about the ", "obligations for OKP scholarship holders", ".", "In order to be eligible for an OKP MSc Scholarship, you:", "must be a national of, and working and living in one of the countries on the ", " OKP country list", ";", "must have an ", "employer’s statement that complies with the format Nuffic has provided", ": All information must be provided and all commitments that are included in the format must be endorsed in the statement;", "must not be employed by an organisation that are considered to have its own means of staff-development. Organisations that are considered to have their own means for staff development are for example: ", "multinational corporations (e.g. Shell, Unilever, Microsoft),", "large national and/or a large commercial organisations,", "bilateral donor organisations (e.g. USAID, DFID, Danida, Sida, Dutch ministry of Foreign affairs, FinAid, AusAid, ADC, SwissAid),", "multilateral donor organisations, (e.g. a UN organization, the World Bank, the IMF, Asian Development Bank, African Development Bank, IADB),", "international NGO’s (e.g. Oxfam, Plan, Care);", "must have an official passport, valid till at least 15 July 2019;", "must not receive more than one scholarship for courses that take place at the same time;", "must have a government statement that meets the requirements of the country in which the employer is established (if applicable) Check if for your country such a statement is required (", "download document", " ).", "Timeline", "10 February 2019", "Deadline\napplication for academic admission for IHE (joint) master programmes\nfor applicants who wish to be considered for OKP scholarship ", "Second week February 2019", "Applicants\nfrom OKP eligible countries who have applied for academic admission and\nhave received a (conditional) admission receive an e-mail with a link\nto apply for OKP scholarship ", "5 March 2019", "Deadline\nfor submission of OKP application in Atlas. All applications submitted\nafter 5 March will not be taken into consideration. ", "22 March 2019", "Deadline\nfor conditionally admitted applicants who have registered for OKP\nscholarship in Atlas, for sending English test results (and for\napplicants joint LWM programme, provisional admission letter of Boku\nUniversity ", "6 June 2019", "Outcome selection. All candidates with an eligible OKP application in Atlas will be informed about the outcome.", "Submit your application and required documents to IHE Delft before ", "10 February 2019.", "For More Information:", "Visit the Official Webpage of the IHE DELFT Orange Knowledge Scholarship Programme 2019 "], "url : https://www.opportunitiesforafricans.com/ihe-delft-orange-knowledge-scholarship-programme-2019/"], [["RUFORUM MasterCard Foundation Undergraduate & Masters Scholarship Award 2019/2020 for young Africans.", "date announced:December 19, 2018", "Application Deadline: Sunday 31st March 2019 at 17:00 Hours (GMT+3)."], ["Application Deadline: Sunday 31", "st", " March 2019 at 17:00 Hours (GMT+3).", "The Regional Universities Forum for Capacity Building in Agriculture (RUFORUM),", " in partnership with ", "Mastercard Foundation", " is implementing an eight year transformative project to ruforum-mastercard-foundation-scholarship-award-20172018-for-young-africans/meaningfully contribute to Africa’s growth and development. The aim of the partnership is to transform African agricultural universities and their graduates to better respond to developmental challenges through enhanced application of science, technology, business and innovation for rural agricultural transformation", "Under this\npartnership, 110 undergraduate and 110 Masters Scholarships will be\nprovided over a period of eight years. The scholarships target\nacademically deserving yet economically disadvantaged, marginalized\ncommunities and those coming from conflict and post conflict areas of\nAfrica. The scholarships are tenable at Egerton University in Kenya and\nGulu University in Uganda. Students enrolled under this scholarship\nprogram will receive comprehensive scholarships, leadership development,\nlife skills support, entrepreneurship training and mentorship and\nexposure to community engagement", "For the academic year 2019, 50 Undergraduate and 20 Masters Scholarships will be made available, of which 70% will be for Kenya and Uganda nationals. Sixty percent (60%) and fifty percent (50%) of the scholarships will be awarded to undergraduate and masters’ female applicants, respectively. These scholarships are only tenable at Gulu University in  Uganda and Egerton University in Kenya.", "Eligible Programs of study The following academic programs are eligible for application during the Academic Year 2019. ", " Gulu University", "1. Bachelor of Science in Agri-Entrepreneurship and Communication Management (5 slots)", "2. Bachelor of Science in Food and Agribusiness (5 slots)", "3. Bachelor of Science in Biosystems Engineering (5 slots)", "4. Bachelor of Science in Agriculture (5 slots)", "5. Bachelor of Information and Communication Technology (5 slots)", "6. Master of Science in Agri-Enterprises Development (5 slots)", "7. Master of Science in Food Security and Community Nutrition (5 slots)", " Egerton University ", "1. Bachelor of Agribusiness Management (7 slots)", "2. Bachelor of Science in Community Development (6 slots)", "3. Bachelor of Science in Natural Resources Management (6 slots)", "4. Bachelor of Science in Animal Science and Technology (6 slots)", "5. Master of Science in Agricultural Extension (5 slots)", "6. Master of Science in Soil Science (5 slots)", "Application procedure", "Applicants should obtain application forms for both the scholarships and admission from the university of choice. ", "Applicants shall only apply to one university of choice. Application forms can also be downloaded by clicking following websites: ", "RUFORUM", "; ", "Gulu Universit", "y and ", "Egerton University", " .", " Applicants are encouraged to carefully study the application guidelines and provide all the required information and documents prior to submitting the application. Females are particularly encouraged to apply.", "Application Deadline", "The deadline to apply for the ", "[email protected]", " Scholarships is Sunday 31", "st", " March 2019 at 17:00 Hours (GMT+3).", "Download the ", "MCF Application Form 2019", " and the ", "Advert MCF Scholarship", " for more details. ", "See  English Version ", "here", "See French Version ", "here", "For More Information:", "Visit the Official Webpage of the RUFORUM MasterCard Foundation Undergraduate & Masters Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/ruforum-mastercard-foundation-undergraduate-masters-scholarship-award-2019-2020/"], [["IAS International Scholarship Programme 2019 to attend the 10th IAS Conference on HIV Science in Mexico City, Mexico (Fully Funded)", "date announced:December 19, 2018", "Application Deadline:24 January 2019, "], ["Application Deadline:", "24 January", " 2019, ", "Through the", " ", "IAS 2019 Scholarship Programme", ", the conference organizers commit themselves to making the conference accessible to community representatives, healthcare workers, and junior investigators from resource-limited settings.", "Eligibility", "The IAS 2019 Scholarship Programme is\nopen to anyone around the world working or volunteering in the field of\nHIV and AIDS and who is at least 16 years old at the time of the\nconference. The programme gives financial assistance to people who would\notherwise be unable to benefit from the conference.", "Priority will be given to:", "Abstract presenters whose submission has been selected ", "Those whose participation will help enhance their work in their own communities ", "Those who are able to assist in the transfer of skills and knowledge acquired at the conference", "Individuals who are part of a key population or living with HIV", "Scholarship selection will be based on a\nnon-biased scoring system. A review committee will contribute to the\nreviewing and scoring of the applications.", "Even though every attempt will be made\nto assist as many applicants as possible, we regret that there will be\nonly a limited quantity of scholarships available. Applicants are\ntherefore strongly encouraged to also seek other funding.", "Process", "The application process is entirely free. Applicants must create a ", "user account", "\nto fill in an individual application form. A letter of recommendation\nwritten by a colleague or peer is required to complete the application.", "Benefits", "Scholarship recipients can request a full or partial scholarship. A full scholarship may include:", "Registration fee", " for the conference (includes access to all sessions and exhibitions)", "Travel ", " (roundtrip ticket at the lowest fare available, from the nearest international airport)", "Accommodation ", " (in a budget hotel for the days of the conference)", "Daily", " living allowance", " or each day of the conference (21-24 July 2019).", "A partial scholarship includes any combination of the above.", "Please note that the programme will not\nreimburse any costs incurred prior to receiving a scholarship.\nScholarships do not include visa costs, transportation to/from the\nairport, or any other incidental cost.", "Timeline", "Applications are now open online through the ", "profile platform", " from until ", "24 January", " 2019, 23:59 CET. ", "All applicants will be notified at the end of March 2019.", "Contact the Scholarship Programme team ", "[email protected]", "For More Information:", "Visit the Official Webpage of the IAS International Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/ias-international-scholarship-programme-2019/"], [["Japanese Government (MEXT) Scholarship 2019 for young Nigerian Teacher Training Students (Fully Funded to Japan)", "date announced:December 19, 2018", "Application Deadline:January 31, 2019"], ["Application Deadline:January 31, 2019", "The Embassy of Japan", " is pleased to inform you that the Government of Japan will provide scholarship for Nigerian Primary/Secondary school teachers who desire to take teacher training course and Japanese language training in Japan.", " ", "The Japanese Government (MEXT) scholarship", " ", "is open to graduates of universities and teachers training colleges no more than thirty-four (34) years of age (must be born on or after April 2, 1984), who have taught as teachers at primary/secondary schools or teacher training colleges for at least five years in their home countries at the time of application. The Embassy will like to use this opportunity to attract Nigerian Schools that wish to start Japanese Language class or course at their school. Beneficiaries shall upon their return, help to promote Japanese Language education in Nigeria.", "QUALIFICATIONS AND CONDITIONS ", "MEXT accepts applications from international students for study in Japan who satisfy the following qualifications and conditions. Its aim is to foster human resources who will become bridges of friendship between the grantee’s country and Japan through study in Japan and who will contribute to the development of both countries and the wider world.", " (1) Nationality: ", " Applicants must have the nationality of a country that has diplomatic relations with Japan. An applicant who has Japanese nationality at the time of application is not eligible. However, persons with dual nationality who hold Japanese nationality and whose place of residence at the time of application is outside of Japan are eligible to apply as long as they choose the nationality of the other country and renounce their Japanese nationality by the date of their arrival in Japan. The First Screening must be conducted at the Japanese diplomatic mission in the country of which the applicant chooses the nationality. ", "(2) Age: Applicants must be born on or after April 2, 1984. Exceptions are limited to cases in which MEXT deems that the applicant could not apply within the eligible age limit due to the situation or circumstances of the applicant’s country (military service obligation, loss of educational opportunities due to disturbances of war, etc.). Personal circumstances (financial situation, family circumstances, state of health, circumstances related to applicant’s university or place of employment etc.) will not be considered for exceptions.", " (3) Academic and Career Background: ", "Applicants must be graduates of universities or teacher training schools and have worked as teachers at primary/secondary educational institutions or teacher training schools (excluding universities) in their home countries for a total period of five years or more as of October 1, 2019. In-service faculty members in a higher education institution are not eligible.", " (4) Japanese Language Ability: ", "Applicants must be willing to learn Japanese. Applicants must be interested in Japan and be willing to deepen their understanding of Japan after arriving in Japan. Applicants must also have the ability to do research and adapt to living in Japan.", " (5) Health: ", " Applicants must submit a health certificate in the prescribed format signed by a physician attesting that the applicant has no physical or mental conditions hindering the applicant’s study in Japan. ", "(6) Arrival in Japan:", " In principle, applicants must be able to arrive in Japan by the designated period (usually September or October) between the day two weeks before the course starts and the starting date of the course. If the applicant cannot arrive in Japan during the specified period for personal reasons, travel expenses to Japan will not be paid. Excluding cases in which MEXT deems as unavoidable circumstances, the applicant must withdraw from this scholarship program if the applicant cannot arrive in Japan by the end of the specified period above which decided by MEXT or the accepting university. ", "SCHOLARSHIP BENEFITS ", "(1) Allowance: 143,000 yen per month. A supplemental regional allowance of 2,000 or 3,000 yen per month will be added to the monthly scholarship amount for the grantees studying or conducting research in specially designated regions. Due to the situation of the Japanese Government’s budget, the amount of payment may be subject to change each fiscal year. If a grantee is absent from the university for an extended period, the scholarship shall be suspended for that period. ", "(2) Education Fees: Fees for the entrance examination, matriculation and tuition at universities will be paid by MEXT. ", "(3) Travel Expenses ①Transportation to Japan: In principle, MEXT stipulates the travel schedule and route, and provides an economy-class airline ticket for the flight from the international airport closest to the grantee’s residence (in principle, the country of nationality) to an international airport in Japan used on the normal route to the accepting university. The grantee shall bear at his/her own expense all costs related to domestic travel from the grantee’s residence to the nearest international airport, airport taxes, airport usage fees, special taxes necessary for travel, travel expenses within Japan (including airline transit costs), travel insurance expenses, carry-on luggage or unaccompanied baggage expenses, etc. ", "Transportation from Japan: Based on the application by the grantee, MEXT will provide an airline ticket to grantees who shall complete the training course at the accepting university and return to the home country by the end of the final month of the scholarship period (See “3. PERIOD OF SCHOLARSHIP”) designated by MEXT. MEXT, in principle, shall provide an economy-class airline ticket from an international airport in Japan used for the normal route to and from the accepting university to the international airport (inprinciple, in the country of nationality) nearest to the returning grantee’s residence. ", "For guidelines and application forms please click : ", "http://www.ng.emb-japan.newweb/itpr_en/00_000071.html", ", to get the form online, or come to the Embassy at the address below.", "Closing date for submission of application: January 31, 2019", "Address: ", "No. 9 Bobo Street (off Gana Street), Maitama, Abuja", "Telephone: 090 6000 9019, 090 6000 9099", "Embassy working hours: (Mon to Thurs) 8:00am to 5:30pm, (Fri) 8:00am to 12:45pm", "For More Information:", "Visit the Official Webpage of the Japanese Government (MEXT) Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/japanese-government-mext-scholarship-2019/"], [["Commonwealth Split-site (PhD) Scholarships 2019 (for low and middle income countries) to Study in the United Kingdom (Fully Funded)", "date announced:December 12, 2018", "Application Deadline: 16:00 (GMT) on 04 February 2019 "], ["Application Deadline: ", "16:00 (GMT)", " on ", "04 February 2019", " ", "Commonwealth Split-site Scholarships", " are for PhD candidates from low and middle income Commonwealth countries, to spend up to 12 months at a UK university as part of their doctoral studies in their home country.", "Funded by the ", "UK Department for International Development (DFID)", ",\nCommonwealth Split-site Scholarships enable talented and motivated\nindividuals to gain the knowledge and skills required for sustainable\ndevelopment, and are aimed at those who could not otherwise afford to\nstudy in the UK. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility Requirements:", "To apply for these scholarships, you must: Be a citizen of or have been granted refugee status by an eligible Commonwealth country, or be a British Protected Person", "Be permanently resident in an eligibleCommonwealth country ", "Be registered for a PhD at a university in aneligible Commonwealth country by the time your scholarship isconfirmed(September 2019)", "Ensure that an institutional or departmentallink exists between your home university and your proposed UK university. Thislink must be greater than simply a collaboration between individuals –see ‘Tenureand placement’ on page for further details. Both supervisors must provide asupporting statement which includes details of the link in order for yourapplication to be eligible. ", "Be available to start your academic studies inthe UK by the start of the UK academic year in September/October 2019 ", "By October 2019, hold a first degree of at leastupper second class (2:1) honours standard, or a second class degree and arelevant postgraduate qualification (usually a Master’s degree)·Beunable to afford to study in the UK without this scholarship", "These scholarships are for:", "Applicants who are citizens of or have been granted refugee status by an eligible Commonwealth country, or be a British Protected Person", "12 months study at a UK university as part of an applicant’s doctoral studies in their home country, starting in October 2019", "Applicants who are registered (or will be registered by September 2019) for a PhD at a university in an eligible Commonwealth country", "Study at a UK university with which your home university has an established institutional or departmental link.", "Study at a UK university which has a ", "part funding agreement with the CSC", "Eligible Commonwealth countries", "Antigua and Barbuda", "Bangladesh", "Belize", "Botswana", "Cameroon", "Dominica", "Eswatini", "Fiji", "Ghana", "Grenada", "Guyana", "India", "Jamaica", "Kenya", "Kiribati", "Lesotho", "Malawi", "Malaysia", "Mauritius", "Montserrat", "Mozambique", "Namibia", "Nauru", "Nigeria", "Pakistan", "Papua New Guinea", "Rwanda", "St Helena", "St Lucia", "St Vincent and the Grenadines", "Samoa", "Sierra Leone", "Solomon Islands", "South Africa", "Sri Lanka", "Tanzania", "The Gambia", "Tonga", "Tuvalu", "Uganda", "Vanuatu", "Zambia", "Scholarship Worth:", "Each scholarship provides: ", "· Approved airfare from your home country to the UK\nand return at the end of your award (the CSC will not reimburse the cost of\nfares for dependants, nor the cost of journeys made before your award is\nconfirmed) ", "· Approved tuition fees ", "· Stipend (living allowance) at the rate of £1,084 per\nmonth, or £1,330 ", "per\n month for those at universities in the\nLondon metropolitan area (rates quoted  at\n2018-2019 levels) ", "· Warm clothing allowance, where applicable ", "· Study travel grant towards the cost of study-related\ntravel within the UK or overseas ", "· If you are widowed, divorced, or a single parent,\nchild allowance of £", "465\nper  month for the first child, and £ 114\n per month for the second and third child\nunder the age of 16, if you are accompanied by your children and they are  living with you at the same address in the UK ", "How to apply", "You must make your application directly to the CSC using the CSC’s\nonline application system. The CSC will not accept any applications that\nare not submitted via the online application system. You are not\nrequired to apply via a nominating body for these scholarships.", "Only one application per applicant for these scholarships will be accepted.", "Application deadline: Your application must be submitted by ", "16:00 (GMT)", " on ", "04 February 2019", " at the latest.", "You are advised to complete and submit your application as soon as\npossible, as the online application system will be very busy in the days\nleading up to the application deadline.", "Supporting documentation deadline: Your application must include the following supporting documentation by ", "16:00 (GMT) ", "on ", "18 February 2019", "Copy of your valid passport (or national ID card) showing your\nphotograph, date of birth, and country of citizenship – uploaded to the\nonline application system", "Full transcripts detailing ", "all", " your higher\neducation qualifications (with certified translations if not in English)\n– uploaded to the online application system", "Supporting statement from your supervisor at your home country\nuniversity, highlighting current institutional links submitted directly\nby your supervisor to the online application system (supervisors will be\nsent an email request).", "Supporting statement from your proposed supervisor at a UK\nuniversity, highlighting current institutional links submitted directly\nby your supervisor to the online application system (supervisors will be\nsent an email request).", "Reference from at least one other individual – submitted directly by\nthe referee to the online application system (referees will be sent an\nemail request)", "The CSC will not accept supporting documentation submitted outside the online application system. ", "Access the online application system", "The ", "online application system", " is now open.", "For More Information:", "Visit the Official Webpage of the Commonwealth Split-site (PhD) Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-split-site-phd-scholarships-2019/"], [["Wageningen University & Research 2019 Africa Scholarship Programme (ASP) for young African Students (Fully Funded to Wageningen, The Netherlands)", "date announced:December 20, 2018", "Application Deadline: February 1st 2019"], ["Application Deadline: February 1st 2019", "The Africa Scholarship Programme (ASP)", " has been initiated by ", "Wageningen University & Research", " to give talented and motivated students from Africa the opportunity to study at the university in Wageningen.", "With this programme, Wageningen wants to support capacity building in Africa by attracting excellent students for a 2-years master’s programme.", "Number of scholarships:", " 5 ", "Citizenship", ": All African countries ", "Application deadline", ": 1 February 2019 ", "Start master’s programme", ": 1 September 2019 ", "Eligibility for the scholarship", ": Excellent students with a GPA of 80 per cent or higher in a bachelor degree, and admitted to a Wageningen University MSc Programme. ", "Benefits:", "Travel to and from Wageningen ", "Living allowance for 2 years", "Tuition fee", "Visa costs and costs for health insurance ", "Budget to visit one seminar/conference in Europe", "Participation in the ‘Reach your full potential’ programme ", "How to Apply:", "African students who want to start their study in September 2019 may be eligible for the scholarship. If you want to apply make sure to complete your MSc application before 1 February 2019.", "Send the ", "ASP application form", " and a reference letter to ", "[email protected]", ". The reference letter should preferably originate from an African University which has (had) a partnership with Wageningen University within the last three years. Please be sure that the contact details of the reference are included.", "Selection", "All the master’s applications and Africa Scholarship Programme applications will be assessed. ", "A\nselected group of candidates will be invited by e-mail on 4 March 2019,\nto make an additional and personalised assignment (deadline 20 March\n2019). Only candidates who will be invited will receive an e-mail. ", "In the week of 8 to 12 April 2019, candidates can be interviewed (by skype). ", "For More Information:", "Visit the Official Webpage of the Wageningen University & Research 2019 Africa Scholarship Programme "], "url : https://www.opportunitiesforafricans.com/wageningen-university-research-2019-africa-scholarship-programme/"], [["Allan and Nesta Ferguson Scholarships 2019/2020 for African Students to sudy in UK.", "date announced:December 17, 2018", "Thanks to the generosity of the Allan and Nesta Ferguson Charitable trust, three Allan and Nesta Ferguson Scholarships have been established for African Students (African nationals and resident in Africa), who wish to undertake a taught masters course at SOAS"], ["Allan and Nesta Ferguson Scholarships", "Deadline: 20 February 2019", "Thanks to the generosity of the ", "Allan and Nesta Ferguson Charitable trust, ", "three ", "Allan and Nesta Ferguson Scholarships", " have been established for African Students (African nationals and resident in Africa), who wish to undertake a taught masters course at SOAS", "Benefits:", "Each Allan and Nesta Ferguson Scholarship covers tuition fees in full and provides a maintenance grant of £7,000.", "In addition to this, International Student’s House (ISH) provides\nfree accommodation and a food scholarship. The scholarship recipient\nmust reside at International Student House during the whole of your\ncourse. ISH is an independent educational charity that runs a large\nstudent hostel near the School, together with social facilities for\ninternational students in London.  It has a close association with the\nUniversity of London.  You should also be aware that in return for the\nresidential scholarship, ISH expects their scholarship students to play\nan active role in the life of ISH.  In addition you may be asked to work\non a voluntary basis within the House for a few hours each month.", "The Ferguson scholarship is awarded on the basis of academic merit.", "Students offered an Allan and Nesta Ferguson Scholarship must take it\nup in the academic year 2019/20 and it cannot be carried forward to a\nlater year.   ", "Eligible Programmes", "Full-time ", "MA African Studies", "Full-time ", "MA International Studies and Diplomacy", "Full-time ", "MA Social Anthropology of Development", "Candidate Criteria", "Applicants should:", "Be nationals of and resident in an African country ", "Hold an undergraduate degree at the first class level ", "Hold an ", "offer of admission", " to pursue one of the eligible programmes by the scholarship deadline.  ", "Priority may be given to applicants with unconditional offers", ".  If your offer is conditional, please ensure you meet the conditions as soon as possible.", "Applicants ", "must meet the English language condition", " of their\noffer of admission to study at SOAS as soon as possible but no later\nthan 1 June 2019.  If your offer is conditional on English, please\narrange your English test and ensure you meet the English requirement as\nsoon as possible.", "Candidate Assessment", "Candidates will be assessed on academic merit by an Advisory Panel consisting of three academic members.", "The assessment of your application will be based on the information\nin your scholarship application.  Selectors will be looking at the\ndegree results and also at academic references, statement and other\nrelevant information.", "Scholarship Application Deadline ", " Scholarship applications must be received no later than ", "16:00 (UK local time) on 20 February 2019", ".", "You must also submit a complete online application to your programme. ", "It is recommended to apply for the programme about six weeks BEFORE the scholarship deadline (that is, by 9 January 2019).", "\nPlease note that complete applications for admission can take up to 4\nweeks to be considered by the Department, although this duration can\nvary depending on the time of year. You should be prepared to wait up to\n6 weeks in busy periods.", "Late or incomplete applications will not be considered.", "Number of Applications normally received", "10 applications", "Notification of Results", "Successful candidates will be notified by end-June.  If you have not\nheard from us by end-June, you should assume that your application was\nunsuccessful.", "Scholarship Application Procedures", "You must follow two steps:", "STEP 1: Apply for your programme", "You must submit a COMPLETE ", "on-line application for admission.", "  ", "Applicants must have an offer of admission to pursue a full-time\nmasters programme at SOAS by the scholarship application deadline. A\ncomplete application for admission includes transcripts, an explanation\nof the grading system for any degrees obtained outside of the UK, two\nreferences, CV and a personal statement.  The panel will be considering\nyour scholarship application TOGETHER with your on-line application for\nadmission.  Please note that complete applications for admission can\ntake up to 4 weeks to be considered by the Department, although this\nduration can vary depending on the time of the year.  You should be\nprepared to wait up to 6 weeks in busy periods.", "It is recommended to apply for the programme about six weeks BEFORE the scholarship deadline (that is, by 9 January 2019).", "STEP 2: Apply for the scholarship ", "by 16:00 (UK local time) on 20 February 2019.", "You must apply for this scholarship via the on-line application form which will open ", "HERE", " on 23 January 2019.", "For enquiries, please: ", "Email: ", "[email protected]", "Telephone: +44 (0)20 7074 5094/5091", "For More Information:", "Visit the Official Webpage of the Allan and Nesta Ferguson Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/allan-and-nesta-ferguson-scholarships-2019-2020/"], [["Johnson & Johnson Global Mental Health Scholarships 2019/2020 for Developing Country Students (Funded)", "date announced:December 13, 2018", "Application Deadline: midnight (GMT) on Sunday 24 March 2019."], ["Application Deadline: ", "midnight (GMT)", " on ", "Sunday 24 March 2019", ".", "The ", "MSc Global Mental Health", " course is a joint programme provided by the ", "London School of Hygiene & Tropical Medicine", " (LSHTM) and the ", "Institute of Psychiatry, Psychology & Neuroscience, King’s College London", "\n(KCL). The programme of study aims to provide students with the\nknowledge and skills to initiate, develop and oversee mental health\nprogrammes and/or policies in low-resource settings, as well as to\nconduct and critically evaluate research on global mental health. These\nskills and knowledge will make it possible for students to make valuable\ncontributions in the domains of research, policy and practice as they\nrelate to the discipline of global mental health. ", "Award", "The Janssen Global Mental Health Scholarship Fund ", "was launched in 2012 through a generous donation from Janssen Pharmaceutica (part of the Johnson & Johnson Family of Companies). In 2018, the Johnson & Johnson Scholarship Fund was launched, providing an additional 18 scholarships over the five years. To date, 21 students registered on the MSc Global Mental Health have benefited as a result of the scholarships. This is an annual award until 2022 (for 2022-23 academic year).", "London School of Hygiene & Tropical Medicine\nis offering up to four Johnson & Johnson Global Mental Health\nScholarships to students accepted onto the 2019-20 ", "MSc Global Mental Health", " programme.", "Each scholarship will cover", "full tuition fees at the KCL overseas fee rate, and", "a stipend (living allowance) of GBP 16,950.00, and", "an allowance of GBP 500.00 for MSc project expenses.", "Eligibility for funding", "Applicants must be nationals of, ", "and", " ordinarily resident in, one of the following countries:", "AFRICA", "\nGhana\n", "\nKenya\n", "\nNigeria\n", "\nRwanda\n", "\nSouth Africa\n", "SOUTH EAST ASIA", "\nIndonesia\n", "\nPhilippines\n", "\nThailand\n", "\nVietnam\n", "\n \n", "SOUTH AMERICA", "\nNicaragua\n", "\nPeru\n", "\n \n", "\n \n", "\n \n", "This list cannot be\nchanged, and is not negotiable, and therefore we are unable to consider\napplicants from other countries for this particular scholarship scheme.", "Applicants from non-English speaking countries (", "as specified by the Home Office – UKVI", ") must meet the minimum ", "English Language Requirements", " if shortlisted for this funding. Applicants who have been short-listed for this funding will be required to provide proof of English language proficiency within 6 weeks of notification for their scholarship application to be considered any further.", "Timelines", "The deadline for applications is ", "midnight (GMT)", " on ", "Sunday 24 March 2019", ".", "Notification of the results of short-listing\nstage and invitations for an interview will be made by the week\nbeginning Monday 29 April 2019 at the latest.", "Notification of final result of your application will be made by Friday 31 May 2019.", "How to apply", "To apply for this funding applicants should complete both steps below by the scholarship deadline.", "Step 1: Submit an application for study for the MSc Global Mental Health programme through the ", "King’s College London", " online application portal.", "Step 2: Submit an ", "online scholarships application", ",\nselecting this scholarship option from the drop-down menu. The\nscholarship application must include the following uploaded documents", "A completed Supplementary Questions Form for this scholarship", ", and", "Proof of your application submission, or Letter of Offer from KCL, for 2019-20 MSc Global Mental Health programme, and", "English Proficiency score results (if you have these already).", "Please note that incomplete applications will not be considered.", "For More Information:", "Visit the Official Webpage of the Johnson & Johnson Global Mental Health Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/johnson-johnson-global-mental-health-scholarships-2019/"], [["Delegation of the European Union to Uganda Erasmus Joint Masters Degrees Scholarships 2019 for Ugandans", "date announced:December 24, 2018", "Application Deadline: October 1st 2019"], ["Application Deadline: October 1st 2019", "\nUgandan academics, students and professionals in the field of education,\ntraining, youth and sport stand a chance to benefit from the\nprestigious Erasmus+ programme following publication of the 2019 call\nfor proposals\n", "The Erasmus+ programme", " is the ", "European Union’s programme for education, training, youth and sport,", " which supports learning mobility of individuals, cooperation for innovation, transnational partnerships and national efforts to modernise systems. The international dimension of the programme — cooperation with partner countries across the globe — focuses on higher education and youth.", "The Erasmus exchange program", " is one of the greatest culture and character building programs provided by the European Union. Through Erasmus+ funding, young people can study, volunteer and gain work experience abroad – to develop new skills, raise their aspirations, and boost their employability.", "Through the programme, teachers, education staff and youth-workers\ncan teach or train abroad – to develop their professional practice,\nbuild relationships with international peers, and share ideas and\nknowledge. Ugandan organisations can collaborate with international\npartners – to share best practice and drive innovation in education", "and youth work.", "Requirements:", " Any public or private body active in the fields of education, training, youth and sport may apply for funding under the ", "2019 call for proposals for the Erasmus+ Programme.", " In addition, groups of young people who are active in youth work, but who do not form a youth organisation, may apply for funding. ", "For More information on how to apply, please follow links below: ", "Erasmus+ Call for proposals", "Erasmus+ Programme Guide", "Erasmus+", "For More Information:", "Visit the Official Webpage of the Delegation of the European Union to Uganda Erasmus Joint Masters Degrees Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/delegation-of-the-european-union-to-uganda-erasmus-joint-masters-degrees-scholarships-2019/"]]