[[["WHO/TDR International Postgraduate Scholarship Scheme 2018/2019 (Funded to study in the University of Ghana)", "date announced:February 24, 2018", "Application Deadline: FRIDAY 30TH MARCH 2018."], ["Application Deadline: ", "FRIDAY ", "30", "TH", " MARCH 2018.", "The Office of Research, Innovation and Development (ORID)", " is pleased to announce a Call for Applications for the award of scholarships for One-year Masters studies in Public Health for the 2018/2019 academic year, funded under the ", "WHO TDR International Postgraduate Scholarship Scheme.", "The scheme provides scholarships for fulltime studies and is focused on courses relevant to a career in implementation research. Implementation Research is a growing field that supports the identification of health system bottlenecks and approaches to address them and is particularly useful in low- and middle-income countries where many health interventions do not reach those who need them the most.  The goal of this scheme is to enhance graduate training capacity and boost the number of researchers in low and middle-income countries.", "STUDY AREAS", "Ten (10) Master’s scholarships will be offered under the programme for the 2018/2019 academic year in the following areas:", "Master’s in Public Health", "MSc Applied Health and Social Sciences", "ELIGIBILITY ", "Nationals and residents from low- and middle income countries (", "data.worldbank.org/about/country-and-lending-groups", ") of ", "WHO African Region", ".", "Applicants should normally be under 35 years old at the time of application for the for the Master’s programme.", "Meet the standard University admission requirements for international graduate students.", "For ", "postgraduate admission requirements", " at University of Ghana, ", "visit the how to apply to postgraduate programmes page", ".", "*", "Female candidates and candidates from less privileged regions or groups as well as candidates with disabilities are encouraged to apply.", "Only applicants from low- and middle-income countries of ", "WHO African Region", " are eligible.", "Scholarship Benefits:", "The scholarship is tenable at the University of Ghana, School of Public Health and covers:", "One round return economy airfare between the home country of the student and Accra, Ghana.", "Tuition and academic user facility fees;", "Basic medical and accident insurance;", "Monthly stipend to cover living expenses including accommodation equivalent to local living cost; and", "Support for research project/thesis expenses during data collection.", "HOW TO APPLY", "Applications for the TDR international postgraduate scholarship must be submitted online at: ", "http://admission.ug.edu.gh/tdr", ".", "Applicants must simultaneously submit applications for admission into the relevant programme at University of Ghana: ", "http://admission1.ug.edu.gh/freshstudents/index.php/graduate-admissions/apply-now.html", ".", "   Please take note that the deadline for UG admission is 2", "nd", " March, 2018.", "For More Information:", "Visit the Official Webpage of the WHO/TDR International Postgraduate Scholarship Scheme 2018/2019"], "url : https://www.opportunitiesforafricans.com/tdr-international-postgraduate-scholarship-2018-2019/"], [["RNTC Scholarships 2018/2019 for media and communications professionals to study in Netherland (Fully Funded)", "date announced:February 14, 2018", "Application Deadline: March 15th 2018"], ["Application Deadline: March 15th 2018", "The Dutch Ministry of Foreign Affairs provides OKP (formerly known as NFP) and MSP scholarships for the ", "RNTC courses", " for media and communications professionals from a variety of partner countries. The scholarships include a contribution towards the cost of living, the course fees, visa, travel and insurance. If applicable, the scholarship holder is expected to cover the difference between actual costs and the OKP or MSP scholarship amount.", "The scholarships are administered by Nuffic, the Netherlands Organisation for International Cooperation in Higher Education. OKP stands for ‘Orange Knowledge Programme’ and these scholarships are available for ", "51 countries", ". MSP stands for ‘MENA (Middle East and North Africa) Scholarship Programme’ and is available for ", "10* countries", ".  Please check below whether you meet the criteria to apply for a OKP or MSP scholarship.", "* MSP is also open to applicants of Syrian nationality who are residing and working outside of Syria in one of the other selected MENA countries. ", "Benefits:", "The scholarships include a contribution towards the cost of living, the course fees, visa, travel and insurance. If applicable, the scholarship holder is expected to cover the difference between actual costs and the KOP or MSP scholarship amount.", "How to Apply:", "1.    First apply to RNTC to check that you are eligible for the course you would like to do. You can apply for a course by selecting a course. Make clear in your application to RNTC that you are intending to apply for an ", "OKP ", "or ", "MSP ", "fellowship. The option is included in the RNTC application form (only available for ‘OKP’ and ‘MSP’ courses before the OKP/MSP deadline).", "2.    Once you have submitted your application, RNTC will inform you by email whether you are eligible or not (usually within 10 working days).", "3.    If you are eligible for the course, RNTC will send you a link by email to apply for a OKP or MSP fellowship in ATLAS; the online system for your OKP or MSP scholarship application.", "4.      Then apply for an ", "OKP", " or ", "MSP", " fellowship.", "Please note that your OKP or MSP application has to be completed and submitted in one go! Once you have submitted your application, you will not be able to make changes or additions.", "5.    If you are eligible according to RNTC and you meet the OKP or MSP criteria, you can apply for a scholarship in the Nuffic system which is called ATLAS, using the link mentioned in step 3.", "6.    Note that you can ", "only ", "apply for a scholarship for your chosen course during the application window for that course. There are two of these windows every year.", "7.    Before applying for a OKP or MSP scholarship, make sure you have all the documents mentioned below ready. This is because your application has to be completed and submitted in one go. Please use the formats provided by Nuffic and submit all the required documents EXACTLY as specified. Otherwise, your application will be rejected by Nuffic! The file format should be PDF and your document must not exceed 2 MB.", "Copy of a valid passport. The passport needs to be still valid at least ", "three months ", "after the submission date of the registration form.", "A Letter of motivation. Have this prepared so you can copy/paste it into the online application form. This can be more or less the same motivation as you prepared for your RNTC application. This motivation will weigh heavily in the selection procedure. Make sure you address the following questions:", "​What is the issue or problem you want to address in your country?", "How will this course enable you to address this issue?", "How will you address this issue considering your position within your organisation?", "An Employer’s Statement. This is a very important document, please fill it out EXACTLY as specified by Nuffic and use this ", "format provided by Nuffic", ". PLEASE NOTE THAT THIS DOCUMENT CONSISTS OF TWO PAGES, BOTH HAVE TO BE FILLED IN, SIGNED & STAMPED.", "A Government Statement (if applicable for your country). A number of governments of KOP and MSP countries require a government statement before candidates can apply for a scholarship. In this statement, the government expresses its support for the scholarship application. Please ", "check this overview", " to see if this applies for your country. Also, it’s always good to check this with your government and/or the Netherlands embassy. If a government statement is required for your country, please use ", "this format", " provided by Nuffic for OKP countries and ", "this format", ", if you are from a MSP country.", "8.    If you are certain that you are eligible for an OKP or MSP scholarship and you have collected all the necessary information and documentation, you can start with your application in Nuffic’s ATLAS online application system using the online application form link that was sent to you.", "9.     Also download and read the ", "OKP and MSP registration instructions for ATLAS.", " ", "For More Information:", "Visit the Official Webpage of the RNTC Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/rntc-scholarships-2018-2019-for-media-and-communications-professionals/"], [["Joint Japan/World Bank Graduate Scholarship Program 2018 for Developing Countries Nationals (Fully Funded)", "date announced:February 24, 2018", "Application Deadline: April 12 , 2018."], ["Application Deadline: ", "April 12 , 2018", ".", "The Joint Japan/World Bank Graduate Scholarship Program", " (JJ/WBGSP)", " is open to women and men from developing countries with relevant professional experience and a history of supporting their countries’ development efforts who are applying to a master degree program in a development-related topic.", "JJWBGSP offers scholarships for over 200 ", "Preferred Programs", " (.xlsx 49 KB) spanning a wide array of development topics and for 14", " ", "Partner Programs", " (.xlsx 15 KB)  at universities in U.S., Africa and Japan in key areas of development, including economic policy management, tax policy, and infrastructure management.  JJWBGSP scholarships for developing country nationals are not available for any other master degree program.", "After earning their degree, developing country scholars commit to return to their home country to use their new skills and contribute to their countries’ social and economic development.", "Eligibility Requirements:", "Broadly speaking, Developing Country nationals must:", "Be a national of a ", "World Bank member developing country", ";", "Not hold dual citizenship of any developed country;", "Be in good health;", "Hold a Bachelor’s (or equivalent) degree earned at least 3 years prior to the Application Deadline date;", "Have 3 years or more of recent development-related work experience after earning a Bachelor’s (or equivalent) degree;", "Be employed in development-related work in a paid full- time position at the time of submitting the scholarship application.  The only exception to this criterion is for developing country nationals from a country that will be on the updated list of Fragile and Conflict States provided to applicants in the Application Guidelines for each call for scholarships.", "On or before the Scholarship Application Deadline date, be admitted unconditionally (except for funding) for the upcoming academic year to at least one of the ", "JJ/WBGSP ", "preferred university master’s programs", " and located outside of the applicant’s country of citizenship and country of residence listed at the time the call for scholarship applications open.", "Not be an Executive Director, his/her alternate, and/or staff of any type of appointment of the World Bank Group or a close relative of the aforementioned by blood or adoption with the term “close relative” defined as: Mother, Father, Sister, Half-sister, Brother, Half-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew; *Please note: All eligibility criteria are strictly adhered to. No exceptions are made. Eligibility criteria WILL NOT change during an open call for applications. However, this information is subject to change between the close of one application process and the opening of the next.", "Scholarship Benefits", "The JJ/WBGSP scholarship", " provides the recipient with the following benefits:", "Economy class air travel between your home country and the host university at the start of your study program and immediately following the end of the scholarship period. In addition to the two-way air travel, scholars will receive a US $500 travel allowance for each trip;", "Tuition for your graduate program and the cost of basic medical insurance usually obtained through the university.", "A monthly subsistence allowance to cover living expenses, including books. The amount of the allowance varies depending on the host country.", "Please note all JJ/WBGSP scholarships cover the duration of the graduate program or two years, whichever is less.", "The JJ/WBGSP scholarship does not cover:", "VISA application(s) costs", "Expenses to bring and/or support a scholar’s family members;", "Extra-curricular courses or training;", "Language training not provided by the graduate program;", "Additional travel during the course of the study program;", "Expenses related to research, supplementary educational materials, field trips, participation in workshops/seminars, or internships; or", "Educational equipment such as computers.", "Note: The JJ/WBGSP scholarship may only supplement, and does not duplicate, any other source of financial support/fellowship you might have. If selected as a finalist or if you are awarded a scholarship, you must inform the JJ/WBGSP if you have other sources of scholarship funds. The JJ/WBGSP stipend may be withdrawn completely or partially if during the scholarship period the Program has evidence of additional sources of support.", "How to Apply", "Applicants can apply for scholarships to both Preferred and Partner Programs. The process to apply to a Preferred Program and to a Partner Program differs:", "ATTENTION:", "  ", "The call for applications for a JJWBGSP Scholarship to one of our Preferred Programs is now open from February 22 to April 12 , 2018", ". Guidance for this call for applications, including this call’s: (i) instructions and requirements to submit an application, the eligibility criteria applicants must meet; and the selection process are provided  in the ", "Application Guidelines", ", ", "FAQs", ", and ", "the complete list of JJ/WBGSP ", "Preferred", " (.xlsx 49 KB) Master Degrees currently offered", ". Please read these documents before starting your application.", "Once you are familiar with the application requirements and processes, ", "click here ", "to apply, and refer to the “", "Accessing your online application", "” and “", "Navigating your online application", "” to navigate step-by-step the online application.", "Those seeking a JJ/WBGSP Partner Program scholarship (.xlsx 15 KB) must first apply for admission to one or more of the Partner Masters Degree Program(s). Inquiries on how to submit an admissions application to a partner program should be submitted to the respective university.", "After reviewing submitted applications, each Partner Master Degree Program will identify a short list of eligible candidates who will then be invited by the JJWBGSP Secretariat to apply for a JJ/WBGSP scholarship. View the ", "complete list of JJ/WBGSP Partner", " (.xlsx 15 KB) master degrees offered.", " ", "For More Information:", "Visit the Official Webpage of the Joint Japan/World Bank Graduate Scholarship Program 2018 for"], "url : https://www.opportunitiesforafricans.com/joint-japan-world-bank-graduate-scholarship-program-2018/"], [["DAAD/Institute for Peace & Security Studies scholarships 2018 for PhD candidates", "date announced:February 15, 2018", "Application Deadline: 23rd February 2018."], ["Application Deadline: 23rd February 2018.", "The DAAD supports over 100,000 German and international students und researchers around the globe each year – making it the world’s largest funding organization of its kind.", "As part of the ‘In-Country/In-Region Scholarship Programme“ DAAD offers scholarships for PhD and Master studies The programme is funded by the German Federal Ministry of Economic Cooperation and Development (BMZ) and aims at university staff in the first line, without neglecting the public sector demand of academically trained personnel.", "The target group for scholarships are graduates and postgraduates from Sub-Sahara Africa", "with a first academic degree if applying for a Master’s programme, or with a Master’s degree if applying for a doctoral programme who want to pursue Master’s or PhD courses in their home country (so called In-Country scholarships ) or in another Eastern Africa country ( so called In-Region scholarships).", "It has been agreed upon that DAAD cooperates with Addis Ababa University by offering up to 27 In-Country/In-Region scholarships for PhD and Master studies (5 PhDs in Management, 4 PhDs and 4 Masters in Microbial/Molecular Biology 6 PhDs and 4 Masters in Earth Sciences, 4 PhD in Peace and Security Studies) for the intake 2018.", "Application Requirements:", "Applicants", "• have successfully completed generally a three-year university degree (Master candidates) or a two- year university degree (doctoral candidates) with above average results (upper forth of class)", "• clearly show motivation and strong commitment", "• have thorough knowledge of the language of instruction", "• have completed their last university degree not more than 6 years ago at the time of application", "• must be nationals or permanent resident of Sub-Sahara Africa", "• should generally be", "\na) staff member of a public university,", "\nb) candidate considered for teaching or research staff recruitment,", "\nc) from the public sector", "d)", " DAFI-Alumni (Albert Einstein German Academic Refugee Initiative)", "Eligible Fields", "The In-Country/ In-Region Scholarship Programme supports studies in subject areas with strong relevance to national development. The scholarships at Addis Ababa University are available in the following fields:", "• Management", "• Microbial and Molecular Biology", "• Earth Sciences", "• Peace and Security Studies", "Duration:", "The duration", "• of the PhD programme is generally three years", "• of the Master programme is generally two years generally starting in September 2018", "Application requirements:", "Applicants must provide the following criteria to be eligible for the scholarships:", "A signed curriculum vitae", "A recommendation letter from university lecturer", "Letter of admission from AAU", "Certified copies of university degree certificates (including transcript)s", "Letter of motivation", "Detailed and precise PhD proposal, including detailed work and timetable (if applicable: mention the planned research stay in Germany)", "Abstract of the proposal on one page (please include name and title of proposal)", "Special considerations are applicable to female applicants and candidates from less privileged regions.", "Application procedure and deadline:", "The required documents should be sent to Dr. Fana Gebresenbet (", "[email protected]", ") no later than 23 February 2018.", "Direct any queries to Dr. Fana Gebresenbet (", "[email protected]", ").", "For More Information:", "Visit the Official Webpage of the DAAD/Institute for Peace & Security Studies scholarships 2018"], "url : https://www.opportunitiesforafricans.com/daad-institute-for-peace-security-studies-scholarships-2018-for-phd-candidates/"], [["Ghent University 2018 PhD Scholarships for research at UNU-CRIS (Funded)", "date announced:February 16, 2018", "Application Deadline: 3rd May 2018 (23:59 GMT+1)"], ["Application Deadline: 3rd May 2018 (23:59 GMT+1)", "Start date : ", "1 October 2018", "UNU-CRIS", " is pleased to announce that ", "Ghent University,", " one of her strategic partners, has launched this year’s call for ", "two PhD Scholarships for research at UNU-CRIS", ". If you are interested in doing research on subjects relevant to UNU-CRIS and would like to answer to this call, you have to find a supervisor at Ghent University, who is willing to supervise your PhD project. The scholarships are initially awarded for 2 years. After an intermediate evaluation, a second term of maximum 2 years can be granted.", "The aim is to obtain a doctoral degree within a time span of 4 years. Keep in mind that these scholarships are very competitive and that we are looking for ", "outstanding proposals and excellent study results", ". Candidates from outside the EU will, in addition, have to verify if their diplomas and certificates are recognised as valid by the Belgian authorities.", "UNU-CRIS welcomes in particular proposals that fit one of its ", "research programmes", ", but other proposals that relate to the UN and its goals could also be considered.", "UNU-CRIS will be happy to assist candidates with realistic chances for a scholarship in contacting potential PhD supervisors at Ghent University and to discuss suggestions for research proposals.", "Eligibility", "No restrictions on nationality or age. Only for candidates with excellent study results during the entire study career.", "Funding", "The amount of the scholarship is approximately € 2.070 per month, depending on the family status of the scholar.", "Based on the advice of the Research Council, a bench fee of € 7.440 (€ 310/month) will be awarded to the supervisor per term of 2 years.", "How to apply?", "Click ", "here", " to find all information about the application procedure and all the application forms.", "To apply for a doctoral scholarship with the UNU-CRIS label, your project proposal will need to be supported by an official statement by the Director of UNU-CRIS, Prof. Madeleine Hosli. For more information, please contact Pascale Vantorre (", "[email protected]", ") with CC to Ewout Ramon (", "[email protected]", ").", "If you have any additional questions related to the application process please contact Management Assistant at UNU-CRIS Mrs. Pascale Vantorre (", "[email protected]", ").", "For More Information:", "Visit the Official Webpage of the Ghent University 2018 PhD Scholarships for research at UNU-CRIS."], "url : https://www.opportunitiesforafricans.com/ghent-university-2018-phd-scholarships-for-research-at-unu-cris/"], [["Insurance Regulatory Authority (IRA) Actuarial scholarships 2018 for Kenyans (Fully Funded)", "date announced:February 28, 2018", "Application Deadline: 23rd March, 2018"], ["Application Deadline: 23rd March, 2018", "The", " Insurance Regulatory Authority (IRA)", ", a state corporation with the mandate to supervise, regulate and develop the insurance industry in Kenya is offering eight (8) scholarships to Kenyans interested in pursuing Master of Science Degree in Actuarial at the Cass Business School, United Kingdom.", "The scholarship will cater for tuition, travel, accommodation, and any other incidental expenses", "Eligibility Requirements:", "Eligible candidates must meet the following requirements:", "• Should have obtained Bachelor of Science in Actuarial Science (at least Upper Second Class", "Honors) or an equivalent Actuarial Science qualification", "• Should have graduated not more than five years ago", "• Should have made significant progress towards becoming Associate Members of the Institute/Faculty of Actuaries (Minimum 5 professional papers)", "Application Procedure:", "Preliminary application forms are available and can be downloaded from the IRA website i.e. ", "www.ira.go.ke", ".", "Completed application forms together with copies of identification, result slips/transcripts, academic certificate, birth certificate and school leaving certificate should be sent to:", "The Ag. Chief Executive Officer", "Insurance Regulatory Authority", "P.O. Box 43505", "NAIROBI", "The applications should reach IRA offices not later than 23rd March, 2018.", "Applicants with First Class Honors will have an added advantage", "Application Form- Actuarial scholarship 2018", "For More Information:", "Visit the Official Webpage of the IRA Actuarial scholarships 2018"], "url : https://www.opportunitiesforafricans.com/insurance-regulatory-authority-ira-actuarial-scholarships-2018-for-kenyans/"], [["Pan African (African Union) University 2018/2019 (Masters & PhD) Scholarships for Africans (Fully Funded)", "date announced:February 21, 2018", "Application Deadline: April 20th 2018"], ["Application Deadline: April 20th 2018", "The Pan African University", " ", "is an initiative of the Heads of State and Government of the African Union. It is a Premier continental university network whose mission is to provide quality postgraduate education geared towards the achievement of a prosperous, integrated and peaceful Africa. Young, qualified, talented and enterprising applicants from African countries", "and the African Diaspora are invited to apply to join Masters or PhD degree programmes at any of the following four PAU institutes listed below.", "Candidates with potential, motivation and who desire to play transformative leadership roles as academics, professionals, industrialists, innovators and entrepreneurs are particularly encouraged to apply.", "Pan African University Institute for Basic Sciences, Technology and Innovation (PAUSTI), at Jomo Kenyatta University of Agriculture and Technology (JKUAT), Kenya.", "2. Pan African University Institute for Life and Earth Sciences – including Health and Agriculture", "(PAULESI), at the University of Ibadan (UI), Nigeria.", "3. Pan African University Institute for Governance, Humanities and Social Sciences (PAUGHSS), at the University of Yaounde II and the University of Buea, Cameroon.", "4. Pan African University Institute for Water and Energy Sciences- including climate", "change (PAUWES), at the University of Tlemcen, Algeria.", "Admission Requirements for Masters Programmes *", "Candidates must satisfy the following conditions:", "1. Undergraduate degree from a recognized university,with at least a second class upper division or its equivalent, in a relevant field;", "2. Certified copies of relevant certificates, transcripts (from university and high school), national I.D. card and passport personal details page;", "3. Recommendation letters from 2 Professors", "4. Clear colored passport size photograph(2cmx2cm);", "5. Maximum age of 30 years for male and 35 years for female applicants.", "*Candidates may be required to undergo a written/oral examination after pre-selection.", "Admission Requirements for Doctoral Programmes", "Candidates must satisfy the following conditions:", "1. A Masters degree in a relevant field from PAU or any internationally recognized university;", "2. Certified copies of relevant certificates, transcripts, national I.D. card and passport personal details page;", "3. A 3 to 4 page research concept note (tentaive title, research questions, objectives, significance of the research etc…)", "4. Recommendation letters from 2 Professors", "5. Clear colored passport size photograph (2cmx2cm);", "6. Maximum age of 35 years for male and 40 years for female applicants.", "Benefits:", "The African Union Commission", " will offer full scholarships to the successful African candidates.", "Scholarship awardees should be committed to working in Africa after graduation.", "Application Procedure", "Applications should be completed online at ", "pau-au.net", ".", "Application forms should be downloaded at the following address: pau-au.net.", "Closing date for receipt of applications with all supporting documents: 20 APril 2018.", "Applications received after this deadline will NOT be considered.", "Further enquiries can be made through: ", "[email protected]", "Download Call for Application:", " Pan African (African Union) University 2018/2019 (Masters & PhD) Scholarships Application Guideline", "For More Information:", "Visit the Official Webpage of the", " Pan African (African Union) University 2018/2019 (Masters & PhD) Scholarships"], "url : https://www.opportunitiesforafricans.com/pan-african-african-union-university-2018-2019-masters-phd-scholarships-for-africans/"], [["MasterCard Foundation Scholars Program 2018/2019 at Kwame Nkrumah University of Science and Technology (Fully Funded)", "date announced:February 13, 2018", "Application Deadline: 17:00GMT, 11th May, 2018"], ["Application Deadline: 17:00GMT, 11th May, 2018", "The Mastercard Foundation Scholars Program at KNUST", " provides academically talented yet economically disadvantaged young people in Ghana and Africa with access to quality and relevant University education. The Scholars Program embodies an array of mentoring and cultural transition services to ensure the scholar’s academic success, community engagement and transition to employment opportunities which will further the goal of social and economic transformation of Africa.", "Eligibility Requirements:", "All Applicants with WASSCE or GBCE or ABCE or GCE O’Level and A’Level or their equivalent Results from an accredited/recognised institution and Certificate Ready and Satisfies KNUST’s Admission Requirements. NO AWAITING RESULTS candidate will be accepted.", "The Applicant must have Critical Economic Needs.", "The Applicant must have Proven Records of Leadership and Community Engagement (s).", "Females and Physically Challenged Applicants shall be given top priority.", "All Subjects are considered; however, there is Preference for Science Students.", "The Applicant must be prepared to Go-Back and Give-Back to his or her Community.", "Benefits:", "The Scholarship includes:", "Comprehensive financial support (full tuition, fully paid on-campus accommodation, learning materials, transportation and monthly stipend).", "Regular group meetings with other scholars that focus on personal and professional development opportunities and activities tailored to build societal relationships and scholars’ capacity.", "Continued academic support through academic mentoring, virtual learning, life and career coaching, and tutoring.", "Opportunities to participate in leadership congresses, community services and mentoring (Go-back Give- Back), and uniquely sourced internships.", "An academic environment where faculty and students engage with global issues.", "The prestige of becoming part of the growing family of the Mastercard Foundation Scholars Alumni and the Global Scholars Community.", "The opportunity to be enrolled on an accelerated Master’s Degree after undergraduate studies with an MCF Partner institution in the USA.", "How to Apply:", "Download a copy of the 2018/2019 application form", "Submit the completed application form THROUGH EMS/ any other courier mail to:", "The Program Manager,", "\nMastercard Foundation Scholars Program at KNUST Secretariat,", "\n℅ Office of the Dean of Students", "\nPrivate Mail Bag", "\nKNUST, Kumasi", "Ghana", "Applications close at 17:00GMT, 11th May, 2018", "International Applicants", "When submitting your scholarship application form to the Secretariat, submit these additional documents", "The print out of KNUST’s online admission", "Both O’Level and A’Level results or their equivalent", "What Next?", "Only shortlisted applicants will be called for interviews which would be held at the KNUST Secretariat of Mastercard Foundation Scholars Program at the Office of the Dean of Students.", "Interviews will be done by an independent panel constituted by the Vice Chancellor of KNUST.", "Verification of ALL examination results and information provided, as well as community visits of SUCCESSFUL applicants, will be conducted before admission is approved.", "Award of the Scholarship will be published on the ", "Program’s website", "For More Information:", "Visit the Official Webpage of the Mastercard Foundation Scholars Program 2018/2019 at KNUST"], "url : https://www.opportunitiesforafricans.com/mastercard-foundation-scholars-program-2018-2019-at-knust/"], [["JR Biotek Foundation (JRBF) Scientific Laboratory Training Workshop Scholarship 2018 at University of Cambridge, UK ( Fully Funded)", "date announced:February 19, 2018", "Application Deadline: 9th April 2018"], ["Application Deadline: 9th April 2018", "JR Biotek Foundation is offering scholarships t", "o sponsor outstanding PhD students (involved in agricultural research in African Universities and Research Institutes) to participate in her world-class Molecular Laboratory Training Workshop taking place in the Department of Plant Sciences, University of Cambridge from 3rd-11th September 2018.", "Selection Criteria and Eligibility", "Our ideal candidate must be:", "A PhD student studying in an African university/institution and currently undertaking research in the field of agriculture. Agricultural research projects with potential impact on food security in their home countries will be given priority.", "Have proven intellectual and leadership abilities", "Have the passion to advance knowledge and technical expertise in the field of agricultural research in their home institution.", "Number of scholarship:", " Five", "Value of scholarship", ":", "The scholarship covers all costs including travel and accommodation at Cambridge for the duration of the training (does not cover visa fees)", "Eligible Countries:", "PhD Students studying in any African university", "How to Apply", ": Interested candidates should apply ", "here", "To be taken at:", " The training workshop will be held at the Department", "For More Information:", "Visit the Official Webpage of the JRBF Scientific Laboratory Training Workshop Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/jr-biotek-foundation-jrbf-scientific-laboratory-training-workshop-scholarship-2018/"], [["Algerian-French scholarships program 2018 “PROFAS B+” in Doctorat (PhD) for young Algerians", "date announced:February 27, 2018", "Application Deadline: March 8th 2018"], ["Application Deadline: March 8th 2018", "The PROFAS B+ program", " is a critical program of cooperation between France and Algeria. It offers scholarships and service to facilitate the ", "mobility of Algerian doctorate (PhD) students towards France.", "The PROFAS B+ program offers scholarships, but also services offered by Algeria and France, including through Campus France. These services are designed to support and facilitate the mobility of scholarship recipients in France. ", "Since 2014, PROFAS B+ has allowed about 300 Algerian scholarship holders to join laboratories of excellence in France.", "The PROFAS B+ scholarships are designed for ", "non-employed Doctorate students", ", whether in joint management or joint supervision of thesis, of ", "up to 35 years old on December 31, 2018", ".", "As part of a thesis completion, the PROFAS B+ program offers:", "to Doctorate students in thesis ", "joint management", ", support to training and research through ", "7 to 12 months scholarships", " ", "over the academic year 2018-2019", ".", "to Doctorate student in thesis", " joint supervision", ", the payment of ", "7 to 18 months scholarships", " distributed over three years of Doctorate in ", "stays of 7 months minimum by academic year", ".", "Departures for the academic year 2018-2019 will start starting on ", "Monday 10 September 2018", " for PROFAS B+ scholarship recipients in joint management, and depending on a schedule determined by co-directors of thesis for PROFAS B+ scholarship holders in joint supervision.", "For More Information:", "Visit the Official Webpage of the Algerian-French scholarships program 2018"], "url : https://www.opportunitiesforafricans.com/algerian-french-scholarships-program-2018-profas-b/"], [["A.G. Leventis Foundation MBA Scholarship Program 2018/2019 for Nigerian citizens (Fully Funded to study in Greece)", "date announced:February 24, 2018", "Application Deadline: March 31st 2018"], ["Application Deadline: March 31st 2018", "The ", "A.G. Leventis Foundation", " MBA Scholarship Program for Nigerian citizens,", " offers two scholarships covering full tuition, accommodation and living expenses for two qualified students from Nigeria to attend The ALBA MBA program in Athens, Greece for the academic year 2018-2019.", "ALBA Graduate Business School at the American College of Greece and the A.G. Leventis Foundation, offer two scholarships covering full tuition, accommodation and living expenses for", "two qualified students from Nigeria to attend. The ALBA MBA program in Athens, Greece for the academic year 2018-2019.", "ALBA Graduate Business School is an accredited,research-driven academic institution with", "international distinctions.", "Requirements:", "• Nigerian Citizenship", "• 1st or Upper 2nd Class Bachelors degree completed (GPA 3.8 or higher)", "• Excellent command of English language", "• At least three years of work experience", "• Ambitious individual", "Application Procedure:", "Applicants are requested to apply online by registering at https://applications.alba.edu.gr/ and", "then send their completed application hard copy package (include all official supplementary documents) by March 31st 2018 to: Leventis Foundation Nigeria ( No. 2", "Leventis Close, Central Business District, FCT, P.O. Box 20351, Abuja)", "Basic entry criteria: Contact person: Ms Anna Vithoulka, International", "Relations Manager, ALBA ", "[email protected]", "For More Information:", "Visit the Official Webpage of the A.G. Leventis Foundation MBA Scholarship Program 2018/2019 "], "url : https://www.opportunitiesforafricans.com/a-g-leventis-foundation-mba-scholarship-program-2018/"], [["Fulbright African Research Scholar Program (ARSP) 2018 for Young Nigerians", "date announced:February 13, 2018", "Application Deadline: June 1st 2018"], ["Application Deadline: ", "June 1st 2018", "Program Information: ", "Two categories of grants are offered in the ARSP: research grants and program and curriculum development grants.", "Research Grants: ", "Awards of 3 to 9 months are offered for selected university faculty professionals to conduct research in any academic discipline at a U.S. academic or research institution.", "Preference will be given to individuals with a doctorate degree, at least three years of university teaching experience, a productive scholarly record, and whose projects relate directly to their ongoing teaching and/or research responsibilities.", "Program and Curriculum Development Grants:", "Awards of 3 to 5 months are offered for qualified university faculty to conduct research in any academic discipline at a U.S. academic or research institution.  Proposals should be linked to professional duties and demonstrate how the scholar will use the knowledge gained to develop new courses, curricula, or programs at the home institution.", "HIV/AIDS: ", "includes a special set of grants for scholars with proposals in HIV/AIDS-related research. Scholars in all academic disciplines are invited to formulate proposals with an HIV/AIDS focus.  Candidates may apply either as research scholars or as program and curriculum development scholars.", "ELIGIBILITY REQUIREMENTS:", "An intended applicant must be a citizen of Nigeria or a permanent resident, and should hold a valid passport issued from the country in which the application is made.", "In addition, applicants must have at least three (3) years of post-doctoral degree training or teaching experience at the time of application.", "The Fulbright program takes the issue of academic dishonesty (plagiarism) very seriously and will disqualify applications that violate academic integrity.", "How to Apply:", "Application instructions are available at: ", "http://www.cies.org/vs_scholars/Application_Instructions", ".", "The application is accessible at ", "https://apply.embark.com/student/fulbright/scholars", ".", "For More Information:", "Visit the Official Webpage of the Fulbright African Research Scholar Program (ARSP) 2018"], "url : https://www.opportunitiesforafricans.com/fulbright-african-research-scholar-program-arsp-2018-for-young-nigerians/"], [["Middle East Partnership Initiative (MEPI) Tomorrow’s Leaders Scholarship Program 2018 for Students from MENA Region (Fully Funded)", "date announced:February 21, 2018", "Application Deadline:  March 31, 2018"], ["Application Deadline: ", " March 31, 2018", "The Lebanese American University (LAU) h", "as launched the", " ", "Tomorrow’s Leaders Graduate (TLG) Scholarship Program", " funded by the ", "U.S. Department of State U.S.-Middle East Partnership Initiative (MEPI).", "The program offers 18 students from the Middle East and North Africa region a unique scholarship opportunity to pursue quality higher education and earn a master’s degree in one of the following fields:", "M.A. in Applied Economics – 30 credits (Beirut Campus)", "M.A. in Interdisciplinary Gender Studies – 30 credits (Beirut Campus)", "M.A. in International Affairs – 30 credits (Beirut or Byblos Campus)", "M.A. in Migration Studies – 30 credits (Beirut Campus)", "Eligibility Requirements:", "To be eligible to apply, you must:", "Be committed to complete your Master’s degree within two-years – starting Fall 2018.", "Be committed to pursue hands-on public policy research and work as a part of your Master’s program.", "Demonstrate academic excellence.", "Be a citizen of: ", "Algeria,", " Bahrain, Jordan, Lebanon, ", "Libya, Morocco,", " Syria, ", "Tunisia,", " West Bank and Gaza, or Yemen.", "Demonstrate financial need status per MEPI and LAU’s Financial Aid policies. Applicants should be underrepresented or economically disadvantaged students and should submit the relevant Financial Aid application as per the below.", "Note: American citizens and Green Card holders are not eligible to apply.", "Benefits:", "If you are accepted, the scholarship will cover the following:", "Full tuition fees", "Medical insurance", "A $500 USD monthly stipend while registering on a full-time basis", "Student housing during school months", "Laptop", "Internship opportunity", "Annual round-trip economy air ticket from home to campus", "Application Procedure:", "To apply, complete and submit parts A & B below by March 31, 2018:", "A. Email the below required documents to: ", "[email protected]", "Completed LAU-TLG admission application", "A recent passport-size photo.", "Identity card or passport (should be the same as the nationality to be used in the registration process at LAU).", "Educational certificates or diplomas (Bachelor, License, etc).", "Official transcript(s) of grades from all colleges or universities attended.", "Upon acceptance, applicants will be requested to present the official transcript(s) in a sealed envelope(s). Failure to declare enrollment at other institutions could result in an invalidation of admission, and any credits or degrees earned.", "Personal Essay, of at least 1,000 words, describing your background and your reasons for wishing to pursue graduate studies, how your character and experiences have formed you into someone who will contribute positively and effectively to not only the department but the academic discipline as a whole. Provide details of social, educational, cultural, or economic obstacles you have overcome in your journey to get to where you are today and your future objectives. Please highlight what is unique about you and how you will advance diversity within the institution.", "A research statement describing your research interests and professional goals, how you plan to accomplish them, and why one of the four programs is best suited for you to do so. Be specific about your specialized interests within your major field and how it relates to the description listed in the below programs description and research focus.", "Be clear about the kind of program you expect to undertake, and explain how your study plan connects with your previous training and future goals.", "Recommendation letters from two professors who are familiar with your academic performance.", "Certificate(s) of employment with a CV, if you have relevant work experience(s).", "Official scores of English proficiency test (depending on the university/college attended) by submitting one of the below:\n", "Internet-based TOEFL (IBT), with a minimum score of 90. The code for LAU is  ", "2595", ". The institutional TOEFL is not accepted.", "Academic IELTS with a minimum score of 7.", "Applicants with Internet –based TOEFL (IBT) scores between 80 and 89 and IELTS scores of 6.5, have to register for ENG009 Remedial English, a three-credit course, or retake and ", "pass the English test within the first year of enrollment. ", "IBT and IELTS scores below 80 and 6.5 respectively are not acceptable.", "N.B.", " English proficiency exams may not be required from applicants from universities recognized by LAU where the language of instruction is English.", "For More Information:", "Visit the Official Webpage of the Tomorrow’s Leaders Graduate (TLG) Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/mepi-tomorrows-leaders-scholarship-program-2018-for-north-africans-fully-funded/"], [["American College of Surgeons (ACS)/College of Surgeons of East, Central, and Southern Africa (COSECSA) Scholarship Program 2018 ($USD 2,500 worth)", "date announced:February 22, 2018", "Application Deadline: April 1st 2018"], ["Application Deadline: April 1st 2018", "To help address the severe shortage of surgeons in Sub-Saharan Africa, the", " American College of Surgeons (ACS)", " and the ", "College of Surgeons of East, Central, and Southern Africa (COSECSA)", " have developed a scholarship program to support women in surgical residency, help them complete their training, and encourage other women in medicine to consider surgery as a profession.", "The program is open to senior female surgical residents enrolled in the COSECSA region. Each $2,500 scholarship will go toward educational expenses, including accreditation, the fellowship examination, and five years of membership dues to COSECSA and the ACS. Applicants should include a personal statement indicating future goals, a current curriculum vitae, and a letter of support from the surgical training program director. Completed applications should be sent via e-mail to ", "[email protected]", " and will be reviewed in conjunction with the Operation Giving Back committee.", "The program is open to senior female surgical residents enrolled is the COSECSA region", "The award should be used for educational expenses, including accreditation, fellowship examination, and five-year membership dues to COSECSA and ACS", "The scholarship will be administered by COSECSA", "Financial Support", "Each scholarship is worth $2,500 and would be administered through COSECSA. The number of awards will depend on quality of applications and available funds.", "Application Process", "Applicants should include a personal statement indicating future goals, a current curriculum vitae, and a letter of support from their surgical training program director.", "Completed applications should be sent to the COSECSA Scholarship Committee at ", "[email protected]", " and will be reviewed in conjunction with the Operation Giving Back Committee.", "Applications are due no later than ", "April 1, 2018", ". Award winners will be notified on April 30, 2018.", "This scholarship is supported by a generous donation from Pon Satitpunwaycha, MD, FACS, and the American College of Surgeons Foundation.", "For More Information:", "Visit the Official Webpage of the ACS-COSECSA Women Scholars Program 2018"], "url : https://www.opportunitiesforafricans.com/acs-cosecsa-women-scholars-program-2018/"], [["Mobility for Breeders in Africa (MoBreed) Masters & PhD Scholarships 2018 for African Students (Fully Funded)", "date announced:February 27, 2018", "Application Deadline: March 30th 2018"], ["Application Deadline: March 30th 2018", "MoBreed (Mobility for Breeders in Africa)", " is an initiative of five public universities from three African regions and one university in Europe to advance knowledge on useful crops of Africa and increase scholars’ capacity in addressing food security. Partners include the ", "University of Abomey-Calavi in Benin", " and ", "Ebonyi State University in Nigeria (West Africa),", " ", "the Jimma University of Ethiopia (Eastern Africa), the University of Namibia", " and ", "the University of KwaZulu-Natal in South Africa (Southern Africa)", " and ", "Montpellier SupAgro in France.", "MoBreed (Mobility for Breeders in Africa), a consortium of five African universities together with one European technical partner, intends to:", "produce 10 high profile plant breeders (PhD holders) that will address current and future challenges related to climate change and agriculture with focus on at least 10 promising underutilized plant species of Afric", "train a new generation of 38 scientists (MSc holders) with strong capacity to increase knowledge and prospects on the selected orphan crops used in Africa for food and nutrition security and the crop production and seed industry,", "harmonize seven MSc and six PhD training programmes and research agenda on the use of neglected and underutilized crops to increase resilience of food production systems,", "enhance collaboration and programmatic agenda among five African higher education institutions that promote neglected and underutilized research and training for agricultural innovations within Africa.", "Eligibility", "To be eligible for a scholarship (i.e. financial support to third parties), master students as well as doctoral candidates referred to as ‘’students’’ must comply with the below criteria at the time of the application for a scholarship:", "a) be a national and resident in any of the eligible countries covered by the Intra-Africa Mobility programme of the EACEA and", "b) be registered/admitted in or having obtained a HEI degree (or equivalent) from", "a. one of the HEIs included in the MoBreed consortium (Target group 1)", "b. a HEI not included in the Mo breed consortium but established in an eligible country (Target group 2) and", "c) have sufficient knowledge of the language of the courses in the host countries", "Scholarship", "For MSc students: maximum twelve-months credits or degree seeking mobility is available for target 1 and target 2 groups.", "For academic staff: maximum two-months staff exchange mobility available for partner universities only.", "The scholarship includes subsistence and settling-in allowances, participation costs, contribution to research costs, insurance and travel in line with Agreement with EACEA. It will cover:", "roundtrip flight ticket and visa costs (using a preferred travel agent and calculated against direct linear distance);", "direct participation costs such as tuition fees, registration fees and service fees where applicable;", "comprehensive travel insurance (Health, Accident and Travel)", "a monthly subsistence allowance for the mobility period", "Application process", "The MoBreed mobility grant", " is open to all students from any of the partner universities", "(Target Group 1) and secondly to students from other African universities (Target Group 2).", "Currently, 31 MSc scholarships and 10 Academic / Administrative staff exchange are available.", "How to apply", "The MoBreed mobility grant is open to all students from any of the partner universities (Target Group 1) and secondly to students from other African universities (Target Group 2).", "Target Group 1:", "This category includes students from all partners universities as follows:", "University of Abomey-Calavi; Benin", "University of Kwazulu-Natal; South Africa", "University of Namibia; Namibia", "Jimma University; Ethiopia", "Ebonyi State University; Nigeria", "Target Group 2:", "All other African countries.", "As soon as the call for applications is online, students or academic / administrative staff wishing to apply should send their application to:", "Mrs. Lydia Sognon, ", "[email protected]", " with copy to ", "[email protected]", "Admission regulations for Doctoral and MSc Studies are to be found from prospective HEIs website. This application is for MoBreed Project scholarships only. The Scholarship application form together with other required documents should be sent as a unique PDF attachment to: eamils indicated above. You may download the MS Word version of the application form, and complete it before sending. Important also is the student proposal that should be sent together within the application as ONE SINGLE DOCUMENT, preferably PDF. Otherrequired documents are listed in the application form and include:", "Cover letter", "Scholarship Application form (this document)", "Student proposal (guidelines available online)", "National ID or Copy of Passport Data page", "Certificate of degree", "Transcript records", "Support letter from sending HEIs", "Recommendation letter of home supervisor (mandatory for all applicants)", "Enrollment proof in degree course from home institution (for MSc applicants)", "Curriculum Vitae.", "Employment certificate (only for staff)", "Certificate of English or French language skills", "Proof of socio-economic vulnerability (if available)", "Applicants should submit completed application and all supporting documents by email to", "[email protected]", " with copy to ", "[email protected]", " by 30 March, 2018. They should indicate in the subject line (if submitting by email) or super scribe the envelope (if", "submitting by post) ‘ Application for ", "MoBreed MSc/Staff exchange programme", "‘. Incomplete applications will be rejected.", "Applications should be sent to: Mrs. Lydia Sognon, ", "[email protected]", " with copy", "to ", "[email protected]", "Guidelines", " ", "Call for applications Mobreed", " ", "Application form", " ", "Guidelines student proposal", " ", "SAQA Guidelines", " ", "Student learning agreement", " ", "Student agreement template", " ", "MoBreed MoU", " ", "Student handbooks", " ", "MoU between Student and Supervisors", " ", "MoU with Home University", " ", "Template Transcript of records", " ", "Areas of Interest for Staff Exchange", "For More Information:", "Visit the Official Webpage of the Mobility for Breeders in Africa (MoBreed) Masters & PhD Scholarships 2018 "], "url : https://www.opportunitiesforafricans.com/mobility-for-breeders-in-africa-mobreed-masters-phd-scholarships-2018/"], [["University of Sheffield Southern Africa Student Scholarship Fund (SUSASSF) 2018 for study in the United Kingdom (Funded)", "date announced:February 15, 2018", "Application Deadline: 5pm (UK time) on Friday 4 May 2018."], ["Application Deadline: 5pm (UK time) on Friday 4 May 2018.", "In partnership with", " SUSASSF,", " the Department of Geography are pleased to offer a scholarship for a taught postgraduate student from Southern Africa.", "Scholarship Award", "The scholarship offers the following support:", "A full tuition fee waiver", "Maintenance for University accommodation and a monthly stipend", " ", "Eligibility Criteria", "1. You must have applied to study on one of the following courses to study at the University of Sheffield, starting in 2018:", "MA International Development", "MSc Environmental Change and International Development", "MPH International Development", "2. You must be classified as overseas for tuition fee purposes.", "\n3. You must be self-funded to receive this award, i.e. not funded by a research council, government, private enterprise, charity or any similar organisation.", "\n4. This scholarship cannot be awarded in conjunction with any other funding awards, either from the University of Sheffield or external sources.", "\n5. Your mode of attendance must be full time.", "\n6. Receipt of the scholarship is subject to successfully meeting any condition(s) attached to your offer before the deadline provided by the Admissions Service.", "\n7. Receipt of the scholarship is subject to successfully receiving a visa to study at the University in September 2018.", "\n8. You must be a national of and permanently domiciled, in one of the following countries or territories:", "South Africa", "Zambia", "Zimbabwe", "Malawi", "Lesotho", "Botswana", "Swaziland", "Namibia"], "url : https://www.opportunitiesforafricans.com/university-of-sheffield-southern-africa-student-scholarship-fund-susassf-2018/"], [["University of Nottingham High Achiever Foundation 2018 Prize for Africa (Engineering and Physical Sciences) for Young Africans (Funded)", "date announced:February 15, 2018", "Application Deadline: 29 June 2018 (12 midday UK time)"], ["Application Deadline: ", "29 June 2018 (12 midday UK time)", "The University of Nottingham is consistently ranked among the world’s top 100 universities* and is ranked 8th in the UK for research power**.", "In 2018 we are offering 5 scholarships of £2,000 each towards tuition fees to students from Africa***, registering on our Engineering and Physical Sciences Foundation Certificate.", "The University of Nottingham foundation courses provide an entry route to selected degrees in arts, business, engineering, science and social sciences and are an opportunity to gain the skills and knowledge needed to undertake a bachelors degree while studying at a world-class university.", "You can find out more about our Engineering and Physical Sciences Foundation Certificate ", "here", ".", "Eligibility Requirements:", "You can apply for this high achiever prize if you:", "are a national of (or permanently domiciled in) an African country*** ", "AND", "are classed as an overseas student for fee purposes ", "AND", "already hold an offer to start on the Engineering and Physical Sciences Foundation Certificate at Nottingham in September 2018. ", "You must have gone firm on that offer by 29 June 2018", "***Three of these scholarships will be reserved for students from Kenya or Nigeria", "How to Apply;", "Read what some of our previous scholarship students have to say", "Click ", "here", " to download an application form", "Please send this form to ", "[email protected]", " by the closing date", "For More Information:", "\u2028Visit the Official Webpage of the University of Nottingham High Achiever Foundation 2018 Prize for Africa"], "url : https://www.opportunitiesforafricans.com/university-of-nottingham-high-achiever-foundation-2018-prize-for-africa/"], [["Commonwealth Shared Scholarships 2018 for Students from Developing Countries for study in the United Kingdom (Fully Funded)", "date announced:February 27, 2018", "Application Deadline: 23.59 (BST) on 17 April 2018"], ["Application Deadline: ", "23.59 (BST)", " on ", "17 April 2018", "Commonwealth Shared Scholarships", " are for candidates from least developed and lower middle income Commonwealth countries, for full-time Master’s study on selected courses, jointly supported by UK universities.", "Funded by the ", "UK Department for International Development (DFID), Commonwealth Shared Scholarships", " enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those who could not otherwise afford to study in the UK. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2018", "By October 2018, hold a first degree of at least upper second class (2:1) standard, or a second class degree and a relevant postgraduate qualification (usually a Master’s degree)", "Not have studied or worked for one (academic) year or more in a high income country", "Be unable to afford to study in the UK without this scholarship", "Eligible Commonwealth countries", "Bangladesh", "Cameroon", "Ghana", "Guyana", "India", "Kenya", "Kiribati", "Lesotho", "Malawi", "Mozambique", "Nigeria", "Pakistan", "Papua New Guinea", "Rwanda", "Samoa", "Sierra Leone", "Solomon Islands", "Sri Lanka", "Swaziland", "Tanzania", "Tuvalu", "Uganda", "Vanuatu", "Zambia", "Benefits:", "VALUE", "Shared Scholarships are jointly funded by the CSC and participating UK universities. Each scholarship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor usually the cost of journeys made before your award is finally confirmed) – arranged by the university; funded by the CSC", "Approved tuition and examination fees– funded by the CSC", "Stipend (living allowance) at the rate of £1,065 per month, or £1,306 per month for those studying at universities in the London metropolitan area (rates quoted at 2017-2018 levels) – paid and funded by the university", "Warm clothing allowance, where applicable – paid and funded by the university", "Study travel grant towards the costs of study-related travel within the UK or overseas– claimed from and paid by the university; funded by the CSC", "Excess baggage allowance, up to an annual approved limit, when returning home–claimed from and paid by the university; funded by the CSC", "Reimbursement of the cost of a mandatory tuberculosis (TB) test, where required for a visa application (receipts must be supplied)– claimed from and paid by the university; funded by the CSC. Additional allowances for spouses or other dependants are not usually available", "How to apply", "You should apply to study one of the taught Master’s courses offered in the Commonwealth Shared Scholarship scheme. These scholarships do not cover undergraduate courses, PhD study, or any pre-sessional English language teaching, and are usually tenable for one year only. View a full list of ", "eligible courses", "All applications must be made through your chosen university. ", "You must check with your chosen university for their specific advice, admission requirements, and rules for applying.", " Some universities may require you to complete their own admissions application form as well, which may have a separate closing date. You must take the necessary steps to secure admission to your course at the same time as applying for a Shared Scholarship. View a full list of ", "university contact details", "You must make your application using the CSC’s Electronic Application System (EAS), in addition to any other application that you are required to complete by your chosen university. ", "View full information on how to use the EAS, including detailed guides", "You can apply for more than one course and/or to more than one university, but you may only accept one offer of a Shared Scholarship.", "All applications must be submitted by ", "23.59 (BST)", " on ", "17 April 2018", " at the latest. Each university has its own closing date for applications, and most are before this date. Any applications submitted after a university closing date will not be considered; please ensure you ", "apply via the EAS before your university closing date", ". View a full list of ", "university closing dates", "For More Information:", "Visit the Official Webpage of the Commonwealth Shared Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/commonwealth-shared-scholarships-2018/"], [["Villa Karo Residency Scholarship Program 2018 for artists, writers and researchers in Benin Republic, West Africa (Funded)", "date announced:February 22, 2018", "Application Deadline: March 15th 2018"], ["Application Deadline: March 15th 2018", "A Villa Karo residency is suited for both individual research and artistic work, and carrying out for instance communal projects. The ideal situation is one where scholarship holders are able to offer something to the local community. The staff of Villa Karo can assist in finding the right contacts and in organising the workshops.", "The role of Villa Karo", " is to act as a mediator between Finnish and African artists and cultural actors. The main objective is to offer Finnish artists, researchers and teachers a possibility to reside in Africa. In addition to that, Villa Karo invites African professionals of the cultural scene to Finland.", "Villa Karo is located in Grand-Popo, Benin", ", for Benin is one of the most democratic and politically stable countries in Africa.", "The activities of the cultural centre", " include, among other things:", "monthly concerts and theatre and dance performances every first Saturday of the month", "film screenings every Friday", "art exhibitions", "conference and seminar rooms", "library (see ", "list of books", ")", "a collection exhibiting West African ethnographic art and the history of West Africa", "guided tours for groups (e.g. schools)", "workshops on art, environment and languages, e.g. for school groups", "Benefits:", "The scholarships of Villa Karo are meant for researchers and artists, as well as for other professionals of cultural and/or societal fields", "The grant of Villa Karo covers", "trip arrangements and the remaining of the plane ticket costs after excess", "transportation from the airport (Cotonou – Grand-Popo – Cotonou)", "accommodation and breakfast in Villa Karo for 50 euros/week", "cleaning of the room", "help and support in planning the trip and on the spot in Benin", "Expenses the scholarship holders take care of themselves", "800 euros excess for the plane ticket (Villa Karo sees to the remaining 400-600 euros)", "50 euros per week for the accommodation and 100 euros per week for companion", "visa and travel insurance", "medication for malaria and vaccinations", "hotel night in Cotonou on arrival in Benin (about 20-50 euros)", "laundry (2,5 euros)", "possible excursions", "possible extensive translation services (e.g. for personal research)", " ", "How to apply?", "The length of the residential periods", " in Villa Karo ranges from ", "five weeks to three months", ".", "The deadline", " for applications for autumn residencies (from September 1", "st", " to December 31", "st", ") is on ", "March 15", "th ", "and for spring residencies (from January 1", "st", " to May 31", "st", ") on ", "September 15", "th", ".", "The most important part of the application is ", "the work plan", "; preferably related to Africa or African culture.", "The application (", "a short resume and a work plan", ") should include the basic information (name as in passport, date of birth, contact information) and sent as ", "PDF-file", ".", "Applications should be sent to ", "hakemukset[a]villakaro.org", ".", "A detached committee evaluates applications and makes decisions on the residencies.", "For More Information:", "Visit the Official Webpage of the Villa Karo Residency Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/villa-karo-residency-scholarship-program-2018-for-artists-writers-and-researchers/"], [["Obama Foundation Scholars Program 2018/2019 for emerging leaders to study at the University of Chicago", "date announced:March 1, 2018", "Application Deadline: April 10th, 2018."], ["Application Deadline: April 10th, 2018.", "The Obama Foundation Scholars Program", " will give rising young leaders around the world who are already making a difference in their communities the opportunity to take their work to the next level through a newly designed curriculum that brings together academic, skills-based, and hands-on learning. The Scholars Program empowers individuals with a proven commitment to service with the tools they need to make their efforts more effective, to identify innovative solutions to complex global problems, and promote change through values-based leadership.", "The program will build lasting relationships among emerging leaders who are committed to working together to solve the most pressing challenges of our time, creating a global network that reaches across issues and borders. After completing the program, Obama Foundation Scholars will return to their communities and continue the important work they started in the program by implementing their own personalized action plan. They will also have an opportunity to play a role in the Obama Foundation’s efforts to inspire, train, and connect rising leaders from around the globe.", " ", "Requirements:", "Rising leaders from around the world who meet the below criteria are encouraged to apply:", "Significant work experience and professional accomplishments with a clear trajectory of increasing impact.", "Demonstrated record of community service or working for the public good, either through a full-time professional role or significant engagement outside of primary employment.", "Possess a clear focus on a globally applicable challenge.", "A clear commitment to return to and reinvest your new skills in your community after the program concludes.", "Benefits:", "Obama Foundation Scholars at the University of Chicago will earn a Master of Arts degree focused on International Development and Policy at the University of Chicago Harris School of Public Policy.", "In addition to classroom studies, the Obama Foundation will offer a robust program of leadership development and service activities throughout the academic year to help Scholars gain the real-world skills, tools, and experiences to expand the impact of their work when they return home.", "These may include leadership development convenings; program experiences in New York and Washington, DC; speaker series with innovators across a variety of sectors; individual and group service projects; mentorship through the Obama Foundation network; potential internship placements; and action plan development for post-program activities.", "Some of these Foundation activities will include experiences throughout Chicago and the South Side.", "By engaging with the local community, students will have the opportunity to complement what they learn in the classroom and also to bring their unique perspectives to Chicago.", "For More Information:", "Visit the Official Webpage of the Obama Foundation Scholars Program 2018/2019"], "url : https://www.opportunitiesforafricans.com/obama-foundation-scholars-program-2018-2019/"], [["Johnson & Johnson Global Mental Health Scholarships 2018 (Funded to study in the United Kingdom)", "date announced:February 28, 2018", "Application Deadline: Sunday 25 March 2018 midnight (GMT)"], ["Application Deadline: ", "Sunday 25 March 2018 midnight (GMT)", "The ", "MSc Global Mental Health", " course is a joint programme provided by the ", "London School of Hygiene & Tropical Medicine", " (LSHTM) and the ", "Institute of Psychiatry, Psychology & Neuroscience, King’s College London", " (KCL). The programme of study aims to provide students with the knowledge and skills to initiate, develop and oversee mental health programmes and/or policies in low-resource settings, as well as to conduct and critically evaluate research on global mental health. These skills and knowledge will make it possible for students to make valuable contributions in the domains of research, policy and practice as they relate to the discipline of global mental health.", "Award", "The Janssen Global Mental Health Scholarship Fund", " was launched in 2012 through a generous donation from Janssen Pharmaceutica (part of the Johnson & Johnson Family of Companies). To date, 18 students registered on the MSc Global Mental Health have benefited as a result of the scholarships. In 2018, we will be launching the Johnson & Johnson Scholarship Fund, which will provide an additional 18 scholarships over the next five years. This is an annual award until 2022 (for 2022-23 academic year).", "London School of Hygiene & Tropical Medicine", " is offering up to four ", "Johnson & Johnson Global Mental Health Scholarships", " to students accepted onto the 2018-19 ", "MSc Global Mental Health", " programme.", "Eligibility", "Applicants must be nationals of, and ordinarily resident in, one of the following countries:", "Rwanda; Ghana; Kenya; Nigeria; South Africa;", " Thailand; Indonesia; Philippines; Vietnam; Peru; Nicaragua. Applicants from other countries will not be considered for these scholarships.", "Applicants for this funding must hold an offer of admission to the MSc Global Mental Health commencing in 2018-19. To apply for the programme of study please follow the application instructions on the ", "King’s College London MSc Global Mental Health programme website", ".", "Applicants from non-English speaking countries (", "as specified by the Home Office – UKVI", ") must meet the minimum ", "English Language Requirements", " if shortlisted for this funding. Applicants who have been short-listed for this funding will be required to provide proof of English language proficiency within 6 weeks of notification for their scholarship application to be considered any further. A copy of the relevant paperwork must be submitted to the ", "Scholarships Team at LSHTM", ".", "Benefits", "Each scholarship will cover full tuition fees, a stipend (living allowance) of GBP 16,730.00 and an allowance of GBP 500.00 for MSc project expenses.", "Timelines", "The deadline for applications is ", "midnight (GMT)", " on ", "Sunday 25 March 2018", ".", "Notification of the results of short-listing stage and invitations for an interview will be made by Thursday 24 May 2018 at the latest.", "Notification of final result of your application will be made by Thursday 31 May 2018.", "How to apply", "To apply for this funding applicants must submit:", "an application for study for the MSc Global Mental Health programme through the ", "King’s College London", " online application portal,", "and", "a Scholarship Application, via the ", "School’s Online Scholarship Application", ", indicating that you are applying for the ", "2018-19 J&J GMH Scholarship", ". As part of this application you should upload a completed ", "J&J GMH Supplementary Questions", " sheet by the scholarship deadline.", "Please note that incomplete applications will not be considered.", "By submitting an application for this funding applicants agree to its ", "Terms & Conditions", ".", "For More Information:", "Visit the Official Webpage of the Johnson & Johnson Global Mental Health Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/johnson-johnson-global-mental-health-scholarships-2018/"], [["Rhodes Global Scholarship 2018/2019 for study in the University of Oxford (Fully Funded)", "date announced:February 19, 2018", "Application Deadline: June 30th 2018"], ["Application Deadline: June 30th 2018", "The", " Rhodes Scholarship", " is a ", "postgraduate", " award supporting exceptional students from around the world to study at the University of Oxford.", "Eligibility criteria", "The following eligibility criteria apply to all applicants for the Rhodes Scholarship:", "Citizenship & residency:", " You must meet the citizenship/residency requirements of one of the Rhodes constituencies – please refer to our full list of ", "Rhodes constituencies and the countries they include", ". If you do not meet any of these requirements, then you can apply for our new Global Rhodes Scholarship.", "Age:", " You must have reached your 18th birthday and not have passed your 24th birthday on 1 October in the year of application. There is some variation on the upper age limit across constituencies depending on the local environment. Please check carefully the specific age requirements for your constituency before applying. Successful candidates will arrive in Oxford the October following the selection process. The Scholarship may not be deferred.", "Education:", " Rhodes Scholars must have completed a Bachelor’s degree before coming up to Oxford, to a sufficiently high standard to meet both the Rhodes and the Oxford criteria. Please consult the detailed information provided by the constituency to which you are applying on our ", "How to apply for a Rhodes Scholarship", " page and the prospectus pages of the ", "University of Oxford", ". NB Some constituencies require completion of your undergraduate degree in the year of application for the Scholarship.", "Rhodes Selection criteria", "Though expressed in the old-fashioned language of the founding documents (see ", "History of the Rhodes Trust", "), the selection criteria governing selection across all Rhodes constituencies remain as relevant today as they were over 100 years ago:", "literary and scholastic attainments (academic excellence)", "energy to use one’s talents to the full (as demonstrated by mastery in areas such as sports, music, debate, dance, theatre, and artistic pursuits, particularly where teamwork is involved)", "truth, courage, devotion to duty, sympathy for and protection of the weak, kindliness, unselfishness and fellowship", "moral force of character and instincts to lead, and to take an interest in one’s fellow beings.", "These are the essential qualities which Selection Committees are looking for, though their embodiment will be diverse and unique to each individual.", "TIMELINE FOR THE AWARDING OF THE GLOBAL SCHOLARSHIPS", "30 June 2018                                      ", "Nominations deadline (Universities)", "30 September 2018                         ", "Application deadline (Applicants)", "October 2018                                     ", "Shortlisting and preliminary interviews", "November 2018                                ", "Final selection interviews at Rhodes House, Oxford", "Early January 2019                           ", "Deadline for applications to Oxford University", "Late September 2019                     ", "Arrival in Oxford to commence studies", "For More Information:", "Visit the Official Webpage of the Rhodes postgraduate Global Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/rhodes-global-scholarship-2019/"], [["Ruth First Educational Trust Scholarships 2018/2019 for Southern Africans to study in the United Kingdom (Fully Funded)", "date announced:February 13, 2018", "Application Deadline: March 15th 2018"], ["Application Deadline: March 15th 2018", "The aim of the ", "Ruth First Educational Trust", " is to enable southern African students from historically disadvantaged backgrounds to undertake postgraduate study at the University of Durham. Southern Africa is defined for this purpose as comprising the following countries: ", "Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, Republic of South Africa, Swaziland, Zambia and Zimbabwe.", "Scholarships make an important contribution towards social, educational and economic development in the region. In addition to their value to individuals they have wide developmental impact, within and beyond southern Africa.", "Ruth First Scholars have played positive leadership roles in their communities and are chosen for their active commitment to good causes, as well as for their academic ability.", "Eligibility Requirements:", "Geographical Criteria", "Applicants must be a national of one of the following countries:", "Angola", "Botswana", "Lesotho", "Malawi", "Mozambique", "Namibia", "Republic of South Africa", "Swaziland", "Zambia", "Zimbabwe", "Level of Study", "Taught Master’s Degree programmes", "Mode of study", "Full time", "Year of Entry", "Applications for programmes commencing 2018/19 Accepted from 8th January 2018", "Programmes", "All programmes EXCEPT MBA", "Further Information", "Applicants should:", "hold a relevant honours degree of sufficient standard to be admitted to your chosen Master’s course; and", "not hold a Master’s degree, nor have previously studied at a university outside southern Africa, and", "show evidence of active involvement in and commitment to voluntary work for the benefit of causes such as rural or urban community development; young people or educational projects; charitable organizations; health or AIDS awareness projects; student welfare or guidance; the defence of human rights; the promotion of equal opportunities or social justice; environmental sustainability. If you have a paid job that involves working in such areas, you should show evidence of leadership and commitment beyond the requirements of the job.", "Benefits:", "* Full payment of tuition fees", "\n* Stipend for living expenses – 12 monthly payments", "\n* one return air ticket from the home country to the UK and the cost of return travel between the UK airport and Durham City", "\n* Fully funded accommodation and meals at St Chad’s College", "\n* ‘Settling in allowance’ on arrival", "\n* A contribution towards the cost of a UK visa and the UK Health surcharge", "How to Apply:", "Please use ", "this Application form ", "to Apply for this Scholarship.", " ", "Application deadline", "15th March 2018", "When candidates will hear the outcome of their application", "Mid-May 2018", "For More Information:", "Visit the Official Webpage of the Ruth First Educational Trust Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/ruth-first-educational-trust-scholarships-2018-for-southern-africans/"], [["Türkiye Undergraduate & Postgraduate Scholarships Program 2018 for Studies in Turkey (Fully Funded)", "date announced:February 20, 2018", "Application Deadline: March 5th 2018"], ["Application Deadline: March 5th 2018", "Türkiye Scholarships", " ", "are ", "government-funded competitive scholarships", " awarded to international students and researchers to pursue full-time degree and research programs at the most prestigious universities in Turkey.", "Apart from providing education opportunities at an international caliber as well as a wealth of knowledge and experience, Turkey also offers scholarships to outstanding international students from all over the world to study in the most prestigious universities in Turkey.", "Requirements:", "Candidates must not be older than 21 years of age for undergraduate degree, 30 years of age for master’s degree and 35 years of age for doctoral degree.", "The list of countries open only for ", "postgraduate", " applications in the second round are as follows:", "Algeria, Andora, Antigua and Barbuda, Bahrain, Bangladesh, Barbados, Belize, Benin, Belarus, Bolivia, Bosnia and Herzegovina, Brunei, Bulgaria, Burkina Faso, Cape Verde, Central African Republic, Djibouti, Cambodia, Cameroon, Chad, China, Comoros, Congo, Croatia, Cuba, Democratic Republic of Congo, Dominica, Egypt, Equatorial Eritrea, Estonia, Ethiopia, Finland, French Guiana, Gabon, Gambia, Ghana, Greece, Guinea, Guinea Bissau, Grenada, Guyana, Georgia, Haiti, Hungary, Indonesia, Iraq, Iran, Israel, Ivory Coast, Jamaica, Jordan,  Kazakhstan, Kosovo, Kuwait, Laos, Latvia, Liberia, Libya, Lithuania, Lebanon, Madagascar, Macedonia, Malawi, Mali, Marshall Islands, Mauritania, Mexico, Montenegro, Mongolia, Morocco, Niger, Nigeria, North Korea, Oman, Palau, Palestine, Poland, Qatar, Romania, Russia, Saint Kitts and Nevis, Saint Lucia, Saudi Arabia, Sao Tome and Principe, Senegal, Serbia, Sierra Leone, Slovakia, Slovenia, Somalia, Sudan, Suriname, Syria, St. Vincent and the Grenadines, Taiwan, Togo, Trinidad and Tobago, Tunisia, Turkish Republic of Northern Cyprus, United Arab Emirates, Uzbekistan, Venezuela, Yemen ", "postgraduate", " applications will be received in the second round between ", "5 February – 5 March 2018", "; while ", "undergraduate", " applications will be received in the third round between ", "16 April – 27 May 2018", ".", "Applicants who apply to Türkiye Scholarships must be a graduate or able to graduate at the end of the current academic year.", "Candidates have to meet the criteria of the university and department which they choose. If it is requested by the university or department, candidates must submit the necessary documents such as the scores of SAT, TOEFL, DELF, YDS, etc. Applications of candidates who do not submit the required documents will not be evaluated.", "Application can only be made online through www.turkiyeburslari.gov.tr. Candidates are required to submit/upload all the required information and/or documents through the application system.", "Applications made by post, courier or by hand will not be accepted.", "Apply Now for the Türkiye Undergraduate & Postgraduate Scholarships Program 2018 ", "For More Information :", "Visit the Official Webpage of the Türkiye Undergraduate & Postgraduate Scholarships Program"], "url : https://www.opportunitiesforafricans.com/turkiye-undergraduate-postgraduate-scholarships-program-2018-for-studies-in-turkey/"]]