[[["AstraZeneca Young Health Programme Scholarship 2019 to attend the One Young World Summit 2019 in London, United Kingdom (Fully Funded)", "date announced:April 2, 2019", "Application Deadline: May 25th 2019"], ["Application Deadline: May 25th 2019", "Through the ", "Young Health Programme (YHP), AstraZeneca", " ", "works to engage and empower young people with information so that they can make healthy choices today that will lead to better health later in life. Youth are at the heart of YHP’s activities providing young people with a powerful voice in identifying their own health needs as well as planning and delivering solutions.", "This year, ", "AstraZeneca", " is collaborating with One Young World to offer 18 scholarships to inspiring young leaders to attend the ", "One Young World Summit 2019 in London, United Kingdom", ". The successful scholars will join 7 other YHP youth delegates who are already involved with the programme, as peer educators, advocates, NGO partners or community youth leaders. In addition to attending the Summit, YHP scholars will participate in a pre-Summit workshop to meet the delegation, share information about their background and get prepared for what will be an incredible experience in London.", "Requirements:", "AstraZeneca", " is looking for young people (aged 18 – 30) who work for or are involved with a non-governmental organisation, social enterprise, community based organization, or who are individuals making an impact through advocacy activities or direct programming related to fighting the burden of non-communicable diseases. In particular this scholarship seeks to support young leaders making an impact in at-least one of the following areas:", "Tackling tobacco use and alcohol consumption", "Increasing physical activity and exercise", "Improving diet and nutrition", "Raising awareness of mental health and supporting people with mental health problems.", "Tackling pollution and improving air quality", "Benefits:", " Access to the One Young World Summit 2019 in London", "Hotel accommodation on a shared basis between 21 and 25 (inclusive) October, 2019", "The cost of travel to and from London (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Access to Youth Health Programme pre-Summit workshop", "Discretionary funds to cover reasonable out of pocket expenses connected with getting to and from the Summit (these can be claimed by Scholars after the Summit) ", "For More Information:", "Visit the Official Webpage of the AstraZeneca Young Health Programme Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/astrazeneca-young-health-programme-scholarship-2019/"], [["The Inter-University Council for East Africa (IUCEA)/World Bank Masters Scholarships 2019/2020 for Female African Students (Fully Funded)", "date announced:April 5, 2019", "Application Deadline: June 30th 2019"], ["Application Deadline: June 30th 2019", "The World Bank is partnering with eight Governments in Eastern and Southern Africa in an innovative project with the aim of improving the quality of training and research in higher education, and reducing the skill gaps in key development priority areas. ", "The Eastern and Southern Africa Higher Education Centers of Excellence (ACE II) ", "Project supports the governments of Ethiopia, Kenya, Malawi, Mozambique, Rwanda, Tanzania, Uganda, and Zambia in strengthening selected African Centers of Excellence (ACEs) to deliver quality post-graduate education and build collaborative research capacity in the following priority areas: ", "(i) Industry, (ii) Agriculture, (iii) Health, (iv) Education, and (v) Applied Statistics. The ACE II Project implements three components, namely (i) strengthening the 24 higher education institutions into regional ACEs in Eastern and Southern Africa in a set of defined regional priority areas (US$ 140 million); (ii) providing capacity building support to these ACEs through regional activities (US$3 million); and (iii) supporting coordination and management of the implementation of components (i) and (ii) (US$5 million). ", "As Regional Facilitation Unit (RFU) for the ACE II Project, the Inter-University Council for East Africa (IUCEA) leads the implementation of key elements of Component 2 of the project, aimed at building strong and sustainable regional partnerships and collaborations to produce competent Masters and PhD holders for the regional market and improve quality of teaching in higher education, and the quality of production and services in public and private sectors. ", "To encourage the participation of young African female students at postgraduate level, IUCEA wishes to implement a Fellowship Program aimed at providing competitive Masters Scholarships to academically deserving future talents to promote regional female student mobility. Eligible female applicants who can demonstrate interest and ability in the priority areas are encouraged to apply for the 30 Fellowships available for the 2019/2020 academic year.", "ELIGIBILITY\nCRITERIA", "In order to be eligible\nfor this Fellowship, the applicant must:", "be a female national of one of ACE II participating countries (Ethiopia, Kenya, Malawi, Mozambique, Rwanda, Tanzania, Uganda and Zambia) or Burundi", "be under the age of thirty five (35) years", "be a holder of a Bachelor’s Degree from a reputable university in the relevant field, at the level of Upper Second Class Honours ", "have obtained admission from an ACE ", "outside one’s own country", " of current nationality to study full-time in any of the priority disciplines of the ACE II Project: (i) STEM (Science, Technology, Engineering and Mathematics) or Industry, (ii) Agriculture, (iii) Health, (iv) Education, and (v) Applied Statistics; and", "have demonstrated outstanding academic achievement as evidenced by academic transcripts, and academic awards, if any. ", "THE FELLOWSHIP AWARD", "The\nprovided financial support for each Fellowship Program will cover:", "University tuition fees:", " Approximately USD 3,000\nper year (payable directly to the Host University according to an official\ninvoice)", "Stipend:", " USD 800 per month to\nsupport living expenses such as housing, food, utilities, local transportation,\nmedication and settlement expenses", "Research:", " USD 4,800 to support\nstudent research, payable upon approval of research proposal", "Allowance: ", "USD 2,000 one-off\nallowance to cover visa, laptop and books", "Air ticket:", " A round-trip economy\nfare for the most direct route between the beneficiary’s home country and the\nstudy destination of Host University ", "Note", ":\n", "Candidates must complete all academic\nwork within 24 months and the scholarship will not be extended beyond this\nperiod.", "APPLICATION\nPROCESS AND PROCEDURES", "To apply for this Fellowship,\ninterested candidates are advised to fill in the application form found at ", "ace2.iucea.org", "\n or ", "www.iucea.org", "\nattach\nall requested documents, and send by e-mail to ", "[email protected]", " with a copy to ", "[email protected]", ".\nAll\napplications must be received not later than 5.00 PM East African Time on ", "June 30\n2019", ". For proof of eligibility, an applicant should ensure that the\nfollowing is provided:", "Completed application form;", "Recent passport-size photograph;", "Summarized CV with names and contacts of two referees;", "Certified copies of academic certificates and transcripts;", "Certified copies of passport or national identity card indicating citizenship; ", "Copy of admission letter from one of the host universities (please refer to the attached table on Countries, ACEs and Universities); and ", "Two (2) reference letters with contact details.", "Download Application form", " / ", "List of ACEs ", "For More Information:", "Visit the Official Webpage of the IUCEA/World Bank Masters Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/iucea-world-bank-masters-scholarships-2019-2020/"], [["Civil Society Leadership Awards 2020/2021 for Social Change Agents (Fully Funded Master’s Degree Scholarships)", "date announced:March 22, 2019", "Application Deadline: midnight, May 15, 2019, Eastern Daylight Time. "], ["Application Deadline: midnight, May 15, 2019, Eastern Daylight Time. ", "The Civil Society Leadership Awards (CSLA)", " ", "provide fully-funded scholarships for master’s degree study to individuals who clearly demonstrate academic and professional excellence and a deep commitment to leading positive social change in their communities. Eligibility Criteria ", "Applicants must meet all of the following criteria:", "be a citizen of an eligible country;", "demonstrate maturity, flexibility, and civil society leadership potential", "have an earned bachelor’s degree as of May 15, 2019 with an excellent academic record;", "demonstrate professional experience related to your chosen field of study;", "demonstrate proficiency in the language of instruction (English,\nGerman or French) at a level required for admission by host\nuniversities;", "be able to participate in an intensive pre-academic summer school in\nJuly or August 2020 and start their degree program in August or\nSeptember 2020;", "be able to receive and maintain a visa or study permit as required by the host country; and", "demonstrate a clear commitment to their home country or region to strengthen open society development.", "The awards are available to citizens of the following countries:  ", "Afghanistan", "Azerbaijan", "Belarus", "Cambodia", "Democratic Republic of Congo", "Egypt", "Equatorial Guinea", "Eritrea", "Ethiopia", "Laos", "Libya", "Myanmar/Burma", "Republic of Congo", "South Sudan", "Sudan", "Syria", "Tajikistan", "Turkmenistan", "Uzbekistan", "Awards are available for study in the following areas:", "Communications, Journalism & Media", "Culture, History & Society", "Development Studies", "Economics", "Education Management & Leadership", "Environment & Natural Resource Management", "Gender Studies", "Human Rights", "Law (including Human Rights law)", "Politics & International Studies", "Public Health Policy & Health Management", "Public Administration", "Public Policy", "Social Policy", "Social Work", "\nGuidelines", "Selection and Notification Cycle", "Applications must be submitted by midnight, May 15, 2019, Eastern Daylight Time.", "Uncompetitive and/or ineligible applicants will be notified in late August. ", "Applicants who pass external review become semi-finalists and will\nbe invited to an interview to be scheduled in late September or October.", "Semi-finalists are required to secure two (2) letters of\nrecommendation which must be submitted directly to CSLA by referees by\nOctober 1, 2019. ", "Semi-finalists will be required to take an official language test by\nthe end of October 2019; all candidates invited to an interview are\nentitled to one (1) language test, arranged and paid for by CSLA.", "Final selection will be held in November; results will be sent via email by January 2020.", "Successful semi-finalists are now CSLA finalists, and CSLA staff will initiate their host university placement process.", "The CSLA university placement process takes time; CSLA will strive to confirm placements for finalists by late April 2020.", "Once placement is secured, CSLA finalists will be notified that they\nare now CSLA grantees, and will be asked to sign and return a formal\ngrant document before any further actions can be taken. ", "Interested applicants must complete an online or paper CSLA\napplication and submit along with supporting documentation to be\nconsidered for CSLA support. ", "Online Application", "All candidates are strongly encouraged to apply online if possible using the ", "Open Society Foundations grant portal", ", an online platform. To apply online, please register on ", "the portal", " and then follow instructions.", "For More Information:", "Visit the Official Webpage of the Civil Society Leadership Awards 2019/2020"], "url : https://www.opportunitiesforafricans.com/civil-society-leadership-awards-2020/"], [["Total/NNPC International Masters Scholarships 2019/2020 for young Nigerian graduates (Fully Funded to France)", "date announced:March 15, 2019", "Application Deadline: March 28th 2019"], ["Application Deadline: March 28th 2019", " Annually, ", " Total,", " in partnership with NNPC and its corporate partners, select and sponsor young Nigerian scholars for Master’s Degree programs in Arts, Management Sciences, Social Sciences, Engineering and Geosciences (Oil & Gas related) in top universities in France. ", "The award is full board. Total welcomes applications from suitably qualified young Nigerians for any of the programmes in the schools below. ", "1. ", "IFP School (Petroleum Engineering)", "12 months of classes and 6 month internship", "Specialized Master in Petroleum Geosciences Geology", "Specialized Master in Petroleum Geosciences Geophysics", "Specialized Master in Reservoir Geoscience and Engineering ", "11 months of classes and 6 month internship", "​Specialized Master in Processes and Polymers ", "Specialized Master in Petroleum Economics and Management", "Specialized Master in Petroleum Data Management", "2. ", "Ecole des Mines d’Ales IMT", "Disaster\nManagement, environment, human and social sciences, Information et\nCommunication Technologies (18 month academic program + 6 month\ninternship , Possibility of doing it home country or in France)", " 3. ", "Ecole des Mines de Nantes IMT Atlantique (Engineering and environment)", "Master in Project Management for Environnemental and Energy Engineering (PM3E) – 2 years", "Master in Process and Bioprocess Engineering – Project Management for Environmental & Energy Engineering (PM3E) 2 years", "MSc Management and Optimization of Supply Chains & Transport (18 month acadamic program + 6 month internship)", "4. ", "Ecole Centrale de  Nantes (Engineering) ", " – 2 years", "Master in Applied Mechanics on Computational Structural MechanicsMaster in Applied Mechanics on Design of Production and Systems", "Master in Applied Mechanics on Metallic and Composites Complex Assemblies", "Master in Control Engineering and Production Systems on Automatic control, Robotics, Signal and  mage", "5. ", "Institut Supérieur d’Électronique de Paris (ISEP)", "ISEP Engineering Master Degree in computer Science – 2 years", "6. ", "INSA Toulouse (Engineering)", "Master in Fluids Engineering for Industrial Processes – 2 years", "Advanced Master in Safety Engineering and Management – 1 year", "Advanced Master on Innovative and secure IoT systems – 1 year", "7. ", "ICSI Toulouse", " (HSE)", "Master in Safety Engineering and Management (HSE) – 2 years", "8. ", "Arts et Metiers ParisTech – 1 year", "Petroleum Geosciences & Engineering/ forage et Production", "MSc Knowledge Integration in Mechanical Production", "Master Degree in Materials and Engineering Sciences", "9. ", "ENSG Lorraine – 2 years", "Master Subterranean Reservoirs of Energy: Hydrodynamics Geophysics – Modeling", "10. ", "ENSGTI Pau – 2 years", "Chemistry International Studies (Chem.I.St)", "International Master “SIMOS“ : SIMulation and Optimization of energy Systems", "Context and environment", "Other programmes are:", "11. ", "ENSIC Nancy", "Chemistry International Studies – 2 years", "12. ", "GRENOBLE INP", "1 year", "Mécanique et energétique", "Master CyberSecurity (CySec)", "2 years", "MSc in Electrical Engineering for Smart Grids and Buildings", "Mechanics: Fluid Mechanics and Energetics – FME", "Master in Sciences and Materials Engineering", "Electrochemistry and Processes", "Master in Sustainable Industrial Engineering", "Master MSE – Program Biorefinery and Biomaterials", "MSc in Integration, Security and TRust in Embedded systems", "Master of Science in Industrial and Applied Mathematics (MSIAM)", "Master in Hydraulic and Civil Engineering", "13. ", "HEC Paris (Business)", " – 10 month academic program + 6 month internship", "MSc Sustainability and Social Innovation", "MSc in International Finance (MIF)", "MSc Strategic Consulting", "MSc Managerial and Financial Economic", "14. ", "EDHEC Business School", " – 2 academic semesters + 3-6 month internship", "MSc in International Accounting & Finance", "MSc in Finance", "MSc in Management Studies", "MSc in Entrepreneurship & Innovation Management", "15. ", "ESC Rennes (Business)", " – 15 month academic programme including a 4 month internship ", "MSc in International Management", "MSc in Global Business Management", "MSc in International Finance", "16. ", "Sciences Po Paris", " (Political Science, Law and Business)", "1 year", "LLM in Transnational Arbitration & Dispute Settlement", "Master in Corporate Strategy", "Master in Financial Regulation and Risk Management", "2 years", "Master in Public Affairs", "Master in International Energy", "Master in International Management and Sustainability", "Master in Environmental Policy", "17. ", "Université de Cergy-Pontoise", " – 1 year ", "LL.M in Law and Business Ethics", "Master (LLM) M. in Business and Taxation Law", "18. ", "CNAM ", "–  1 year", "Master of Science in Telecommunications and Networks", "Master of Business Administration", "19. ", "Polytechnique Palaiseau", " – 2 years", "MSc Internet of Things: Innovation and Management", "MSc Ecotechnologies for Sustainability and Environment Management", "MSc  Energy Environment: Science Technology and Management – STEEM", "20. ", "ESCP Europe", " (Energy Management)", "MSc in Energy Management (MEM) – 3 academic semesters (London-Paris-London) + 4-6 month internship", "21. ", "University of Lyon 1", "MSc Synthesis, catalysis and sustainable chemistry – 1 year", "22. ", "EM LYON Business School", "Quantitative Finance – 1 year", " 23. ", "Université de Grenoble Alpes", " –  2 years", "MSc in Chemistry  – five specialties", "MSc  in Earthquake Engineering & Engineering Seismology", "The advert closes ", "two (2) weeks", " from the date of this publication. Only short-listed candidates will be contacted.", "THE SELECTION EXERCISE WILL TAKE PLACE IN APRIL 2019\n", "Candidate profile", "Interested applicants must have obtained a university degree (minimum of second class upper) ", "not earlier than (5) years ago", " and must have completed the mandatory NYSC programme.", "Offer ID: 17215BR", "Métier", "Production\nGeneral Resp, Upstream Operations, Flow Managemet Optimisation,\nTechnology, General Operations Responsab, Control Laboratory, General R\n& D Responsibilities, Upstream R&D, Process R&D, Products\nR&D, Materials Sciences R&D, Analysis R&D, Biology\nBiotechnology R&D, Digital Simulation/STIC R&D,\nApplications/Systems R&D, HSE R&D, Support R&D", "For More Information:", "Visit the Official Webpage of the Total/NNPC International Masters Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/total-nnpc-international-masters-scholarships-2019-2020/"], [["Beit Trust Postgraduate Scholarship 2019/2020 for Southern Africans to study in the United Kingdom (Fully Funded)", "date announced:April 3, 2019", "Application Deadline: 11 MARCH 2020. "], ["Application Deadline: ", "11 MARCH 2020. ", " In 2019, the Trust has awarded over 20 new Scholarships at British and South African universities, by means of generous academic partnerships with leading institutions. ", "The Beit Trust", " has ", "partnership agreements", " with the universities below. This enables the Trust to share costs, and to increase the number of scholarships it can fund. For this reason, ", "only applicants with acceptances from the universities listed will be eligible for Beit Scholarships", ".", "There are six universities in the United Kingdom: ", "Cambridge, Edinburgh, Glasgow, Leeds, Oxford and Strathclyde", ".", "There are currently three active partners in South Africa: ", "Rhodes, Stellenbosch and UCT", ".", "These partnerships allow us to award joint scholarships (e.g. Beit-Cambridge, Beit-UCT, etc.), and may change from time to time. ", "Applicants must first apply to, and be accepted by, a Beit partner university before applying to the Trust for a scholarship", ".", "Requirements:", "The next round of Beit Scholarships will be awarded for the academic year beginning ", "September 2020", " for universities in the UK; and ", "January 2021", "\nfor universities in South Africa. Scholarships for the academic year\nbeginning September 2019 (UK) and January 2020 (SA) have already been\nawarded.", "Please read", " the section above, on the Trust’s ", "Joint University Partnerships", ". As set out, the Trust has jointly-funded academic partnerships with six universities in the UK, and three in South Africa. We will fund successful applicants to these universities ", "only", ".", "Benefits:", "Fees, tuition costs and related academic expenses. These are paid by the Trust direct to the universities.", "A personal allowance, index-linked in accordance with guidance from an independent authority, covering maintenance support.", "Other allowances are paid for arrival, a laptop and a return flight home.", "Economy Class tickets are provided for the initial journey to the place of study, and on final return.", "No allowances are paid for spouses and other family members.", "The process for applying for a Beit Scholarship is as follows:", "Only\nnationals of Zambia, Zimbabwe and Malawi, who are also resident in and\nintend to return to those countries, are eligible to apply;", "Applications\nshould be for a one-year taught Master’s Degree (to UK universities);\nand a two-year taught Master’s in South Africa;", "Applications should be made ", "directly", " to the partner universities listed above, and ", "only", " to those universities, ", "via their websites and in the period beginning September 2019", " (although some application windows do not open until October. Their websites will guide you).", "As\nlong as the courses to be pursued are available, you may apply to more\nthan one partner university at a time, and might wish to do so to\nincrease your chances of acceptance;", "Once you have a\nconditional acceptance or an offer from your chosen partner university,\nyou should apply as early as possible to The Beit Trust for a\nscholarship, using this ", "linked application form", ".", "The\nTrust will then sift and shortlist the most qualified, for interview by\nnational selection boards in Zambia, Zimbabwe and Malawi. The boards\nwill sit in April 2020.", "Resources are limited and the\nscholarship process competitive. Not all those interviewed will\nnecessarily be selected for a Scholarship. ", "But an interview is essential to selection;", "The Trust will notify those selected for interview of the date, time and place;", "The\nTrust will give particular weight to those who have work or other\nprofessional experience; have demonstrated a capacity to become leaders\nin their field; are reading for a degree of direct and practical\nrelevance to the development of their country; and whose stated\nintention is to return to their country at the completion of their\ndegree.", "If you are interested in a Beit Scholarship, and as a help in tracking potentially qualified applicants, would you please:", "Notify the relevant university, as part of your study application, that you will be approaching the Beit Trust for scholarship funding. Please indicate your work or professional experience;", "Notify the Trust once you have submitted an application to a partner university;", "Tell the Trust which course you’ve applied for; ", "Confirm your nationality to the Trust;", "Zimbabweans and Malawians should send their application forms to ", "[email protected]", "Zambians should send theirs to ", "[email protected]", "If you need any further information about applying for a ", "Beit Scholarship", ", and are from ", "Zambia", ", please contact the Scholarship Secretary on ", "[email protected]", "If you are from either ", "Zimbabwe", " or ", "Malawi", ", please contact the Harare Scholarship Secretary on ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Beit Trust Postgraduate Scholarship 2019 "], "url : https://www.opportunitiesforafricans.com/beit-trust-postgraduate-scholarship-2019-2020/"], [["African Trans-Regional Cooperation through Academic Mobility (ACADEMY) Consortium Scholarships 2019 for young Africans (Fully Funded)", "date announced:March 26, 2019", "Application Deadline: April 30th 2019"], ["Application Deadline: April 30th 2019", "The Intra-Africa Academic Mobility Scheme", " supports higher education cooperation between countries in Africa. The scheme aims to promote sustainable development and ultimately contribute to poverty reduction by increasing the availability of trained and qualified high-level professional manpower in Africa.", " ", "The programme’s objective is to improve the skills and competences of students and staff through enhanced mobility between African countries. Strengthening cooperation between Higher Education Institutions (HEIs) in Africa will increase access to quality education and will encourage and enable African students to undertake postgraduate studies in the African continent.", "Eligibility Criteria", "Applicants for all types of scholarships must:", "Be nationals and residents in any of the eligible African countries.", "Have sufficient knowledge of the language of instruction of courses in the host country.", "Fulfill the criteria of one of the target groups below:", "Students having previously benefitted from a scholarship under the\nIntra-ACP or the Intra-Africa Academic Mobility Schemes are NOT\neligible.", "Target Group 1 (TG1)", "For Master and PhD credit-seeking mobility applicants: Students\nmust be registered in one of the five partner universities: Université\nde Tlemcen (Algeria), University of Cape Coast (Ghana), Kenyatta\nUniversity (Kenya), University of Ibadan (Nigeria), and University of\nKwaZulu-Natal (South Africa).", "For staff: Staff must be working in one of the five partner", " universities.", "Target Group 2 (TG2)", "For credit-seeking mobility applicants: Students must be registered in any African Higher Education Institution.", "SCHOLARSHIP COVERAGE", "\nThe Scholarship covers:", "\n Monthly subsistence allowance for the entire mobility period", "\n Extra allowance per academic year to female students (for mobility equal to or", "\nlonger than two academic years)", "\n Settling in allowance (for students only)", "\n Roundtrip flight ticket and visa costs – for mobility equal to or longer than two academic", "\nyears, two roundtrip tickets will be provided (arranged by the coordinating", "\ninstitution on behalf of students)", "\n Comprehensive insurance (Health, Accident and Travel) (arranged by the coordinating", "\ninstitution on behalf of students)", "\n Participation costs such as tuition fees, registration fees and service fees where", "\napplicable (paid directly to the hosting institutions)", "\n Research costs for students on mobility for 10 months or more (based on actual research", "\nneeds and dependent on a request submitted by the students).", "Required documents", "Photo", " (mandatory for all types of scholarships). ", "Video", " (optional). ", "Formal Identity Card ", "(mandatory for all types of\nscholarships) – Must be issued by a national authority otherwise it will\nnot be considered valid and the application will be immediately\nexcluded. In case your country does not issue such document it is\nmandatory to upload a copy of your passport. ", "Passport", " (optional when a formal identity document has been uploaded). ", "Certificate proving the previously obtained degree ", "(mandatory\nfor Master mobility, PhD mobility, and Staff mobility)– Must be issued\nby a university, dated, signed and stamped, otherwise it will not be\nconsidered valid and the application will be immediately excluded. In\nthe case of having achieved more than one academic degree, the uploaded\nfile must contain the scan of all documents. It is not necessary to\ncertificate the diploma through the ", "apostille", " stamp. ", "Transcript of Records ", "(mandatory for Master\nmobility and PhD mobility): must be issued by the home university,\nstating in detail all courses taken and grades obtained. This document\nmust be dated, signed and stamped by the institution, or have an\nofficial digital certification, otherwise it will not be considered\nvalid and the application will be immediately excluded.", "Important:", " The Transcript of Records is the one of the course the students are ", "currently enrolled", ".", "Statement of the Home Institution (partner) with a brief description of the applicant’s main activity", " (Mandatory for Academic and Administrative Staff)This\ndocument must be dated, signed and stamped by the institution,\notherwise it will not be considered valid and the application will be\nimmediately excluded. The declaration should be written in the language\nof the host University or, in case of choosing several host\nUniversities, in English, by the responsible person for the applicants’\nactivities/project at the home institution. ", "Statement of support from the University of origin (", "Mandatory\nfor Target Group 1, TG1)- This document must be issued by a professor\nor by the respective academic department of the applicant. It must be\ndated, signed and stamped by the home institution, otherwise it will not\nbe considered valid and the application will be immediately excluded.\nThis document is mandatory for all exchange applicants (non-degree\nseeking mobility) and staff members. Other applicants are advised to\ninclude this statement of support but such document is not mandatory. ", "Statement issued by the home institution confirming the applicant’s enrollment in the degree course", " (mandatory for Master mobility and PhD mobility). ", "Certificate of language skills ", "(mandatory for all types of scholarships)-\nThis document must be dated, signed and stamped by the issuing\ninstitution. If the host institution you’re applying to demands the\npresentation of a language certificate (eg. French or English), the\ndocument is mandatory. If this document is not uploaded, the application\nwill be immediately excluded from the project without possibility of\nappeal. In other cases when institutions do not require it, it is\noptional ( So as to know whether the certificate is mandatory, please\ncheck the academic offer in the “Courses” section in the website). ", "Declaration of Honour from the applicant – This document must be dated and signed", " (mandatory for all types of mobility and the document is available in the application form for downloading). ", "Document that specifically proves your actual status of physical disability (if applicable).", " ", "Document that specifically proves your vulnerable socio-economic situation (if applicable). ", "This\ndocument must be dated, signed and stamped by the issuing entity. In\ncase you fail to do so we will not consider you as a candidate in\nparticularly vulnerable socio-economic situation. ", "Motivation Letter", " ", "Other documents relevant for the application that you may consider.", " ", "Selection ", "After the application deadline, first the local Academic Evaluation\nCommittee and then the Consortium Management Group (endorsing\nrecommendations made by the Consortium Selection Committee) will review\nall received applications. ", "Only complete applications will be considered for selection.", "\nYour application is complete if you have uploaded all the requested\ndocumentsand filled in the form completely. The home and host\nuniversities of the consortium will work together to evaluate the\napplications based upon the following criteria:", "Academic merit.", "Motivation for the mobility period.", "Language skills.", "Research Project (for PhD).", "Research/Teaching/Working Plan (for academic and administrative staff).", "Scientific Production/Previous experience (for academic and administrative staff).", "For More Information:", "Visit the Official Webpage of the ACADEMY Consortium Scholarships"], "url : https://www.opportunitiesforafricans.com/african-trans-regional-cooperation-through-academic-mobility-academy-consortium-scholarships-2019/"], [["Dutch Ministry of Foreign Affairs (MFA) Scholarships to Attend One Young World Summit 2019 (Fully Funded to London,UK)", "date announced:March 27, 2019", "Application Deadline: April 14th 2019"], ["Application Deadline: April 14th 2019", "Do you care about youth employment and have you had an active role in promoting it? Are you aged between 18 and 34? And would you like to come to the One Young World Summit in London from 22 to 25 October, and an additional pre-Summit programme in the Netherlands on 21 October? ", " This October, London will host the One Young World Summit 2019 alongside its 10th anniversary. The Summit will see 2000 young leaders from 190+ countries descend to London for the global forum for young leaders. During the Summit, delegate will present and debate solutions to our time’s most pressing issues alongside senior leaders such as musician and activist Sir Bob Geldof, Nobel Peace Prize Laureate Professor Muhammad Yunus, former President of Ireland Mary Robinson and CEO of DSM Feike Sijbesma. ", "The Dutch Ministry of Foreign Affairs prioritises improving young people’s prospects in a number of developing countries and fragile states by encouraging local entrepreneurs and creating jobs. ", "The Dutch MFA will collaborate with OYW and will provide support to 50 delegates to participate in the global Summit around creating youth employment opportunities for prosperous and peaceful societies.", "Eligibility Criteria", "Aged 18 – 34 by date of One Young World Summit 2019.", "Residents in a country from one of the following countries are eligible for the scholarship: ", "Algeria, Burkina Faso, Egypt, Ethiopia, Iraq, Jordan, Kenya, Lebanon, Mali, Morocco, Niger, Nigeria, Senegal, Sudan and Tunisia", "50% of the candidates will be female.", "All candidates need a working understanding in English.", "Candidates by date of OYW 2019 have not participated in more than 2 other (big) international conferences;", "Dutch MFA encourages young leaders with a form of disability to apply.", "Dutch MFA encourages young leaders from rural to urban areas to apply.", "Scholars selected to participate in the initiative will receive:", "Profiling in national media outlets.", "Access to the additional program of the Dutch MFA on 21 October in The Hague, The Netherlands", "Access to the One Young World Summit on 22-25 October 2019 in London, United Kingdom", "Hotel accommodation on a shared basis in The Hague and in London", "Catering which includes breakfast, lunch and dinner during OYW", "Transport between the Summit accommodation and the Summit venue", "Air travel to The Hague, coach to London and air travel from London back to country of destination.", "Visa costs for the Netherlands and the United Kingdom are covered.", "For More Information:", "Visit the Official Webpage of the MFA Scholarships to Attend One Young World Conference 2019"], "url : https://www.opportunitiesforafricans.com/dutch-ministry-of-foreign-affairs-mfa-scholarships/"], [["AIMS/Carnegie Corporation PhD Scholarships in Data Science ($19 390 per annum financial support)", "date announced:April 11, 2019", "Application Deadline: September 30th 2019"], ["Application Deadline: September 30th 2019", "In partnership with the Carnegie Corporation of New York, the African Institute for Mathematical Sciences (AIMS) is inviting students who are in the final stage of their MSc or MSc holders with an interest in data science and its related disciplines (such as Mathematics, Statistics, Machine Learning, Cluster Analysis, Data Mining, Big data Analytics, Data Visualization, Artificial Intelligence, Neural Networks, Deep Learning, Deep Active Learning, Cognitive Computing among others), to apply for one of four attractive PhD scholarships at its pioneering ", " Quantum Leap Africa (QLA) Research Centre in Rwanda. ", "Successful candidates will each benefit from financial support of up to $19 390 per annum for the three year duration of their research study. Funding is also available for conferences and international scientific events. The term can be renewed based on satisfactory progress. Students would preferably be based at QLA in Rwanda and could be affiliated to any of the AIMS Research Centres and spend time in other international partner universities or research centres. Beneficiaries may also be affiliated to any recognized institution of higher learning located in the same country as the AIMS Research Centre.", "The ", "AIMS-Carnegie Research program in Data Science ", "and its Applications aims to position Africa at the forefront of information science. It also seeks to ensure that scientists worldwide are able to fully contribute to the above goal. Eligibility ", "Applicants can be from any country. ", "Applicants must hold at least an MSc degree in any field related to\nmathematical sciences before the start date of this position.", "Applicants should be interested in undertaking research in Data Science and its related disciplines. ", "Knowledge in mathematical modelling would be an advantage. ", "Applicants must be open-minded, and must be willing to conduct their\nresearch at their preferred AIMS Research Centre, or a designated\npartner institution in one of the AIMS host centres.", "\nHow To Apply\n", "Applicants must use the ", " online application portal ", "\nto apply and submit supporting documents. These supporting documents\nshould be submitted in a pdf format and named using the following\nformat: “AIMS-Carnegie-PhD–first and last name of applicant-type of\ndocument- monthyear of submission” e.g.\n“AIMS-Carnegie-PhD–JohnJake-CV-July2019” ", "Before starting the application process, applicants should provide\ncomplete and accurate contact information (email address, title, names)\nof two referees who will provide confidential letters of support on\ntheir behalf. We will request these letters of support directly from the\nreferees. It is the applicant’s responsibility to provide their\nreferees with a copy of the ‘Terms of Reference’ and the ‘Instructions\nfor Referees’. The applicant is also responsible for ensuring that their\nreferees have received the request for a letter of support from us and\nhave submitted the requested letters to us on time. ", "Applications shall be considered complete if all the documents listed\nabove, including support letters, are received by AIMS before the\nevaluation start date.\nDeadline\n", "Applications will be evaluated at the end of May, August and October\n2019. Prospective applicants are encouraged to apply before the end of\nApril, July or September 2019. Only complete applications with required\nsupporting documents will be considered. Incomplete or late applications\nwill be reviewed during the subsequent evaluation period if all of the\nabove supporting documents are eventually submitted. The application\nportal will remain open until prospective candidates are found.", "For More Information:", "Visit the Official Webpage of the AIMS/Carnegie Corporation PhD Scholarships in Data Science"], "url : https://www.opportunitiesforafricans.com/aims-carnegie-corporation-phd-scholarships-in-data-science/"], [["Commonwealth Medical Fellowships 2019/2020 for Mid-Career Medical Professionals to Study in the United Kingdom (Fully Funded)", "date announced:April 9, 2019", "Application Deadline: 16:00 (BST) on 13 May 2019 "], ["Application Deadline: ", "16:00 (BST)", " on ", "13 May 2019", " ", "Commonwealth Medical Fellowships", " are for mid-career medical staff from low and middle income countries, to enhance their clinical skills.", "Funded by the ", "UK Department for International Development (DFID)", ",\nCommonwealth Medical Fellowships enable talented and motivated\nindividuals to gain the knowledge and skills required for sustainable\ndevelopment. These fellowships are offered under one of the CSC’s six\nthemes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these fellowships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Have an academic appointment in an eligible Commonwealth country at one of the medical schools by the World Directory of Medical Schools employed by a hospital affiliated to the Medical School where you have the academic appointment", "Be available to start your fellowship in the UK in January 2020", "Have qualified as a doctor before 1 October 2004", "Have qualified at a medical school recognised by the ", "World Directory of Medical Schools", "Have met the English language requirements of the ", "General Medical Council (GMC)", " within 2 months of being notified that you have been provisionally selected for an award", "Eligible Commonwealth countries", "Bangladesh", " Cameroon", " The Gambia", " Ghana", " India", " Kenya", " Malawi", " Mozambique", " Nigeria", " Pakistan", " Papua New Guinea", " Rwanda", " Samoa", " Sierra Leone", " South Africa", " Sri Lanka", " Tanzania", " Uganda", " Vanuatu", " Zambia", "Benefits:", "Fellowship Worth\nEach fellowship provides:\n \n", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor usually the cost of journeys made before your award is finally confirmed)", "Research support grant, payable to your host university hospital", "Stipend (living allowance) at the rate of £1,627 per month, or £2,019 per month for those at university hospitals in the London metropolitan area (rates quoted at 2017-2018 levels)", "Reimbursement of the fee for a single English language test and the fee for General Medical Council (GMC) registration", "Warm clothing allowance", "Study travel grant towards the costs of approved travel within the UK", "If you are widowed, divorced, or a single parent, child allowance of £457 per month for the first child, and £112 per month for the second and third child under the age of 16, if you are accompanied by your children and they are living with you at the same address in the UK", "How to apply", "You must make your application directly to the CSC using the CSC’s\nonline application system. Your application must be submitted to and\nendorsed by the Dean of the Medical School which you have the academic\nappointment The CSC will not accept any applications that are not\nsubmitted via the CSC’s online application system.", "Only one application per applicant for these fellowships will be accepted.", "Application deadline:", "All applications must be submitted by ", "16:00 (BST)", " on ", "13 May 2019", " at the latest.", "Supporting documentation deadline: You must provide the following supporting documentation by ", "16:00 (BST)", " on ", "28 May 2019", " in order for your application to be eligible for consideration:", "Copy of your valid passport (or national ID card) showing your\nphotograph, date of birth, and country of citizenship – uploaded to the\nonline application system", "Full university transcripts and certificates detailing the dates of qualification for your ", "primary medical degree", " – uploaded to the online application system", "Academic reference from the Head of your Teaching Hospital\nDepartment outlining how the skills gained are required. All references\nare to be submitted directly by the referees to the online application\nsystem (referees will be sent an email request)", "Endorsement by the Dean of the Medical School at which you have the\nacademic appointment confirming your academic appointment submitted\ndirectly by the Dean to the online application system (the Dean will be\nsent an email request)", "Supporting statement from a proposed supervisor in the UK university\nhospital – submitted directly to the CSC (supervisors will be sent an\nemail request)", "The CSC will not accept supporting documentation submitted outside the online application system.", "For More Information:", "Visit the Official Webpage of the Commonwealth Medical Fellowships 2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-medical-fellowships-2019-2020/"], [["The Trust Conference Changemakers Programme 2019 (Fully Funded)", "date announced:March 21, 2019", "Application Deadline: May 3rd 2019"], ["Application Deadline: May 3rd 2019", "\nThe Trust Conference Changemakers Programme, formerly known as the Scholarship Programme, is part of the ", "Trust Conference", ", hosted by the Thomson Reuters Foundation from November 13-14, 2019 in London, United Kingdom.\n", "The Trust Conference Changemakers Programme", " funds frontline activists and human rights defenders from around the world to attend the annual conference. In 2018, we received applications from 90 countries and selected Changemakers with expert knowledge of our conference themes.", "This year, Trust will award up to 60 scholarships to applicants from diverse disciplines who will bring their unique perspectives and take action at Trust Conference. The Trust Conference Changemakers Programme offers access to an influential gathering of NGOs, heads of corporations, lawyers, public servants and philanthropists.", "Requirements:", " The Trust Conference Changemakers Programme is open to all applicants working in the areas of modern slavery, women’s rights, economic empowerment, refugee support and other human rights areas. ", "Priority will be given to applicants from developing countries who demonstrate that participation in the Trust Conference will enhance their work in their own communities. ", "Benefits:", "A free day of specialised training and networking with other Changemakers on November 12, 2019", "Free attendance at the Trust Conference on November 13 and 14, 2019 ", "A potential financial bursary to support travel and accommodation costs (up to £1,250).", "Their name and photo in Trust Conference marketing materials and on the official website.", "For More Information:", "Visit the Official Webpage of the Trust Conference Changemakers Programme 2019 "], "url : https://www.opportunitiesforafricans.com/the-trust-conference-changemakers-programme-2019/"], [["University of Durham Hatfield Lioness Scholarship 2019 for female students from developing countries.", "date announced:March 25, 2019", "Application Deadline: April 30th 2019"], ["Application Deadline: April 30th 2019", " The aim of the", " Hatfield Lioness Scholarship", " is to enable a female student from a developing country where access to tertiary education is limited to benefit from undertaking postgraduate study at the ", "University of Durham.", " The scholarship has been set up as part of the celebration of 30 years of women students at Hatfield College, University of Durham, and is funded by alumni, friends of the College and other sources supportive of the scholarship’s aims. ", "Eligibility Requirement", "Applicants must have applied for and been offered an unconditional\nplace on their chosen master’s programme by the end of June 2019.", "Applicants must not be in receipt of any other scholarship to fund their postgraduate studies.", "Geographical criteria", "Applicants must be a national of one of the following countries:", "Afghanistan", "Angola", "Bangladesh", "Benin", "Bhutan", "Bolivia", "Burkina Faso", "Burundi", "Cabo Verde", "Cambodia", "Cameroon", "Central African Republic", "Chad", "Comoros", "Congo, Dem. Rep", "Congo, Rep.", "Côte d’Ivoire", "Djibouti", "El Salvador", "Eritrea", "Ethiopia", "Gambia, The", "Georgia", "Ghana", "Guinea", "Guinea-Bissau", "Haiti", "Honduras", "Rwanda", "São Tomé and Principe", "Kenya", "Kiribati", "Korea, Dem. People’s Rep.", "Kosovo", "Kyrgyz Republic", "Lao PDR", "Lesotho", "Liberia", "Madagascar", "Malawi", "Mali", "Mauritania", "Micronesia, Fed. Sts.", "Moldova", "Mongolia", "Morocco", "Mozambique", "Myanmar", "Nepal", "Nicaragua", "Niger", "Nigeria", "Philippines", "Senegal", "Sierra Leone", "Solomon Islands", "Somalia", "South Sudan", "Sri Lanka", "Sudan", "Swaziland", "Syrian Arab Republic", "Tajikistan", "Tanzania", "Timor-Leste", "Togo", "Tunisia", "Uganda", "Ukraine", "Vanuatu", "Yemen, Rep.", "Zambia", "Zimbabwe", "Level of study", "Taught Master’s Degree programmes", "Mode of study", "Full-time", "Year of Entry", "The scholarship is available for students starting a degree programme in October 2019.", "Programmes", "All except MBA", "Scholarship Worth:", "The scholarship will cover:", "Full payment of University tuition fees", "Stipend for living expenses – 12 monthly payments", "One return economy air ticket from the home country to the UK, and\nthe cost of return travel between the UK airport and Durham City", "Fully funded, self-catered, mixed accommodation at Hatfield College", "‘Settling in allowance’ on arrival", "Cost of UK visa and the UK Health surcharge", "Duration", "One academic year", "Restrictions", "The Scholarship does not provide funding for dependants, nor for travel during the Scholarship", "Accommodation is for the Scholarship holder only; dependants cannot be accommodated", "How to apply", "Stage 1: ", "Submit an ", "academic application", "\nfor your chosen master’s programme; within this application you should\nreference your intention to apply for the Hatfield Lioness Scholarship", "Stage 2: ", "Submit an application for the Scholarship on this ", "Application form", "Application deadline", "30", "th", " April 2019", "When candidates will hear the outcome of their application", "Mid-July 2019", "For More Information:", "Visit the Official Webpage of the University of Durham Hatfield Lioness Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/university-of-durham-hatfield-lioness-scholarship-2019/"], [["TOTAL/ QUAI D’ORSAY International Master’s Degree Scholarships 2019/2020 for young Nigerians", "date announced:March 21, 2019", "Application Deadline: March 28th 2019 "], ["Application Deadline: ", "March 28th 2019", " ", "Annually, Total, in partnership with", " The Embassy of France in Nigeria,", " select and sponsor young Nigerian scholars to master’s degree programs in Management, Finance, International Relations, Energy and Environmental issues in top universities in France. The award is full board.", " ", "The French Embassy welcome applications from suitably qualified young Nigerians for the ", "2019 /2020 Quai d’Orsay/Total International Scholarship Scheme.", "Application Requirements", "Interested applicants, who must have obtained a university degree (minimum second upper class) not earlier than (5) years ago and must have completed the mandatory NYSC programme.", "TIPS FOR NAVIGATING THE WEBSITE:", " 1) If the page defaults in French, click on “English” at the top of the page to change the language.", " 2) Click on “APPLY TO TOTAL”", " 3) Navigate to “Our offers” and select your language preference", " 4) Click on “Advanced search”", " a) In the “Country” text box type “Nigeria”", " b) in the “Functional discipline” option box select “Research Innovation & Development”", " c) Then click “Search” to display the advanced Scholarship Programme in Nigeria.", " 5) Click on the “Total International Scholarship” to view details of the application. you can then complete an online application form by clicking on “Apply to job” at the bottom of the page.", " 6) You will be requested to create an account if you do not have an existing one. This is mandatory.", " 7) Please fill the form accordingly.", " 8) It is compulsory to attach your CV where it is requested in the application form.", " Your CV must include the following details in the order listed:", " • Name, surname name, other names (where applicable)", " • Date of birth", " • Contact address stipulating road street number(s) only", " • Functional email address. Please Note; All communication will be by email ONLY", " • State of origin", " • Details of tertiary education; Institution, degree obtained, Class of degree, period of study", " • Details of secondary education; institution, certificate, period of study", " • Details of primary education; institution, certificate, period of study", "For More Information:", "Visit the Official Webpage of the TOTAL/ QUAI D’ORSAY International Master’s Degree Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/total-quai-dorsay-international-masters-degree-scholarships-2019-2020/"], [["African Palliative Care Education Scholarship Fund 2019 for Nurses & Social Workers", "date announced:March 22, 2019", "Application Deadline: 19th April 2019. "], ["Application Deadline: 19th April 2019. ", "The African Palliative Care Association (APCA)", " in partnership with ", "Global Partners in Care (GPIC)", " in the USA provide a limited number of scholarships each year for palliative care training opportunities. APCA and GPIC recognise the important role nurses and social workers play in providing holistic palliative care services for people with life threatening and life limiting illnesses and their families. ", "Despite this, the inadequate incorporation of palliative care into the pre-service (undergraduate) training for nurses and social workers, the lack of clear career pathways for those interested in specialising in palliative care and lack of recognition of palliative care qualifications by local ministries of health and education continues to be a challenge.", " The Palliative Care Education Scholarship Fund for Nurses and Social Workers", " aims to provide an opportunity for nurses and social workers involved in palliative care provision or those determined to lead the development of such services in their settings to undergo specialist training. Palliative care is a growing area of practice in Africa, and nurses and social workers often feel unprepared to deal with the complex issues it encompasses. ", "Training opportunities through this Fund are expected to enhance skills, knowledge, attitudes, values, methods, and sensitivities needed to work effectively in palliative care with patients, families, health care providers, and the community. This year, APCA UK has joined GPIC to contribute towards the Scholarship Fund.", "Host Institution(s):", "Any recognised institution of higher learning offering palliative\ncare training in Africa. Examples include: Institute of Hospice and\nPalliative Care in Africa/Hospice Africa Uganda, Mildmay Uganda, Nairobi\nHospice/Oxford Brooks University in UK, University of Malawi and\nUniversity of Cape Town in South Africa.", "For Social Workers, study can also be in form of a\nfellowship/experiential learning from an institution such as a hospice\nor palliative care programme with well-established social work services.\nSuch a fellowship will be undertaken from a recognised hospice and\npalliative care institution and APCA will verify eligible programs\nthrough the national palliative care association and/or Ministry of\nHealth.", "Level/Field of study:", "Diploma, degree or master level studies in palliative care. For\ndegree and master level studies, those in the final year of study will\nbe given preference.", "Social workers can also undertake clinical fellowship/experiential learning.", "Number Scholarships available: ", "Five (5) scholarships for nurses", "Four (4) scholarships for social workers", "Scholarship beneficiaries:", "Nurses and social workers", "Scholarship value/duration:", "USD 2,500 each for nurses", "USD 1,500 each for social workers. This amount will however vary\ndepending to the option of study, either formal course or experiential\nlearning at a hospice.", "Eligibility:", "A qualified nurse or social worker with a degree or diploma residing and working in Africa", "Has obtained a place on a desired palliative care course in an\ninstitution in Africa recognised by APCA or a hospice recognised by the\nnational palliative care association or Ministry of health for social\nworkers who apply to undertake experiential learning.", "Currently licensed in nursing or social work, where applicable", "Able to legibly complete the application", "Able to obtain full support from place of work to undertake the course", "Able to serve the institution of work for at least a year after completion of the training", "Willing to provide support towards future fundraising for the\nscholarship fund. This may be in form of thank you letter, sharing\nexperience through articles, video testimonial, or skype interview with\nGPIC and APCA.", "Application instructions:", "Eligible applicants can access scholarship application forms through our website on ", "www.africanpalliativecare.org", "The scholarship application deadline is 19th April 2019.", "Should you require additional support or information contact the\nscholarships officer at APCA by telephone +256 393 264978 or email to:", "[email protected]", " for nurses scholarships and  ", "[email protected]", "  for social work scholarships.", "For More Information:", "Visit the Official Webpage of the African Palliative Care Education Scholarship Fund 2019"], "url : https://www.opportunitiesforafricans.com/african-palliative-care-education-scholarship-fund-2019/"], [["French Embassy and Saint-Gobain Master Scholarship 2019/2020 for study in France (Fully Funded)", "date announced:March 20, 2019", "Application Deadline: March 31st 2019"], ["Application Deadline: March 31st 2019", "Saint-Gobain and the Embassy of France in South Africa are inviting South African and Basotho graduates to apply to an exclusive Master’s scholarship programme in Business or Engineering.", "This highly competitive programme will fully fund two scholarship holders for two years (year 1 & 2 of their Master’s degree) in a French institution of higher education. Upon the scholarship holders’ return to South Africa, Saint-Gobain’s Sub-Saharan Africa branch will offer their bursary holders employment within their company (on condition of the successful completion of their Master’s).", "Benefits:", "Saint-Gobain: at public French universities, round-trip airfare, a monthly stipend (767€/month)", "·\nFrench government: annual tuition fees (up to 3 770 €) at public\nuniversities, Schengen visa fees, social security and complementary\ninsurance, CROUS housing reservation support", "REQUIREMENTS", "The\nscholarship focuses on students in Engineering and Business and more\nbroadly includes Finance, Supply Chain, Construction (Architectural) and\nMarketing. Applicants will be shortlisted on the basis of the\nfollowing:", "–        Phase 1: academic merit", "–        Phase 2: a short video interview", "–        Phase 3: psychometric assessment", "–        Phase 4: top applicants will be selected for final interviews", "The selection committee will consist of representatives of Saint-Gobain and the Embassy of France in South Africa.", "HOW TO APPLY", "Start identifying and applying to your French institutions now by using the ", "Campus France search engine", ". Remember, you do not have to speak French to study in France – numerous Master ", "programs taught in English", " are available at French higher education institutions. ", "To apply,", "–  download the Master’s information sheet", "–  download and fill out the Master’s scholarship 2019-2020 application sheet (select the Saint-Gobain scholarship option)", "– email complete applications to ", "[email protected]", "The deadline to apply is 30 March 2019.", "Masters French Embassy scholarship information sheet 2019_2020.pdf", "Masters French Embassy scholarship application form 2019_2020.pdf", "For More Information:", "Visit the Official Webpage of the French Embassy and Saint-Gobain Master Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/french-embassy-and-saint-gobain-master-scholarship-2019-2020/"], [["Oxford – Adara Foundation Scholarship Programme 2019/2020 for female MBA Candidates (Fully Funded)", "date announced:March 25, 2019", "Application Deadline: 5th April 2019 "], ["Application Deadline: 5th April 2019 ", " The ", "Oxford – Adara Foundation Scholarship", " programme was announced by Dean Peter Tufano at the School’s annual Oxford Business Forum Africa, which coincided with International Women’s Day.  From 2019, the Adara Foundation, in partnership with Oxford University, will fund a full scholarship for an exceptional female MBA candidate from Africa for three years. The Foundation shares Saïd Business School’s commitment to fostering greater gender parity in education and increasing levels of investment in talented individuals from across Africa. ", "The Adara Foundation, a non-profit social enterprise in Nigeria,\nfocusses on empowering women and advancing education in Africa. The\nFoundation shares Saïd Business School’s commitment to greater gender\nparity in education and supports our aim to foster a global MBA\ncommunity with representation from all over the world.", "New for 2019, the Adara Foundation, in partnership with Oxford\nUniversity’s Graduate Scholarship Matched Fund, is offering a full\nscholarship to an exceptional female MBA candidate from Africa.", "Requirements:", " The scholarship, open to female candidates of an African nationality, covers the full MBA programme fee and living expenses. ", "Candidates must demonstrate a commitment to return to their home country upon completion of the one-year MBA programme to contribute to Africa’s business and socio-economic development. ", "The scholarships will be available for the 2019-20 academic year and no separate application will be needed as all students meeting the criteria will automatically be considered.  ", "For More Information:", "Visit the Official Webpage of the Oxford-Adara Foundation Scholarship programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/oxford-adara-foundation-scholarship-programme-2019-2020/"], [["NRF-Nuffic Doctoral Scholarships 2019 for young South Africans", "date announced:April 1, 2019", " The National Research Foundation (NRF) of South Africain partnership and Nuffic (the Netherlands organisation for internationalisation in education  represented locally in South Africa by Nuffic’s Netherlands Education Support Office), is pleased to announce a pre-call for the 2019 NRF-Nuffic Doctoral Scholarships."], [" ", "The National Research Foundation (NRF) of South Africain partnership and Nuffic (the Netherlands organisation for internationalisation in education ", " represented locally in ", "South Africa by Nuffic’s Netherlands Education Support Office),", " is pleased to announce a pre-call for the", " ", "2019 NRF-Nuffic Doctoral Scholarships.", " In recognition of the long standing collaboration between South Africa and the Netherlandsin education and research, and with the ambition to strengthen postgraduate training while enhancing sustainable collaboration between South African and Dutch higher education institutions(HEIs), anagreement was signed in 2017 between the NRF and Nuffic. ", "This is an implementing agreement under the MOU Science & Technology (2015) between South Africa and the Netherlands.Through thispartnership, doctoral scholarships will be provided for South African citizens and permanent residents to study full-timein the Netherlands (i.e. single sitemode). Institutional level agreements between Dutch HEIsand Partner Institutions in South Africa to enable full-time joint doctoral degrees will also be supported (i.e. split sitemode). ", " The scholarship is intended to support doctoral candidates to pursue research studies in all areas of (i) Science, (ii) Engineering (iii) Technology, (iv) the Social Sciences and (v) Humanities, at universities in participating countries. The percentage of supported students will be 80% from the Science, Technology, Engineering and Mathematics (STEM) disciplines and 20% from the Social Sciences and Humanities, in line with South Africa’s National Development Plan. ", "Preference will also be given to applications to obtain a Doctoral degree in a vulnerable discipline such as Statistics, Mathematics and Nursing, emerging research areas or where there exists a paucity of research infrastructure and/or suitably qualified supervisors in South Africa. ", " Applicant Eligibility", "To be eligible, applicants must:", "Be South African citizens or permanent residents with a SA ID number, although South African citizens will be prioritised; ", " Not hold this scholarship concurrently with any other NRF or South African/Netherlands government scholarship;", "Provide a Master’s degree certificate or an official document from the university certifying that all requirements for the Master’s degree have been met and that they will be graduating; ", "Be intending to pursue full-time doctoral studies; and", "Not hold full-time salaried employment during the tenure of the award. ", "Benefits:", " Eligibility Institution and Supervisor ", "Eligibility", "To be eligible to participate in this doctoral training initiative, participating institutions and supervisors must meet the following requirements:", "Dutch HEIs will waive tuition fees or in the case that a tuition fee applies, this will not be charged to the NRF or the individual scholarship awardee;", "Dutch HEIs will provide research running costs (i.e. costs that can reasonably be expected to accrue during the course of the doctoral research period) and access to research infrastructure; ", "Doctoral supervisory capacity must be in place at both the Dutch HEIs and the South African Partner Institution,in the case of joint degrees;", "Supervisors must commit to evaluate the academic suitability of the applicant andendorse the research proposal (including time frames) before the application is submitted to the NRF for merit review. Supervisors may do this through email correspondence with the applicant and via other electronic media such as Skype or video conferencing;", "Supervisors must submit a letter of support indicating that the necessary research infrastructure, resources and funds for undertaking the research and supporting the doctoral student exists within their faculty/school/department. Supervisors may only support one (1) applicant per year; ", "For More Information:", "Visit the Official Webpage of the NRF-Nuffic Doctoral Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/nrf-nuffic-doctoral-scholarships-2019-for-young-south-africans/"], [["Deloitte/One Young World Scholarship 2019 (Fully Funded to attend the One Young World Summit in London, United Kingdom)", "date announced:March 31, 2019", "Application Deadline: 10 May 2019"], ["Application Deadline:", " 10 May 2019", "Education is the cornerstone of sustainable development. There are\ncurrently 1.8 billion young people (aged 10-24) worldwide and over half\nof this population will not have the skills necessary to participate in\nthe emerging global workforce. The United Nations’ Sustainable\nDevelopment Goals (SDGs) clearly recognize that this gap must be closed,\nas the international community more explicitly addresses the challenges\nof quality and equity in education.", "At ", "Deloitte,", " we are committed to preparing 50 million people to succeed in a rapidly changing global economy by 2030. We are applying our core skills, experience, and global reach to make an impact through education, skills development, and access to opportunity, in line with SDGs 4 – Quality Education and 8 – Decent Work & Economic Growth.", "As a longstanding partner of One Young World, we are proud to support the", " Deloitte One Young World Scholarship 2019,", " which will enable 10 outstanding young leaders to attend the ", "One Young World Summit in London, United Kingdom", " on 22 – 25 October 2019.", "Eligibility Criteria", "Candidates must be:", "Aged 18 – 30", "Nationals of all countries will be eligible to apply for this scholarship", "Please\nnote that you will be unable to save your responses in the submission\nform. With this in mind, we recommend saving your responses first in an\noffline document before submitting your application.   ", "This scholarship is intended for young leaders\nfocused on improving the education, skills, and access to opportunity\nfor people in their communities, countries, or world at large. The\nscholarship is seeking candidates who have demonstrated commitment to:", "Improving access to education, skills, or employment opportunities for those that may be left behind by the rapidly changing global economy. For example, to women and girls, disadvantaged youth.", "Creating skills development or lifelong learning opportunities for people to prepare for the future workforce, including in areas where there are talent shortages.", "Accelerating entrepreneurship, new types of employment, or providing opportunities for people to overcome traditional barriers to employment.Improving access to education, skills, or employment opportunities for those that may be left behind by the rapidly changing global economy. For example, to women and girls, disadvantaged youth.", "Creating skills development or lifelong learning opportunities for people to prepare for the future workforce, including in areas where there are talent shortages.", "Accelerating entrepreneurship, new types of employment, or providing opportunities for people to overcome traditional barriers to employment.", "Benefits:", "Access to the One Young World Summit 2019 in London, United Kingdom", "The cost of travel to and from London (economy flights only)", "Hotel accommodation in a single room from 21-25 October inclusive", "Catering which includes breakfast, lunch and dinner, during these days", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Participation in Deloitte-hosted sessions for their delegation in the lead-up to and during the Summit, and a Deloitte “buddy”", "For More Information:", "Visit the Official Webpage of the Deloitte/One Young World Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/deloitte-one-young-world-scholarship-2019/"], [["Master’s degree (LLM/MPhil) in Human Rights and Democratisation in Africa Scholarships 2019/2020 (Scholarships Available)", "date announced:March 16, 2019", "Application Deadline: 30 June 2019 "], ["Application Deadline: ", "30 June 2019", " ", "The", " HRDA", " is a  one-year intensive course where 25-30 exceptional individuals spend six months in Pretoria and six months at one of the ", "12 partner universities", " all over Africa. They are taught by eminent lecturers in the field of human rights and undergo many practical training exercises. ", " It is the only course of its kind in Africa. Graduates become members of the HRDA Alumni Association whose 537 members are currently active in the full spectrum of human rights work: from grassroots, through civil service, to international organisations including the African Union and the United Nations. ", "Eligibility", "The eligibility criteria for the LLM/MPhil (HRDA) is as follows:", "Law students (LLM option): ", "A degree allowing access to the legal profession\n", "Non-law students (MPhil option): ", "An Honours degree in a discipline relevant to human rights and democratisation \n", "Applicants must have excellent academic credentials and demonstrate\nhuman rights experience or interest. Women, as well as members of\nminority groups such as indigenous people, LGBTI persons and persons\nwith disabilities, are particularly encouraged to apply.", "Fees / Scholarships", "Approximate cost of the programme (1 year)  is US$ 15 000", "There are up to 25 FULL Scholarships available for African citizens.", " Partially or fully self-funded students are also encouraged to apply for this programme.", "For More Information:", "Visit the Official Webpage of the Human Rights and Democratisation in Africa Scholarships 2019/2020 "], "url : https://www.opportunitiesforafricans.com/masters-degree-llm-mphil-in-human-rights-and-democratisation-in-africa-scholarships-2019-2020-scholarships/"], [["AIMS/Carnegie Corporation MSc Scholarships in Data Science ($10 000 per annum financial support)", "date announced:April 11, 2019", "Application Deadline: ongoing"], ["Application Deadline: ongoing", "In partnership with the ", "Carnegie Corporation ", "of New York, the African Institute for Mathematical Sciences (AIMS) is inviting students who are at least in the final year of their BSc program or BSc degree holders with an interest in data science and its related disciplines (such as Mathematics, Statistics, Machine Learning, Cluster Analysis, Data Mining, Big data Analytics, Data Visualization, Artificial Intelligence, Neural Networks, Deep Learning, Deep Active Learning, Cognitive Computing among others), to apply for one of six attractive Masters by Research scholarships at its pioneering Quantum Leap Africa (QLA) Research Centre in Rwanda.", "Successful candidates will each benefit from financial support of up to $10 000 per annum for at most two years. Applicants with an MSc degree could be eligible for a –year MPhil. Funding is also available for conferences and international scientific events. The term can be renewed based on satisfactory progress. Students would preferably be based at QLA in Rwanda and could be affiliated to any of the AIMS Research Centres and spend time in other international partner universities or research centres. Beneficiaries may also be affiliated to any recognized institution of higher learning located in the same country as the AIMS Research Centre.", "The AIMS-Carnegie Research program in Data Science and its\nApplications aims to position Africa at the forefront of information\nscience. It also seeks to ensure that scientists worldwide are able to\nfully contribute to the above goal.\nEligibility\n", "Applicants can be from any country. ", "Applicants must hold at least a BSc degree in any field related to mathematical sciences before the start date of this position.", "Applicants should be interested in undertaking research in Data Science and its related disciplines. ", "Knowledge in mathematical modelling would be an advantage.", "Applicants must be open-minded, and must be willing to conduct their\nresearch at their preferred AIMS Research Centre, or a designated\npartner institution in one of the AIMS host centres.", "\nHow To Apply\n", "Applicants must use the ", " online application portal ", "\nto apply and submit supporting documents. These supporting documents\nshould be submitted in a pdf format and named using the following\nformat: “AIMS-Carnegie-PhD–first and last name of applicant-type of\ndocument- monthyear of submission” e.g.\n“AIMS-Carnegie-PhD–JohnJake-CV-July2019” ", "Before starting the application process, applicants should provide\ncomplete and accurate contact information (email address, title, names)\nof two referees who will provide confidential letters of support on\ntheir behalf. We will request these letters of support directly from the\nreferees. It is the applicant’s responsibility to provide their\nreferees with a copy of the ‘Terms of Reference’ and the ‘Instructions\nfor Referees’. The applicant is also responsible for ensuring that their\nreferees have received the request for a letter of support from us and\nhave submitted the requested letters to us on time. ", "Applications shall be considered complete if all the documents listed\nabove, including support letters, are received by AIMS before the\nevaluation start date.\nDeadline\n", "Applications will be evaluated at the end of May, August and October\n2019. Prospective applicants are encouraged to apply before the end of\nApril, July or September 2019. Only complete applications with required\nsupporting documents will be considered. Incomplete or late applications\nwill be reviewed during the subsequent evaluation period if all of the\nabove supporting documents are eventually submitted. The application\nportal will remain open until prospective candidates are found.", "For More Information:", "Visit the Official Webpage of the AIMS/Carnegie Corporation MSc Scholarships in Data Science "], "url : https://www.opportunitiesforafricans.com/aims-carnegie-corporation-msc-scholarships-in-data-science/"], [["Learn Africa Scholarship Program 2019/2020 for African women undergraduate & graduate students (Fully Funded to Spain/Portugal)", "date announced:March 21, 2019", "Application Deadline: April 7th 2019"], ["Application Deadline: April 7th 2019", "Learn Africa ", "selects African Female Undergraduate and Graduate Students for Scholarships at Spanish and Portuguese Universities", "After the success of previous programs, we launched the third public edition of the scholarship program for African women students universities Learn Africa, thanks to which a hundred students have already enjoyed studies in Spanish universities.", "This program, promoted by the Women for Africa Foundation, aims to promote the transfer of knowledge, exchange and training of African women undergraduate and graduate students through scholarships in Spanish universities that collaborate in this initiative. Thanks to these scholarships, the selected students can complement their university education in our country, and then invest what has been learned to benefit their communities, thus contributing to the progress of African societies.", "Requirements:", "In general, any person who meets the following requirements:", "Be a woman and have the nationality of an African country.", "Be enrolled in an African university or have a university degree\nissued in an African country. For Postgraduate Scholarships, the Degree\ntitle is required. The required degree can vary depending on the\nrequested scholarship (See details of each scholarship).", "Meet the specific requirements of each type of scholarship.", "Only one application per person", "Benefits", "The scholarships are funded mostly by the universities participating in the program – all of them, members of the Conference of Rectors of Spanish Universities (CRUE) – and cover round trips, tuition and fees, accommodation and food, and medical insurance.", "Scholarships Duration", "The scholarships included in this call have a variable duration\ndepending on the modality agreed with each of the host universities and\nthe training program offered, comprising of periods ranging from short\nstays, as is the case of some research projects, or to four years for\nthose aiming to Master and Doctorate.", "The majority of the scholarships that are offered in this program are for the 2019-2020 academic year.", "Selection Process and Results", "The selection process will be coordinated by the Women for Africa Foundation and will take place between ", "April 8th and the 30th", ", according to the following criteria: ", "CV", " (academic record, previous education, languages spoken, professional experience)", "Reference letters ", "Personal motivation letter ", "Language Requirement", "Research Project ", " (necessary only in the case of doctoral student scholarships)", "The final selection will be agreed with each of the participating\nuniversities, the results of the selection process will be available at\nthe end of June on the Foundation’s website and will be personally\ncommunicated to each of the selected applicants.", "For More Information:", "Visit the Official Webpage of the Learn Africa Scholarship Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/learn-africa-scholarship-program-2019-2020/"], [["CICOPS Scholarships 2020 for Researchers from Developing Countries for Study in Italy (Fully Funded)", "date announced:April 3, 2019", "Application Deadline:31st May 2019 "], ["Application Deadline:", "31st May 2019", " ", " ", "CICOPS Scholarships", " are now being accepted for 2020. The call for application is open!", "In\norder to promote international cooperation, particularly with\nDeveloping Countries, the University of Pavia and EDiSU (Institute of\nthe Right to University Studies) provide ", "10 scholarships", " to visiting scholars for the year 2020 for a period of stay of 4 to 12 weeks at the University of Pavia. ", "Academics from Developing Countries who wish to carry out research in collaboration with a professor at the University of Pavia are welcome to apply. ", "Requirements:", " Applicants must have at least two years of either teaching experience or activity within international organizations and institutions and  must have the support of a collaborator at the University of Pavia who invites them with a formal invitation letter (incomplete applications will be rejected, no exceptions will be made).", "Benefits:", "CICOPS\nScholarships are foreseen for research collaboration in the short period\nin order to encourage the mobility of researchers from Developing\nCountries. Applicants enrolled in a Doctoral or Postgraduate Course at\nan Italian University are not eligible to apply\n", "For More Information:", "Visit the Official Webpage of the CICOPS Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/cicops-scholarships-2020/"], [["Johnson & Johnson One Young World Scholarship Program 2019 (Fully Funded to the One Young World Summit 2019 in London,UK)", "date announced:March 27, 2019", "Application Deadline: 6 May 2019"], ["Application Deadline: ", "6 May 2019", "For the third year running", ", Johnson & Johnson Global Community Impact,", " ", "the team who leads the global partnership for Johnson & Johnson with OYW, is collaborating with OYW to offer ", "scholarships to 12 young health leaders across the globe", " to participate in the 2019 Johnson & Johnson One Young World Program.", "The\nJohnson & Johnson Global Community Impact team supports and\nchampions people on the frontlines who are at the heart of delivering\ncare. The team believes that changing the trajectory of health for\nhumanity requires putting people first, so that communities and health\nsystems have the ability to address the health needs of the world’s most\nvulnerable people. Through its global and community-based partnerships\nand programs, the Team aims to support the next generation of global and\ncommunity-based health leaders to develop the skills and tools they\nneed to drive health and well-being in underserved communities.", "As well as attending the upcoming 2019 One Young World Summit, scholarship recipients will receive individual coaching from senior Johnson & Johnson executives to further develop their aspiration, strategy and/or initiatives. In addition, all J&J OYW scholars are buddied with a team of 2019 J&J delegates over the course of the six-month program to help build and strengthen the capacity of the Scholar, through the sharing of their skills and knowledge.", "Eligibility Criteria", "Applicants must be working on the front lines of delivering care and dedicated to health and care giving to underserved populations and communities.", "You can be a nurse, midwife, community health worker, a doctor, a social entrepreneur, a digital health expert, or working for a social enterprise, medical facility and/or a nongovernmental organization.", "If selected, Health Care Professionals classified as Government Officials within their home country will need approval from their employer and may be required to undergo an additional health care compliance approval process by Johnson & Johnson before their scholarship can be confirmed.", "Benefits:", "The Johnson & Johnson One Young World Scholarship Program", " runs from September 2019 – February 2020. All scholar recipients will be expected to invest 10% of their time in this program and to attend regular Johnson & Johnson webinars and calls. ​", "Participation in the 2019 Johnson & Johnson One Young World Program", "Individual coaching with senior Johnson & Johnson leaders", "Working\nwith 2019 Johnson & Johnson delegates in buddy teams, over the\ncourse of the six-month program to support the Scholar through the\nsharing of their skills and knowledge", "Attendance at the J&J OYW Program pre-workshop and dinner on 21 October 2019", "Attendance at the J&J OYW Program debrief session & lunch on 26 October", "Participation in interactive webinars and conference calls throughout the duration of the Program", "Access to the One Young World Summit 2019 in London, United Kingdom", "The cost of travel to and from London ", "(economy flights only)", "Hotel accommodation in a single room from 21-25 October inclusive", "Catering which includes breakfast, lunch and dinner, during these days", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Selection Criteria", "Important: Selected scholars must be\navailable to commit 10% of their time to the program, over the 6-month\nprogram period (September 2019 – February 2020)", "Demonstrated capacity for leadership", "Evidenced commitment to delivering positive change", "Understanding of key local and/or global issues", "Track record of generating impactful and innovative idea", "Interest and engagement in sharing and learning from others", "Skills:\nenthusiastic, pro-active, creative, eager to improve, not afraid to\nchange the status quo, team player, good communicator and project\nmanagement", "For More Information:", "Visit the Official Webpage of the Johnson & Johnson One Young World Scholarship Program 2019 "], "url : https://www.opportunitiesforafricans.com/johnson-johnson-one-young-world-scholarship-program-2019/"], [["Lagos State Undergraduate/Postgraduate Scholarship Award Scheme 2019", "date announced:March 19, 2019", "Application Deadline:"], ["Application Deadline:", " ", "T", "he Lagos State Scholarship Board", " ", "is the agency in charge of scholarship, bursary and other related matters within the state. It grants Scholarship awards to deserving indigenes in various tertiary institutions for full time studies in order to assist these students financially. ", "Undergraduate Requirements:", "THIS SCHOLARSHIP SCHEME IS FOR LAGOS STATE INDIGENES ONLY STUDYING IN ANY TERTIARY INSTITUTION ACROSS THE COUNTRY.", "1.      All applicants must have gained full time admission into an accredited Nigerian tertiary Institution.  ", " 2.      All Under-graduate applicants: ", " i.       Where CGPA scale is 7.0 (e.g University of Ibadan) he /she must possess a minimum of 4.6/7.0 ", " ii.      Where CGPA scale is 5.0 (e.g University of Lagos) he /she must possess a minimum of 3.5/5.0", " iii.     Where CGPA scale is 4.0 (e.g polytechnics and colleges of education) he /she must possess a Minimum of 3.0/4.0 ", " iv.     Where applicant is a medical student in 200L,  option i, ii and iii applies ", " v.      Where applicant is a medical student in 300L and above a minimum of ", "Credit", " is required in their result ", " 3.      All applicants must be in their second year or above", " 4.      All applicants must have completed LASRRA Registration ", " 5.      All applicants must have a signed letter of identification from their respective Oba", "6.      All applicants must have a signed letter of identification from their respective local government  ", "Apply Now for the Lagos State Undergraduate Scholarship Award Scheme 2019", " ", "2019 Lagos State Postgraduate Scholarship Award Scheme", " The Lagos State Scholarship Board is the agency in charge of scholarship, bursary and other related matters within the state.It grants Scholarship awards to deserving indigenes in various tertiary institutions for full time studies in order to assist these students financially. ", "THIS SCHOLARSHIP SCHEME IS FOR LAGOS STATE INDIGENES ONLY STUDYING IN ANY TERTIARY INSTITUTION ACROSS THE COUNTRY.", "1.      All\napplicants must have gained full time admission into an accredited\nNigerian tertiary Institution for postgraduate studies (Masters or\nDoctorate).", "2.      All Post-graduate applicants (Only applicable to Masters Degree applicants): ", "i.      \nWhere CGPA scale is 7.0 (e.g University of Ibadan) he/she must have\ngraduated with a minimum of 4.6/7.0 at undergraduate level ", "ii.      Where\nCGPA scale is 5.0 (e.g University of Lagos) he/she must have\ngraduated a minimum of 3.5/5.0 at undergraduate level", "iii.     Where CGPA scale is 4.0 (e.g polytechnics and colleges of education) he/she must possess a Minimum of 3.0/4.0 ", "iv. \n   Where applicant has obtained an upper credit in Higher National\nDiploma (HND), he/she must present evidence of completion\nof postgraduate diploma (PGD) ", "3.      All Post-graduate applicants (Only applicable to Doctorate Degree applicants): ", "i. \n     Where applicant has obtained a second class lower CGPA at\nundergraduate level, he/she must possess a distinction in their masters\ndegree", "4.      All applicants must be in their first year or above (admitted on or before 2018/2019 academic session)", "5.      All applicants must have completed LASRRA Registration ", "6.      All applicants must have a signed letter of identification from their respective Oba", "7.      All applicants must have a signed letter of identification from their respective local government  ", "Apply Now for the Lagos State Postgraduate Scholarship Award Scheme", "For More Information:", "Visit the Official Webpage of the Lagos State Undergraduate/Postgraduate Scholarship Award Scheme 2019 "], "url : https://www.opportunitiesforafricans.com/lagos-state-undergraduate-postgraduate-scholarship-award-scheme-2019/"], [["Queen’s Commonwealth Trust Scholarships 2019 to attend the One Young World Summit in London, UK (Fully Funded)", "date announced:March 22, 2019", "Application Deadline:5 May 2019, 5PM BST"], ["Application Deadline:", "5 May 2019, 5PM BST", "One Young World", " ", "is delighted to offer this scholarship in partnership with the Queen’s Commonwealth Trust to connect young leaders driving positive social impact in the Commonwealth with the opportunity to attend One Young World conference in 2019..", "The Scholarship in particular seeks to support young leaders who are active in one of the following areas:", "Achieving change through sport", "Preserving and protecting the environment", "Creating healthier communities", "Increasing access to quality education", "Eligibility Requirements:", "You are eligible for sponsorship if you:", "Are between the ages of 18 – 30", "Have an evidenced commitment to delivering positive change in at least one of the following areas:", "Sport", "Environment", "Health", "Education", "Demonstrate capacity for leadership", "Are addressing key local and/or global issues in your work", "Have a track record of generating impactful and innovative ideas ", "Are a national (passport holding citizen) of one of the countries listed below:", " ", "Antigua and Barbuda", "Australia", "Bangladesh", "Barbados", "Belize", "Botswana", "Brunei Darussalam", "Cameroon", "Canada", "Cyprus", "Dominica", "Fiji Islands", "Ghana", "Grenada", "Guyana", "India", "Jamaica", "Kenya", "Kingdom of eSwatini", "Kiribati", "Lesotho", "Malaysia", "Malta", "Mauritius", "Mozambique", "Namibia", "Nauru", "New Zealand", "Nigeria", "Pakistan", "Papua New Guinea", "Rwanda", "Saint Kitts and Nevis", "Saint Lucia", "Saint Vincent and the Grenadines", "Samoa", "Sierra Leone", "Singapore", "Solomon Islands", "South Africa", "Sri Lanka", "The Bahamas", "The Gambia", "Tonga", "Trinidad and Tobago", "Tuvalu", "United Kingdom", "United Republic of Tanzania", "Vanuatu", "Zambia", "Benefits:", "Access to the One Young World Summit 2019 in London, the United Kingdom.", "Hotel accommodation on a shared basis between 22 October and 25 October 2019.", "Catering which includes breakfast, lunch and dinner.", "Transport between the Summit accommodation and the Summit venue.", "Summit hand-outs and support materials.", "The cost of travel to and from London. Your flight to and from London must depart from and return to one and the same international airport.", "The selection process:", "The strongest\napplicants will be shortlisted by the end of May. You will be contacted\nindividually by a member of the One Young World team if you have been\nshortlisted. ", "Please note:", "We cannot guarantee any\napplicant that they will be shortlisted or that we will secure\nsponsorship for any shortlisted applicant.", "Priority will be given to applicants from countries that have been less represented at previous One Young World Summits.", "Priority will also be given to first-time Summit attendees (not OYW Ambassadors).", "Due\nto the overwhelming amount of applications we receive, One Young World\nis unable to respond to individual emails enquiring about the outcome of\nthe selection process.", "We do not provide feedback as to why candidates are not selected.", "Tips for applying:", " check out our ", "helpful guidelines", " for submitting a successful application. ", "For More Information:", "Visit the Official Webpage of the Queen’s Commonwealth Trust Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/queens-commonwealth-trust-scholarships-2019-to-attend-the-one-young-world-summit-2019/"]]