[[["Standard Bank Chartered Accounting CA(SA) Programme 2018 for Young South Africans", "date announced:March 12, 2018", "Application Deadline: June 15th 2018"], ["Application Deadline: June 15th 2018", "Citizenship:", " South African", "Duration:", " 36 months", "If you think you’ve got what it takes to be one of the best and brightest in the accounting field, the ", "Chartered Accounting CA(SA) graduate programme", " ", "will help you gain the essential financial management skills, commercial exposure and leadership capabilities needed to further a stellar career.", "By rotating through our different business areas, you’ll fulfil the requirements of the ", "South African Institute of Chartered Accountants (SAICA),", " and maybe even travel a little on the side by working outside of South Africa.", "Key qualifications: Completed or completing SAICA-accredited Certificate in the ", "\n– Theory of Accounting,", "\n– Honours (HNS) in Accounting", "\n– Graduate Diploma in Accounting (GDA) or equivalent.", "Application Process:", "Apply online", "You’ll need to create an account, complete your application and attach your CV.", "Interviews", "If you pass our first screening we’ll invite you to interview- on campus, at our offices or over the phone. We may ask you back for a further interview or psychometric test.", "Assessment", "The last step, and the most intensive. At our Global Leadership Centre you’ll be taking part in a range of interviews, presentations and team exercises while getting the opportunity to network with some of our most senior bankers.", "For any further information please contact Kashmeera Sookhinunthen ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Standard Bank Chartered Accounting CA(SA) Programme 2018 "], "url : https://www.opportunitiesforafricans.com/standard-bank-chartered-accounting-casa-programme-2018-for-young-south-africans/"], [["NNPC/TOTAL/ QUAI D’ORSAY International Master’s Degree Scholarship 2018/2019 for young Nigerians", "date announced:March 15, 2018", "Application Deadline: March 28th 2018"], ["Application Deadline: March 28th 2018", "TOTAL, in partnership with NNPC and its corporate partners, selects and sponsors young Nigeria scholars for", " Masters degree programs in Engineering and Geosciences (Oil and Gas related) in top universities in France.", " The award is full board.", "Suitably qualified candidates are invited to apply for the ", "2018 NNPC/TOTAL/ QUAI D’ORSAY International Master’s Degree Scholarship", "Eligibility Requirements:", "Applicants must be Nigerian", "Must hold a university degree (minimum second class upper) obtained between 2013 and 2017", "Must have completed the mandatory NYSC programme.", "Interested applicants should visit ", "www.careers.total.com", " for detailed information on the institutions. All applications must be completed online. No paper application will be accepted.", "\nTips for Navigating the TOTAL Careers Website", "If the page defaults in French, click on “English” at the top of the page to change the language.", "On the navigation bar, click “", "APPLY TO TOTAL", "”", "Navigate to “", "Our offers", "” and “select” your language preference", "Click on “", "Advanced Search", "”\n", "ln the “", "Country", "” text box type ", "‘Nigeria’", "ln the “", "Functional discipline", "” option box select ‘", "Research Innovation & Development", "’", "Then click “Search” to display the advertised Scholarship program in Nigeria.", "Click on the “", "Total International Scholarship", "” to view details of the application. You can then complete an online application form by clicking on ‘", "Apply to job", "’ at the bottom of the page.", "You will be requested to create an account if you do not have an existing one. This is mandatory.", "Please fill the form accordingly", "It is compulsory to attach your CV where it is required in the application form", "What your CV should contain", "\nYour CV must include the following details in the order listed:", "Name, first name, other names (where applicable)", "Date of birth", "Contact address stipulating road/street number(s) only", "Functional email address. Please Note : ALL communication will be by email only", "State of origin", "Details of tertiary education; institution, degree obtained, class of degree, period of study", "Details of secondary education: institution, certificate, period of study", "Details of primary education: institution, certificate, period of study", "Note", "Only shortlisted candidates will be contacted.", "TOTAL does not take responsibility for any careers/job/training vacancies placed outside the TOTAL careers website ", "www.careers.total.com", "For More Information:", "Visit the Official Webpage of the NNPC/TOTAL/ QUAI D’ORSAY International Master’s Degree Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/nnpc-total-quai-dorsay-international-masters-degree-scholarship-2018-for-young-nigerians/"], [["The Mandela Institute for Development Studies (MINDS) Pan-African Scholarship 2018/2019 for Leadership Development Program (Fully Funded)", "date announced:March 14, 2018", "Application Deadline: Ongoing"], ["Application Deadline: Ongoing", "The Mandela Institute for Development Studies (MINDS)", " offers scholarships to African students who wish to pursue post-graduate studies within Africa, outside of their own countries. Through tailored leadership development activities, the MINDS Scholarship Program nurtures leaders who have a continental development mindset; leaders who will facilitate greater cooperation between African countries.", "MINDS Scholarships are applicable to full-time studies of a one or two year Honors or Master’s degree at one of the MINDS preferred institutions in Africa. MINDS does not prescribe the course to be studied.", "Requirements:", "To be considered for a MINDS Scholarship, you must:", "Be a national of an African country, residing in any African country;", "Have been formally accepted by one or more MINDS preferred institution/s outside of your country of citizenship and/ or residency;", "Have been formally accepted by one or more MINDS preferred institution/s to pursue postgraduate studies within the following year;", "Have obtained at least 70% in each subject/ course in the last two completed years of study;", "Produce evidence of demonstrated leadership abilities or potential guided by the questions/ requirements set out in the application form;", "Submit a complete application form with the required supporting documentation as set out on the application form.", "Benefits:", "The Scholarship covers some or all of the expenses below, depending on whether a partial or full scholarship is awarded:", "Tuition", "Accommodation and meals", "One return ticket per duration of studie", "A fixed stipend", "Individuals with a Pan African outlook, demonstrated leadership ability and an excellent academic record who wish to study elsewhere on the African continent, outside their home country are invited to apply for the scholarships.", "Applying for a MINDS Scholarship? Here is some guidance:", "\n1. Ensure that you meet ALL of the requirements set out and upload ALL of the required documents. Applications that do not meet requirements or for which all required documentation has not been provided are immediately disqualified. Don’t get yourself disqualified because you’re in a hurry to submit an application. Rather take the time to ensure that you mee", "t the requirements and to gather all of the required documents before submitting an application.", "2. We are looking for individuals with a Pan-African outlook, strong leadership potential and a track record of academic excellence. Your application must demonstrate these elements convincingly.", "3. We encourage applicants to consider universities that are outside of South Africa. Most applications received to date have been for South African institutions and there are limited numbers that can be awarded to each university. This means that competition is stiffer for South African institutions.", "4. There are two scholarships available for South African citizens wishing to study elsewhere in Africa.", "5. MINDS have set aside scholarships for studies that relate to Actuarial Sciences, Business Sciences and Accounting. If you wish to conduct such studies at any of the South African, Kenyan and Nigerian institutions that are on our preferred list, don’t miss the opportunity to apply. Ensure that you meet the requirements before submitting an application.", "6. There is no deadline for submission. Applicants – who meet the criteria – should apply as soon as they have all supporting documents needed submit the application. MINDS will review applications as they are submitted and aim to award scholarships per different university cycles on the continent.", "For More Information:", "Visit the Official Webpage of the MINDS Pan-African Scholarship 2018 for Leadership Development Program"], "url : https://www.opportunitiesforafricans.com/minds-pan-african-scholarship-2018-2019/"], [["Study Social Sciences and Humanities on the Warwick International Foundation Programme (IFP), UK (Win a partial scholarship of £2000)", "date announced:March 2, 2018", "Application Deadline: May 31st 2018"], ["Application Deadline: May 31st 2018", "Are you a high school student looking to study Social Sciences and Humanities? Win a partial scholarship of £2000 to join the ", "Warwick ", "International Foundation Programme (IFP) i", "n ", "Social Sciences and Humanities", " in the United Kingdom!", "Would you want to study Politics, Psychology Economics or International studies in the future?", "The foundation programme at Warwick is the perfect place to start. The Warwick Social Sciences and Humanities IFP gives you the option to study topics as diverse as Communism and Fascism in Europe, the UK political system, and the nature of economic markets, you will develop the analytical and problem-solving skills needed to enter a range of undergraduate courses.", "Take this online challenge to compete for the partial scholarship!", " ", "How is works:", "1. Sign up", "2. Take a short quiz, fill in your details and explain why you would like to join the programme", "3. Apply directly with the University of ", "Warwick", " once you have completed the challenge", "For More Information:", "Visit the Official Webpage of the Study Social Sciences and Humanities on the Warwick IFP"], "url : https://www.opportunitiesforafricans.com/study-social-sciences-and-humanities-on-the-warwick-international-foundation-programme-ifp-uk/"], [["Miles Morland Foundation African Scholarship 2018 at the University of East Anglia, UK", "date announced:March 9, 2018", "Application Deadline: 12 noon on Tuesday, May 15th, 2018."], ["Application Deadline: ", "12 noon on Tuesday, May 15th, 2018.", "The ", "Miles Morland Foundation African Scholarship", " is awarded to a Postgraduate student within the School of Literature, Drama and Creative Writing to enable them to study on the MA Creative Writing (Prose Fiction) course.", "Eligibility", "Level: Postgraduate", "Fees: International", "School: Literature, Drama and Creative Writing", "Course: MA  Creative Writing (Prose Fiction)", "Country of Birth: Any country within Africa", " or", "Nationality: Any country within Africa ", "or", "Other Criteria: Both parents born in Africa (If the scholarship is awarded on this basis, copies of both parents’ passports must be provided as evidence to UEA at point of acceptance of the scholarship.)", "Benefits:", "Total Value: Up to £25,000 to cover tuition fees and a maintenance grant.", "Tuition fees or maintenance: Both", "Number available: 1", "How to Apply:", "Application Form", "Applications are now open for 2018/19 entry. The deadline for applications is ", "12 noon on Tuesday, May 15th, 2018.", "For More Information:", "Visit the Official Webpage of the Miles Morland Foundation African Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/miles-morland-foundation-african-scholarship-2018/"], [["Study Online/Blended Learning MBA & DBA Programs (Win a partial scholarship up to 50%!)", "date announced:March 20, 2018", "Earn an MBA or DBA with the flexibility of studying online or mixing it with classroom time. Win a partial scholarship up to 50%!"], ["Earn an MBA or DBA with the flexibility of studying online or mixing it with classroom time. Win a partial scholarship up to 50%!", "A Master of Business Administration (MBA) or Doctorate of Business Administration (DBA) are highly valued by employers and can be your gateway to career success. However, these programs usually demand a huge commitment of time and money.", "Wouldn’t it be great if you could enrol in an internationally accredited MBA or DBA program that is both affordable and flexible?", "Unicaf University offers exactly that. Its top-class business programs will prepare you for the demanding world of business, and open-up excellent career opportunities.", "Made affordable with generous scholarships covering a large part of tuition fees. Currently up to 50% (€5,000 for the MBA, €10,000 for the DBA)", "Made flexible with a choice of online study or blended learning. This lets you to keep your job and salary, or stay at home and care for your family.", "And it gets even better – the range of Unicaf University programs include the following highly sought-after specialisations:", "MBA Master of Business Administration", "MBA Finance", "MBA Management Information Systems", "MBA Oil and Gas Management", "MBA Health Management", "DBA Doctorate of Business Administration", "Program starts: Program can start as soon as you are ready!", "How is works:", "1. ", "Take this online challenge", " (to win a career coaching session that could change your professional path!", "Sign up on Sqore", "Take a short quiz to learn more about UNICAF", "Fill in your details", "2. Apply with UNICAF once you have completed the challenge", "For More Information:", "Visit the Official Webpage of the Study Online/Blended Learning MBA & DBA Programs"], "url : https://www.opportunitiesforafricans.com/study-online-blended-learning-mba-dba-programs/"], [["Action for Climate Empowerment (ACE) Youth Forum Scholarships 2018 (Fully Funded to Bonn, Germany)", "date announced:March 7, 2018", "Application Deadline: March, 12, 2018 | 23.59 UTC"], ["Application Deadline: ", "March, 12, 2018 | 23.59 UTC", "The first ever ", "Action for Climate Empowerment (ACE) Youth Forum", " will bring together young people from all over the world who are taking steps towards climate action and projects related to the concept of “ACE”", "The ACE Youth Forum", " is an initiative of the Presidency of the 23rd UN Climate Change Conference (COP23) and YOUNGO (the official youth constituency to UN Climate Change), in partnership with the Government of Canada, United Nations Development Programme (UNDP) and UN Climate Change.", "More than hundred youth will participate in the ACE Youth Forum (AYF), out of which about 40 youth from the Global South will be fully funded through AYF Scholarships.", "Eligibility Requirements:", "To be eligible for an ACE Youth Forum Scholarship, an applicant must ensure that:", "You are between 16 and 35 years of age on 31 March 2018", "If selected, you will be available to join the ACE Youth Forum on the 29 April 2018 in Bonn Germany and shall also engage proactively in the preparation phase leading to the Forum, along with other YOUNGO members.You are a citizen/national of one of the countries listed below:", "Africa", "Angola", "\nBenin", "\nBotswana", "\nBurkina Faso", "\nBurundi", "\nCameroon", "\nCape Verde", "\nCentral African Republic", "\nChad", "\nCongo", "\nCongo, The Democratic Republic of the", "\nCôte D’Ivoire", "\nEquatorial Guinea", "\nEritrea", "\nEthiopia", "\nGabon", "\nGambia", "\nGhana", "\nGuinea", "\nGuinea-Bissau", "\nKenya", "\nLesotho", "\nLiberia", "\nMadagascar", "\nMalawi", "Mali", "\nMauritius", "\nMayotte", "\nMozambique", "\nNamibia", "\nNiger", "\nNigeria", "\nRwanda", "\nSaint Helena", "\nSao Tome and Principe", "\nSenegal", "\nSeychelles", "\nSierra Leone", "\nSouth Africa", "\nSouth Sudan", "\nSwaziland", "\nTanzania, United Republic of", "\nTogo", "\nUganda", "\nWestern Sahara", "\nZambia", "\nZimbabwe", "Benefits:", "About 40 young people from the countries of the Global South, will receive ACE Youth Forum Scholarships, which include complete funding and relevant support for effective participation in the ACE Youth Forum.", "All expenses covered for participation in the ACE Youth Forum on 29 April 2018 in Bonn, Germany.", "The selected youths will have all their costs covered – including costs for all international and domestic flight tickets, costs of accommodation for about 3 days, visa application fee, cost for travel insurance, food, local transport and additional expenses during the stay in Bonn.", "For More Information:", "Visit the Official Webpage of the Action for Climate Empowerment (ACE) Youth Forum Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/action-for-climate-empowerment-ace-youth-forum-scholarships-2018/"], [["DAAD/ Forschungszentrum Jülich Scholarships 2018 for African Journalists/Bloggers (Fully Funded to Accra, Ghana)", "date announced:March 6, 2018", "Application Deadline:April, 30th 2018."], ["Application Deadline:April, 30th 2018.", "The German Research Centre / Forschungszentrum Jülich", " has won one of the main prizes in this year’s", " International Research Marketing ideas competition", " run by the", " German Research Foundation (DFG).", " The project on the", " pan-African challenge of soil as a resource", " will build a scientific bridge between Forschungszentrum Jülich and African partners. Against the background of the rapid population growth and climate change and its consequences, it aims to support Africa to implement methods to make food production sustainable and secure.", "In order to make the project known in the African scientific community as well as in the public we offer a scholarship for an African journalist.", "Core activities of the project will be a supercomputing training at a fall school and a so-called Hackathon in Accra for excellent young (and senior) geo-scientists. A Hackathon is a gathering of scientists to work on specific software applications. Here it will focus on data modelling for soil-related food security.", "Requirements", "If you are an African journalist (print, TV, radio or Social Media, for instance Blogs) who is devoted to the possibilities of modern science to tackle great societal challenges it would be a pleasure for us to receive your application.", "During your four-week stay in Jülich, you will work with the press office and support the communication’s team to initiate first project activities already. You will also get close insight into our geoscientific research, meet scientists who organize the Pan African Soil Challenge project and get in contact with colleagues of international relations. On the other hand, we expect you to cover the project via your home medium, especially during the fall school and the Hackathon in Accra.", "Benefits:", "The scholarship includes an invitation to a one-month stay at Forschungszentrum Jülich, one of Europe’s biggest research centres in the fields of information, energy and bio economy in summer 2018. The scholarship also covers the costs for a one-week trip to Accra, Ghana, where the core activities of the project take place from 26th November 2018 to 30th November 2018.", "For one week in autumn 2018 young scientists from Ghana and other African regions will meet Geo-scientists from Forschungszentrum Jülich in Accra, to get in contact with the latest methods of modern geoscientific research – modeling and simulation with supercomputers. The vision: Soil Research can support a secure and sustainable food production for Africa – and a week together could be the first step for future cooperation of geo-scientists from both sides of the bridge.", "Application Procedure:", "Please provide the following documents with your application: letter of intent, CV, letter of recommendation, and two to three examples of your journalistic work.", "The deadline for applications is April, 30th 2018.", "For More Information:", "Visit the Official Webpage of the DAAD/ Forschungszentrum Jülich Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/daad-forschungszentrum-julich-scholarships-2018-for-african-journalists-bloggers/"], [["Kemitraan Negara Berkembang (KNB) Indonesian Government Scholarships 2018 for Students from Developing Countries (Fully Funded)", "date announced:March 14, 2018", "Application Deadline: April 30th 2018"], ["Application Deadline: April 30th 2018", "The Kemitraan Negara Berkembang (KNB) Scholarship", " is a financial assistance offered by the Indonesian Government to International students coming from developing countries to pursue their master degree in Indonesian Universities. Initially, the idea of offering scholarships by the Ministry of Education and Culture of the Republic of Indonesia for the student coming from the NAM member countries was mandated in the 10th Conference of Heads of States of Non-Aligned Movement (NAM) countries commenced in Bandung from 1st–6thSeptember 1992.", "Following that mandate, in 1993 the Government of the Republic of Indonesia started offering", "postgraduate (master degree) scholarships to students from the NAM member countries. Since 2002, due to the substantial change in the international political constellation, the use of the term “NAM” in this program was considered irrelevant. The program name then changed to", "Kemitraan Negara Berkembang (Developing Countries Partnership) Scholarship or KNB Scholarship.", "Consequently, the program have been widely offered to students, not only to the NAM member countries, but also to other developing countries such as Thailand, Fiji, Gambia, Senegal, Nigeria, Madagascar, Suriname, Pakistan, Guyana, Myanmar, Laos, Vietnam, and Vanuatu.", "Program Objectives", "1. To contribute in the human resource development in the developing countries;", "2. To promote deeper cultural understanding between developing countries;", "3. To strengthen the relationship and cooperation between developing countries.", "Requirements:", "1. The maximum age to apply for the scholarship is 35 years old;", "2. Applicants must hold a bachelor degree (master degree holder is not eligible to apply);", "3. Applicants must have a TOEFL (or other certified English Proficiency) score of 500 or equivalent;", "4. Applicants must complete the on-line application form;", "5. Prior to the departure to Indonesia, the successful candidates must sign the Statement Letter and Scholarship Agreement prepared by the KNB Scholarship management", "Medium of Instruction", "a. Language", "All courses will be delivered in Bahasa Indonesia.", "b.Thesis", "Thesis should be written in Bahasa Indonesia unless the university suggested otherwise.", "c.Research", "Research should be carried out in Indonesia", "Benefits:", "The KNB Scholarship covers:", "1. A Settlement Allowance of IDR 1,000,000 will be given to new students upon", "their arrival in Indonesia;", "2. While taking the Indonesian language course and preparatory programs, the new students", "will only receive a Living Allowance of IDR 2,550,000 per month;", "3. During the Master Program, the KNB students will receive a scheme of monthly allowance as detailed below:", "1 Living Allowance IDR 2,550,000", "2 Research Allowance IDR 400,000", "3 Books Allowance IDR 350,000", "4. A health insurance with a maximum of IDR 200,000 monthly premium (In case of the cost of medical services exceeded to those covered by the health insurance, the difference should be borne by the student);", "5. A round-trip international airfare (economy class) from the international airport of the student’s home countries to Indonesia, including local transport to the host university;", "6. The duration of scholarship is exclusively correlated to the duration of the academic program as indicated below:", "1 Indonesian Language Course and Master Preparatory Program : Maximum 12 months", "2 Master Program : Maximum 24 months (4 semester)", "3 Bachelor Program Maximum 48 months (8 semester)", "How to Apply:", "All application process is conducted online through the KNB Scholarship website www.knb.ristekdikti.go.id. Please be advised that soliciting is prohibited.", "a. Required Documents", "1) Recommendation letter from the Indonesian Embassy in the respective country;", "2) Nomination letter from the respective government official (Ministry of Education, other related Government Agency–should the applicant works for the Government Agency, or Embassy of the Applicant’s Country of Origin in Indonesia);", "3) 2 Academic Recommendation letters;", "4) Scanned passport (personal data page only) or birth certificate;", "5) Scanned bachelor certificate and academic transcripts (in English);", "6) Scanned TOEFL score certificate (or other English Proficiency Tests) obtained within the last 2 Years;", "7) Scanned Official Medical Statement (Official Diagnose) prepared by a certified Physician.", "Application Procedures", "1) Download the Invitation Letter (Available in the KNB Scholarship website);", "2) Submit the Invitation letter, Passport, Academic Certificates and Academic Transcripts to the Indonesian Embassy to acquire the recommendation letter;", "3) Complete the online application process;", "4) Selection process;", "Selection Results Announcement. The Selection Results will be announced online via the KNB Scholarship Website and officially announced through the Indonesian Embassy publication network;", "Schedule", "1. The online application process must be completed no later than April 30th, 2018;", "2. Selection process will be conducted on the first week of May 2018;", "3. The selection result will be announced on the 2nd week of June 2018.", "4. The students are expected to arrive in Jakarta on August 2018", " ", "For More Information:", "Visit the Official Webpage of the Kemitraan Negara Berkembang (KNB) Indonesian Government Scholarships 2018 "], "url : https://www.opportunitiesforafricans.com/kemitraan-negara-berkembang-knb-indonesian-government-scholarships-2018/"], [["Coventry University Ghana Development Fund 2018 for young Ghanaians.", "date announced:March 5, 2018", "Application Deadline: 18th May 2018"], ["Application Deadline: 18th May 2018", "Many Ghanaian students have told us that the real cost of a", " Coventry University", " course in Cedi has gone up significantly in the last year. We don’t think it’s fair that an ambitious Ghanaian student should be penalised just because exchange rates have fallen. So we’ve secured extra financial support to help Ghanaian students afford the cost of a Coventry University degree.", "Ghana Development Fund", " isn’t a selective grade-based scholarship. Any student from Ghana who enrols on a qualifying course that starts in May 2018 can take advantage of this offer. This award is to save £2,000 from tuition fees for every year that they study with us.", "So a postgraduate student on a one year course could save £2,000, and an undergraduate student could save a total of £6,000 during their 3 year course.", "Eligibility", "can only consider you for this scholarship when you complete an application for a course run by the Faculty of Engineering, Environment and Computing. You must successfully enrol for the May 2018 intake at the Coventry campus of Coventry University in order to receive the award.", "In addition, you must:", "Be a Ghanaian national.", "Be self-funded and paying international tuition fees.", "Have submitted a valid course application for a qualifying course before the deadline.", "Not be progressing to us through our partnership with Cambridge Education Group or ISC London.", "Further Information", "You cannot combine this award with any other Coventry University scholarship or discount. If you were eligible for two scholarships or discounts, we will award you the one that has the greatest benefit to you.", "Coventry University has sole discretion to assign, vary or withdraw this award.", "For More Information:", "Visit the Official Webpage of the Coventry University Ghana Development Fund 2018"], "url : https://www.opportunitiesforafricans.com/coventry-university-ghana-development-fund-2018-for-young-ghanaians/"], [["OPEC Fund for International Development (OFID) 2018/2019 Scholarships for Students from Developing Countries (Fully Funded)", "date announced:March 20, 2018", "Application Deadline:  May 4th, 2018."], ["Application Deadline: ", " May 4th, 2018.", "OFID (The OPEC Fund for International Development)", " is pleased to announce that qualified applicants who have obtained or are on the verge of completing their undergraduate degree and who wish to study for a Master’s degree are welcome to apply for the", " OFID Scholarship 2018/2019", " during the dates below.", "The Application Portal will be open from March 20, 2018 – May 4, 2018.", "OFID scholarships will be awarded to candidates for master’s degree studies. Applicants must be from a developing country (except ", "OFID Member Countries", "), and he/she must first obtain admission to pursue a Master’s degree studies in a relevant field of development, from any recognized university/college in the world.", "Through its scholarship scheme, OFID aims to help highly motivated, highly driven individuals overcome one of the biggest challenges to their careers – the cost of graduate studies. The winners of the OFID Scholarship Award will receive a scholarship spread over a maximum of two years, toward the completion of a Master’s degree, or its equivalent, at an accredited educational institution, starting in the autumn of the academic year 2018/2019.", "Eligibility", "Must be between the ages of 23-32 at the time of submitting his/her application.", "Must have obtained or be on the verge of completing their undergraduate degree with a Baccalaureate from an accredited college/university, or its equivalent.", "Must have a minimum cumulative GPA of 3.0 or higher on a 4.0 rating system, or its equivalent.", "Must be matriculated at an accredited university for the upcoming academic year starting August/September 2018, and must maintain full-time status for the duration of the Master’s Degree.", "Must be a national of a developing country—please refer to the list of eligible countries. Please note that nationals of OFID Member Countries (Algeria, Ecuador, Gabon, Indonesia,  Iran, Iraq, Kuwait,  Libya, Nigeria, Qatar, Saudi Arabia, United Arab Emirates, Venezuela) are ineligible to apply.", "Must select a subject of study that pertains to OFID’s core mission, such as: economics of development (poverty reduction, energy and sustainable development), environment (desertification), or other related science and technology fields.", "Benefits:", "The Award will cover the full cost of tuition fees, including any supplementary fees, required by your academic institution. The grant will also cover one round-trip flight between your home country and the university, health insurance, a relocation grant to help you cover additional costs of moving, and a monthly allowance for one year.", "The terms and conditions of payment will be determined in coordination with the student upon his/her selection in accordance with the following guidelines:", "The tuition fees, including any supplementary examination fees, as may be required by the academic institution, will be paid by OFID directly to the academic institution. Health insurance will be paid in accordance with the institution’s own standard medical scheme.", "A monthly allowance to cover living expenses, books and accommodation, will be transferred to the student’s own personal bank account.", "Prior to the start of his/her first year studies, the student will be paid a relocation grant. OFID will also pay for travel costs from the nearest airport to the student’s place of residence, to the nearest airport to the chosen place of study. Upon completion of the studies, the student will be paid the cost of one-way air ticket to his/her home country.", "Required Documents", "A completed on-line application form.", "A scanned copy of the applicant’s passport.", "A scanned copy of the transcripts/certificates from the highest level of education completed.", "A scanned letter of acceptance from chosen educational institution, confirming your admission, subject of study and duration of the Master’s degree program.", "A proof of meeting any prerequisites, including language proficiency.", "A short essay – of about 500 words in English – giving reasons for applying for the OFID scholarship, explaining your educational goals, and clearly describing how you will use the experience gained from your Master’s degree studies to help in the development of your home country.", "Two letters of recommendation from professors and/or lecturers at applicant’s present university (or present employer).", "Curriculum Vitae (CV).", "Application Guidelines", "STEP 1: ", "Ensure that you fulfill the OFID Scholarship Award Eligibility Criteria and all necessary documents are ready for submission.", "STEP 2:", " Register within the OFID Scholarship Portal by using your email address. Please note you can log onto the portal as many times as required before finally submitting the application.", "STEP 3:", " Fill out the application form. Make sure to save data each time you update your application. Once you are logged in, if the page remains inactive for more than two hours, your session will time-out and you may lose unsaved data. Do not submit your application until you have completed the entire application process!", "STEP 4:", " Upload necessary documents: CV, two recommendation letters, certificates/transcripts from the highest level of completed education, acceptance letter into postgraduate program, passport copy and personal essay.", "STEP 5: ", "When your application is complete, and all additional documents are uploaded, your application is ready to be submitted. Once your application is submitted, you can no longer make any changes or upload any more documents.", " The application deadline is May 4, 2018", ". Please do not call or email OFID to see if your application has been received or to inquire about your status. You will receive an automated confirmation once your application has been submitted. Only the winners will be notified by ", "June  2018 ", "and announced on our website.", "For More Information:", "Visit the Official Webpage of the OPEC Fund for International Development (OFID) 2018/2019 Scholarships"], "url : https://www.opportunitiesforafricans.com/opec-fund-for-international-development-ofid-2018-2019-scholarships/"], [["Qalaa Holdings Foundation Scholarships 2018/2019 for Young Egyptians (Fully Funded)", "date announced:March 17, 2018", "Application Deadline: April 15th 2018"], ["Application Deadline: April 15th 2018", "The Qalaa Holdings Scholarship Foundation", " ", "was created in 2007, out of a strong will to contribute to national development through creating high caliber professionals to help enhance Egypt’s growth in all sectors. The Foundation is funded by an endowment from Qalaa Holdings to grant academic scholarships for talented and promising young Egyptian men and women to pursue master degrees abroad in all fields of study.", "Eligibility criteria for application:", "Applicant must be under the age of 35.", "Must be an Egyptian national and residing in Egypt.", "Applicant must have a minimum of two years of work experience post-graduation.", "Is planning to pursue his/her studies at one of the top universities abroad in their discipline of choice.", "Must have been accepted at the university and program of interest.", "Applicant must submit an unconditional acceptance letter (with the exception of a funding condition).", "Excellent command of language of study. Good command of the English language.", "Involvement with activities in civic, public or international affairs (NGOs, volunteer work, etc) will be an asset.", "Must have a genuine financial need.", "Not a beneficiary of any other partial scholarship or grants (with exception to waivers from the university of choice itself).", "Upon completion of program, graduates must be committed to return to work in Egypt for a minimum of 2 years.", "Military service status must be clear (for males).", "Timeline:", "April 15th:", "Deadline for submitting hard copy applications.", "May:", "Shortlisting completed. Semi-finalists contacted for personal interviews.", "June:", "Scholarship recipients announced.", "July – August:", "Placement and departure of scholars", "Application Procedure:", "Your application package must include the following:", "The Qalaa Holdings Scholarship application form (download button below)", "Copy of letter of acceptance to University of choice", "Copy of (completed) application form submitted to university of choice", "An updated C.V.", "Two reference letters (academic and professional)", "Copy of Military Certificate (for Males only)", "Download Application Form", "Once it is completed, please submit your application package to:", "By Regular Post:", "Qalaa Holdings Scholarship Foundation", "\nP.O Box 29", "\nPostal Code: 11516", "\nCairo, Egypt", "By Fedex:", "Qalaa Holdings Scholarship Foundation", "\nHold at Fedex Mohandessin office", "Note:", "You can check that your application has been delivered through: ", "[email protected]", "Kindly wait for a week before checking.", "Please submit an acceptance letter to only one university.", "Submit your application package only once.", "Multiple applications from one person will result in rejection of all applications.", "For More Information:", "Visit the Official Webpage of the Qalaa Holdings Foundation Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/qalaa-holdings-foundation-scholarships-2018-2019-for-young-egyptians/"], [["Edinburgh Global Online Distance Learning Masters Scholarships 2018", "date announced:March 17, 2018", "Application Deadline: 1st June 2018."], ["Application Deadline: ", "1st June 2018.", "The University of Edinburgh", " will offer Masters scholarships for distance learning Masters programmes offered by the University.", "Benefits", "Each scholarship will cover full tuition fees and will be tenable for three years.", "One scholarship funded by the Sanctuary Walk and Humanitarian Assistance Fund will be awarded to an applicant from the Syrian Arab Republic.", "Eligibility", "Scholarships will be available for students commencing in session 2018-2019 any distance learning Masters programme offered by the University .", "Applicants must be nationals of the following countries:", "Angola", "Afghanistan", "Bangladesh", "Benin", "Bhutan", "Burkina Faso", "Burundi", "Cambodia", "Central African Republic", "Chad", "Comoros", "Congo, Dem Rep", "Djibouti", "Equatorial Guinea", "Eritrea", "Ethiopia", "Gambia, The", "Guinea", "Guinea-Bissau", "Haiti", "Kenya", "Kiribati", "Korea, Dem Rep", "Lao PDR", "Lesotho", "Liberia", "Madagascar", "Malawi", "Mali", "Mauritania", "Mozambique", "Myanmar", "Nepal", "Niger", "Rwanda", "São Tomé and Principe", "Senegal", "Sierra Leone", "Solomon Islands", "Somalia", "South Sudan", "Sudan", "Syrian Arab Republic", "Tajikistan", "Tanzania", "Timor-Leste", "Togo", "Tuvalu", "Uganda", "Vanuatu", "Yemen, Rep", "Zambia", "Zimbabwe", "Applicants should already have been offered a place at the University of Edinburgh and should have firmly accepted that offer or be intending to do so.", "Criteria", "The scholarship will be awarded broadly on the basis of academic merit. Candidates must have, or expect to obtain, a UK first class or 2:1 Honours degree at undergraduate level or the international equivalent.", "Applying", "Information on how to apply will follow shortly – ", "the closing date will be ", "1 June 2018.", "Notification", "All applicants will be notified of the outcome in August 2018.", "For More Information:", "Visit the Official Webpage of the Edinburgh Global Online Distance Learning Masters Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/edinburgh-global-online-distance-learning-masters-scholarships-2018/"], [["National Film & Video Foundation (NFVF) International Bursary 2018 for Film & TV Post Graduate Studies – South Africa", "date announced:March 7, 2018", "Application Deadline: 31 March 2018 at 17h00 CAT."], ["Application Deadline: ", "31 March 2018 at 17h00 CAT.", "The National Film & Video Foundation (NFVF),", " an agency of the Department of Arts and Culture, is a statutory body mandated to spearhead the equitable growth and development of the SA film and video industry.", "The NFVF’s bursary programme is aimed at building capacity by upskilling film and TV professionals for global competitiveness through its support of qualifying applicants for ", "overseas studies which are not offered at South African tertiary institutions. However, Live Performance or Acting programmes ", "are excluded.", "This bursary will be awarded for the 2018 academic year with a cap of R250 000 inclusive of tuition and living expenses.", "Qualifying Criteria:", "The applicant must:", "Must apply six months before the course commences", "Be a South African citizen", "Have a good academic record", "Demonstrate a need for a financial assistance", "Be enrolled at an accredited overseas tertiary institution for a full time post graduate film/TV programme", " (the course must be commencing in September 2018 and not available in South Africa)", "Applications must be accompanied by a detailed motivation as to why the applicant must be awarded a bursary together with all the supporting documents as indicated in the online application form.", "Required Documents", "• A completed application form;", "• a covering letter including personal motivation for study and its relevance to the applicant’s intended career path and benefit to South African film industry;", "• proof of registration at a recognised institution or proof of acceptance to study at a recognised institution;", "• a letter of recommendation from an industry professional;", "• proof of financial need in the form of legal guardian and applicant’s payslip or bank statements or IRP5 form. If the legal guardian and applicant are unemployed, producing an affidavit to that effect will suffice;", "• certified copy of Senior Certificate;", "• certified copy of undergraduate qualification;", "• certified copy of South African Identity Document; and", "• certified copy of most recent academic results.", " ", "PLEASE NOTE:", "Failure to provide all requested information will lead to an automatic disqualification of the application", "No late applications will be considered", "Should there be a change of contact details the onus is on the applicant to notify NFVF", "For further information, please consult the NFVF Funding Policy available on a link below:", "http://www.nfvf.co.za//home/22/files/Approved%20FUNDING%20POLICY%20APRIL%202016.pdf", "How to apply", "Complete an online international bursary application form which is available on the NFVF website: ", "www.nfvf.co.za", " or ", "https://nfvf.praxisgms.co.za", ".", "Deadline for applications: 31 March 2018 at 17h00 CAT.", " ", "Failure to submit all the mandatory requirements will result in an automatic disqualification.", "For any queries regarding the application process please email Thandekile Hlatshwayo at ", "[email protected]", " and for queries regarding the qualifying criteria, please email Lebohang Khunou at ", "[email protected]", ", 011 483 0880", "For More Information:", "Visit the Official Webpage of the National Film & Video Foundation (NFVF) International Bursary 2018"], "url : https://www.opportunitiesforafricans.com/nfvf-2018-for-film-tv-post-graduate-studies/"], [["Trust Conference Scholarship Programme 2018 to attend the Trust Conference in London, United Kingdom (Funded)", "date announced:March 6, 2018", "The Trust Conference Scholarship Programme funds frontline activists and human rights defenders from across the world to attend the annual conference. In 2017, the Trust Conference received applications from 90 countries and selected Scholars from developing nations with expert knowledge of our conference themes."], ["The Trust Conference Scholarship Programme", " ", "funds frontline activists and human rights defenders from across the world to attend the annual conference. In 2017, the Trust Conference received applications from 90 countries and selected Scholars from developing nations with expert knowledge of our conference themes.", "This year, we will award up to 60 scholarships to applicants from diverse disciplines that will bring unique perspectives and help forge tangible commitments at Trust Conference. For global leaders who want to connect and take action, the prestigious Trust Conference Scholarship Programme offers access to an influential gathering of NGOs, heads of corporations, lawyers, public servants and philanthropists from around the world.", "Eligibility Requirements:", "The Trust Conference Scholarship Programme is open to all applicants working in the areas of human rights; including women’s rights, education, human trafficking and modern-day slavery.", "Priority will be given to applicants from developing countries who will demonstrate their participation at Trust Conference will enhance their work in their own communities.", "Benefits:", "The Thomson Reuters Foundation and the sponsors of Trust Conference will award scholarships to exceptional applicants from across the world. Scholarship selection will be based on an objective rating system developed by the scholarship review committee.", "Scholarships will include:", "Free attendance at the Trust Conference on November 14 and 15 2018 in  London, United Kingdom", "Financial bursary to support travel and accommodation costs (up to £1,000).", "Name and photo in Trust Conference marketing materials", "Complimentary Ticket", " ", "One non-transferable ticket to Trust Conference", "Financial Support\n", "A bursary for travel & accommodation costs", "Exclusive Access\n", "Opportunity to network & participate in scholar events", "Global Exposure", "Name featured in delegate booklet and website", "Alumni Membership\n", "Continued engagement opportunities", " ", "Scholarship Type", "Scholarship selection will be based on a rating system developed by the scholarship review committee. Scholarship recipients will use their bursary to cover all travel, visa and accommodation costs to attend Trust Conference 2017. There is no further funding available to cover expenses. Scholarships will be awarded at three levels:", "Ticket only", "One non-transferable ticket to Trust Conference", "Partial scholarship", "One non-transferable ticket and £500 bursary", "Full scholarship", "One non-transferable ticket and £1,000 bursary", "How to Apply:", "Scholarship applications will open in February 2018. Applications can only be received online. Please complete the application in English only.", "All applicants will be notified of the outcome of their application in summer 2018.", "For More Information:", "Visit the Official Webpage of the Trust Conference Scholarship Programme 2018"], "url : https://www.opportunitiesforafricans.com/trust-conference-scholarship-programme-2018/"], [["UCL Institute for Global Health African Graduate Scholarships 2018/2019 for young Africans (Funded)", "date announced:March 2, 2018", "Application Deadline:  27th of April, 2018 "], ["Application Deadline: ", " 2", "7th of April, 2018 ", "Sponsored by the ", "CP Charitable Trust,", " and the ", "International Student House,", " this scholarship exists to support African nationals with a high-quality academic and professional background who would not be able to study at UCL without financial assistance. The Scholarship is a one-off award for the academic year September-September to study Global Health and Development at UCL.", "The scholarships exist to support African nationals with a high-quality academic and professional background who would not be able to study at UCL without financial assistance.The Scholarship is a one-off award for the academic year September-September to ", "study at the UCL Institute for Global Health.", "Eligibility Requirements:", "Candidates must meet the following criteria:", "The candidate must be an African national and a permanent resident of an African  nation at the time of application.", "The candidate must have made an application and been accepted to UCL to study for a full-time postgraduate programme at the Institute for Global Health for the coming academic year. Click ", "this link ", "to apply to the MSc.", "The scheme offers a s", "ubstantial scholarship towards UCL tuition fees, accommodation and some living costs. The candidate must also be able to provide evidence that he/she has secured other sources of funding for travelling to and from the UK.", "Application Process:", "Candidates are required to submit their completed scholarship application forms with", "the following documentation:", "Two reference letters. (Preferably one professional and one academic reference). Reference letters must be on letter-headed paper with a signature and must be signed across the seal of the envelope to ensure confidentiality (if sent by post). If sent by e-mail the referee can send the signed letter directly to Alison Gilry at ", "[email protected]", "A copy of the UCL unconditional offer letter for the relevant academic year that the scholarship is intended for.", "A current CV.", "A letter confirming current employment status and annual salary in GBP.", "Copies of certificates and transcripts for higher education and professional training.", "A detailed personal statement.", "Proof of funding status including evidence that they have applied to other funding bodies for the additional expenses", "Application Procedure:", "African Graduate Scholarship Application ", "Form", " (word doc) ", "Please submit your application and supporting documentation by the 2", "7th of April, 2018 ", "Application forms can be obtained from and, when completed, should be returned to", "the following postal address.", "Alison Gilry", "UCL Institute for Global Health", "30 Guilford Street", "London WC1N 1EH", "Email: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the UCL Institute for Global Health African Graduate Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/ucl-institute-for-global-health-african-graduate-scholarships/"], [["Study Maths and Economics on the Warwick International Foundation Programme (IFP), UK (Win a partial scholarship of £2000)", "date announced:March 2, 2018", "Are you a high school student looking to study Maths and Economics? Win a partial scholarship of £2000 to join the Warwick IFP in Maths and Economics in the United Kingdom!"], ["Are you a high school student looking to study Maths and Economics?", " Win a partial scholarship of £2000", " to join the Warwick IFP in Maths and Economics in the United Kingdom!", "Do you want to study your bachelor in Maths and Economics but need more preparation? The foundation programme at Warwick is a great place to start! Warwick is one of the UK’s leading universities, with an acknowledged reputation for excellence in research and teaching, for innovation, and for links with business and industry.", "Take this online challenge to compete for the partial scholarship!", " How is works: ", "1. Sign up", "2. Take a short quiz, fill in your details and explain why you would like to join the programme", "3. Apply directly with the University of ", "Warwick", " once you have completed the challenge", "For More Information:", "Visit the Official Webpage of the Study Maths and Economics on the Warwick International Foundation Programme"], "url : https://www.opportunitiesforafricans.com/study-maths-and-economics-on-the-warwick-international-foundation-programme-ifp-uk/"], [["Beit Trust Postgraduate Scholarship Scheme 2018 for Southern Africans to Study in the UK/South Africa (Fully Funded)", "date announced:March 17, 2018", "Application Deadline: May 31st 2018"], ["Application Deadline: May 31st 2018", " ", "The Beit Trust offers annually a number of ", " ", " ", "Postgraduate", " Scholarships", " abroad (excluding MBAs and Ph.Ds.) to graduates who are domiciled in and are nationals of Malawi, Zambia or Zimbabwe (and ", " ", " ", "only", " to graduates in these three countries)", ". ", " Scholarships are ", "taken up at a partner university in the United Kingdom or South Africa, for study in a subject of the individual’s choice appropriate to the needs of their country.  Duration is normally for a one-year taught Master’s in the UK and two years in South Africa.", " ", "Postgraduate Scholarship expenses are shared between The Beit Trust and the following Universities:", "UK", "Cambridge", "Edinburgh", "Glasgow – University of Glasgow (Biomedical Scholarships)", "Glasgow – University of Strathclyde (Engineering Scholarships)", "Leeds", "Oxford (Wadham College)", "South Africa", "University of Cape Town ", "Rhodes University", "Stellenbosch ", " ", "University", "Requirements:", "By Act of Parliament, the Beit Trust sponsors ", " ", " ONLY", " students who are nationals of Malawi, Zambia or Zimbabwe, and currently live there. In addition, ", " ", "the Trust cannot consider applications from those who have already begun a course.", "All", " applicants (except medical and veterinary doctors) must be ", "under 30 years of age", " on 31 December of the year of application. Some experience of work after completion of a first degree is essential. ", "Doctors and vets", " must be ", "under 35 years of age", " on 31 December and should have completed 18 months of internship and a one-year, preferably rural, posting in the relevant country.", "Prospective applicants, who must hold at least an upper second class degree (2:1): i.e. Merit or Distinction", "Benefits:", "Fees, tuition costs and related academic expenses are paid by the Trust direct to the universities.", "Payment of a personal allowance, index linked in accordance with guidance from an independent authority, covering maintenance support.", "Other allowances are paid for: arrival, a laptop, printing of a thesis, and return home.", "Economy Class air passages are provided by the Trust for the initial journey to the place of study, and on final return.", "Application Procedure:", "Zimbabwe and Malawi: Application lists open on 1 March (online link below).  Please read these ", "guidance notes", " before you go online.", "Zambia:  Application lists open on 1 March and should be made to: The Secretary, The Beit Trust, Beit House, Grove Road, Woking, Surrey, GU21 5JB, ENGLAND.   E-Mail: ", "[email protected]", "Please note that ", " all", " documents, including independent references, must be received by The Beit Trust by ", "31 May", ".", " Zimbabweans", " ", "–", " the application form can be obtained from ", " https://beitrust.wufoo.eu/forms/zzhmurj1dwav1p/", "Malawians", " –  the application form can be obtained from ", " https://beitrust.wufoo.eu/forms/zzhmurj1dwav1p/", " Zambians", " ", "–", " you will need to complete an initial application form ", "using this online initial application link", ".  Applicants are urged to submit the online form as early as possible to establish whether they would qualify to apply. If you do qualify, a form will be emailed to you and you will be required to provide additional information and details. This information will include, but may not be restricted to, the following:-", "A fuller application", "A medical certificate from your doctor", "A certified transcript of your degree results", "A certified document of evidence of residency (National Registration Card or birth certificate)", "Current CV showing all work experience", "A current photograph (not a passport photo)", " ", "For More Information:", "Visit the Official Webpage of the Beit Trust Postgraduate Scholarship Scheme 2018 "], "url : https://www.opportunitiesforafricans.com/beit-trust-postgraduate-scholarship-scheme-2018-for-southern-africans/"], [["Western Union Foundation Global Scholarship Program 2018 for Post-Secondary Education (USD $2,500)", "date announced:March 8, 2018", "Application Deadline: Friday, April 13, 2018 at 12:00pm EST"], ["Application Deadline: Friday, April 13, 2018 at 12:00pm EST", "The Western Union Foundation Global Scholarship Program,", " also referred to as WU Scholars, is a program designed to support young people and their efforts to pursue a post-secondary education.", "The Institute of International Education, Inc. (IIE), a US non-profit, administers the program on behalf of the Western Union Foundation and its contributors.", "The WU Scholars program", " was created to help give young people a boost toward a better life. The Western Union Foundation believes education is the surest path to economic opportunity. Educational pursuits to gain knowledge and skills for in-demand, 21st century careers are helping people all over the world climb the economic ladder.", "Eligibility Requirements:", " ", "Scholarships must be used at an accredited post-secondary institution seeking an undergraduate degree.", "All applicants must be pursuing a degree/field of study in one of the following categories: science, technology, engineering, mathematics, and business/entrepreneurship.", "All applicants for scholarships must be between the ages of 18 – 26 years of age on June 1, 2018.", "Application must be submitted in English. Translation services may be used to help non-English speakers submit. You will not be penalized for basic errors.", "Must be able to demonstrate admittance to an accredited post-secondary institution or have applied for admittance.", "Must provide a letter of recommendation from a teacher or professor. If a teacher or professor is unable to submit a recommendation on your behalf, you may also use someone who has supervised you in a youth/community group, volunteer position, job/employment situation, etc.", "Scholarships must be used on programs resulting in an undergraduate degree. Specialized academic programs (study abroad term, stand-alone language acquisition course, service learning, etc.) are not permitted.", "Scholarships may not be used for advanced degrees, such as Masters, PhD, JD, etc.", "Benefits:", "Selected scholarship recipients will receive USD $2,500 each to contribute toward tuition or school fees at an accredited post-secondary institution and will be selected based on criteria relating to the program’s three pillars: Perseverance, Aspiration, and Community.", "Timeline:", "Application Period Opens: Thursday, March 8, 2018", "Application Period Closes: Friday, April 13, 2018 at 12:00pm EST", "Selection and Notification to All Applicants: July 2018", " ", "For More Information:", "Visit the Official Webpage of the ", "Western Union Foundation Global Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/western-union-foundation-global-scholarship-program-2018/"], [["Mo Ibrahim Foundation 2018 Masters Scholarships in Governance and State-building (Fully Funded to United Kingdom)", "date announced:March 12, 2018", "Application Deadline: 20th May 2018"], ["Application Deadline: 20th May 2018", "The International Development Department is pleased to announce an exciting opportunity to undertake the ", "MSc in International Development (Governance and State-building)", " with a full scholarship.", "The scholarship is for two years to enable the applicant to complete the MSc and undertake a one year internship, including six-months with the Mo Ibrahim Foundation. Applicants must have a first class Honours degree, or equivalent, and be African nationals domiciled (or permanent residents) in an African country. Preference will be given to scholarship candidates living in Sub-Saharan Africa.", "The programme", "The Governance and Statebuilding programme is one of the specialised streams within international development, and takes an interdisciplinary standpoint, combining the theoretical rigour of political economy and the practical experience of development. The good governance agenda occurs now increasingly alongside debate on state-building, which encompasses issues such as accountability and transparency, corruption, conflict, political settlement, human rights, participation, access to justice and democratisation. Governance and state-building are of particular interest to governments, non-governmental organisations and development agencies, as well as to a growing and vibrant academic community.", "The pathway for the Foundation scholarship comprises the following modules:", "International Development (20 credits)", "Governance and State Building (20 credits)", "One of the following four modules (20 credits)", "Development Policy and Politics", "Development in Practice", "Conflict and Development", "Post Conflict Reconstruction and Development", "Choice of optional modules (60 credits) choose from over 25 IDD modules plus others from across the University.", "Dissertation (60 credits)–in depth focus on a topic of particular interest, with support from a supervisor. This may involve over seas fieldwork in a country chosen by the candidate.", "Eligibility", "The entry requirements consist of:", "A first class Honours degree or equivalent from an approved university.", "Good written and spoken English. For those whose first language is not English, evidence of this capacity is required. Applicants should reach at least level 6.5 in the IELTS or 580 /93 for TOEFL. Please check the University website for more information on English language requirements.", "Applicants must be African nationals domiciled (or permanent residents) in an African country. Preference will be given to scholarship candidates living in Sub-Saharan Africa", "The scholarship", "The scholarship includes:", "1. Full tuition fee", "2. Air fare to and from the United Kingdom and visa", "3. Monthly stipend of £950 for 18 months", "4. Arrival allowance of £950", "The remaining six months for the internship will be funded directly to the successful candidate by the Mo Ibrahim Foundation", "Application process", "Applications must be received through the University online application system, accessed via www.birmingham.ac.uk by the 20th May 2018. In addition to the usual documents to be submitted, applicants should also upload a 500 word statement and CV.", "This statement should set out why the applicant is the best candidate for the scholarship. Applicants must then send an email to Mrs Debra Beard (", "[email protected]", ") informing her of their wish to be considered for the Mo Ibrahim Scholarship and their ID number.", "Please include ‘Mo Ibrahim Scholarship’ in the subject line of the email", "For More Information:", "Visit the Official Webpage of the Mo Ibrahim Foundation 2018 Masters Scholarships in Governance and State-building "], "url : https://www.opportunitiesforafricans.com/mo-ibrahim-foundation-2018-masters-scholarships-in-governance-and-state/"], [["Mandela Rhodes Postgraduate Scholarships 2018/2019 for Africans to study in South Africa (Fully Funded)", "date announced:March 12, 2018", "Application Deadline: 15 April 2018."], ["Application Deadline: ", "15 April 2018", ".", "The Mandela Rhodes Scholarships programme", " is a combination of financial support for postgraduate studies and a high quality leadership development programme, with the intention of building exceptional leadership capacity in Africa.", "Eligibility Criteria:", "The Scholarship is open to ", "citizens", " of all African countries", "The Scholarship is for postgraduate study at South African universities or tertiary institutions", "Full funding is for Honours (maximum one year) or Masters (up to a maximum of two years) or their equivalents (MBA’s excluded)", "Any individual who will be between the ages of 19 and 30 years at the time of taking up the Scholarship may apply", "Applicants must possess a first degree or its equivalent or must be in the process of completing one by 31 January 2019", "Applicants should have a history of well above average academic results", "Individuals that reflect in their character a commitment to the four principles of Education, Reconciliation, Leadership and Entrepreneurship", "Applicants must be able to attend all compulsory elements of our leadership development programme. These activities can occur during the week or on weekends.", "The Scholarship cannot be deferred once awarded. It must be taken up in the year which was applied for", "PLEASE NOTE: ", "If you qualify for the Scholarship, The Mandela Rhodes Foundation does not apply to tertiary institutions on your behalf. Applicants must apply separately to their chosen tertiary institution for the degree they wish to undertake. The Scholarship award is conditional on the applicant being offered a place at the relevant institution.", "Leadership development programme", "The MRF leadership development programme", " is made up of the following three components.", "Three residential workshops;", "Three regional group pods;", "Mentoring.", "Benefits:", "The Scholarship covers the cost of a Scholar as follows:", "Tuition and registration fees as set by the institution", "A study materials allowance as set by the MRF", "Accommodation and meal allowances as set by the MRF", "A medical aid allowance as set by the MRF", "Economy-class travel allowance for international Scholars only from the Scholar’s home to their institution at the beginning and end of their degree", "Personal allowance", "The applications and selections process:", "All applicants apply online via the Embark application system on the MRF website.", "Round 1:", " Applications reviewed by South African tertiary institutions and the Mandela Rhodes Foundation (alumni reviewers). By ", "end June 2018", ", all applicants to be informed by ", "universities ", "and/or the ", "MRF  ", "whether or not their application is through to the next stage", "Round 2:", " Reviews by designated Mandela Rhodes Foundation staff. By the ", "end of July 2018", ", remaining applicants to be informed by the ", "MRF  ", "whether or not their application is through to the next stage", "Round 3:", " Reviews by designated Mandela Rhodes Foundation staff. By ", "end of August 2018", ", remaining applicants to be informed by the ", "MRF", " whether or not their application is through to the next stage", "Final round:", " Panel interviews with Selection Committees in October. By ", "end of October 2018", ", panel interviewed applicants to be informed by the ", "MRF", " whether or not they have been selected as Mandela Rhodes Scholars.", "For More Information:", "Visit the Official Webpage of the Mandela Rhodes Postgraduate Scholarships 2018/2019 "], "url : https://www.opportunitiesforafricans.com/mandela-rhodes-postgraduate-scholarships-2018-2019/"], [["Singapore-ICAO Developing Countries Training Programme 2018/2019 Scholarships for study in Singapore (Fully Funded)", "date announced:March 8, 2018", "Application Deadline: Varying by Course"], ["(Photo: RENDY ARYANTO/VisualVerve.SG)", "Application Deadline: Varying by Course", "Singapore and ICAO jointly established a ", "Developing Countries Training Programme (DCTP)", " in 2001 which is sponsored by the Singapore Government and administered by the", " ICAO Technical Cooperation Bureau for specialised training programmes", " conducted by the Singapore Aviation Academy (SAA).", "The programme which has been awarding fellowships for training at SAA since 2001 was further extended and expanded in 2004, 2007, 2010 and 2013. In 2013, a new Aviation Leaders Scholarship for Diploma in Civil Aviation Management was introduced. In response to overwhelming and continued demand, the fellowship and scholarship programme has been extended for another three years from 2016 to 2019, and expanded to provide 300 fellowships and 10 scholarships. Since 2001, 1,036 fellowships and 14 scholarships have been taken up under the DCTP.", "Training Programmes", "Dates", "Closing Dates for Application", "Safety Oversight Managers", "9 – 26 Jul 2018", "21 May 2018", "Aviation Security Management Programme", "16 – 19 Jul 2018", "28 May 2018", "Aviation Weather Risk Management", "23 – 27 Jul 2018", "4 Jun 2018", "Safety Oversight of Aviation Meteorological Services", "30 Jul – 2 Aug 2018", "11 Jun 2018", "Emergency Management Workshop", "30 Jul – 3 Aug 2018", "11 Jun 2018", "Future Airports: Transforming Mindsets of Regulators and Airport Operators", "13 – 17 Aug 2018", "25 Jun 2018", "Methodology and Best Practices for Aviation System Block Upgrades (ASBU) Implementation", "13 – 17 Aug 2018", "25 Jun 2018", "Aerodrome Certification", "3 – 6 Sep 2018", "16 Jul 2018", "Future Airports: Technology and Digital Agility for Regulators and Airport Operators", "15 – 19 Oct 2018", "27 Aug 2018", "Air Traffic Management Safety Investigation and Analysis", "22 – 26 Oct 2018", "3 Sep 2018", "Civil Aviation Management Programme", "22 Oct – 2 Nov 2018", "3 Sep 2018", "Procedures and Design Process for PBN Airspace", "12 – 23 Nov 2018", "24 Sep 2018", "Air Disasters: Crisis Planning and Business Continuity Management", "19 – 23 Nov 2018", "1 Oct 2018", "Airport Emergency Service Command Leadership Workshop", "3 – 7 Dec 2018", "15 Oct 2018", "Safety Oversight Inspectors (Flight Operations)", "18 Feb – 1 Mar 2019", "31 Dec 2018", "Safety Audits of Air Traffic Services", "25 Feb – 1 Mar 2019", "7 Jan 2019", "Aviation Leaders Scholarship for Diploma in Civil Aviation Management", "Fully awarded", "Terms of Fellowships", "The Government of Singapore will bear the training fees, daily allowance of sixty Singapore Dollars (S$60) and hotel accommodation for participants accepted for the programmes.", "Complimentary breakfast will be provided at the hotel and lunch at SAA during training days.", "Travel arrangements are to be made and costs borne by the nominating Governments.", "Hotel accommodation will be provided for the training duration, i.e. one day before course commencement (after 2pm) and one day after the course (till 12 noon). Daily allowance will be limited to the training duration, i.e. from the start of the course up to the last day of the course.", "Expenses to be incurred for stay beyond this duration will not be covered. Participants are advised to secure their own overseas travel insurance to cover themselves for the period of the training in Singapore.", "Application Procedures", "The fellowships are intended for participants nominated by their respective Governments.", "Nominating Governments should preferably nominate not more than 2 candidates for each course and indicate which candidate should take priority if more than one candidate is nominated.", "Applications should be submitted online at www.saa.com.sg/fellowships by the stated closing dates. Before proceeding with the online application, Nominating Governments should complete and endorse the attached Nomination Form (also available online) as part of the application process.", "For enquiries, please contact:", "Fellowships Management", "Singapore Aviation Academy", "Tel: (65) 6540 6232", "/ 6540 0433", "Fax: (65) 6542 9890 / 6543 2778", "Email: ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the Singapore-ICAO Developing Countries Training Programme 2018/2019 Scholarships"], "url : https://www.opportunitiesforafricans.com/singapore-icao-developing-countries-training-programme-2018-2019-scholarships-for-study-in-singapore-fully-funded/"], [["Women Deliver Young Leaders Program 2019 (full scholarship to attend Women Deliver Global Conference in Vancouver, Canada)", "date announced:March 9, 2018", "Application Deadline: April 19th 2018"], ["Application Deadline: April 19th 2018", "The Women Deliver 2019 Conference", " ", "will take place 3-6 June 2019 in Vancouver, Canada and will be the world’s largest conference on gender equality and the health, rights, and wellbeing of girls and women in the 21st century. It will serve as a catalyst for advocates working to achieve a more gender equal world.", "More than 6,000 world leaders, influencers, advocates, academics, activists, and journalists will flock to Vancouver with the drive to accelerate progress for girls and women everywhere.", "The conference will present new knowledge, promote world-class solutions, and engage a broad spectrum of voices. It will focus on several issues from health, nutrition, education, economic and political empowerment to human rights, good governance, and girls’ and women’s agency and equality.", "Everyone deserves a seat at the table. Women Deliver is committed to making our conferences accessible to people across all geographies, ages, and backgrounds.", "The scholarship program provides financial assistance to people who would otherwise be unable to cover the cost of attendance. It is opened to individuals of any age, but preference will be given to applicants from low- and middle-income countries and/or vulnerable populations who are working to advance gender equality and the health, rights, and wellbeing of girls and women—including sexual and reproductive health and rights.", "Scholarship Worth:", "Registration Fee", "Ground Transportation (days of conference only)", "Economy Airfare", "Per Diem (days of conference only)", "Visa Reimbursement", "Hotel Accommodation (days of conference only)", "Health Insurance", "Scholarship Requirements:", "Upon acceptance, scholarship recipients must be willing to complete the following commitments.", "Participate in the online communication and advocacy boot-camp in winter or spring of 2019", "Hold at least one policy dialogue post-conference in home country", "Secure visa at least 3 months prior to the conference (Canada allows applications 6 months prior to the event)", "Participate fully in the conference (on-site attendance for the full duration)", "Respond promptly to requests for information from the organizers", "Applications will only be open for 6 weeks and winners will be announced in September of 2018. ", "Scholarship selection is based on a non-biased scoring system, performed by an independent Scholarship Review Committee. Only a limited number of scholarships are available and applicants are strongly encouraged to seek other/additional funding sources. ", "For More Information:", "Visit the Official Webpage of the Women Deliver Young Leaders Program 2019"], "url : https://www.opportunitiesforafricans.com/women-deliver-young-leaders-program-2019-scholarships/"]]