[[["Investec Tertiary Bursary Programme 2020 for Young South Africans.", "date announced:May 30, 2019", "Application Deadline:30 September 2019. "], ["Application Deadline:30 September 2019. ", "Investec,", " in partnership with StudyTrust, provides the funding necessary to see young South Africans with academic potential get to university. With our assistance, they are able to study towards financial sector related degrees at various local universities.", "\nStudy Trust is an educational trust and public benefit organization who\nmanage bursaries, offer mentorship and student development.  ", "\nInvestec works in partnership with Study Trust and by completing the\nonline application, you will be considered for an Investec bursary and\nalso have the opportunity to get access to other bursaries managed by\nStudy Trust. \n", "Requirements:", " Applications are open to: All young SA citizens with academic potential who are in need of financial assistance.", " Pupils holding or working towards a matric exemption with a minimum of 70% in English and Mathematics (not Maths Literacy) and a 60% pass rate in all other subjects. ", "Benefits", "\nInvestec offers a full bursary per year towards study-related expenses. Terms and Conditions apply.\n", "For More Information:", "Visit the Official Webpage of the Investec Tertiary Bursary Programme 2020 "], "url : https://www.opportunitiesforafricans.com/investec-tertiary-bursary-programme-2020/"], [["2019 Margaret McNamara Memorial Fund for Women from Developing Countries.", "date announced:May 25, 2019", "Application Deadline: September 14, 2019. "], ["Application Deadline: ", "September 14, 2019.", " ", " Education grants", " are awarded to women from developing and middle-income countries who, upon obtainment of their degree, intend to work in, or with, a developing country to improve the lives of women and/or children. ", "Applicants must meet the following eligibility criteria:", "Be at least 25 years old at time of application deadline (see specific regional program application below);", "Be a national of a country listed on the ", "MMEG Country Eligibility List", " (except for the Trinity Washington University program);", "Be enrolled (not just accepted) at an accredited academic institution when submitting application; and plan to be enrolled for a full academic term after award of the grant by the Board;", "Not be related to a World Bank Group, International Monetary Fund or Inter-American Development Bank staff member or spouse;", "south AFRICA", "Applications for Africa program are accepted from ", "May 15, 2019 to September 14, 2019.", " Queries may be addressed to ", "[email protected]", " during this period. Decisions will be announced in December, 2019.", "In addition to the above criteria, an applicant must: ", "already", " be enrolled part time (minimum of 2 courses per semester or term) or full time at one of the universities listed below:", "University of the Witwatersrand", "University of Cape Town", "University of Stellenbosch", "University of Pretoria", "University of the Free State", "be enrolled for at least one more academic term (the term between January to July 2020) ", "Applicants applying from eligible countries other than South Africa must hold a study permit for South Africa.", "Estimated expenses should be calculated and expressed in Rand", "For More Information:", "Visit the Official Webpage of the 2019 Margaret McNamara Memorial Fund"], "url : https://www.opportunitiesforafricans.com/2019-margaret-mcnamara-memorial-fund-for-women-from-developing-countries/"], [["University of Malta Commonwealth Master’s Scholarships 2019/2020 for study in Malta", "date announced:May 13, 2019", "Application Deadline: Monday 27 May 2019"], ["Application Deadline: ", "Monday 27 May", " 2019", "The ", "University of Malta", " is offering four Commonwealth and Valletta Action Plan Master’s Scholarships provided by the Government of Malta for students from Ghana and Namibia in 2019 (two per country).", "These scholarships support both taught and research Master’s courses in a range of different subjects – ", "full details about the scholarships (including a full list of subjects) are available here", ".", "Eligibility", "You must be a citizen of either Ghana or Namibia.", "How to apply", "Please complete the ", "application form", " and submit it to your home institution (university) by ", "Monday 27 May.", "The following guidelines should be consulted while filling in your application:", "Application instructions for students from Ghana", "Application instructions for students from Namibia", "Universities in Ghana and Namibia will then nominate candidates to the University of Malta.", "Please note, successful candidates will be required to pay an\napplication fee of Euro 95, further information will be provided by the\nInternational Office, University of Malta.", "All enquiries should be directed to ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the Commonwealth Master’s Scholarships at University of Malta"], "url : https://www.opportunitiesforafricans.com/university-of-malta-commonwealth-masters-scholarships-2019-2020-for-study-in-malta/"], [["Knight-Hennessy Scholars Program 2019/2020 at Stanford University for high-achieving students (Fully Funded)", "date announced:May 22, 2019", "Application Deadline: October 9th 2019"], ["Application Deadline: October 9th 2019", " Knight-Hennessy Scholars", " develops a community of future global leaders to address complex challenges through collaboration and innovation. Every year, up to 100 high-achieving students from around the world will receive full funding to pursue any graduate degree at Stanford, including the DMA, JD, MA, MBA, MD, MFA, MS, and PhD programs, as well as joint- and dual-degrees. Knight-Hennessy Scholars is the largest fully endowed scholars program in the world. ", " As a Knight-Hennessy Scholar you will develop both the depth and range of subject expertise to confront the numerous grand challenges and opportunities of the future. You will be part of a unique community of change agents from a diverse range of backgrounds. This is a community that will support you, motivate you, and hold you accountable for achieving your goals even when the odds of success seem likely against you. ", "Eligibility Requirements:", "Stanford encourage applications to the Knight-Hennessy Scholars program from citizens of all countries.", "You are eligible to apply to the Knight-Hennessy Scholars program if you are applying to enroll in a full-time graduate degree program at Stanford (for example, but not limited to, JD, MA, MBA, MD, MS, or PhD) or if you plan on pursuing one of Stanford’s many joint- and dual- graduate degree options (for example, but not limited to, MD+PhD, JD+MA, MBA+MS).", "Financial Support for Full Cost of Attendance", "The education of Knight-Hennessy Scholars is fully funded for\nany graduate degree at Stanford. The Knight-Hennessy Scholars program\nfunds up to the first three years of your graduate education, and if\nyour degree program exceeds three years — such as an MD or PhD program, or a Stanford dual- or joint-degree program — then\nyour Stanford home department(s) will fund the remainder of your\neducation to the extent consistent with its standard funding commitment\nfor that program. (That means, for example, five years for some PhDs and\nsix years for others.)", "During each of the first three years of graduate study, Knight-Hennessy Scholars receive:", "a fellowship applied directly to cover tuition (commensurate\nwith standard departmental level of enrollment) and associated fees, and", "a stipend for living and academic expenses (such as room and board,\nbooks, academic supplies, instructional materials, local\ntransportation, and reasonable personal expenses), and", "a travel stipend intended to cover an economy-class ticket for one annual trip to and from Stanford.", "NOTE: Knight-Hennessy Scholars also may apply for supplemental funds to support academic endeavors (e.g. conference travel).", "Leadership Development", "Building on departmental programs, you will learn to communicate,\ncollaborate, and innovate with your fellow Knight-Hennessy Scholars from\nother disciplines. We believe these relationships — breaking down traditional academic silos — will\nbe essential to your ability to discover new solutions that will\nadvance humanity. Tailored workshops and individual coaching and\nfeedback will hone your capacity for collaborative leadership. A clearer\nunderstanding of yourself and others will allow you to influence even\nwhen you lack authority. We also will place particular emphasis on the\nart of storytelling and your ability to find your voice and tell your\nstory. These essential skills form the foundation for your development\nas a leader in your field.", "In addition to the opportunities that you will pursue through the\nKnight-Hennessy Scholars program, you’ll find ample opportunity to build\nleadership skills specific to your discipline. Each of Stanford’s\ngraduate departments offers courses and structured programs designed for\nstudents within its field. The ", "Vice-Provost for Graduate Education", " also offers a comprehensive ", "professional-development framework", " for all Stanford graduate students.", "Mentorship", "Knight-Hennessy Scholars will have the opportunity to spend time with\nestablished leaders in both informal and formal settings. These\nencounters will be available both as intimate conversations exclusively\nwithin your community as well as one-on-one meetings with experts in\nyour areas of interest. The presence of a Fellow in Residence, a\ndistinguished global leader residing on campus, will allow for the\nchance to build meaningful relationships and go in depth in the Fellow’s\narea of expertise.", "Finally, you will also have the opportunity to work with special mentors from the ", "Distinguished Careers Institute", " and meet one-on-one or in small groups with members of our Global Advisory Board, who hail from a diverse range of fields.", "Experiential Learning", "The pace of your graduate studies will be intense. Given the demands\non your time, the Knight-Hennessy Scholars program will provide a\nflexible array of activities — community experiences, group\nworkshops, meetings with leaders in your field, and personal\ndevelopment opportunities comprising the King Global Leadership Program.\nIn small, multidisciplinary teams, you will reflect on your own\nleadership ability and participate in practical group exercises designed\nto challenge you. You will confront real-world problems that require\nreal-world solutions. You will weave these opportunities into your time\nat Stanford. A diverse and supportive community of scholars will inspire\nand encourage you along the way.", "For More Information:", "Visit the Official Webpage of the Knight-Hennessy Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/knight-hennessy-scholars-program-2019-2020-at-stanford-university/"], [["University of Gondar Mastercard Foundation Scholars Program (MCFSP) 2020 for East African Students (Fully Funded)", "date announced:May 17, 2019", "Application Deadline: May 30th 2019"], ["Application Deadline: May 30th 2019", "The Mastercard Foundation Scholars Program (MCFSP) at the University of Gondar ", "awards a total of 160 graduate scholarships in the coming eight years, starting from 2018/19. The scholarship will directly benefit academically talented but disadvantaged youth from five East African countries – Ethiopia, Somalia, Eritrea (refugees in camps located in Ethiopia), Djibouti and South Sudan. The Graduate Scholars Program is designed to help Scholars to acquire transformational and leadership skills and demonstrate high professional and scholarly competencies to effectively influence global, regional, national and local socioeconomic development trends. The Program is technically and financially supported by Mastercard Foundation and will avail excellent academic and nonacademic support to Scholars during their stay at University of Gondar.", "THE ELIGIBLE PROGRAMS ARE:", "Law", "Sociology", "Psychology", "Physiotherapy", "Nursing", "Eligibility Requirements", "\nThis scholarship is open only for International applicants who earn\ntheir Bachelor’s degree in the past 5 years in South Sudan, Somalia,\nDjibouti and Eritrea (Eritrean migrants, in Ethiopia) at the time of\napplication and intend to be a full-time graduate student of\nPHYSIOTHERAPY, NURSING, SOCIOLOGY, PSYCHOLOGY or LAW at the University\nof Gondar. Scholarships will be awarded on the basis of applicants’\ndemonstrated academic ability, leadership potential, socioeconomic need\nand or disability if you are a male.\n", "Benefits:", "\nThe scholarship is comprehensive and covers the costs of tuition,\naccommodation/boarding, stipend and additional program-related expenses\nas well as support on training programs, academic, financial literacy\nand social issues with the aim of developing capable and transformative\nleaders at grassroots and global levels. The scholarship adopts the\napproach of experiential learning and facilitates organizational\nattachments and summer-camps, among others, for scholarship holders.\n", "STUDENT RESOURCES", "The following resources provide more information about the University\nof Gondar, campus facilities, policies and university regulations. If\nyou have any question or cannot find specific information, please\ncontact us (website: ", "www.uogqueensmcf.com", "; email: ", "[email protected]", ").", "FORMS, MANUALS AND ANNUAL SCHEDULE", "Application Package ", "Manuals", "Annual Scholars Program Schedule", "HOUSING AND ACCOMMODATIONS", "Admission policy on housing – please read ", "UoG’s policy for admission to University housing", "Cafeteria and lounges – the University of Gondar has ", "student lounges and cafeterias", "at\neach of its five campuses. Cafeterias are open three times a day to\nprovide meals for students and most lounges are open for 18 hours each\nday to provide meals and beverages for students and staffs.", "Campus Facilities", "The University of Gondar has ", "five campuses", ". The University has a number of facilities including:", "Banking services", " – The Commercial Bank of Ethiopia (CBE) has a full-service branch at the Tewodros campus. ATMs are located at:\n", "The main gate of the University, Maraki (Dashen Bank, United Bank and Commercial Bank of Ethiopia)", "The ", "Atse Tewodros Campus ", "near the Post Office (Commercial Bank)", "The College of Medicine and Health Sciences and Hospital complex (CBE (3) and United Bank (1))", "Library Services", " – the University has ", "nine libraries ", "that\nprovide a wide range of library services, including computer\nlaboratories, digital resources, training and support for students with\ndisabilities.", "Information Communications Technology (ICT) facilities", " – the University provides technology support through a main office at the ", "Atse Tewodros Campus", " and\nthrough offices in all faculties. There are several computer\nlaboratories on campus, and students have access to free internet\nservices through a username and password.", "Guidance and Counseling Services", " – the University provides guidance and counselling services for all students, as well as ", "community support services", ". Contact the ", "Dean of Student Affairs", " for more information.", "Center for Disability Studies", " – the Center for\nDisability Studies sponsors and coordinates research and services for\nstudents with disabilities and is connected to the Center for Community\nBased Rehabilitation.", "Center for Community Based Rehabilitation", " –\nthe Centre for Community-Based Rehabilitation works to support the full\nintegration of people with disabilities into their communities.", "Campus Security", " – Our Campus security team works to keep all staff, faculty and students safe while at the University.", "For More Information:", "Visit the Official Webpage of the University of Gondar Mastercard Foundation Scholars Program (MCFSP) 2020"], "url : https://www.opportunitiesforafricans.com/university-of-gondar-mastercard-foundation-scholars-program-mcfsp-2020/"], [["The TY Danjuma MBA Scholarships 2019/2020 for post-graduate African students", "date announced:May 1, 2019", "Application Deadline: June 30th 2019"], ["Application Deadline: June 30th 2019", " ", "The TY Danjuma MBA Scholarship", " provides financial support to ", " post-graduate African students ", "who have been accepted onto MBA programmes at the top-10 leading Business Schools in the world. The Financial Times MBA Global Ranking for 2019 lists the top ten schools as; Stanford Graduate School of Business, Harvard Business School, INSEAD, University of Pennsylvania: Wharton, Ceibs, London Business School, University of Chicago: Booth, MIT: Sloan, Columbia Business School and University of California at Berkeley: Haas. ", "All successful African MBA applicants to the top ten Business Schools\n(as ranked by the Financial Times) are eligible to receive The TY\nDanjuma MBA Scholarship regardless of domicile. The grant is awarded to\nsuccessful candidates prior to the annual intake for that Business\nSchool. The TY Danjuma MBA Scholarship is intended to provide additional\nfinancial support to help African students bridge some of the financial\nburden attached to taking on MBA programmes, it will not be enough to\nact as the primary source of funding for these programmes.", "Launched in 2011, The TY Danjuma MBA Scholarship aims to help up to\nfive students a year. Since launching, scholarships have been awarded to\n35 students in total attending Harvard Business School, INSEAD, London\nBusiness School, MIT:Sloan, Stanford Graduate School of Business,\nUniversity of California at Berkeley:Haas, University of Chicago Booth,\nIE Business School Madrid, University of Cambridge: Judge Business\nSchool and Wharton University of Pennsylvania. Our scholars have come\nfrom Nigeria, South Africa, Uganda and Zimbabwe, Ghana and Morocco.", "How to apply", "We are now receiving applications for 2019/20 intakes. ", " ", "Eligible students should email ", "[email protected]", " sending the following information between 1 May and 30 June 2019:", "• Full Name", "• Nationality", "• Full contact details", "• Name of Business School where you have been accepted onto their MBA Programme", "• Year of enrolment at the Business School", "• Copy of offer letter from the Business School", "• Copy of your CV", "• Copy of\nyour budget and funding shortfall (include all scholarship and loans\ninformation). Note, the TY Danjuma MBA Scholarship is to help support by\nproviding additional financial aid, it will not be enough to act as the\nprimary source of funding for the MBA.", "Applications received prior to 1 May 2019 or after 30 June 2019 will not be processed.", "For More Information:", "Visit the ", "Official Webpage of the TY Danjuma MBA Scholarship 2019/2020 "], "url : https://www.opportunitiesforafricans.com/the-ty-danjuma-mba-scholarships-2019-2020/"], [["2020 Human Rights Advocates Program (HRAP) at Columbia University (Scholarships Available)", "date announced:May 27, 2019", "Application Deadline: December 16, 2019 at 17:00 EST. "], ["Application Deadline:", " December 16, 2019 at 17:00 EST", ". ", "Founded in 1989,", " ", "the Human Rights Advocates Program (HRAP)", " ", "is a unique and successful model of human rights capacity building. HRAP capitalizes on its affiliation with Columbia University and its location in New York City to provide grassroots leaders the tools, knowledge, access, and networks to strengthen their organizations and promote human rights.", "HRAP’s comprehensive program of advocacy, networking, skills-building, and academic coursework provides advocates the opportunity to hone practical skills, develop a deeper understanding of human rights, and foster mutually beneficial relationships with organizations and individuals in their fields.", "Eligibility Requirements:", "The Program is designed for lawyers, journalists, doctors, teachers,\nsocial workers, community organizers, and other human rights activists\nworking with NGOs on issues including sexual and gender-based violence,\ndomestic violence, minority rights, LGBT rights, labor rights,\nmigration, health, social exclusion, environmental justice, and\ncorporate social accountability.", "Participants are selected on the basis of their previous work\nexperience in human rights, commitment to the human rights field, and\ndemonstrated ability to pursue graduate-level studies. Full-time\nstudents or government officials will not be considered. Applicants\nholding full or part-time jobs pursuing their advocacy efforts are\npreferred.", "Advocates must work at the grassroots level. Applicants from\nhigh-income countries will not be considered except for those\nrepresenting marginalized communities. Fluency in English is required.\nPreference is given to those who have not previously had opportunities\nto travel and study internationally.", "Selection of Participants", "The Program is designed for human rights activists working with NGOs\non issues including sexual and gender-based violence, minority rights,\nLGBT rights, labor rights, migration, health, social exclusion,\nenvironmental justice, disability rights, and corporate social\naccountability.", "Participants are selected on the basis of their previous work experience in human rights, commitment to the human rights field, and demonstrated ability to pursue graduate-level studies. Full-time students or government officials will not be considered. Applicants holding full or part-time jobs pursuing their advocacy efforts are preferred.", "Scholarships", " Only a very limited number of full scholarships will be awarded. Other admitted applicants will be asked to cover expenses such as living and stipend. ", "Application", "Instructions", "Applicants are asked to complete the application in its entirety.\nPlease complete all sections in English. Please follow all instructions,\nincluding those sent to your email address.", "In order to access the application, applicants must ", "register an account", " on the ISHR website and ", "log in", ". Once logged in, applicants can begin a new application by choosing ", "Start/Resume An HRAP Application", " from the menu.", "Upon submission of a completed application, a confirmation will be\nsent to the applicant. Applicants may also login to the online\napplication to view their submitted applications. ", "After beginning an application, the applicant can either choose to\nsave the form as a draft, or submit a completed application. If you\nchoose to save the form as a draft, you can return to this page to\ncomplete it.  Upon submission of a completed application, a confirmation\nwill be sent to the applicant. Applicants may login to the online\napplication to view or edit their submitted applications until the\ndeadline. ", "To edit complete submitted applications, ", "log in", " to the ISHR website and choose Manage HRAP Submission.", "Columbia University aims to make all websites fully accessible to\nusers with disabilities. If you experience difficulty using this page,\nplease contact ", "[email protected]", ".", "If you would rather submit the application by international courier at your own expense, please send a completed copy of this ", "PDF application", "\nand all supporting documentation including the reference letters via\ninternational courier such as FedEx to Columbia University, 1108 IAB, MC\n3365, New York, NY 10027 USA. It is your responsibility to ensure that\nthe application is received by Columbia no later than December 16,\n2019. ", "For More Information:", "Visit the Official Webpage of the 2019/2020 Human Rights Advocates Program"], "url : https://www.opportunitiesforafricans.com/2020-human-rights-advocates-program-hrap-at-columbia-university/"], [["Top 10 Scholarships to attend the 2019 One Young World Summit in London, United Kingdom (Fully Funded)", "date announced:May 1, 2019", " Since 2010, One Young World has worked to guarantee young people from all 196 countries in the world are represented at OYW Summits, regardless of their ability to pay. To ensure this, fully-funded scholarship places are awarded to outstanding young leaders with a range of backgrounds, skill sets and nationalities. "], [" Since 2010, One Young World has worked to guarantee young people from all 196 countries in the world are represented at OYW Summits, regardless of their ability to pay. To ensure this, fully-funded scholarship places are awarded to outstanding young leaders with a range of backgrounds, skill sets and nationalities. ", "Queen’s Commonwealth Trust Scholarships 2019 to attend the One Young World Summit in London, UK (Fully Funded)", " Application Deadline:", "5 May 2019, 5PM BST", "One Young World", "is\ndelighted to offer this scholarship in partnership with the Queen’s\nCommonwealth Trust to connect young leaders driving positive social\nimpact in the Commonwealth with the opportunity to attend One Young\nWorld conference in 2019..\n", "Apply Now for the ", "Queen’s Commonwealth Trust Scholarships 2019", " ", "2.", " Johnson & Johnson One Young World Scholarship Program 2019", " (Fully Funded to the One Young World Summit 2019 in London,UK)", "Application Deadline: ", "6 May 2019", " ", "For the third year running", ", Johnson & Johnson Global Community Impact,", "the team who leads the global partnership for Johnson & Johnson with OYW, is collaborating with OYW to offer ", "scholarships to 12 young health leaders across the globe", " to participate in the 2019 Johnson & Johnson One Young World Program. ", "Apply Now for the ", "Johnson & Johnson One Young World Scholarship Program", " ", "3. ", "Deloitte/One Young World Scholarship 2019", " (Fully Funded to attend the One Young World Summit in London, United Kingdom)", " Application Deadline:", " 10 May 2019", " As a longstanding partner of One Young World, we are proud to support the", " Deloitte One Young World Scholarship 2019,", " which will enable 10 outstanding young leaders to attend the ", "One Young World Summit in London, United Kingdom", " on 22 – 25 October 2019. ", "Apply Now for the Deloitte/One Young World Scholarship 2019", "4. ", "AstraZeneca Young Health Programme Scholarship 2019 to attend the One Young World Summit 2019 in London, United Kingdom (Fully Funded)", " Application Deadline: May 25th 2019 ", "This year, ", "AstraZeneca", " is collaborating with One Young World to offer 18 scholarships to inspiring young leaders to attend the ", "One Young World Summit 2019 in London, United Kingdom", ". The successful scholars will join 7 other YHP youth delegates who are already involved with the programme, as peer educators, advocates, NGO partners or community youth leaders.", " In addition to attending the Summit, YHP scholars will participate in a pre-Summit workshop to meet the delegation, share information about their background and get prepared for what will be an incredible experience in London. ", "Apply Now for the AstraZeneca Young Health Programme Scholarship 2019 ", "5. ", "The Cambridge Consultants’ Code for Good Scholarships", " (Fully Funded to attend the One Young World Summit 2019 in London,UK)", " Application Deadline: ", "3 May 2019", "The Cambridge Consultants’ Scholarship", "\nhas been established to support young people who want to apply\ntechnology to address the United Nations Sustainable Development Goals.\nApplications using data analysis, artificial intelligence, language\nprocessing, novel designs for Human Interaction or similar fields are\nparticularly interesting to us. Your innovation can be wholly software,\nor some large product or service where software is just one of the\nimportant parts.\n", " As well as participating in the ", "One Young World Summit 2019, ", "scholarship recipients will receive remote mentoring, an intensive two week residency at the Cambridge (UK) headquarters and support in developing their innovations. ", "Apply Now for the ", "Cambridge Consultants’ Code for Good Scholarships", " ", "6. ", "Audi Environmental Foundation Scholarships 2019", " to attend the One Young World Summit 2019 in London, United Kingdom (Fully Funded)", " Application Deadline: May 17th 2019 ", " Audi is collaborating with One Young World to offer scholarships to 15 inspiring young leaders to attend this year’s One Young World Summit 2019 in London, United Kingdom. ", " In addition to participating in the One Young World Summit, Audi Scholars will join an exclusive pre-event where they will connect with fellow innovators from the programme as well as experts from the Audi Environmental Foundation.  ", "Apply Now for the ", "Audi Environmental Foundation Scholarships 2019", " ", "7. ", "DSM: Brighter Living Scholarship 2019", " for young Entrepreneurs (Fully Funded to attend the One Young World Summit 2019 in London, United Kingdom)", " Application Deadline: May 15th 2019 ", " As a longstanding partner of ", "One Young World, DSM ", "is proud to support the ", "Brighter Living Scholarship", " in light of the 2019 Summit in London. The purpose is to create brighter lives for people today and generations to come. We connect our unique competencies in Life Sciences and Material Sciences to create solutions that nourish, protect and improve performance. ", " With the ", "Brighter Living Scholarship DSM ", "will offer 3 scholarships to young entrepreneurs in the field of nutrition for the ", "One Young World Conference 2019 in London.", "Apply Now for the ", "DSM: Brighter Living Scholarship 2019", " ", "8. ", "DSM: Resources & Circularity Scholarship ", "(Fully Funded to attend the One Young World Summit 2019 in London, United Kingdom)", " Application Deadline: ", "15 May 2019", " With the Resources & Circularity Scholarship DSM will offer three scholarships to young leaders around the world, who are working to further the transition from a linear to a circular and/or bio-based economy. ", " The scholarship focuses on DSM’s purpose-driven domain, Resources & Circularity. DSM’s ambition is to safeguard the future availability of natural resources, and to unlock more value from the limited resources that are available. ", "Apply Now for the ", "DSM: Resources & Circularity Scholarship", " ", "9. ", "One Young World Politician of the Year 2019", " for emerging Leaders (Funded to the One Young World Summit 2019 in London, United Kingdom)", " Application Deadline: ", "19 May 2019 ", "One Young World’s Politician of the Year 2019", " celebrates the most impressive, impactful, young politicians around the world. Nominate a candidate or apply to win yourself! ", "Apply Now for the ", "One Young World Politician of the Year 2019", " ", "10. ", "Lenovo Smarter Technology for All Scholarship ", "(Fully Funded to the One Young World Summit 2019)", " Application Deadline:", " 20 May 2019", " This year, Lenovo will support one young innovator to participate in the", " One Young World Summit 2019", " held in London from 22 – 25 October. The successful scholar will join 2,000+ fellow young leaders from 190+ countries for four transformative days of speeches, panels, networking, and workshops. The scholarship recipient will also have the opportunity to apply to give a keynote speech, sharing a platform with world leaders with the world’s media in attendance. ", "Apply Now for the ", "Lenovo Smarter Technology for All Scholarship", " ", "For More Information:", "Visit the Official Webpage of the 2019 One Young World Summit Scholarships"], "url : https://www.opportunitiesforafricans.com/top-10-scholarships-to-attend-the-2019-one-young-world-summit-in-london/"], [["Queen Elizabeth Commonwealth Scholarships Scheme 2020 for students in Commonwealth Nations (Fully Funded)", "date announced:May 1, 2019", "Application Deadline: Wednesday 26 June 2019"], ["Application Deadline: ", "Wednesday 26 June", " 2019", "Applications are now open for the second round of", " Queen Elizabeth Commonwealth Scholarships!", "Join more than 35,000 individuals who have benefitted from the life-changing opportunities a Commonwealth Scholarship offers and contribute to the development of the future Commonwealth.", "The following scholarships are on offer in this round:", "2 Climate Resilience scholarships are on offer in Fiji", "These awards are only available for applicants from ", "eligible countries within the Caribbean", "1 scholarship is available in Fiji under the following subject area:", "Physical sciences, engineering and mathematics", "Social sciences", "Arts and humanities", "4 scholarships are on offer in South Africa in the following subject areas:", "Medicine, health and life sciences ", "Physical sciences, engineering and mathematics ", "Social sciences ", "Arts and humanities ", "2 scholarships are on offer in Sri Lanka in the following subject areas:", "Medicine, Health and Life Sciences (UoC)", "Social Sciences (UoSJ)", "1 scholarship is on offer in Papua New Guinea in the following subject areas:", "Medicine, health and life sciences", "Physical sciences, engineering and mathematics", "Social sciences", "Benefits:", "1) A life-changing opportunity for cultural exchange and academic\ncollaboration, studying in unique environments across the globe.", "2) Awards are for two-year Master’s degrees and are not applicable to distance learning courses.", "3) Award allowances include:", "Fully-funded tuition fees", "Living expenses (stipend) for duration of award", "Return economy flight", "One-off arrival allowance", "Research support grant (on request)", "For More Information:", "Visit the Official Webpage of the Queen Elizabeth Commonwealth Scholarships Scheme 2020"], "url : https://www.opportunitiesforafricans.com/queen-elizabeth-commonwealth-scholarships-scheme-2020/"], [["CECIL Renaud Overseas Scholarship 2020 for young South Africans study in the United Kingdom", "date announced:May 2, 2019", "Application Deadline: 31st of October 2019.  "], ["Application Deadline: 31st of October 2019.  ", "Dr Cecil Renaud, a well-known Durban Philanthropist, established The Cecil Renaud Educational and Charitable Trust in 1988. Dr Renaud passed away on 3 June 1993 and bequeathed the residue of his estate to the Trust. Shortly after the Trust became active, the trustees established the Overseas Scholarship.", "The Overseas Scholarship,", " granted annually to one or two students, is awarded for a maximum of two years for post-graduate study (Masters degree (or equivalent) or PhD) in the United Kingdom at a university of the student’s choice.", "Since 1994, we have awarded 28 scholarships to the best and brightest young South Africans. In past years students who have been awarded the Scholarship have attended, inter alia, the University of Cambridge, the University of Oxford and the University of London across a wide range of disciplines. This Scholarship is available only to students who completed their secondary schooling at any school in KwaZulu-Natal, and you must be in your final year of a postgraduate honours degree, or four year undergraduate degree.", "CRITERIA", "ACADEMIC EXCELLENCE", "Applicants should have attained, or aim to achieve, undergraduate or Honours degree(s) cum laude or summa cum laude; and additionally, have achieved Dean’s Commendations and Certificates of Merit or equivalent. ", "Will leave big footprints", "We’re looking for candidates who will have a significant impact on their field of study, and the world.", "attended Secondary school in kzn", "Applicants must have completed a major part of their secondary schooling in KwaZulu-Natal, and be under the age of 27 at the time of applying for the scholarship.", "STudying at a south african university", "The scholarship is open to postgraduate students who have completed or are currently studying towards an Honours degree; or a four year undergraduate degree.", "Evidence of focus, commitment, stamina and leadership", "A good track record in extracurricular activities and a drive to succeed and uplift South Africa.", "Any field of study", "Former scholars have read towards varied fields including an MPhil in Development Studies, an MA in Applied Theology, an MSc in Mathematics and an MA in Singing.", "Applications for the ", "2020 Cecil Renaud Overseas Scholarship", " close on the 31st of October 2019. ", "Application forms can be downloaded ", "here", "For More Information:", "Visit the Official Webpage of the CECIL Renaud Overseas Scholarships 2020 "], "url : https://www.opportunitiesforafricans.com/cecil-renaud-overseas-scholarship-2020/"], [["CHANEL One Young World Scholarships 2019 (Fully Funded to the One Young World Summit 2019 in London)", "date announced:May 2, 2019", "Application Deadline: May 15th 2019"], ["Application Deadline: May 15th 2019", "CHANEL is one of the world’s most iconic and influential brands in\ncreating, developing, manufacturing and distributing luxury products. If\nCHANEL is first and foremost about creation, CHANEL is also about being\na human-driven company committed to creating long-term value for the\nbrand and for society. As an iconic brand, our influence far exceeds our\nbusiness activities. Working within the industry and beyond, we want to\nuse this influence to define and promote a more ambitious way to\naddress and manage sustainability and social challenges.", "CHANEL\naims to develop impactful and socially transformative actions through\ndifferent kinds of initiatives involving its best ambassadors: its\npeople. In 2019, CHANEL will participate in the One Young World Summit\nwith a delegation of 25 of its internal young leaders. CHANEL will also\noffer scholarships to 15 external delegates who are setting the example\nto make their communities, countries and organisations more sustainable\nand socially responsible. The Chanel – One Young World Scholarship will\nidentify and support 15 exemplary change makers to participate in the\nOne Young World Summit 2019 in London.", "This scholarship is\nparticularly intended for young leaders at the forefront of\norganisations and movements that make an impact in at least one of the\nfollowing areas:", "Climate Change", "Sustainable Retail", "Social entrepreneurship with handcraft & savoir-faire", "Human rights", "Advancing the role of women in society", "Eligibility Criteria", "Candidates must be:", "Aged 18-30.", "Nationals of all countries will be eligible to apply for this scholarship.", "Please\nnote that you will be unable to save your responses in the submission\nform. With this in mind, we recommend saving your responses first in an\noffline document before submitting your application.   ", "Benefits", "Access to the ", "One Young World Summit 2019 London", "Hotel accommodation on a shared basis between 22 and 25 (inclusive) October, 2019", "The cost of travel to and from London (flights in economy)", "­Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Selection Criteria", "Evidenced commitment to delivering positive change", "Demonstrated capacity for leadership", "Understanding of key local and/or global issues", "Track record of generating impactful and innovative ideas", "One Young World will actively seek and prioritise applicants who demonstrate impact in the areas of:", "Climate Change", "Sustainable Retail", "Social entrepreneurship with handcraft & savoir-faire", "Human rights", "Advancing the role of women in Society", "For More Information:", "Visit the Official Webpage of the CHANEL One Young World Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/chanel-one-young-world-scholarships-2019/"], [["BP Advancing Energy Scholarship: One Young World 2019 (Fully Funded to the One Young World Summit 2019 in London)", "date announced:April 30, 2019", "While the world demands more energy to fuel its rapid growth and lift\npeople out of poverty, it also demands fewer emissions and a path to a\nlow carbon future."], ["While the world demands more energy to fuel its rapid growth and lift\npeople out of poverty, it also demands fewer emissions and a path to a\nlow carbon future.", "The UN’s Sustainable Development Goals\nrecognise the need for sustainable energy for all. Supporting the\nambitions of the Paris Agreement, BP is determined to address the dual\nenergy challenge: more energy with fewer greenhouse gas emissions.", "Reflecting\nthe UN’s Sustainable Development Goal 7, the BP Advancing Energy\nscholarship funds 30 scholars from around the world to participate in\nthe One Young World Summit 2019.", "This scholarship is for young\nleaders who are focused on advancing the energy transition, creating low\ncarbon businesses, and mitigating the impact of climate change.", "The scholarship seeks candidates who:", "Create new low-carbon energy and business solutions", "Work to improve current renewable technologies such as solar, wind, and biofuels", "Increase access to, and the affordability of, renewable energy for developing countries", "Eligibility Criteria", "Candidates must be:", "Aged 18 – 30*", "Not be employed by the BP Group of companies", "Nationals of all countries will be eligible to apply for this scholarship", "Assessment Criteria", "BP will select 30\nscholars from a shortlist of candidates provided by One Young World.\nCandidates are assessed on the following: ", "Evidenced commitment to delivering positive change", "Demonstrated capacity for leadership", "Understanding of key local and/or global issues", "Track record of generating impactful and innovative solutions", "One Young World will actively seek and prioritise applicants who are making an impact in at least one of the following areas:", "Development of renewable energy solutions", "Accessibility of renewable energy solutions", "Climate change adaption", "Environmental protection", "Benefits:", "Access to the ", "One Young World Summit 2019 in London", "Advancing Energy Workshop with BP delegates on 22 October", "Hotel accommodation on a shared basis between 21 and 25 (inclusive) October 2019", "Travel to and from London (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Discretionary funds to cover reasonable out of pocket expenses connected with getting to and from the Summit (these can be claimed by scholars after the Summit)", "For More Information:", "Visit the Official Webpage of the BP Advancing Energy Scholarship: One Young World 2019"], "url : https://www.opportunitiesforafricans.com/bp-advancing-energy-scholarship-one-young-world-2019/"], [["ACU Routledge/Round Table Commonwealth Studentships Program 2019", "date announced:May 23, 2019", "Application Deadline: Sunday 30 June "], ["Application Deadline: ", "Sunday 30 June", " ", "Funded by ", "The Round Table: The Commonwealth Journal of International Affairs", " ", " and the journal’s publisher, Routledge, in association with the ACU, these two new PhD studentships provide support for research projects on Commonwealth related themes.", "Two studentships are available each year for study in the UK, one for\nUK-registered students (to the value of £4,000), and one for\nCommonwealth students in other countries to undertake a short study\nplacement in the UK (to the value of £8,000).", "Proposed research must either:", "relate to the Commonwealth as a whole or to any Commonwealth-wide institution or organisation, or", "have a strong Commonwealth comparative aspect, or", "be of relevance to a Commonwealth country other than the UK.", "For example, a research project comparing LGBT rights in South Africa\nand Uganda would be eligible, as would a project on the reform of\ncolonial-era anti-LGBT legislation in India, but a project on the role\nof Stonewall in advocating for LGBT rights in the UK would not.", "Applications are welcomed from a broad range of disciplines in the\nhumanities and social sciences, but preference may be given to\ndisciplines usually covered by the Round Table journal, including (but\nnot exclusively) politics, international relations, economics,\ninternational history, geography, law, development studies, and area\nstudies.", "Eligibility", "The first studentship is open to registered PhD students from UK\nuniversities, who are resident in the UK at the time of applying for the\naward, although not necessarily UK citizens.", "The second is open to registered PhD students from ACU member\nuniversities anywhere in the Commonwealth, and to Chevening and\nCommonwealth Scholarship alumni who are PhD students at any Commonwealth\nuniversity outside the UK, who wish to travel to a UK university for\ntheir period of research, before returning to complete their PhD at\ntheir home university.", "Chevening alumni would need to wait at least two years after the end\nof their Chevening award before applying for a Routledge/Round Table\nCommonwealth Studentship, in order to satisfy the criteria for the\nChevening award.", "Research should fall within the broad range of humanities and social sciences disciplines.", "Requirements", "Applications should be submitted by the deadline, midnight on ", "Sunday 30 June", " via the ", "online application form", ".", "Applications should consist of:", "Your CV", "A studentship plan, outlining:", "The work you plan to carry out during the studentship, in non-technical language", "The likely impact of your studentship work, and how it will advance\nknowledge in your field and contribute to greater understanding of the\nCommonwealth", "The planned outcomes and outputs of the studentship", "Letters of support from referees, one academic (preferably your PhD/DPhil supervisor) and one personal", "An outline of the intended use of the funds", "Applicants from outside the UK will also need to provide a letter\nfrom a UK university willing to provide academic mentoring support. It\nwill be the responsibility of the successful applicants to arrange\nflights, accommodation, and visas.", "The note outlining the intended use of the funds should include such\ninformation as: the intended period of study; the specific topic of the\nproposed research; explanation of why the applicant is hoping to\nundertake this research; what Commonwealth value the findings might\nhave; and what the applicant intends to do after obtaining a doctorate.", "Applicants from outside the UK will also need to provide a letter\nfrom a UK university willing to provide academic mentoring support. It\nwill be the responsibility of the successful applicants to arrange\nflights, accommodation, and visas.", "Funding", "The first studentship for UK-registered student has a value of £4,000.", "The second studentship for Commonwealth students to travel to the UK has a value of £8,000.", "How to apply", "To apply, please complete the ", "online application form", ".", "For further information or clarification, ", "email Alex May", ".", "Timeline", "Applications open: ", "Wednesday 15 May 2019", "Deadline for applications: Midnight on ", "Sunday 30 June 2019", "Judging period: July and August", "Announcement of winners: ", "Early September 2019", "Take-up of awards: ", "1 November 2019 to July 2020", ",\nalthough there may be exceptions in the case of Chevening Scholars doing\ngraduate work who are unable to return to the UK for two years after\ncompletion of their scholarship.", "For More Information:", "Visit the Official Webpage of the ACU Routledge/Round Table Commonwealth Studentships Program"], "url : https://www.opportunitiesforafricans.com/acu-routledge-round-table-commonwealth-studentships-program-2019/"], [["Pan African (African Union) University 2019/2020 (Masters & PhD) Scholarships for Africans (Fully Funded)", "date announced:May 14, 2019", "Application Deadline: June 27th 2019"], ["Application Deadline: June 27th 2019", " The Pan African University", " is an initiative of the Heads of State and Government of the African Union. It is a Premier continental university network whose mission is to provide quality postgraduate education geared towards the achievement of a prosperous, integrated and peaceful Africa.", "Young, qualified, talented and enterprising applicants from African\ncountries and the African Diaspora are invited to apply to join Masters\nor PhD degree programmes at any of the following four PAU institutes:", "Pan African University Institute for Basic Sciences, Technology and\nInnovation (PAUSTI), at Jomo Kenyatta University of Agriculture and\nTechnology (JKUAT), Kenya.", "Pan African University Institute for Life and Earth Sciences-\nincluding Health and Agriculture (PAULESI), at the University of Ibadan\n(UI), Nigeria.", "Pan African University Institute for Governance, Humanities and\nSocial Sciences (PAUGHSS), at the University of Yaounde II and the\nUniversity of Buea, Cameroon.", "Pan African University Institute for Water and Energy Scien", " Admission Requirements for Masters Programmes", " * Candidates must satisfy the following conditions: ", "1.Undergraduate degree from a recognized university,with at least a second class upper division or its equivalent, in a relevant field;", " 2.Certified copies of relevant certificates, transcripts (from university and high school), ", "3.National passport (personal details page); ", "4.Clear colored passport size photograph(2cmx2cm); ", "5.Detailed CV;", " 6.Recommendation letters from 2 Professors ", "7.A letter of motivation justifying why you want to pursue your study in the Pan African University;", "8.Maximum age of 30 years for male and 35 years for female applicants. ", " *Candidates may be required to undergo a written/oral examination after pre- selection.", "*Candidates for the Master in Conference Interpreting and Translation programmes are required to have excellent knowledge of at least two of the African Union’s official languages (Arabic, English, French and Portuguese).", " Admission Requirements for Doctoral Programmes ", "Candidates must satisfy the following conditions:", " 1.A Masters degree in a relevant field from PAU or any internationally recognized university; ", "2.Certified copies of relevant certificates, transcripts, ", " 3.Copy of Passport (personal details page);", " 4.A 3 to 4 page research concept note (tentaive title, research questions, objectives, significance of the research etc…)", "5.Recommendation letters from 2 Professors ", "6.Clear colored passport size photograph (2cmx2cm); ", "7.Detailed CV ", "8.A letter of motivation justifying why you want to pursue your study in the Pan African University;", "9.Maximum age of 35 years for male and 40 years for female applicants. ", " Reasons to join PAU ", "1.Excellent programmes taught by world class faculty;", "2.A broad network of academic and professional partners on the continent and beyond;", "3.Attractive scholarship scheme;", "4.Joint degree awards from the Pan African University and its Host Universities;", "5.Excellent career prospects in some of the fastest growing industries, with relevant career guidance; and ", "6.Vibrant, multi-cultural and Pan African learning and research environments.", "Application ProcedureApplications should be completed online at ", "www.au-pau.org", "The call for applications is open from May 14, 2019 to June 27, 2019.Applications received after this deadline will not be considered.Further enquiries can be made through: ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the Pan African (African Union) University 2019/2020 (Masters & PhD) Scholarships"], "url : https://www.opportunitiesforafricans.com/pan-african-african-union-university-2019-2020-masters-phd-scholarships/"], [["World Bank/Moi University Masters (MSc) & Doctorate (PhD) Scholarships 2019/2020 for young Africans", "date announced:May 6, 2019", "Application Deadline: May 20th 2019"], ["Application Deadline: May 20th 2019", " Moi University is a Public University located in Eldoret, Kenya. The University offers world class training both at undergraduate and postgraduate levels. As a result of successful application for World Bank funding during the Africa Center of Excellence II bidding by Eastern and Southern African States, the University is hosting the African Center of Excellence in Phytochemicals,Textile and Renewable Energy, ACEII-PTRE. ", " The Center is, therefore, offering limited postgraduate scholarships for Masters (MSc) and Doctorate (PhD) to highly deserving students on a competitive basis. The Center’s scholarships will be offered to both national and regional students in the following fields: ", "Analytical Chemistry (MSc and Ph.D),Materials & Textile Engineering (Ph.D), Industrial Engineering (MSc), ", "Textile Engineering (MSc), and Renewable Energy (Msc and Ph.D). Doctorate (Ph.D) scholarships will be awarded for a maximum of three years (36 months) while Masters (MSc) scholarships will be awarded for a maximum of two years (24 months).", "Only shortlisted candidates as per the following criteria will be considered:", "A minimum of Second Class Honours Upper Division or its equivalent in a Bachelor’s degree related to the field one is interested in. In case of PhD application, Master’s degree in a related field is a requirement.", "The candidate must meet minimum requirement for admission into Masters and PhD programmes as stipulated by Moi University Senate.All interested candidates must have a research conceptpaper in the intended area of study. ", "Demonstration that one cannot afford to pay for his or her postgraduate programme will be a requirement.", "Proof of admission into the above stated programmes will be an added advantage ", " he following candidates are highly encouraged to apply for the scholarship: female, regional, disadvantaged, marginalized groups and candidates with disabilities.The programmes are scheduled to start in September 2019. ", " Eligible candidates interested in these programmes are invited to apply. Allinterested candidates can apply by filling in a scholarship form that can be downloaded from the Moi University website (using the links below) or can be obtained directly from the Center. ", "The duly filled application form should be emailed so as to reach the Center not later than 20th May,2019. ", "All applications should be filled and sent by email to the following address:-The Center LeaderAfrica Center of Excellence II in Phyto chemicals, Textile and Renewable Energy (ACEII-PTRE)Moi UniversityP.O. Box 3900-30100Eldoret, Kenya.Email Address: ", "[email protected]", " ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the World Bank/Moi University Masters (MSc) & Doctorate (PhD) Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/world-bank-moi-university-masters-msc-doctorate-phd-scholarships-2019-2020/"], [["NIIT NIGERIA 20th NATIONAL IT SCHOLARSHIP 2019 for Young Nigerians.", "date announced:May 15, 2019", "Application Deadline: 12th July, 2019 "], ["Application Deadline: 12th July, 2019 ", " For the first time ", "NIIT", " is launching futuristic cutting-edge Digital Transformation Programs aligned with Industry 4.0 like Power Business Intelligence (BI), Python, Internet of Thing (IoT), Block Chain, Artificial Intelligence (AI), Machine Learning with R, DIGINXT-MMS Software Engineering: Full Stack Developer (Python, REST, Angular JS, REACT), Data Analytics (Machine Learning using R & Python, Artificial Intelligence, Business Intelligence), Digital Marketing (SEO, SEM, Mobile & Email Marketing, ORM), Big Data, Java Enterprise Apps with Dev Ops, in Nigeria. ", "The 20th\nNIIT NIGERIA NATIONAL SCHOLARSHIP is being announced to provide\nScholarship assistance to deserving and meritorious students across\nvarious disciplines – School Leavers, Under Graduates, Graduates\n[Unemployed, Under-Employed], Individuals desirous of enhancing their\ntechnical skill-sets and students in general who aspire to know about\nI.T. and career in I.T. The offer is to enable them realize their dream\nof a successful career in the field of Information Technology and\nrelated Industries.", "For the\nfirst time on the occasion of 20th Scholarship NIIT is offering 100 %\nFree scholarship to 20 Digital Star of Nigeria. This year Scholarship\ntest is scheduled to be held on 13th July 2019. Hurry up ! last to apply\nfor Scholarship is 12th July 2019.", "For More Information:", "Visit the Official Webpage of the NIIT NIGERIA 20th NATIONAL IT SCHOLARSHIP 2019"], "url : https://www.opportunitiesforafricans.com/niit-nigeria-20th-national-it-scholarship-2019/"], [["Forum for African Women Educationalists (FAWE) Mastercard Foundation Scholarship Program 2019/2020 – Uganda.", "date announced:May 15, 2019", "Application Deadline: June 14th 2019"], ["Application Deadline: June 14th 2019", "The Forum for African Women Educationalists Regional Secretariat (FAWE RS)", " ", "with support from the Mastercard Foundation, is implementing through FAWE Uganda Chapter an eight-year (2016—2024) Higher Education Access Program targeting 300 youth (70% female and 30% male) from economically disadvantaged backgrounds and regions of Eastern, Northern and Western Uganda. The overall goal of the program is to enable a total of 300 young women and men from the disadvantaged regions of Uganda to access, transition through higher education and secure employment in sectors that contribute to the development of their home communities.", "This will be achieved through two (2) specific student-focused objectives:", "1)To\nprovide bursaries to 300 bright students from economically\ndisadvantaged backgrounds in Eastern, Northern and Western Uganda to\naccess and complete higher education; and,", "2)To\nprovide academic and psycho-social support and facilitate pathways for\nthe students to internships, industrial practice and employment.", "The program is being implemented in partnership with particular institutions: ", "Busitema University; Mbarara University of Science and Technology; Gulu University; Jinja School of Nursing and Midwifery; and, Medical Laboratory Technology Training School, Jinja", " with 60% of slots dedicated towards degree courses and 40% towards diploma courses.", "Eligibility Criteria", " ", "The applicant must be aged between 18 and 25 years; ", "The applicant must have sat his/her advanced level (S.6) examinations in 2018; ", "The applicant must be applying for direct entry into the partner institutions of learning for the academic year 2019/2020; ", "The applicant must have been born in and be a resident of any of the 13 programme districts of ", "Bukwo, Buyende, Katakwi, Mayuge, Buliisa, Bundibugyo, Kanungu, Ntoroko, Adjumani, Amudat, Amuru, Kaabong and Pader.", " ", "The applicant must have attended Ordinary or Advanced Level Education in any of the 13 programme districts; ", "Applicants\nwho sat their Advanced Level Education (S6) examinations in schools\noutside their districts of birth but within the specific regions of\nEastern, Northern and Western Uganda qualify to apply for the bursaries; ", "The\napplicant must be qualified for admission into the following programme\nareas of study: Agricultural Sciences, Medical and Health Sciences and\nEducation courses (Science and Literature, degree only); ", "The applicant must not be a current beneficiary of any other bursary scheme or scholarship; ", "Other\nvulnerability aspects to be considered include: young people living\nwith disability, HIV/AIDS– infected or affected, orphaned (total or\npartial). ", "The Applicant must be willing to give back to his/her community through development services.", " ", "Note: Female applicants from the 13 districts are highly encouraged to apply", "How to apply", " ", "Application forms will be available at NO cost at the offices of the Academic Registrars of the partner institutions of Mbarara University of Science and Technology, Gulu University, Busitema University, Jinja School of Nursing and Midwifery and Medical Laboratory Training School in Jinja. ", "Application forms can also be found at the District Education Offices in the 13 Program districts above and FAWE Uganda Office plot 328, Bukoto – Kisasi Road, P.O. Box 24117 Kampala, Uganda or downloaded from the website through the link below: www.faweuganda.org. ", "Submit a fully filled-in application form to the office of the District Education Officer (DEO), any of the partner institutions or to FAWE Uganda Office. ", "The deadline for applications is ", "14", "th", " ", "June 2019", ", after which no applications will be accepted. ", "Please note that;", "i.Application forms are free of charge and ", "NO", " fees/ facilitation or intermediaries required at any stage of the selection process.", "ii.Inaccurate\ninformation or misinterpretation of any part of the application,\nfalsification or incomplete application and any attempt to influence the\nprocess will lead to automatic disqualification or recommendation for\ndismissal from the program.", "iii.All\ndocuments submitted will be subjected to thorough verification\nincluding home visits of successful applicants before final approval and\naward.", "iv.Only\nshortlisted applicants will be notified at every stage of the selection\nprocess which will be conducted by a team of independent Regional\nTechnical Bursary Committees (RBTCs) supervised by FAWE Uganda.", "v.Applicants must provide evidence of Admission for direct entry to the partner’s institutions of; Busitema\nUniversity; Mbarara University of Science and Technology; Gulu\nUniversity; Jinja School of Nursing and Midwifery; and, Medical\nLaboratory Technology Training School, Jinja for Academic year\n2019/2020.", "For further enquiry and assistance, please do not hesitate to contact the Programme Officer 0772545021/0753545021", "HEAP Application Form 2019", "[HEAP Application Form 2019]", "706 Kb", "For More Information:", "Visit the Official Webpage of the FAWE Mastercard Foundation Scholarship Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/forum-for-african-women-educationalists-fawe-mastercard-foundation-scholarship-program-2019-2020/"], [["AfDB Japan Africa Dream Scholarship (JADS) Program 2020 for young Africans to study in Japan (Fully Funded)", "date announced:May 9, 2019", "Application Deadline: August 31, 2019 "], ["Application Deadline: ", "August 31, 2019 ", " ", "The Japan Africa Scholarship (JADS) Program", " ", "– capacity building in energy sector through skills development for sustainable development– is a joint initiative by the AfDB and Japan that aims at providing two-year scholarship awards to highly achieving African graduate students to enable them to undergo post-graduate studies (i.e. a two-year Master’s degree program) in priority development areas on the continent and abroad (including in Japan). This JADS program is funded by the Government of Japan. ", "The overarching goal that the AfDB and the Government of Japan seeks to attain is to enhance skills and human resources development in Africa in a number of priority areas pertaining to science and technology with a special focus on the energy sector. JADS’s objectives are aligned with the Bank’s High 5 agenda (i.e. Light up and power Africa, Feed Africa, Industrialize Africa, Integrate Africa and Improve the quality of life for the people of Africa) and key Japanese development assistance initiatives to Africa and the ", "6", "th", " Tokyo International Conference for African Development (TICAD VI) outcomes. ", "The JADS Program", " is open to applicants from AfDB\nmember countries with relevant professional experience and a history of\nsupporting their countries’ development efforts who are applying to a\ngraduate degree program in energy development and related discipline.\n The program does not provide scholarships to any other graduate degree\nprogram.", "The scholarship program provides tuition, a monthly living stipend, round-trip airfare, health insurance, and travel allowance.", "Upon completion of their studies, the beneficiary scholars are expected to return to their home countries to apply and disseminate their newly acquired knowledge and skills, and contribute to the promotion of sustainable development of their countries.", "Eligibility Requirements:", "Broadly speaking, nationals of African countries must:", "Be a national of a AfDB member country;", "Be in good health;", "Hold\na Bachelor (or equivalent) degree in the energy area (or related field)\nearned at least 1 years prior to the application deadline date;", "Have 1 years or more of recent development-related experience after earning a Bachelor (or equivalent) degree;", "Be\naccepted unconditionally to enroll in the upcoming academic year in at\nleast one of the JADS partner universities for a Master’s degree;", "Applicants living or working in a country other than his or her home country are not eligible for scholarships. ", "JADS does not support applicants who are already enrolled in graduate degree programs. ", "Not\nbe an Executive Director, his/her alternate, and/or staff of all types\nof appointments of the African Development Bank Group or a close\nrelative of the aforementioned by blood or adoption with the term “close\nrelative” defined as: Mother, Father, Sister, Half-sister, Brother,\nHalf-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew.", "*Please note: All eligibility criteria are strictly adhered to. No exceptions are made. Eligibility criteria ", "will not", " change during an open call for applications. However, this information is subject to change between the close of one application process and the opening of the next.", "Benefits:", "The JADS Scholarship", " provides the recipient with the following benefits:", "Economy class air travel between your home country and the host university at the start of the study program and immediately following the end of the scholarship period. ", "Tuition for a graduate program and the cost of basic medical insurance usually obtained through the university.", "A monthly subsistence allowance to cover living expenses, including books. ", "Application Procedure:", "1.  Applicant completes JADS ", "application form", " ", "2. \nApplicant sends documents (application form, university transcripts and\ncertificate, CV, professional references and research proposal), to the\nJADS Secretariat for first screening through ", "[email protected]", " ", "3.  JADS Secretariat sends shortlist of candidates to selected Japanese universities ", "4.  Universities does second screening and share selected students with JADS Secretariat ", "5.  JADS Secretariat recommends awardees based on its selection criteria to the Japanese Executive Director for approval. ", "6.  AfDB contacts selected awardees, and informs partner universities.", "For More Information:", "Visit the Official Webpage of the Japan Africa Dream Scholarship (JADS) Program 2020 "], "url : https://www.opportunitiesforafricans.com/afdb-japan-africa-dream-scholarship-jads-program-2020-for-young-africans-to-study-in-japan-fully-funded/"], [["Investec Bursary Programme 2020 for Young South Africans.", "date announced:May 2, 2019", "Application Deadline: 30 September 2019. "], ["Application Deadline: 30 September 2019. ", "Investec, ", "in partnership with StudyTrust, provides the funding necessary to see young South Africans with academic potential get to university. With our assistance, they are able to study towards financial sector related degrees at various local universities.", "Requirements", " Applications are open to: All young SA citizens with academic potential who are in need of financial assistance.", " Pupils holding or working towards a matric exemption with a minimum of 70% in English and Mathematics (not Maths Literacy) and a 60% pass rate in all other subjects. ", "Benefits", " Investec offers a full bursary per year towards study-related expenses. Terms and Conditions apply. ", " .  ", "Selection Criteria", "\nBursary selection is based on financial need, academic potential and study programmes. Bursaries are available for:\n", "Full-time students at Further Education and Training (FET) and Agricultural Colleges", "University of Technology and University students studying full-time, with a pass symbol in all subjects, studying towards careers in demand by the labour market", "Applicants for tertiary bursaries must specify: exact name of study programme, type and name of the educational institution and the year of study. Please differentiate clearly between “University of Technology” and “University”. Study programme changes, after submitting your application forms, may lead to the cancellation of a bursary.", "How To Apply", "Complete your bursary applications online between ", "1 April 2019 and 30 September 2019.", "Please carefully follow our instructions below. We do not consider incomplete bursary applications.", "Our ", "online application form", " (preferred) is accessed by clicking on the link below. An application form can be requested from StudyTrust here.", "Please do not use previous year’s bursary application forms for applications for 2020 bursaries.", "Document Checklist", "Documents to accompany ", "your bursary application (where applicable)", " South African ID.", "2. Grade 11 final results.", "3. This year’s June results (or your latest results if you are not studying this year).", "4. Official Matric/ NSC results if you have completed Grade 12.", "5. Tertiary students: June results or progress report of all subjects (if no examinations were written).", "6. A Testimonial by a responsible Educational Official from your Teacher or Lecturer.", "7. Pay slips for your parent(s) if employed.", "8. Latest financial statements if your parent(s) is/are self-employed.", "9. Sworn affidavits if your parent(s) is/are unemployed.", "10. Death certificates if your parent(s) is/are deceased.", "11. Divorce certificate if your parents are divorced.", "12. Sworn statement from one parent if your parents are separated/have no contact.", "13. A copy of your CV.", "For More Information:", "Visit the Official Webpage of the Investec Bursary Programmes 2020"], "url : https://www.opportunitiesforafricans.com/investec-bursary-programme-2020-for-young-south-africans/"], [["FINCAD Women in Finance Scholarship Program 2019 (US$10,000 for graduate-level studies)", "date announced:May 15, 2019", "Application Deadline: June 30th 2019"], ["Application Deadline: June 30th 2019", "The field of finance is changing rapidly, largely in response to regulations designed to protect market practitioners and to prevent financial crises. ", "FINCAD ", "has long believed that deep market knowledge, transparency and trustworthiness play a critical role in making financial markets safe for all participants.", "In addition, FINCAD is keenly aware that the majority of\npractitioners in the capital markets industry are men, and that the\ntrend to include more women in the industry is not as rapid as it should\nbe.", "For these reasons, FINCAD established our annual Women in Finance\nScholarship. The goal is to encourage and support outstanding women in\nthe field of finance, particularly those pursuing careers in financial\nasset management, market risk management and derivatives finance within\nthe capital markets. ", "The FINCAD Women in Finance Scholarship is an award of US$20,000 to support graduate-level studies.", "The scholarship is open to women of any age and citizenship who are studying Finance in an accredited graduate-level program.", "Application Procedure:", "APPLICATIONS ARE NOW OPEN. ", "APPLICATIONS WILL CLOSE ON JUNE 30, 2019", "The winner will be notified on or before August 15, 2019.", "APPLICANTS SHOULD NOT ATTEMPT TO CONTACT US WITH ANY QUESTIONS ABOUT THE SCHOLARSHIP", ". All the information you require to apply is included on this page and on the application form. Please keep this page opened for your reference as you are completing the application form.", "We will send all applicants an email publically announcing the scholarship winner once she has been named. This will likely occur in autumn 2019.", "DOCUMENTATION REQUIREMENTS", "You will be required to attach a number of documents in\nthe prescribed file format (jpg, pdf or gif) with the prescribed naming\nconvention (Note: Maximum file size is 20 MB). These include: ", "Your resume or CV", "Two letters of reference for the scholarship from appropriate\nindividuals  (e.g., professors or other relevant university staff, work\nsupervisors and colleagues)", "University transcript(s) from undergraduate program(s)", "Confirmation of acceptance or enrollment in the post-graduate program for the 2019-2020 academic year", "Any authored papers (optional)", "FILE NAMING CONVENTION:  ", "{family name}{given name}{document name}.", "{file extension}", "Document Name(s)", "CV", "Letter1, Letter2", "Transcript1, Transcript2", "Enroll", "Paper", "eg.", "smithsarahCV.pdf", ", ", "smithsarahLetter1.pdf", ", etc.", "For More Information:", "Visit the Official Webpage of the FINCAD Women in Finance Scholarship Program 2019 "], "url : https://www.opportunitiesforafricans.com/fincad-women-in-finance-scholarship-program-2019/"], [["Earn your Online Master Degree with the University of South Wales", "date announced:May 29, 2019", " The University of South Wales, a major player in UK higher education, and UNICAF are offering scholarships up to 60% to study online for your Master’s degree. "], [" The University of South Wales, a major player in UK higher education, and UNICAF are offering ", "scholarships up to 60%", " to study online for your Master’s degree. ", "Eligible countries for the scholarships: ", "Botswana, Ghana, Kenya, Nigeria, South Africa, Rwanda, Uganda, Zambia and Zimbabwe. ", "Answer a few questions to find out if either one of these programmes suits you! ", "MSc in Public Health", "Would you like to deal with Public Health issues? Find out if this programme could be for you! ", "Take the quiz", ". ", "MA in Education", "Want to become a teacher or improve your teaching skills? ", "Take this quiz", " to find out if this programme could be for you!", "Master in Business Administration", "Boost your career and salary with an MBA degree. ", "Take this quiz", " to find out if this programme could be for you!", "For More Information:", "Visit the Official Webpage of the University of South Wales Online Masters Program"], "url : https://www.opportunitiesforafricans.com/earn-your-online-master-degree-with-the-university-of-south-wales/"], [["Ian Perry Scholarship Prize 2019 for young Photo Journalists ($USD 3,500 Prize)", "date announced:May 9, 2019", "Application Deadline: July 5th 2019"], ["Application Deadline: July 5th 2019", "Ian Parry", " was a photojournalist who died while on assignment for The Sunday Times during the Romanian revolution in 1989. He was just 24 years of age. Aidan Sullivan, then picture editor, and Ian’s friends and family created the Ian Parry Scholarship in order to build something positive from such a tragic death. Each year we hold an international photographic competition for young photographers who are either attending a full-time photographic course or are under 24.", "This year’s Ian Parry Scholarship is divided into two categories: ", "The Sunday Times Award for Achievement ", "and ", "The Canon Award for Potential", ".", "The entry criteria for both is the same and the judges will make their decisions based on the individual merits of the entries. Entrants must submit a portfolio and a clear proposal of a project they would undertake if they won the scholarship.", "Benefits include:", "Each winner will receive $3,500", " towards their chosen project.", "Canon Europe ", "continues to support the Scholarship and loans equipment to the winners.", "Attend a ", "portfolio review", " day with leading industry experts in London.", "Mentorship ", "Programme", ", we offer a\nyear-long personal Mentorship to the winner of The Canon Award for\nPotential. The 2019 mentor is former Ian Parry Award recipient and\nhighly respected Magnum photographer ", "Jonas Bendiksen", ".", "The winner of The Canon Award for Potential will have the opportunity to take part in the ", "Transmissions Programme", " at", " Visa Pour L’Image", " in Perpignan.", "World Press Photo", ", automatically accepts the winner\nof the Achievement Award into its final list of nominees for the Joop\nSwart Masterclass in Amsterdam.", "Your work will appear in ", "The Sunday Times", " Magazine", ", our media sponsor.", "For More Information:", "Visit the Official Webpage of the Ian Perry Scholarship Prize 2019"], "url : https://www.opportunitiesforafricans.com/ian-perry-scholarship-prize-2019/"], [["DAAD 2020 In-Region Scholarships Programme in South Africa", "date announced:May 6, 2019", "Application Deadline: May 17th 2019"], ["Application Deadline: May 17th 2019", "The DAAD awards ", "funding to Sub-Saharan African students for Master or PhD degrees in their home country or in another Sub-Saharan African country outside their home country. These In-Region scholarships lead to mobility of researchers between Sub-Saharan African countries and capacity building at African universities.", "DAAD In-Region scholarships ", "are generally awarded for specific fields of study. In South Africa, for instance, other Sub-Saharan African Nationals can obtain a Master degree in human rights law with an In-Region scholarship at the ", "Centre for Human Rights", " (CHR) based at the University of Pretoria. Likewise, a South African citizen may apply for a In-Region scholarship for a PhD in Development Studies at the ", "Institute of Statistical, Social and Economic Research", " (ISSER) based at the University of Ghana. Some of the In-Region scholarships in certain countries, however, are awarded to citizens of those same countries.", "DAAD In-Region scholarship holders are eligible for exciting funding\nopportunities in addition to the scholarship they have received for\ntheir full-time Master or PhD degree in Sub-Saharan Africa. They may\nchoose to apply for DAAD funding for a Short-Term Research Visit of 2 – 6\nmonths to Germany and/or attend one of six summer schools on offer in\nGermany during their funding period with the DAAD. They are thus able to\ngain experience and network in African countries as well as in Germany.", "In-Region Scholarships in South Africa", "The centres or departments at the South African universities below\nhave DAAD In-Region scholarships available for postgraduate study. The\nscholarships at the centres below are generally only open to other\nSub-Saharan African Nationals. South Africans may apply for the ", "DAAD-NRF In-Country Scholarship", " for postgraduate studies in South Africa.", "AIMS | Mathematics", "CHR | Law, Human Rights", "Rhodes University | Biochemistry and Microbiology", "Stellenbosch University | Management and Economics Sciences", "UCT | African Paediatric Fellowship Programme", "UNISA | Nanosciences", "University of Pretoria | Agriculture and Environmental Sciences", "Calls are now open for In-Region Scholarships in South Africa! Below the calls may be downloaded as PDF documents.", " ", "Download: 17 May 2019 | AIMS, Mathematics (pdf, 537.68 KB)", " ", "Download: 17 May 2019 | APFP, Paediatrics (pdf, 594.05 KB)", " ", "Download: 17 May 2019 | CHR, Human rights (pdf, 536.92 KB)", " ", "Download: 17 May 2019 | Rhodes, Microbiology (pdf, 536.49 KB)", " ", "Download: 17 May 2019 | Stellenbosch, Economics and Management (pdf, 537.42 KB)", " ", "Download: 17 May 2019 | UNISA, Nanoscience (pdf, 538.87 KB)", " ", "Download: 17 May 2019 | UP, Agriculture (pdf, 536.85 KB)", "In-Region Scholarships in Southern Africa", "Calls are now open for In-Region Scholarships in Malawi,\nMauritius and Namibia! Below the calls may be downloaded as PDF\ndocuments. ", "All Sub-Saharan African Nationals may apply for these scholarships, including South Africans.", " ", "Download: 17 May 2019 | LUANAR, Agriculture (pdf, 538.12 KB)", " ", "Download: 17 May 2019 | NUST, Computer Science (pdf, 538.04 KB)", " ", "Download: 21 June 2019 | Mauritius, Computer Science (pdf, 539.71 KB)", "For More Information:", "Visit the Official Webpage of the 2020 In-Region Scholarships Programme "], "url : https://www.opportunitiesforafricans.com/daad-2020-in-region-scholarships-programme-in-south-africa/"], [["The African Institute for Mathematical Sciences (AIMS) Postgraduate & Postdoctoral Research Programme 2019 (CAD 32,000 per annum)", "date announced:May 2, 2019", "Application Deadline: Ongoing"], ["Application Deadline: Ongoing", "The African Institute for Mathematical Sciences – Research (AIMS Research)", " ", "is pleased to invite prospective postdoctoral fellows who hold a PhD degree in any mathematical science discipline to apply for one of fifteen postdoctoral fellowships available through the AIMS Postdoctoral Research Fellows Program in climate change science. This is in response to an urgent need to increase the number of high-end researchers who, with limited supervision, can conduct cutting-edge mathematical science research in Africa.", "AIMS postdoctoral research fellows in climate change science will each benefit from financial support of up to CAD 32,000 per annum for a maximum duration of two years, extendable subject to approval. They will be based at one of the seven existing AIMS Research Centres, including Quantum Leap Africa. Beneficiaries may be affiliated to any recognized institution of higher learning located in the same country as the host AIMS Research Centre. Funding will be provided for fellows and their supervisors to attend one research school that will take place at AIMS Rwanda.", "Eligibility", "Applicants can be from any country.", "Applicants must hold at least a PhD degree (or a recognized\nequivalent) in any field related to mathematical sciences before the\nstart date of this position.", "Applicants should be interested in undertaking research within the climate change sciences and its related areas.", "Knowledge/interest in mathematical modelling would be an advantage.", "Applicants must be open-minded, and must be willing to conduct their\nresearch at their preferred AIMS Research Centre, or a designated\npartner institution in the same host country. The designated partner\ninstitution could be an academic/research institution or a non-academic\ninstitution (e.g. industry).", "Financial Information", "This is a two year extendable research position with a maximum total cost to AIMS of ", "CAD 32,000 per annum", ". The cost includes a return flight ticket from the candidate’s home/institution to the AIMS Research Centre, tuition (if applicable), visa application, accommodation, living support, and health insurance.", "How to Apply", "Applications should be submitted using the ", "online application form", ", and should contain the following supporting documents:", "a completed ", "personal details form", ",", "a completed ", "research proposal form", ",", "a letter of motivation which outlines why you should be offered this position,", "most recent transcripts and attestation, and", "a current CV.", "Your supporting documents should be ready for submission before you\ncomplete the online application form. Supporting documents should be\nsaved as pdfs in the format: “name of the researchprogram_type\nof_document_AIMSentity/centre_monthyear_applicant’s name-surname”. For\ninstance, the personal details form should be saved as\n“AIMSPostdoc_personaldetails_AIMSRwanda_Dec2018_SarahJake”.", "Two academic referees from tertiary institutions should email confidential letters of support on your behalf to ", " aimspostdoc @nexteinstein.org", "\nusing the subject line:\nAIMSPostdoc_supportletter_AIMSentity/centre_month/year_applicant’s\nname-surname’ e.g. ‘AIMSPostdoc _AIMSRwanda_Jun2018_JohnJake’. It is\nyour responsibility to ensure that these letters of support are sent and\nreceived. Ensure to also download and send the ‘", "Instructions for Referee", "’ document and the above email address to your respective referees.", "For More Information:", "Visit the Official Webpage of the AIMS Postgraduate & Postdoctoral Research Programme 2019 "], "url : https://www.opportunitiesforafricans.com/aims-postgraduate-postdoctoral-research-programme-2019/"]]