[[["Coimbra Group Short Stay Scholarship Programme 2019/2020 for young researchers from Sub – Saharan Africa", "date announced:January 31, 2019", "Application Deadline: 31 March 2019"], ["Application Deadline: 31 March 2019", "Coimbra Group Universities", " have been providing, since 2008, young researchers from universities in Sub-Saharan Africa with the opportunity to spend a short period (generally 1 to 3 months) at a Coimbra Group University to carry out part of their research there. ", " Eligible countries: all African countries ", "except", " Algeria, Egypt, Libya, Morocco, and Tunisia (applicants from these countries are eligible under the Scholarship Programme for Young Researchers from the European Neighbourhood). ", "Requirements:", "1 – Applicants should provide the name and contact details of an\nacademic supervisor in the receiving Coimbra Group University who will\nsupervise their work during their stay abroad. If you do not have any\ncontacts, we suggest you visit the website of your chosen institution or\nget in touch with the contact person whose email address is indicated\nin the brochure. The Coimbra Group Office is not in the position to\nprovide assistance in this.", "2 – All applicants are requested to provide a letter/e-mail of\nacceptance (to be submitted together with your application) written by\nthe head of the academic supervisor or administrative unit of the host\nuniversity where you would like to carry out the proposed working plan.\nThe letter should state that the supervisor is willing to work with you\nin case you obtain a Coimbra Group Scholarship.", "3 – Applicants can select one institution only. Multiple applications from the same candidate will be rejected.", "4 – Please fill in your application form only when you have all the\ndata available (i.e. name of and letter of acceptance by supervisor at\nCoimbra Group University, etc.). Incomplete applications will be\nrejected, no exceptions will be made.", "5 – The dates of your stay should be agreed upon between the\napplicant and the academic supervisor at the Coimbra Group University.\nTypically this will be during the academic year 2019/2020.", "For More Information:", "Visit the Official Webpage of the Coimbra Group Short Stay Scholarship Programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/coimbra-group-short-stay-scholarship-programme-2019-2020/"], [["Hogan Lovells Scholarship Program 2019 for South African LLB students", "date announced:February 2, 2019", "Application Deadline: March 29th 2019"], ["Application Deadline: March 29th 2019", "Hogan Lovells", " (South Africa) is awarding a scholarship, open to all previously disadvantaged South African LLB students in their penultimate year of study.", "Criteria and Conditions", "Applicants should be able to demonstrate:", "a strong academic record", "\nevidence of being an all-rounder (for example being a partiicpant in extra-curricular activities, such as sport/community/cultural/volunteer or paid employment activites)", "\na need for financial assistance", "The Succcessful candidate will be expected to attend a vacation programme at Hogan Lovells (South Africa) and, if offered the opportunity, will be required to enter a contractual arrangement to serve articles with the firm.", "Applications for 2019 will close on March 29th 2019 and should be submitted to ", "[email protected]", "The following documents must be submitted:", "The name of the scholarship for which you are applying.", "\nLetter fully motivating why you should be a beneficiary", "\nCurriculum Vitae that includes your student number", "\nCertified copy of your academic results", "\nCertified copy of identity document", "\nTwo letters of reference", "\nContactable telephone number/s", "\n(Incomplete applications will not be considered)", "For More Information:", "Visit the Official Webpage of the Hogan Lovells Scholarship Program 2019 "], "url : https://www.opportunitiesforafricans.com/hogan-lovells-scholarship-program-2019/"], [["King Carl Gustaf Scholarship 2019 for Students from Conflict Areas to study in Sweden.", "date announced:January 18, 2019", "Application Deadline: 1st February 2019. "], ["Application Deadline: 1st February 2019. ", "The King Carl Gustaf Scholarship", " is aimed at students who live in unsafe and dangerous conditions in areas of conflict outside Europe. Scholarships will cover the cost of tuition, but not living expenses, for studies at Uppsala University Master’s programmes offered during the current admission round and commencing 2 September 2019.", "For studies at:", " Master’s programmes           ", "Eligibility criteria:", "Citizens of: Afghanistan, Central African Republic, DR Congo, Egypt,\nIndia, Iraq, Libya, Myanmar, Nigeria, Pakistan, Philippines, Somalia,\nSouth Sudan, Syria, Yemen.", "Applicants must show why they are particularly vulnerable and\ntherefore in need to belonging to the education environment at Uppsala\nUniversity as well as having the academic talent required.", "Students can only be awarded a King Carl Gustaf scholarship if a programme at Uppsala University is chosen as first priority.", "You must meet the entrance requirements for the programme you\napplied to and application fee and supporting documents must have been\nreceived before deadline to University Admissions. ", "The programme must be delivered on campus.", "Documentation to send:", "No extra documents need to be sent. We will use documentation you submit with your programme application on ", "www.universityadmissions.se", ". ", "Your application ID from ", "www.universityadmissions.se", " must be noted on the scholarship application form.", "For More Information:", "Visit the Official Webpage of the King Carl Gustaf Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/king-carl-gustaf-scholarship-2019/"], [["Canon Collins Trust Scholarships 2019/2020 for Postgraduate Study in the United Kingdom (Fully Funded)", "date announced:January 17, 2019", "Application Deadline:Monday 25th February 2019. "], ["Application Deadline:Monday 25th February 2019. ", "Canon Collins Trust", " offers scholarships to support taught masters degree programmes at certain UK universities.", "School of Oriental and African Studies, University of London", " ", "Canon Collins Trust", " partner with SOAS to co-fund one scholarship annually. Applicants must:", "Be\na national of, and normally resident in one of the following countries:\nAngola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa,\nSwaziland, Zambia, Zimbabwe.", "Be in possession of a good Honours\ndegree (minimum second class, upper division or equivalent) or about to\ngraduate in the year of application.", "Be applying for a full-time one-year taught masters course in any subject.", "Have at least 2 years work experience in a relevant field.", "University of Sussex", " ", "Canon Collins Trust", " partner with the ", "Mandela Scholarship Fund at the University of Sussex", " to co-fund two awards annually. Applicants must:", "Be\na national of, and normally resident in one of the following countries:\nAngola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa,\nSwaziland, Zambia, Zimbabwe.", "Be in possession of a good Honours\ndegree (minimum second class, upper division or equivalent) or about to\ngraduate in the year of application.", "Be applying for a full-time one-year taught masters course in any subject.", "Have at least 2 years work experience in a relevant field.", "Benefits:", " All these scholarships cover full tuition fees, a monthly stipend, a return economy flight, a settling-in allowance and other support whilst in the UK. ", " Application Process ", "The online application form is of primary importance as it serves as the basis for assessment. The online application form can be found on the Canon Collins Trust website, when the call for applications is open.", " You will find full instructions online when you start a new form. It is your responsibility to ensure that your application is complete and accurate before submitting your application online. All sections of the form need to be complete before the system will allow the application form to be submitted.", " Information can be saved and the application form edited until the applicant chooses to submit. All applicants are required to submit the following supporting documentation:", "Certified copy of undergraduate degree certificate, if available", "Certified academic transcripts", "Reference letters from two referees", "ID document (The following are acceptable: Passport, Birth Certificate, Driver’s License)", "Proof of refugee status, if applicable.Ideally, you should submit an academic reference (preferably from your current supervisor) and a reference from an employer. ", "You should ask your referees to write a reference that relates to your application for this scholarship. It should outline your strengths as an applicant, demonstrate your capacity to study at the level required, explain how you would benefit from further study and identify your potential impact in the future. ", "How to apply", "Applications are open and will close on Monday 25th February 2019 at 17:00 UK time. Please read the guidelines ", "here ", "and complete the application form by clicking ", "here", ".", "For More Information:", "Visit the Official Webpage of the Canon Collins Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/canon-collins-scholarships-2019-2020/"], [["New Zealand Development Scholarships 2019/2020 for Study in New Zealand (Fully Funded)", "date announced:February 1, 2019", "Application Deadline: 14 March 2019 at 12:00 pm NZ Time. "], ["Application Deadline: 14 March 2019 at 12:00 pm NZ Time. ", "New Zealand offers scholarships to eligible citizens from developing countries to study abroad at a New Zealand education institution or university or at a Pacific university.", "New Zealand Development Scholarships (NZDS)", " give candidates from selected developing countries an opportunity to gain knowledge and skills through study in specific subject areas which will assist in the development of their home country.", "NZDS are funded by the New Zealand Aid Programme, the New Zealand Government’s overseas aid and development programme. They are managed by the ", "New Zealand Ministry of Foreign Affairs and Trade (MFAT).", "Applicants from the following countries are eligible to apply for the New Zealand Scholarships:", "Algeria,\nAngola, Botswana, Djibouti, Egypt, Ethiopia, Ghana, Kenya, Lesotho,\nMalawi, Mauritius, Morocco, Mozambique, Namibia, Nigeria, Rwanda,\nSenegal, South Africa, Swaziland, Tanzania, Tunisia,\nUganda, Zambia and Zimbabwe. ", "Qualification Types", "New Zealand Development Scholarships are available for the following qualifications:", "Postgraduate Certificate (6 months)", "Postgraduate Diploma (1 year)", "Master’s Degree (1 – 2 years)", "PhD (3 – 4 years)", "Financial benefits", "Our scholarships provide the following financial support:", "full tuition fees", "living allowance (stipend) – NZ$480 per week. This is  a contribution to basic living expenses", "an establishment allowance – NZ$3000. This is a contribution to assist with set up costs in New Zealand – for example  it can be used towards accommodation expenses, text books, study materials", "medical and travel insurance", "travel to and from your home country – this is for travel from your home country at the start of the scholarship, and for you to return to your home country at the end of your scholarship. Note that we offer our scholarships for the shortest amount of time needed for you to complete the academic programme.", "home leave or reunion travel for some scholars", "assistance with research and thesis costs for many postgraduate research students", "Application Procedure:", "Online applications", "Online applications are for the following scholarship types:", "New Zealand Development Scholarships", "Make sure you are fully prepared before you begin your online application:", "Complete all the steps in the ", "Getting Started section ", "(see above)", "Make sure you read the ", "Application Guidance", " – especially the section about Online applications.", "We still find that many applications we get are low-quality and show that the applicant has not read the essential information and guidance on this website.", "The online application process has four steps, all completed on an ", "online application site (external link)", ". The site will explain each step in more detail.", "Step one: Confirm your eligibility", "Complete the Online Eligibility Test. This will give you a number that you will need when you register (step three).", "Step two: Create a Real Me login", "This will give you a login and password that you will use through the application process.", "Step three: Register with New Zealand Scholarships online", "This creates your application account, and means you will be set up to complete an application.", "Step four: Complete your application", "This step will only become available when applications formally opens. Check ", "application dates", ".", "If you are interested in applying for a scholarship we encourage you to do all the things under ‘", "Getting started", "‘ ", "before", " applications open. There is a lot you should do before you begin your application.", "Start your online application process now:", "Start your online application process here (external link)", ".", "For More Information:", "Visit the Official Webpage of the New Zealand Development Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/new-zealand-development-scholarships-2019-2020/"], [["Transparency International School on Integrity (TISI) 2019 in Vilnius, Lithuania (Scholarships available)", "date announced:January 18, 2019", "Application Deadline: May 19th 2019"], ["Application Deadline: May 19th 2019", "The Transparency International School on Integrity", " is open to ", "senior students, graduates and young professionals under the age of 35", ".", "The Transparency School welcome individuals from ", "public, private, non-governmental and academic sectors, ", "from all academic backgrounds. Transparency School does not discriminate its applicants on the grounds of race, color, national origin, disability, sex, gender identity, religion, political beliefs, marital, familial or parental status, sexual orientation or any other basis.", "The School curriculum is presented\nthrough a variety of learning modules such as lectures, seminars,\ntraining, discussions, field trips, film screenings and social events.\nThe program follows a conscious schedule which, as the week goes by,\ngradually moves away from introductory topics and toward seminars and\ntraining aimed to address particular subjects and lets participants\nacquire new skills. In short, the aim of the programme is to leave you\ninspired and empowered by creating opportunities to learn in small\ngroups as well as through mentoring hours.", "The School features three teaching modules that cover ", "the", " ", "public sector, the private sector ", "and", " civic empowerment tools. ", "Each module deals both with theory and practice and includes:", "Public sector ", "– grand and small corruption, measuring corruption, state capture, political party financing, public procurement, etc.;", "Private sector", " –\ninternational anti-corruption mechanisms, corporate reporting standards\nand corruption in different industry sectors, such as the media or\nsports, etc.;", "The civic empowerment", "\nmodule addresses the role of citizens in monitoring the activities of\nthe state and explores ways in which people can become involved in the\npublic decision-making process, in reporting corruption and in\nanti-corruption activities.", "Transparency School is organized in cooperation with Mykolas Romeris University in Vilnius. Upon completion of the course, ", "the students receive 6 ECTS (European Credit Transfer System) credits", ".", "Scholarships", "A limited number of scholarships is available for applicants from certain countries. ", "Full scholarships cover international travel, tuition and accommodation expenses.", "\nStudents seeking to receive full scholarships are encouraged to apply\nas soon as the application process opens. In certain cases, students may\nalso be offered ", "partial tuition fee waivers", " (partial scholarships) to cover a part of their course expenses.", "Please find the list of countries from\nwhich applicants are eligible for full scholarships: Armenia,\nAzerbaijan, Belarus, Bulgaria, Georgia, Moldova, Poland, Romania,\nRussia, South Africa, Taiwan, Turkey and Ukraine.", "Also, university students of ", "Nordplus Law Network", "\npartner universities (from Denmark, Estonia, Finland, Iceland,\nLatvia, Norway and Sweden) are entitled to receive Nordplus mobility\ngrant. List of universities can be found ", "here", ".", "If you wish to apply for a scholarship, make sure to fill out the appropriate section in the online application form, stating your reasons for applying.", "Fees & Accommodation", "The course fee covers ", "tuition fee, course material, accommodation, meals and extra-curricular activities", ".", "\nThe fee for Transparency School 2019 is ", "750 EUR. ", "The lectures are held at the ", "Mykolas Romeris University student campus. ", "Usually all the participants are accommodated at the university\nhostel facilities and are asked to share a room with another participant\nof the same gender. However, do not hesitate to let us know if you have\nparticular needs or certain preferences. TI School team will do their\nbest to meet your needs and make sure nothing spoils your stay in\nVilnius.", "Deadline for applications", "With scholarship", " ", "The deadline for scholarship applications is ", "1 May 2019.", " Candidates applying for a scholarship will be notified about the results of the selection procedure by ", "21 May 2019 ", "at the latest.", "With partial scholarship / without scholarship", " ", "The deadline for partial scholarship and non-scholarship applications is ", " 19 May 2019.", " ", "Candidates will be notified about the results of the selection procedure within three weeks of their application, by ", "12 June 2019 ", "at the latest.", "The application process", "Applying is really simple – just fill out and submit our online application form (please find it below).", "Please note that you will be asked to upload a short motivational\nletter along with your Europass CV. We strongly advise that you prepare\nthese in advance and have them ready before you start filling out your\napplication form.", "The following documents are required in order to complete your application", ":", "1. Europass Curriculum Vitae (CV);", "\n2. Motivation letter (max 500 words);", "\n3. Completed online form.", "Upon receipt of your notification, you will be asked to transfer the\nrequisite fee of 750 EUR (in case you are not eligible for a\nscholarship) to the designated bank account. We will confirm your\nadmission upon receiving the course fee.", "If you have any application-related questions, please do not hesitate to contact us at ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Transparency International School on Integrity (TISI) 2019"], "url : https://www.opportunitiesforafricans.com/transparency-international-school-on-integrity-tisi-2019/"], [["German Bundestag International Parliamentary Scholarships (IPS) Scheme 2019/2020 for young Professionals (500 Euros/Month & Fully Funded to Berlin,Germany)", "date announced:January 18, 2019", "Application Deadline: January 31st 2019The German Bundestag invites highly motivated graduates from the Arab region to take part in a scholarship programme in Berlin in September 2019."], ["Application Deadline: January 31st 2019", "The German Bundestag", " invites highly motivated graduates from the Arab region to take part in a ", "scholarship programme", " in Berlin in September 2019.", "In 2019, for the eighth time, the German Bundestag is once again offering a scholarship programme for politically engaged young graduates from the Arab region who are interested in the German parliamentary system and play an active role in promoting core democratic values in their home countries.", "During an intensive\nfour-week programme, participants have the opportunity to gain\nfirst-hand experience of the German parliamentary system and political\ndecision making processes.", "The programme", "The programme\nwill take place from 1 – 30 September 2019 in Berlin. The core element\nof the programme is a one-week work placement in the office of a Member\nof the German Bundestag.", "The focus is also on events about the German parliamentary system along with presentations, workshops and seminars on topics such as German history and culture, freedom of religion, minority issues, comparison of systems and approaches to experiences of dictatorship and the German culture of remembrance (Nazi dictatorship, SED dictatorship). A workshop on project management aims to support the development of individual project ideas with a view to promoting democracy and civil society in participants’ countries of origin.", "Eligibility criteria", "Citizenship of an Arab country", "Under the age of 35 at the start of the scholarship", "University degree", "Very good knowledge of German", "An interest in politics, and social/political commitment", "Please\nsend your completed online application documents by email as a\nPDF-file, with the file name consisting of your surname followed by your\ngiven name (i.e. surname-first name), to the German mission in your\nhome country.", "The scholarship", "Participants will receive a monthly scholarship of 500 euros. The Bundestag will also cover the costs of health, accident and personal liability insurance. In addition, accommodation in an apartment complex (two people sharing) will be provided free of charge, and the costs of travel to and from Berlin covered.", "The selection process", "The scholarship programme is aimed at\nhighly-motivated, capable and talented young individuals from the Arab\nregion who are open to new ideas, interested in politics and wish to\nplay an active and responsible role in shaping the democratic future of\ntheir country.", "Applicants will be invited to attend an interview at a German embassy in the Arab region, where an independent selection panel set up by the German Bundestag will choose the successful candidates based on their professional, social, language and intercultural skills. Some of the costs of travel to the interview will be reimbursed, if it is not possible for this to take place in the applicant’s home country.", "Application Process:", "Please send your completed online application documents by\nemail as a PDF-file, with the file name consisting of your surname\nfollowed by your given name (i.e. surname-first name), to the German\nmission in your home country.", "Your application should be submitted in German and include the following scanned documents:", "Passport photo (please attach this to the first page of the application form);", "Application form (available online at: ", "www.bundestag.de/ips_arabisch", ");", "Evidence of very good knowledge of German;", "Personal statement of reasons for applying (maximum of two pages);", "Copy of passport or ID card;", "Certified copy of university degree certificate", "1", ";", "Letter\nof recommendation in German or English (from a university professor or\nemployer, assessing the applicant’s qualification for the programme).", "1", " Copies are officially certified when they have been signed and stamped by a recognised authority (a German or foreign public authority, an embassy or consulate of the Federal Republic of Germany, a university, notary, or translator/interpreter registered with the public authorities) to confirm that they are a true copy of the original. If several photocopies are stapled together, each individual copy must be certified in this way. Unless documents are properly certified, the application cannot be processed.", "Contact", "This information, along with an application form, can be found at ", "www.bundestag.de/ips_arabisch", ". For further information, please send an email to: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the International Parliamentary Scholarships (IPS) Scheme 2019/2020"], "url : https://www.opportunitiesforafricans.com/german-bundestag-international-parliamentary-scholarships-ips-scheme-2019-2020/"], [["Reporters Without Borders Berlin Scholarship Program 2019 : Empowering Journalists in the Digital Field (Fully Funded to Berlin, Germany)", "date announced:January 31, 2019", "Application Deadline: Tuesday, February 19th 2019 at 23:59 (Central European Time). "], ["Application Deadline: ", "Tuesday, February 19th 2019 at 23:59", " (Central European Time). ", "Reporters Without Borders Germany", " invites journalists from war zones and crisis areas to come to Berlin for four months. During this time they can enjoy a break and complete a comprehensive training program in digital security issues relevant to their work.", "The program is funded by ", "the Berlin Senate Department for Economics, Energy and Public Enterprises.", "The aim of the scholarship is to provide scholarship holders with\npractical knowledge on how to protect themselves against digital threats\nsuch as surveillance or hacker attacks in their journalistic work. In\naddition, they will also receive training in how to teach others in\ntheir home region about digital security issues.", "From May 1st, 2019 until December 31st, 2019, eight journalists from war zones and crisis areas will be invited to Berlin for a period of four months each (", "1.05.2019 to 31.08.2019", " or ", "1.09.2019 to 31.12.2019", ").", "Requirements:", "Professional journalists, bloggers and citizen journalists who", "are exposed to digital threats due to their work in their home regions,", "want to learn and work extensively with digital security in order to improve their personal security", "are interested in passing on the knowledge acquired during the scholarship program to colleagues in their home regions and, ideally, already have some experience in teaching (including in other areas).", "Requirements:", "Applicants must have a very strong command of the English\nlanguage, as the scholarship program will be conducted entirely in\nEnglish.", "A high level of proficiency in regards to digital security is not\nrequired; anyone who is used to working with a computer can apply. ", "Applicants should also have adequate experience working as a\njournalist, be it as a professional journalist or a citizen journalist. ", "In addition, applicants must have every intention of returning to their home region after four months of residence in Germany.", "Benefits", "Reporters without Borders will cover the travel costs, take care of all visa-related matters, provide a pleasant apartment in Berlin for the duration of the scholarship, a monthly stipend of € 1000, free use of public transportation in Berlin, and also organize participation in a varied scholarship program taught by experts in the field of digital security. ", "Furthermore, during their stay in Berlin, scholarship holders will be given insights into the activities of Reporters Without Borders, a globally-active journalist and human rights organization. ", "Topics", "Threat Model for Journalists: How do I identify my risks?", "Legal Standards: What rights do journalists have against government surveillance?", "Technical Background: How does the internet technically work (including IP, DNS and email communication)?", "Encryption: How can you secure your communications (email, calls, messaging, etc.) against surveillance?", "Anonymization: How can you hide yourself online?", "Security on Social Media: How do you secure your accounts and what helps against trolling?", "Commercial Surveillance: What do companies want to know about their clients and how can you protect yourself against it?", "How to Apply", "Please send a completed and signed application form, the\ncompleted questionnaire, your CV and your identity documents in separate\nPDF documents as attachments (in total 4 PDF’s) either via:\nSignal-Messenger to ", "+49163 6182705", " or if you have an Protonmail-Account to ", "[email protected]", " or if you know how to use PGP by encrypted email to ", "[email protected]", " (", "GnuPG/GPG-Key", "). ", "The application form and the questionnaire are fillable PDF’s. So\nplease fill out the files on your computer and send them to us like\nthat, so that we are able to read your whole text:", "1. safe the files", "2. fill out the files on your computer", "3. save the filled out files again", "4. send the documents to us", "The deadline for applications is ", "Tuesday, February 19th 2019 at 23:59", " (Central European Time).", "Please use the application form and the questionnaire provided by us\nto apply. We ask for your understanding that we can only contact\napplicants who are shortlisted for a place on the program.", "For More Information:", "Visit the Official Webpage of the Reporters Without Borders Berlin Scholarship Program 2019"], "url : https://www.opportunitiesforafricans.com/reporters-without-borders-berlin-scholarship-program-2019/"], [["Ruth First Educational Trust Scholarships 2019/2020 for Southern Africans to study in the United Kingdom (Fully Funded)", "date announced:February 5, 2019", "Application Deadline: March 1st 2019"], ["Application Deadline: March 1st 2019", "The aim of the ", "Ruth First Educational Trust", " is to enable southern African students from historically disadvantaged backgrounds to undertake postgraduate study at the University of Durham. Southern Africa is defined for this purpose as comprising the following countries: Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, Republic of South Africa, Swaziland, Zambia and Zimbabwe.", "Scholarships make an important contribution towards social,\neducational and economic development in the region. In addition to their\nvalue to individuals they have wide developmental impact, within and\nbeyond southern Africa.", "Ruth First Scholars have played positive leadership roles in their\ncommunities and are chosen for their active commitment to good causes,\nas well as for their academic ability.", "Many former Ruth First Scholars now hold important positions in the\npublic and private sectors in southern Africa, and have become\ninspirational role models for young people.", "Geographical Criteria", "Applicants must be a national of one of the following countries:", "Angola", "Botswana", "Lesotho", "Malawi", "Mozambique", "Namibia", "Republic of South Africa", "Swaziland", "Zambia", "Zimbabwe", "Level of Study", "Taught Master’s Degree programmes", "Mode of study", "Full time", "Year of Entry", "Applications for programmes commencing 2019/20", "Programmes", "All programmes EXCEPT MBA", "Further Information", "Applicants should:", "hold a relevant honours degree of sufficient standard to be admitted to your chosen Master’s course; and", "not hold a Master’s degree, nor have previously studied at a university outside southern Africa, and", "show evidence of active involvement in and commitment to voluntary work for the benefit of causes such as rural or urban community development; young people or educational projects; charitable organizations; health or AIDS awareness projects; student welfare or guidance; the defence of human rights; the promotion of equal opportunities or social justice; environmental sustainability. If you have a paid job that involves working in such areas, you should show evidence of leadership and commitment beyond the requirements of the job.", "Detail:", "Full payment of tuition fees", "Stipend for living expenses – 12 monthly payments", "one return air ticket from the home country to the UK and the cost of return travel between the UK airport and Durham City", "Fully funded accommodation and meals at St Chad’s College", "‘Settling in allowance’ on arrival", "A contribution towards the cost of a UK visa and the UK Health surcharge", "Duration", "One year", "Restrictions", "The Trust cannot provide additional support for dependants, nor for travel during the period of the Scholarship.", "Number of awards available", "1", "Application Procedure:", "Please use ", "this Application form ", "to Apply for this Scholarship.", "Application deadline", "1st March 2019", "When candidates will hear the outcome of their application", "Mid-May 2019", "For further information or advice:", "Email:", " ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Ruth First Educational Trust Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/ruth-first-educational-trust-scholarships-2019-2020/"], [["Chinese Government Scholarships 2019/2020 for South Africans to study in China (Funded)", "date announced:January 29, 2019", "Application Deadline: March 15th 2019The Chinese Government is offering scholarships for South African students to study at Chinese institutions starting in the 2019/20 academic year. The Department of Higher Education and Training is responsible for nominations"], ["Application Deadline: March 15th 2019", "The Chinese Government is offering scholarships for South African students to study at Chinese institutions starting in the 2019/20 academic year. The Department of Higher Education and Training is responsible for nominations", "The scholarship is offered for undergraduate (Bachelors) in the identified scarce skills, postgraduate (Masters or PhD) or non-degree Chinese language studies. Bachelor’s degree scholarships are taught in ", "Chinese and will only be awarded to applicants who already have the required level of Chinese proficiency (HSK 5 or above). Preference is given to applications for postgraduate studies. ", "Criteria and Eligibility", " ", "–    South African citizens in good health ", "(medical check will be required for successful applicants);", ";", " –    Strong academic record with a minimum 65% average in previous studies;", " –    Availability to study in China from September 2019;", " –    Demonstrated interest in China and commitment to the development of South Africa;", " –    Applications in all fields of study except medicine will be considered;", " –    Preference will be given to postgraduate applicants, previously disadvantaged applicants and", "      applications in the following fields:", "\n–\tApplicants must meet the minimum academic requirements for entry into a similar programme at a", " South African university.", "\n–\tBachelor’s applicants must have HSK 5 certificate and be willing to study in Chinese.\n", "Education requirements and age limits:", "STUDY PROGRAM", "EDUCATION REQUIREMENTS", "AGE (AS OF SEPTEMBER 2019)", "Chinese language studies (non-degree)", "National Senior Certificate (or equivalent) with a university entrance pass (a minimum of 70% average is recommended)", "Under 35", "Master’s degree", "Master’s degree (a minimum of 65% average is recommended)", "Under 40", "Doctoral degree", "Bachelor’s degree (honours) (a minimum of 65% average is recommended)", "Under 35", "Bachelor’s degree", "National Senior Certificate (or equivalent) with a university entrance pass (a minimum of 70% average is recommended)", "\nHSK 5 (or higher ) certificate", "Under 25 ", "Language of Instruction", "According to the regulations of the Chinese Ministry of Education, ", "all undergraduate programmes for ", "scholarship students are taught through the Chinese language medium. No exceptions will be made for students already in China studying in English.", " Bachelor’s degree applicants interested in pursuing a Bachelor’s degree must have HSK Level 5 or higher.", "Applicants wishing to undertake a Bachelor’s degree in China, without the required Chinese language proficiency should apply for Chinese Language Studies only, ", "not for the degree. ", "They will be required to apply for the scholarship again for their degree studies upon successful completion of the language programme. Being awarded a scholarship for language studies does not guarantee that a degree scholarship will be available or awarded the following year. ", "At Master’s and PhD level, programmes taught in English are eligible for the scholarship.", " Applicants must identify the relevant institution and programme and submit an application to the university directly,in parallel with the scholarship application. ", "Institutions and Programmes", "Scholarship applicants are required to apply directly to the institution of their choice prior to applying for ", "the scholarship. ", "Evidence of the submitted application must be provided. ", "It is the responsibility of each candidate to do research into available programmes, institutions,", " language of instruction and programme-specific entrance criteria. The programmes and institutions in ", "China are listed here: ", "Universities in China", "Approximate duration (years) of scholarships", "STUDY PROGRAM", "DURATION OF PROGRAM", "DURATION OF PREPARATORY CHINESE LANGUAGE COURSE", "DURATION OF SCHOLARSHIP", "Chinese language studies", "1-2", "None", "Up to 2", "Master’s degree", "3-4", "1-2", "3-6", "Doctoral degree", "2-3", "1-2", "2-5", "Bachelor’s degree", "4-5", "1-2", "4-7", "Studies must be completed within the duration of the scholarship, as specified in the Admission Notice.", "Scholarship Conditions", "The Chinese Government provides the following:", "STUDY PROGRAM", "Tuition (RMB per year)*", "Accommodation (RMB per year)", "Stipend (RMB per year)", "Medical Insurance (RMB per year)", "Chinese language studies", "20000-27000", "8400", "30000", "800", "Master’s degree", "25000-34000", "8400", "36000", "800", "Doctoral degree", "33000-45000", "12000", "42000", "800", "Bachelor’s degree", "20000-27000", "8400", "30000", "800", "*Should tuition fees for the identified programme exceed the above stated amounts, the Scholarship", " Recipient will be responsible for paying the difference.", "The South African Government provides the following ", "(subject to the availability of funds)", ":", "\nCompulsory orientation programme from 13-16 August 2018.\n", "Successful scholarship applicants will be required to sign a contract and return to South Africa upon ", "completion of studies", "How to apply", "Complete the DHET application form and email it with all supporting documents to", " ", "[email protected]", " by ", "15 March 2019. ", "Applicants MUST apply to a Chinese university and submit proof of application or acceptance letter with ", "their application. ", "All PhD applicants", " must identify and make contact with a supervisor at their university of choice and submit proof of this engagement with application form.  ", "Documents and links", "General information on the Chinese Government Scholarship", "DHET application form", "Information about universities in China", "For More Information:", "Visit the Official Webpage of the Chinese Government Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/chinese-government-scholarships-2019-2020/"], [["Allan Gray Orbis Foundation High School Scholarships 2019/2020 for young South Africans (Fully Funded)", "date announced:January 18, 2019", "Application Deadline: 15 March 2019. "], ["Application Deadline: 15 March 2019. ", "The Allan Gray Orbis Foundation", " i", "nvests in the education and development of individuals with entrepreneurial potential within Southern Africa. ", "The Allan Gray Orbis Foundation ", " do so because we believe that these curious, driven and responsibly minded young people are capable of significantly, positively and permanently impacting the economic lives of the communities, cities and possibly even the country they operate in.", "The Foundation takes a holistic approach to entrepreneurship development and there are three critical aspects: the person in whom we cultivate an entrepreneurial mindset, the practice of developing entrepreneurial skills and competencies and the context of understanding the African and global ecosystems. ", "Overview", "The Foundation offers high school Scholarships to learners who are\nin financial need, have a curious, entrepreneurial mindset and the\npotential to excel academically.", "Scholarship recipients, known as ", "Allan Gray Orbis Scholars, ", "receive funding for high school in addition to access to support and programmes to develop their entrepreneurial talents. We aim to develop a community of young, entrepreneurially minded leaders so that our Scholars have the opportunity to go to university through the Fellowship Programme.", "The Scholarship Programme focuses on the cultivation of an entrepreneurial mindset, personal mastery and academic excellence. We believe an entrepreneurial mindset will enable our Scholars to attain academic success and effective personal leadership.", "Requirements:", "This Scholarship is offered in three countries, however the models differ in each country.", "South Africa – The Scholarship is available to learners entering high school. Learners in Grade 6 may apply.", "Botswana / Swaziland – This Scholarship is available to Grade 12\nlearners who need a post-Matric to gain access to a South African\nUniversity. Please apply through the ", "Fellowship", " page.", "Here is the full list of the partner placement schools:", "Eastern Cape:", "Clarendon High School for Girls", "Selborne College High School", "Collegiate Girls’ High School", "Grey High School", "St Andrew’s College (Grahamstown)", "Diocesan School for Girls", "Gauteng:", "St Alban’s College", "King Edward VII School", "St Andrew’s School for Girls", "St Mary’s School, Waverly", "St Stithians College", "Roedean School (SA)", "Pretoria Boys High School", "KwaZulu-Natal:", "Michaelhouse", "Epworth Independent High School", "Pietermaritzburg Girls’ High School", "Maritzburg College", "Western Cape:", "Bishops Diocesan College", "St Cyprian’s High School", "Rustenburg Girls’ High School", "Rondebosch Boys’ High School", "Rhenish Girls’ High School", "Benefits:", "The Scholarship programme provides access to quality high school education. Allan Gray Orbis Foundation aim to establish passion in the selected Scholars and develop their potential to become self-starting, high-impact entrepreneurs.", "The Scholarship covers the following:", "Full tuition and boarding fees", "A monthly allowance (pocket money)", "A travel subsidy", "Stationery and prescribed books", "Toiletries, school uniforms and casual clothing", "Support for extra-mural activities", "Scholars also have access to an entrepreneurial development\nprogramme. This ensures their continued progress by providing additional\nleadership and entrepreneurial development opportunities.", "For More Information:", "Visit the Official Webpage of the Allan Gray Orbis Foundation High School Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/allan-gray-orbis-foundation-high-school-scholarships-2019-2020/"], [["Government of ​Brunei Darussalam Scholarships 2019/2020 for Foreign Students (Fully Funded to Brunei)", "date announced:February 2, 2019", "Application Deadline: 1600 hrs (Brunei time) on 28 February 2019. "], ["Application Deadline: ", "1600 hrs (Brunei time) on 28 February 2019.", " ", " The Ministry of Foreign Affairs is pleased to invite applications for the ", " ", "Government of Brunei Darussalam Scholarship", " ", "under the above Scholarship Award Scheme for the 2019/2020 academic session.", "\nTenable\nin Brunei Darussalam, the scholarship award provides applicants with\nthe opportunity to undertake Diploma, Undergraduate Degree and\nPostgraduate Master’s Degree at any one of the following institutions of\nhigher education:", "\n·       Universiti Brunei Darussalam (UBD), ", "\n·       Universiti Islam Sultan Sharif Ali (UNISSA), ", "\n·       Universiti Teknologi Brunei (UTB) and ", "\n·       Politeknik Brunei (PB).", " The academic year commences July/August 2019.", "ELIGIBILITY", "\n1.1    Applications are open to citizens of, but not limited to, ASEAN, Commonwealth and OIC member countries.", "\n1.2    Applicants should be nominated by their Government.", " 1.3    Applicants must be certified to be medically fit to undertake the scholarship and to study in Brunei Darussalam, by a qualified medical practitioner who is registered with any Government Authority(ies) prior to arrival in Brunei Darussalam.  Any and all costs incurred in obtaining this certification are to be borne by the applicant.", " 1.4    Applicants must be, between the ages of 18-25 for Undergraduate and Diploma programmes and must not exceed the age of 35 for Postgraduate Master’s Degree programmes on the 31", "st", " July 2019", " 1.5    The award is NOT eligible to Brunei Darussalam Permanent Residents.", "PROGRAMMES OFFERED AND ENTRY QUALIFICATIONS", "\nProgrammes offered, entry qualifications and any further information are available from the following websites:", "i)     Universiti Brunei Darussalam – ", "www.ubd.edu.bn", "ii)    Universiti Islam Sultan Sharif Ali– ", "www.unissa.edu.bn", "iii)   Universiti Teknologi Brunei– ", "www.utb.edu.bn", "iv)   Politeknik Brunei – ", "www.pb.edu.bn", " ", "* only programmes offered under BDGS Scholarship as per advertisement for Academic Year 2019/2020.", "TERMS AND CONDITIONS OF THE SCHOLARSHIP ", "\nThe full\nlisting of the terms and conditions of the scholarship will be provided\nto the applicant once the application is successful and a scholarship is\noffered. A declaration will be required to be signed confirming\nunderstanding and agreement to these terms and conditions upon\nacceptance of the scholarship.", "\nThe general terms and conditions are as follows:", " 3.1    The scholarship recipient will be facilitated with the benefits of the scholarship as follows:", " i)      exemption from paying tuition fees including acceptance, examination, registration and orientation fees for the duration of the programme", " ii)     an economy class air-ticket to Brunei Darussalam from the scholarship recipient’s country of origin/ country of domicile prior to the commencement of the course and an economy class air-ticket from Brunei Darussalam to the scholarship recipient’s country of origin/country of domicile upon completion of the course; ", " iii)    a monthly personal allowance of BND$500.00;", " iv)    a monthly meals allowance of BND$150.00;", " v)     an annual book allowance of BND$600.00;", " vi)    accommodation at the residential college of the University/ Polytechnic;", " vii)  baggage allowance for shipment of the scholarship recipient’s personal effects to his country of origin/country of domicile upon completion of the programme, at a maximum amount of:", " ·       BND$250.00 to a country within the ASEAN region; or ", " ·       BND$500.00 to a country outside the ASEAN region;", " viii)  comprehensive insurance cover for the whole duration of the Scholarship. The scholarship recipient is urged to obtain additional insurance prior to his travel to Brunei Darussalam and for the whole duration of the Scholarship at his own expense.", "APPLICATION PROCEDURE AND CLOSING DATES", "\n4.1    Application forms can be downloaded from the following link:", "APPLICATION FORM 2019/2020", "4.2   \nApplication forms must be duly completed and endorsed by the Ministry\nof Foreign Affairs or the National Focal Point for scholarships of the\napplicant’s country.", "\n4.3   \nApplicants are required to also submit a security clearance statement\nfrom their National Security Agency(ies)/ Police Station (i.e. a\nstatement/ report certifying that applicants are clear from any civil\nand criminal charges).", "\n4.4    Completed application forms are to be emailed to the following address:", "[email protected]", "(NOTE: Maximum size allowed for e-mail and attachment files is 10MB)", "\nApplicants applying to Univeristi Brunei Darussalam must also complete an online application through ", "https://apply.ubd.edu.bn/orbeon/uis-welcome/", "\n4.5    Incomplete application forms will not be considered.", " 4.6    The closing date for the reception of completed application forms, together with certified copies of relevant certificates and documents is, ", "not later than 1600 hrs (Brunei time) on ", " ", "28 February 2019.", " For further enquiries please contact:           ", "\nTechnical Assistance Division", "Department of Administration", "Ministry of Foreign Affairs", "Bandar Seri Begawan BD2710", "Brunei DarussalamTel: +673 2261177 ext. 163 / 310Fax: + 673 2261250", "E-mail:\n", "[email protected]", "For More Information:", "Visit the Official Webpage of the Government of ​Brunei Darussalam Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/government-of-%e2%80%8bbrunei-darussalam-scholarships-2019-2020/"], [["Commonwealth Shared Scholarships 2019 for Students from Developing Countries for study in the United Kingdom (Fully Funded)", "date announced:January 21, 2019", "Application Deadline: 16.00 (GMT) on 14 March 2019 at the latest. "], ["Application Deadline: ", "16.00 (GMT)", " on ", "14 March 2019", " at the latest. ", "Commonwealth Shared Scholarships", " are for candidates from least developed and lower middle income Commonwealth countries, for full-time Master’s study on selected courses, jointly supported by UK universities.", "Funded by the ", "UK Department for International Development (DFID)", ",\nCommonwealth Shared Scholarships enable talented and motivated\nindividuals to gain the knowledge and skills required for sustainable\ndevelopment, and are aimed at those who could not otherwise afford to\nstudy in the UK.", "These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "• Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "\n• Be permanently resident in an ", "eligible Commonwealth country", "\n• Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2019", "\n• By October 2019, hold a first degree of at least upper second class\n(2:1) standard, or a second class degree and a relevant postgraduate \nqualification (usually a Master’s degree). The CSC would not normally\nfund a second UK Master’s degree. If you are applying for a second UK\nMaster’s degree, you will need to provide justification as to why you\nwish to undertake this study.", "\n• Not have studied or worked for one (academic) year or more in a high income country", "\n• Be unable to afford to study in the UK without this scholarship", "Eligible Commonwealth countries", "Bangladesh", " Cameroon", " Eswatini", " The Gambia", " Ghana", " Guyana", " India", " Kenya", " Kiribati", " Lesotho", " Malawi", " Mozambique", " Nigeria", " Pakistan", " Papua New Guinea", " Rwanda", " Samoa", " Sierra Leone", " Solomon Islands", " Sri Lanka", " Tanzania", " Uganda", " Vanuatu", " Zambia", "Scholarship Worth", "\nShared Scholarships are jointly funded by the CSC and participating UK universities. Each scholarship provides:\n", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor usually the cost of journeys made before your award is finally confirmed) – arranged by the university; funded by the CSC", "Approved tuition and examination fees– funded by the CSC", "Stipend (living allowance) at the rate of £1,065 per month, or £1,306 per month for those studying at universities in the London metropolitan area (rates quoted at 2018-2019 levels) – paid and funded by the university", "Warm clothing allowance, where applicable – paid and funded by the university", "Study travel grant towards the costs of study-related travel within the UK or overseas– claimed from and paid by the university; funded by the CSC", "Excess baggage allowance, up to an annual approved limit, when returning home–claimed from and paid by the university; funded by the CSC", " Reimbursement of the cost of a mandatory tuberculosis (TB) test, where required for a visa application (receipts must be supplied)– claimed from and paid by the university; funded by the CSC. Additional allowances for spouses or other dependants are not usually available ", "How to apply", "You can apply to study one of the taught Master’s courses offered in\nthe Commonwealth Shared Scholarship scheme. These scholarships do not\ncover undergraduate courses, PhD study, or any pre-sessional English\nlanguage teaching, and are usually tenable for one year only. ", "View a full list of eligible courses", ".", "You must also secure admission to your course in addition to applying for a Shared Scholarship. ", "You\nmust check with your chosen university for their specific advice on\nwhen to apply, admission requirements, and rules for applying.", " ", "View a full list of university contact details", ".", "You must make your application using the CSC’s online application\nsystem, in addition to any other application that you are required to\ncomplete by your chosen university. The CSC will not accept any\napplications that are not submitted via the online application system.", "You can apply for more than one course and/or to more than one\nuniversity, but you may only accept one offer of a Shared Scholarship.", "All applications must be submitted by ", "16.00 (GMT)", " on ", "14 March 2019", " at the latest.", "The CSC’s ", "online application form", " is now open.", "For More Information:", "Visit the Official Webpage of the Commonwealth Shared Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-shared-scholarships-2019/"], [["Education for Sustainable Energy Development (ESED) Scholarship Program 2019/2020 ($23,000 Worth)", "date announced:January 16, 2019", "Application Deadline: March 8, 2019 (23:59, UTC-05:00). "], ["Application Deadline: March 8, 2019 (23:59, UTC-05:00). ", "The", " Global Sustainable Electricity Partnership (GSEP)", " has had a long-standing commitment to education. In 2001, the Partnership reinforced this commitment by establishing the ", "Education for Sustainable Energy Development (ESED) scholarship program", " to support students from developing countries and economies in transition. The ESED program offers master’s level scholarships to outstanding students for a period of up to two years. In addition to the master’s scholarships offered, the ", "ESED program", " also supports a web-based network of scholars designed to encourage the sharing of information and knowledge among scholars and alumni.", "The purpose of the", " ESED scholarship", " is to support outstanding students pursuing advanced studies in sustainable energy development and to encourage meaningful contributions to the collective body of knowledge about this subject.", "The scholars are exceptional students from developing countries studying in sustainable energy development. Today, the need for globally-oriented practitioners and researchers is growing rapidly. Our one-of-a-kind scholarship program fosters the next generation of energy, climate, and electricity sector specialists who will be prepared to tackle the challenges of the future. ", "The Global Sustainable Electricity Partnership considers an outstanding student to be one who:", "graduates with excellent grades in the top 20% of her/his class", "is determined to advance her/his knowledge and understanding", "has a history of community involvement", "is committed to sustainable energy", "is committed to return and contribute to her/his home country", "Eligibility Requirements:", "To be eligible for this scholarship, prospective applicants must:", "Undertake master’s-level studies in sustainable energy development", "Be a citizen of a developing country/territory on the ", "List of official development aid recipients identified by the Development Co-operation Directorate (DAC) of the Organisation for Economic Co-operation and Development (OECD)", "Be committed to returning to their home country/territory after their studies to contribute to its development", "Be an outstanding student\n", "Graduates with excellent grades in the top 20% of their class", "Is committed to sustainable energy development", "Has a history of community involvement", "Is determined to advance their knowledge and understanding", "Required Documents:", "You must provide an electronic copy of all the documents listed below.", "Passport (photo page only) or birth certificate", "Curriculum vitae detailing your education, work experience (if applicable), awards, and participation in volunteer and/or extracurricular activities", "Admission letter from your university program of choice ", "If you have not yet received a letter of admission, you can upload an acknowledgement of receipt from your university showing that you have applied for admission", "If you receive your official admission letter after the scholarship application deadline, it is your responsibility to forward it via email to ", "[email protected]", " by no later than April 20, 2019. If we do not receive your official admission letter by this date, your application will not be considered", "If this application is for the second year of a two-year program, please include proof of enrolment ", "Program outline ", "Upload an outline of the curriculum or the courses you will be taking for your master’s program ", "University transcript(s) ", "If the language of your original transcript is not English, we require a certified translation of the document which includes the name of the translator as well as a copy of the original (untranslated) transcript", "If this application is for the second year of a two-year master’s program, please include your transcript for the first year ", "Academic Reference Form ", "You need to provide a completed copy of the Academic Reference Form. The form must be completed in English.", "The form must be completed by a faculty member or professor at your current or previous university who knows your academic abilities", "Should the referee wish to send the Academic Reference Form directly to the Global Sustainable Electricity Partnership, they can email it to ", "[email protected]", " by March 8, 2019 (23:59, UTC-05:00). Once received, it will be indicated in the online application system ", "Academic or personal reference letter ", "You need to provide one reference letter from either an academic or personal referee", "The reference needs to be in letterform (with an official letterhead of the referee’s organization, if possible), written in English, and must be dated and signed by the referee", "An academic referee must be a faculty member or professor at your current or previous university who knows your academic abilities. They cannot be the same person as the individual who completes your Academic Reference Form.", "A personal referee should be a person (e.g. employer, supervisor, mentor, coach) who can discuss other personal qualities or interests that make you specially qualified to receive the scholarship. This referee cannot be a family member", "Please make sure that the referee includes your full name in their letter", "Should the referee wish to send their letter directly to the Global Sustainable Electricity Partnership, they can send email it to ", "[email protected]", " by March 8, 2019 (23:59, UTC-05:00). . Once received, it will be indicated in the online application system ", "For More Information:", "Visit the Official Webpage of the Education for Sustainable Energy Development (ESED) Scholarship Program "], "url : https://www.opportunitiesforafricans.com/education-for-sustainable-energy-development-esed-scholarship-program-2019-2020/"], [["ARPPIS-DAAD PhD Scholarships 2019 for study at the International Centre of Insect Physiology and Ecology (icipe),Kenya", "date announced:January 18, 2019", "Application Deadline: 11th February 2019 "], ["Application Deadline: ", "11", "th", " February 2019", " ", " ", "The International Centre of Insect Physiology and Ecology ", "(icipe)", ", Kenya,", " ", "in partnership with the German Academic Exchange Service (DAAD", "1", ") In-Country/In-Region Scholarships Programme and African university partners, invites applications from suitably qualified candidates for PhD scholarships in the African Regional Postgraduate Programme in Insect Sciences (ARPPIS). ", "ARPPIS ", "The primary objective of ARPPIS is to prepare young researchers from\nAfrica to compete in an internationally competitive research environment\nwithin national, regional and international research programmes. At ", "icipe", "\nARPPIS scholars are provided with excellent research facilities in an\ninterdisciplinary environment within a structured, three-year PhD\nprogramme that includes research, training, developing research\npartnerships, writing scientific papers and grant proposals, and\nattending scientific meetings and international conferences. Scholars\nconduct their innovative research at ", "icipe", "’s laboratories and at field sites located in various agro-ecological zones.", "Six ", "ARPPIS-DAAD PhD scholarships are available to nationals of sub-Saharan countries for the following projects: ", "LIST OF PROJECTS", "The scholarships cover all costs of the PhD programme, including\ntravel, living expenses, medical insurance, university fees and all\nresearch and training costs.", "Successful candidates will develop a full proposal and register with\nan ARPPIS partner university in Africa after they start the PhD\nprogramme at ", "icipe", ".", "The ARPPIS PhD programme will commence from September 2019.", "Eligibility criteria", "The applicant must be a citizen of a country in sub-Saharan Africa. Some country restrictions apply. See ", "LIST OF PROJECTS", " for more details.", "A Bachelor’s degree with a minimum pass of second-class, upper division.", "A Master’s degree taken with both coursework and research in the\nfield of natural sciences or other field relevant to the PhD project.", "The Master’s degree must have been completed less than six years ago at the time of application.", "Qualified female candidates and candidates from less privileged\nregions or groups as well as candidates with disabilities are especially\nencouraged to apply.", "Qualified nationals of French- and Portuguese-speaking countries in Africa are also encouraged to apply.", "Preference will be given to applicants with a maximum age of 36 years (men) or 40 years (women) by 31", "st", " December 2019.", "Additional specific entrance\nrequirements will be considered for admission depending on the eligible\nPhD project(s) selected by the candidate. For information on applicant\nrequirements for each project, go to ", "LIST OF PROJECTS", ".", "A working knowledge of English (written & spoken).", "Completed application forms and accompanying supporting documents. ", "Note: ", "please\nstart the application process as soon as possible, especially if some\nof the supporting documents are difficult to obtain.", "Application Procedure ", "Full instructions and online application: ", "LINK", "Deadline", "Deadline for applications: ", "11", "th", " February 2019", "Questions", "In case of any questions regarding the ARPPIS PhD programme or your\napplication, kindly contact: Ms. Vivian Atieno, Capacity Building\nOfficer, Capacity Building and Institutional Development Programme, ", "icipe", ", ", "[email protected]", "icipe", ".org", " ", "For More Information:", "Visit the Official Webpage of the ARPPIS-DAAD PhD Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/arppis-daad-phd-scholarships-2019/"], [["Netherlands Fellowship Programmes (NFP) – Orange Knowledge Programme (OKP) 2019 for study in Netherland (Funded)", "date announced:February 7, 2019", "Application Deadline: Varying by Institution"], ["Application Deadline: Varying by Institution", " The Orange Knowledge Programme", " ", "aims to advance the development of the capacity, knowledge and quality of both individuals as well as organisations both in the field of higher and vocational education and in other fields related to the priority themes in the programme countries. ", "Scholarships", "One of the instruments offered by the Orange Knowledge\nProgramme are the individual scholarships, which are open to mid-career\nprofessionals who are nationals of -and living and working in the\nfollowing countries:", "Country list for short courses and masters – April 2019 deadline – Orange Knowledge", "We emphasise that these scholarships are also open for applicants from francophone countries.", "Scholarships are available for a selection of:", "short courses (duration 2 weeks to 12 months);", "master’s programmes (duration 12 – 24 months).", "Eligible courses", "All courses that are eligible for an Orange Knowledge Programme\nscholarship for this application round are listed in Studyfinder. Please\nsearch in ", "Studyfinder, using the filter ‘OKP qualified – Yes’", ". You can also find contact details of the institutions there. ", "Application", "The application process for a scholarship is handled by the Dutch education institution. For more information on the eligibility criteria and how to apply, please read: ", "OKP information for applicants(165 kB)", "Please note that there are focus areas for each country,\nwhich are taken into consideration when scholarship applications are\nnominated and assessed. Applications that fall within the focus areas\nfor a specific country are given priority:", "Country focus document Orange Knowledge Programme (220 KB)", "For some countries a government statement is required, see the following document:", "Government statement requirements for OKP and MSP", "Dates and deadlines", "There are 3 application rounds for individual scholarships in 2019. The current application round opened on 7 February. ", "Application deadlines vary per institution. After selecting a course,\nyou need to contact the Dutch institution directly for more information\nabout the application deadline.", "Provisional opening for other application rounds will be 6 June 2019 and 5 September 2019.", "For the current application round there is extra budget for Masters\nand Short courses for applicants of Jordan, Lebanon, Egypt, Palestinian\nTerritories, Burkina Faso, Ethiopia, Mali, Nigeria and Niger. ", "The procedure is as follows:", "Candidates register", "Dutch institution nominates candidates and submits grant application", "Embassies check eligibility and assess applications", "Selection results published", "Grants awarded", "The Dutch institution can give you more information on the\nvarious steps involved in the application and selection procedures, as\nwell as the eligibility criteria. You can find contact information for\nthe Dutch institutions on ", "www.studyfinder.nl", "For More Information:", "Visit the Official Webpage of the Netherlands Fellowship Programmes (NFP) – Orange Knowledge Programme (OKP) 2019 "], "url : https://www.opportunitiesforafricans.com/netherlands-fellowship-programmes-nfp-orange-knowledge-programme-okp-2019-2/"], [["Higherlife Foundation Joshua Nkomo Scholarships 2019 for Zimbabwean citizens.", "date announced:February 6, 2019", " Higherlife Foundation is offering Joshua Nkomo Scholarships for students referred to as “Joshualites”. The scholarships are available to Zimbabwean citizens under the age of 21 at the time of applying. A-level scholarships are for candidates starting Lower 6th and University scholarships are for candidates entering 1st year undergraduate studies. 70% of the scholarships will be for Science, Technology, Engineering & Mathematics (STEM) studies, whilst 30% is reserved for other disciplines. "], [" Higherlife Foundation is offering ", "Joshua Nkomo Scholarships", " f", "or students referred to as “Joshualites”. The scholarships are available to Zimbabwean citizens under the age of 21 at the time of applying. A-level scholarships are for candidates starting Lower 6th and University scholarships are for candidates entering 1st year undergraduate studies. 70% of the scholarships will be for Science, Technology, Engineering & Mathematics (STEM) studies, whilst 30% is reserved for other disciplines. ", "The ", "Joshua Nkomo Scholarship", " is a merit-based scholarship programme that focuses on identifying young Zimbabwean talent through a rigorous selection process and creating the opportunity for them to get the best and most relevant education at world-class local and overseas tertiary learning institutions. The scholarships are available to Zimbabwean citizens who are under the age of 21 at the time of applying.", "Requirements:", " A student with Academic Merit as determined by applicant performance in public examinations (mainly ZIMSEC and Cambridge). For A-Level applications, a minimum of SEVEN (7) “A” grade passes is required and for University applications, a minimum of TEN (10) points for females  and TWELVE (12) points for males is required. ", "\nLeadership Potential as demonstrated by levels of responsibility and\noffice bearing in the School and surrounding; Community Engagement, as\nwell as confirmed indications of Community Engagements and\nextra-curricular activity; Personal Integrity as deduced from School\nReports and reports from other responsible authorities.\n", "Documentation Required", "A student will need to submit Academic certificates/public exam\nresults, Birth Certificate, National ID and a Character Reference Form ", "(Download Here)", ".", "NB.", " Reference Form to be hand delivered to any Higherlife Foundation office", "For More Information:", "Visit the Official Webpage of the Higherlife Foundation Joshua Nkomo Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/higherlife-foundation-joshua-nkomo-scholarships-2019-for-zimbabwean-citizens/"], [["Commonwealth Distance Learning Scholarships 2019/2020 for study in the United Kingdom (Fully Funded)", "date announced:February 4, 2019", "Application Deadline: midday 12.00 PM (BST) on 22 March 2019 "], ["Application Deadline: midday ", "12.00 PM (BST)", " on ", "22 March 2019", " ", "Commonwealth Distance Learning Scholarships", " ", "are offered to citizens from low middle income Commonwealth countries. These scholarships are funded by the UK Department for International Development (DFID), with the aim of contributing to the UK’s international development aims and wider overseas interests, supporting excellence in UK higher education, and sustaining the principles of the Commonwealth.", "Purpose:", " ", "To contribute to development needs of Commonwealth countries by providing training for skilled and qualified professionals in key development areas.", "Intended beneficiaries:", " ", "High-quality postgraduate students who wish to access training not available in their home countries, who wish or need to remain in their home country while they study, and who have the potential to enhance the development of their home countries with the knowledge and leadership skills they acquire.", "Eligibility", "To be eligible for a Commonwealth Distance Learning Scholarship, candidates should:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in a low middle income Commonwealth country", "Hold a first degree of at least upper second class (2:1) standard. A lower qualification and sufficient relevant experience may be considered in certain cases.", "Be unable to afford to study the programme without this scholarship.", "Eligible Countries", "Bangladesh", " Cameroon", " Eswatini", " Ghana", " Guyana", " India", " Kenya", " Kiribati", " Lesotho", " Malawi", " Mozambique", " Nigeria", " Pakistan", " Papua New Guinea", " Rwanda", " Samoa", " Sierra Leone", " Solomon Islands", " Sri Lanka", " Tanzania", " The Gambia", " Tuvalu", " Uganda", " Vanuatu", " Zambia", "Benefits:", " Commonwealth Distance Learning Scholarships provide full tuition fees and all other compulsory costs of studying a UK Master’s programme by distance learning. This includes the full cost of any residential components of a course. ", "Selection process", "Each participating UK University will conduct its own recruitment\nprocess to select a specified number of candidates for Distance Learning\nScholarships. Universities must put forward their selected candidates\nto the CSC by  29th April 2019. The CSC will then confirm that these\ncandidates meet the eligibility criteria for this scheme. Universities\nwill inform candidates of their results by July 2019.", "Selection criteria include:", "Academic merit of the candidate", "Potential impact of the work on the development of the candidate’s home country", "How to apply", "You should apply to study an eligible Master’s course at a UK\nuniversity that is participating in the Distance Learning scheme. Click\nhere for a ", "list of participating universities and eligible courses", ".", "You must also secure admission to your course in addition to applying for a Distance Learning Scholarship. ", "You\nmust check with your chosen university for their specific advice on\nwhen to apply, admission requirements, and rules for applying.", " You\nmust make your application using the CSC’s online application system,\nin addition to any other application that you are required to complete\nby your chosen university. The CSC will not accept any applications that\nare not submitted via the online application system.", "You can apply for more than one course and/or to more than one\nuniversity, but you may only accept one offer of a Distance Learning\nScholarship.", "All applications must be submitted by midday ", "12.00 PM (BST)", " on ", "22 March 2019 a", "t the latest.", "Your application must include the following supporting documentation\nby 12:00 PBST) on 5 April 2019 in order for your application to be\neligible for consideration:", "Copy of your valid passport or national ID card showing your\nphotograph, date of birth, and country of citizenship – uploaded to the\nonline application system", "At least one reference – submitted directly by the referee to the\nonline application system. Referees will be sent an email request\nhowever applicants are responsible for seeking permission from their\nreferees in advance of submitting their application; for ensuring that\ntheir referees are available to complete the reference by the deadline;\nand that the referees have received the reference request email.", "An offer letter to start your chosen course of study in the 2019-2020 academic year – uploaded to the online application system", "Full transcripts detailing all your higher education qualifications\n(with certified translations if not in English) – uploaded to the online\napplication system", "For More Information:", "Visit the Official Webpage of the Commonwealth Distance Learning Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/commonwealth-distance-learning-scholarships-2019-2020/"], [["Anita Borg Institute Grace Hopper Celebration of Women in Computing Scholarships 2019 (Funded to Attend GHC Conference 2019, Orlando, FLorida USA)", "date announced:January 17, 2019", "Application Deadline: March 6, 2019 at 5 p.m. PT. "], ["Global Action Climate Summit", "Application Deadline: ", "March 6, 2019 at 5 p.m. PT.", " ", "The GHC Scholarships", " provide funds for undergraduate students, graduate students, and faculty to attend our three-day Celebration. Scholars who attend GHC gain access to career and academic workshops, networking opportunities, and memories that will last a lifetime. ", "Student Eligibility", "You must be a full-time student enrolled in an accredited degree program at a college, university, or high school at the time of applying.", "You must be a full-time student enrolled in an accredited degree program at a college or university at the time of the Celebration (October 2019). Those graduating prior to the Celebration are not eligible unless accepted to another related degree program (such as a M.S. or Ph.D. program).", "Show satisfactory progress toward a degree such as, ", "but not limited to", ", computer science, computer engineering, or a related technical discipline such as electrical engineering, human-computer interaction, math, physics, or management information systems.", "Be able to demonstrate an interest in computing.", "You cannot have been an AnitaB.org-GHC Scholarship recipient in 2018.", "You must be at least 18 years of age by October 2, 2019.", "You cannot accept more than one scholarship to attend GHC.", "If you receive a scholarship and do not notify AnitaB.org that you cannot attend prior to the Celebration, you will not be eligible in future years as this takes a scholarship away from another student that could have attended.", "Student Scholars", "Student scholars are active in their community, including being\ninvolved with campus computing/STEM clubs and working toward the\nadvancement of women in computing.", "Student scholars have an understanding of how attending GHC will\nhave an impact on them and any messages or key learnings they take back\nto share at their schools.", "Scholarship Details", "Student and Faculty Scholarships include:", "Individual Registration for the three-day Celebration.", "Hotel accommodations (arranged by AnitaB.org). Student Scholars will be assigned a roommate. Faculty Scholars will be assigned their own room.", "Airfare booked and paid for by AnitaB.org Travel Consultant.", "Travel stipend (if used wisely, stipend is expected to cover transportation costs to and from the airport, baggage fees, meals, and other travel incidentals).", "We will provide the stipend when you pick up your badge at GHC. Scholars pay upfront for travel day meals and taxis/shuttles to the GHC venue.", "Faculty Eligibility", "You must be teaching at an accredited college or university at the\ntime of the conference. We do not award scholarships to High School\nteachers, as the conference does not provide programming for K-12.", "You must teach in a degree program such as, but not limited to,\ncomputer science, computer engineering, or a related technical\ndiscipline such as electrical engineering, human-computer interaction,\nmath, physics, or management information systems.", "If you receive a scholarship and do not notify AnitaB.org that you\ncannot attend prior to the Celebration, you will not be eligible in\nfuture years as this takes a scholarship away from another faculty that\ncould have attended.", "Faculty scholar?", "Faculty scholars mentor female students.", "Scholars are active in computing community, providing support to computing clubs and/or organizations.", "GHC will have an impact on the scholar and the message the scholar takes back to her or his school and community.", "For More Information:", "Visit the Official Webpage of the GHC 19 Scholarships", "GHC 19 Scholarships"], "url : https://www.opportunitiesforafricans.com/anita-borg-institute-grace-hopper-celebration-of-women-in-computing-scholarships-2019/"], [["The Fondation Sciences Mathématiques de Paris (FSMP) mathematical sciences Scholarships 2019-2020 for study in France (Funded)", "date announced:January 18, 2019", "Application Deadline:"], ["Application Deadline:", " The Fondation Sciences Mathématiques de Paris (FSMP)", " has launched several calls for applications. FSMP offers scholarships at Master’s and PhD levels and funding for research chairs and postdoctoral positions in Paris. ", "The\nFondation Sciences Mathématiques de Paris offers to students, selected\nthrough an online application process, some scholarships of 1 or 2 years\nin one of the universities of its network. The laureates will be\nable to register to the universities of the FSMP network. They will\nbenefit from a range of courses based on the skills of the whole\nparisian laboratories in mathematical sciences research.", "This program is supported in particular by the French Embassies in ", "South Africa and Lesotho,", " Albania, Austria, Bolivia, Cameroon, ", "Korea,", " Hungary, Iran, Iceland, Japan, Madagascar, Nigeria, ", "Quebec,", "Romania\nand Togo. Ukraine, Sudan, Uruguay and Vietnam; as well as by Paris\nSciences Lettres University (PSL), INRIA, and Paris 13 University\n(LAGA).", "The French Embassy will co-fund two scholarships for South African Master’s degree students. ", "The Fondation Sciences Mathématiques de Paris (FSMP) is an excellence\nnetwork in mathematics and fundamental computer science in Paris.", " ", "Paris Graduate School of Mathematics (PGSM)", ": Scholarships’ program at Master’s degree level of 1 or 2 years in one of the universities of FSMP network. ", " The", " French Embassy will provide two social coverage scholarships", " which will give the South African students selected the status of French government scholarship holders and will cover travel expenses from and to South Africa. ", "Eligibility criteria", "All candidates must have a Master degree (or equivalent) at the time of their enrollment and should speak French or English.", "There is no nationality or age criteria but the applicant must :", "* Not have resided or carried out their\nmain activity (work, studies, etc.) in France for more than 12 months in\nthe 3 years immediately before the deadline of the call (April, 1st of\n2019).", "* At the time of the call deadline\n(April, 1st 2019), all applicants must be in the first four years\n(full-time equivalent research experience) of their research career and\nhave not been awarded of a doctoral degree.", "Deadlines for applications:", "January 26th 2019", ": for students who carried out a bachelor degree or a first year of master outside of France.", "May 10th 2019", ": for the same students above mentioned\nand students who carried out a bachelor degree or a first year of master\nin one of the universities of the FSMP’s network.", " ", "MathInParis", ": The ", "international Doctoral Training in Mathematical Sciences in Paris", " – MathInParis – cofunded by Marie Sklodowska-Curie Actions offers ", "40 PhD fellowships", "\nwithin the framework of the European Horizon 2020 program “Marie\nSklodowska-Curie Co-funding of Regional, National and International\nProgrammes”", "For More Information:", "Visit the Official Webpage of the FSMP mathematical sciences Scholarships 2019-2020 "], "url : https://www.opportunitiesforafricans.com/fsmp-mathematical-sciences-scholarships-2019-2020/"], [["NFP/MSP (MENA) Scholarship Programme 2019/2020 for Study in the Netherlands (Fully Funded)", "date announced:February 7, 2019", "Application Deadline:Varying by Institution"], ["Application Deadline:Varying by Institution", " ", "The MENA Scholarship Programme (MSP)", " ", "offers scholarships to professionals for short courses in the Netherlands. ", "Aim", "The overall aim of the MSP is to contribute to the\ndemocratic transition in the participating countries. It also aims at\nbuilding capacity within organisations by enabling employees to take\npart in short courses in the Netherlands. ", "While the scholarship is awarded to individuals, all candidates\nmust be nominated by their employer to be able to participate. The need\nfor training has to be demonstrated in the context of the organisation\nthe applicant is employed by. ", "Target group", "The MSP is open to professionals who are nationals of – and living and working in – one of the countries listed below: ", "Algeria", "Egypt", "Iran", "Iraq", "Jordan   ", "Lebanon", "Libya", "Morocco", "Syria *", "Tunisia", "MSP is not currently open to applicants applying from Syria. Applicants with the Syrian nationality may apply if they are residing and working in one of the other MSP countries on the list.", " To be eligible for an MSP scholarship:", " ▪ one must be a professional and national of, and living and working in one of the countries on the MSP country list valid at the time of application;", " ▪ one must have a current employer’s statement that complies with the format Nuffic has provided. All information must be provided and all commitments that are included in the format must be endorsed in the statement;", " ▪ one must not be employed by an organisation that has its own means of staff-development. Organisations that are considered to have their own means of staff development are for example:", " multinational corporations (e.g. Shell, Unilever, Microsoft);", "large national and/or a large commercial organisation;", "bilateral donor organisations (e.g. USAID, DFID, Danida, Sida, Dutch ministry of Foreign affairs, FinAid, AusAid, ADC, SwissAid);", "multilateral donor organisations, (e.g. a UN organisation, the World Bank, the IMF, Asian Development Bank, African Development Bank, IADB);", "international NGO’s (e.g. Oxfam, Plan, Care).", " ▪ one must have an official and valid passport (valid at least 3 months after the candidate submission date);", " ▪ one must have a government statement that meets the requirements of the country in which the employer is established (if applicable);", "▪ the age of the MSP candidate must not exceed 45 years of age at the time of the grant submission.", " ▪ the candidate must not receive more than one MSP scholarship for courses that take place at the same time.", " How to apply", " Before you apply, make sure you review the eligibility criteria carefully and check whether your employer is willing to nominate you for the scholarship.", " When you are certain that you are eligible for an MSP scholarship, you can start making the necessary preparations for your application.", " Follow these steps to apply:", "Select a course on the MSP course list", "Contact the Dutch higher education institution that is offering the course for information on:", " ▪ course content", " ▪ the application deadline (deadlines can differ per Dutch institution)", " ▪ the application and selection procedures", " ▪ the online application form and the supporting documents", "Prepare your application and the supporting documents1", "Submit your online application via the Dutch institution offering the course", " For any questions on the application -and selection procedures please contact the Dutch institution directly www.studyfinder.nl", "How to Apply:", "1. Select a course on the MSP course list", "MENA Scholarship Programme (MSP) Course list for short courses", "2. Contact the Dutch institution that is offering the course for information on:", "course content", "the application deadline (deadlines can differ per Dutch institution)", "the application and selection procedures", "the online application form and the supporting documents ", "3. Prepare your application and the supporting documents ", "4. Submit your online application via the Dutch institution offering the course", "\nWith your online application, you will be asked to upload a valid\npassport copy, a current statement from your employer, and depending on\nyour country of employment; a government statement. \n", "Selection procedure", "If your application meets all the course admission requirements and\nthe MSP eligibility criteria, you can be nominated by the Dutch\ninstitution for a scholarship. The Dutch institution will inform you\nabout the outcome of your selection. ", "The scholarships are awarded in a competitive selection to highly\nmotivated professionals who are in a position to introduce the\nnewly-acquired skills and knowledge into their employing organisation. ", "For any further questions concerning the MSP application and\nselection procedures, please contact the Dutch institution offering the\ncourse directly. You can find contact information for all institutions\non ", "studyfinder.nl", ".", "For More Information:", "Visit the Official Webpage of the NFP/MSP (MENA) Scholarship Programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/nfp-msp-mena-scholarship-programme-2019-2020/"], [["Fulbright Foreign Student Program 2019/2020 (Masters & PhD) Scholarships for study in USA (Fully Funded)", "date announced:February 2, 2019", "Application Deadline: Varying by Country"], ["Application Deadline: Varying by Country", "The Fulbright Foreign Student Program", " enables graduate students, young professionals and artists from abroad to study and conduct research in the United States. The Fulbright Foreign Student Program operates in more than 155 countries worldwide. Approximately 4,000 foreign students receive Fulbright scholarships each year.", " The program is designed primarily to strengthen capacities of African universities through higher degree training and to develop the potential of their academic staff.  It is targeted at young and exceptionally promising faculty members who wish to conduct their doctoral research in the United States.  ", "Applicants", "The ", "Fulbright Program for Foreign Students", " is administered by ", "binational Fulbright Commissions/Foundations or U.S. Embassies", ". All Foreign Student Program applications are processed by these offices.", "Program eligibility and selection procedures vary widely by country", "Scholarship Worth", "Funding for the whole duration of the program", "Tuition fee,", "Airfare", "Living Stipend", "Health Insurance", "Click ", "here", " to find information about the Fulbright Program in your home country, including eligibility requirements and application guidelines.", "For More Information:", "Visit the Official Webpage of the Fulbright Foreign Student Program 2019/2020 (Masters & PhD) Scholarships"], "url : https://www.opportunitiesforafricans.com/fulbright-foreign-student-program-2019-2020/"], [["DAAD In-Country/In-Region PhD Scholarships 2019 – Eastern Africa", "date announced:January 29, 2019", "Application Deadline: Sunday 24th February 2019 at 5.00pm. "], ["Application Deadline: ", "Sunday 24th February 2019 at 5.00pm", ". ", "The German Academic Exchange Service (", "DAAD", ") in collaboration with ", "The Initiative to Develop African Research Leaders (IDeAL), KEMRI-Wellcome Trust Research Programme (KWTRP)", " and ", "Strathmore University", " are pleased to announce that they are offering up to 5  PhD scholarships in Health Management.", "We invite highly qualified candidates to apply for these\nscholarships. Potential candidates are invited to read the application\ninformation below and should strictly adhere to the set guidelines while\nsubmitting their applications.", "Value of Scholarships", "The scholarship includes full tuition fees, monthly stipend at DAAD\nrates, limited contribution research costs. However, please note that\nthis is not a full scholarship, as DAAD will only provide funding as\nstated in the scholarship information sheet.", "Successful applicant will be registered at Strathmore University and\nsupervised by renowned health systems researchers from the university\nand the KEMRI-Wellcome Trust Research Programme. They will also have\naccess to various generic skills training offered by IDeAL", "Eligibility", "The Scholarship is open to ", "citizens of a country in Sub-Saharan Africa.", "You must have Bachelor’s and/or Master’s degree qualification with at least above average results", "You should have proof of admission to Strathmore University for the indicated programme or official letter assuring admission.", "Eligible program/field of study:", "Applications for DAAD PhD scholarships at Strathmore University ", "must", " be in the following program/field of study:", "PhD in Healthcare Management", "Relevance to development", "PhD proposals must demonstrate relevance to development.", "Duration and Commencement", "Scholarships are available for up to a maximum of three years. The\nscholarship will be initially granted for one year and may be extended\nupon individual application to DAAD", "Application Procedure and Deadline", "To apply for the scholarship, you first need an admission letter from Strathmore University as the host institution.", "Applications for these scholarships are will be managed jointly by IDeAL and Strathmore University.", "\nApplications should be submitted to Strathmore University no later than ", "Sunday 24th February 2019 at 5.00pm", ".", "Application Documents", "Submit ", "all ", "the documents listed in the ", "Requirements for Application", " document and the DAAD information sheet 2019/2020. Please download the requirements document ", "here", ". Please note that incomplete applications will not be considered.", "Click ", "here", " to download the Reference Form.", "Click ", "here", " to download the Graduate Application Form.", "Click ", "here", " to download the DAAD Information Sheet.", "Contact:", "Dr. Sam Kinyanjui,", "\nDirector, IDeAL and Head of Training, KWRTP", "\nKEMRI-Wellcome Trust Research Programme.", "\nTel: +254 709 983000", "\nEmail: ", "[email protected]", "Prof. Ruth Kiraka,", "\nDean, School of Graduate Studies,", "\nStrathmore University.", "\nTel: 0703 034258/497/397", "\nEmail: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the DAAD In-Country/In-Region PhD Scholarships Eastern Africa"], "url : https://www.opportunitiesforafricans.com/daad-in-country-in-region-phd-scholarships-2019-eastern-africa/"], [["New Zealand Commonwealth Scholarships 2019/2020 for postgraduate study (Masters and PhD) in New Zealand Universities (Fully Funded)", "date announced:February 1, 2019", "Application Deadline: 28 march 2019 at 12:00 pm NZ Time. "], ["Application Deadline: 28 march 2019 at 12:00 pm NZ Time. ", "New Zealand Commonwealth Scholarships", " are prestigious scholarships that recognise New Zealand’s history and ties to the Commonwealth. The Commonwealth Scholarships are part of the", " Commonwealth Scholarship and Fellowship Plan (CSFP)", " – an international programme under which Commonwealth countries offer scholarships and fellowships to citizens of other Commwealth states. The purpose of the scholarships is set out in the ", "Commonwealth Scholarship and Fellowship Plan (external link)", ", with the following key principles to:", "promote mutual cooperation and share educational experience among all Commonwealth countries", "be available across the Commonwealth", "recognise and promote the highest level of intellectual achievement.", "NZ Commonwealth Scholarships are funded by the New Zealand Aid Programme, the New Zealand Government’s overseas aid and development programme. They are managed by the New Zealand Ministry of Foreign Affairs and Trade (MFAT).", "Eligible Commonwealth countries:", "\nAfrica\n", "\nBotswana, Cameroon, Ghana, Kenya, Lesotho, Malawi, Mauritius,\nMozambique, Namibia, Nigeria, Rwanda, Sierra Leone, South Africa,\nSwaziland, Tanzania, Uganda, Zambia.", "Levels of study available:", "You can study these qualifications at one of eleven New Zealand universities and education institutions:", "Postgraduate Certificate (6 months)", "Postgraduate Diploma (1 year)", "Master’s Degree (1-2 years)", "PhD (up to 3.5 years)", "Financial benefits", "Our scholarships provide the following financial support:", "full tuition fees", "living allowance (stipend) – NZ$480 per week. This is  a contribution to basic living expenses", "an establishment allowance – NZ$3000. This is a contribution to assist with set up costs in New Zealand – for example  it can be used towards accommodation expenses, text books, study materials", "medical and travel insurance", "travel to and from your home country – this is for travel from your home country at the start of the scholarship, and for you to return to your home country at the end of your scholarship. Note that we offer our scholarships for the shortest amount of time needed for you to complete the academic programme.", "home leave or reunion travel for some scholars", "assistance with research and thesis costs for many postgraduate research students", "How to apply", "The application process for a New Zealand Commonwealth Scholarship is different to other New Zealand Scholarships. Applicants must submit their applications to their country’s ‘Nominating Agency’ first. The Nominating Agency then ‘nominates’ two applicants from the submitted applications to send to the New Zealand Ministry of Foreign Affairs and Trade. Read the Commonwealth section of the ", "How to Apply ", "page carefully before you submit an application.", "Application Process:", "The application process for a New Zealand Commonwealth Scholarship is different to other New Zealand Scholarships. Applicants must submit their paper applications to their country’s ‘Nominating Agency’ first. The Nominating Agency then ‘nominates’ two applicants from the submitted applications to send to the New Zealand Ministry of Foreign Affairs and Trade. Read the below information carefully before you submit an application.", "Note: Applications are open, and will close on 28 March. ", "Applications must arrive at your country’s Commonwealth Nominating Agency by 28 march 2019 at 12:00 pm NZ Time. ", "Application Procedure", "Follow these four steps:", "Step 1: Confirm your eligibility", "Complete\nthe Online Eligibility Test to see if you are eligible to apply. If the\nOnline Eligibility Test confirms that you are eligible, you will get an\neligibility code (number).", "This eligibility code displays on your\nscreen at the end of the test. You need this eligibility code in Step\n3. Please write down your eligibility code.", "Step 2: Create a login to access New Zealand government forms online", "To\naccess any online form for a New Zealand government department, first\nyou need to register online. This registration system is called RealMe.\nYou will need a RealMe login (username and password) to access the\nonline New Zealand Scholarship application form. You also need the same\nRealMe login to apply for a student visa if you get a scholarship.", "Please\nremember your RealMe username and password. You need this login to\nview, edit and submit your New Zealand Scholarship application form.", "Note:", " You will not need to verify your RealMe account with a post office. This is only necessary for New Zealanders.", "Step 3: Register with New Zealand Scholarships online application system", "Use your eligibility code from Step 1 to register online with the New Zealand Scholarships online application system.", "Note:", " Steps 2 and 3 require you to register with two different IT systems.", "Step 4: Complete and submit your application before the closing date", "Use\nyour RealMe login to access the New Zealand Scholarship online\napplication system anytime between the opening and closing dates for\nyour country.", "Check the opening and closing dates for your country", "For More Information:", "Visit the Official Webpage of the New Zealand Commonwealth Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/new-zealand-commonwealth-scholarships-2019-2020/"]]