[[["Australia Africa Awards Masters Scholarships 2019 for Study in Australia (Fully Funded)", "date announced:September 1, 2018", "Application Deadline: 3rd December 2018"], ["Application Deadline: 3rd December 2018", "Australia Awards, ", "a cornerstone of the Australian Government’s development assistance program for Africa, provide access to postgraduate education, training and professional development opportunities for suitably qualified Africans from eligible countries. On their return to the workplace, Australia Awards Alumni are expected to contribute actively to development in their home countries.", " ", "Australia Awards Scholarships", " ", "are postgraduate scholarships that lead to an academic qualification from an Australian university. The objective of the Awards is to provide high quality education and training to talented Africans who will be in a position, on their return home, to make an important contribution to national or regional development.", "Australia Awards Scholarships are currently being offered at Master degree level. Focus sectors reflect areas that have been identified as priorities by partner governments and in which Australia is recognised as having world-class expertise and experience.", "\nAustralia Awards aim to promote knowledge, education links and enduring ties between Australia and our neighbours through Australia’s extensive scholarship programs. The initiative aims to build a new generation of global leaders with strong links to Australia.", "Award types include:", "Australian Awards Scholarships, to undertake higher degree studies in Australia at Masters level.", "Australia Awards Short Courses, to undertake short-term, targeted professional training courses, in Australia and/or in Africa, in a range of development-focused sectors.", "Priority areas are:", "Agricultural Productivity", "Extractives ", "and Natural Resource Management", "Public Policy (especially those focussed on governance and economic policy, including trade policy)", "Applications from exceptional candidates will also be considered in the following sectors:", "Education", "Environment", "Gender Studies", "Health", "Infrastructure", "Eligibility Criteria", "The following countries are eligible for Scholarships:", "Botswana", "Ghana", "Kenya", "Malawi", "Mauritius", "Madagascar", "Mozambique", "Nigeria", "South Africa", "Tanzania", "Zambia", "Requirements:", "Citizen of an eligible African country", "Minimum academic requirement: Bachelor’s degree or equivalent", "Mid-level to senior-level professional, currently employed in a relevant field", "Meet relevant post-graduate work experience requirements", "Demonstrate a clear vision of how the knowledge gained through the scholarship will be used to improve policy, practice or reform in their home country", "Satisfactory English proficiency to enable full participation in a training course delivered in English", "Satisfy all requirements of the Australian Government for the appropriate student visa (subclass 500).", "English Language requirements and support", "All studies undertaken under Australia Awards are in English and, for postgraduate studies at an Australian University, a high level of English proficiency is required.", "English requirements for Masters Awards", ":", "Candidates for Masters Awards may be required to sit a language proficiency test as part of the selection and course placement process. Language proficiency is tested through the International English Language Testing System (IELTS), an internationally recognised practical English language assessment used by those seeking international education. Alternatively, candidates requiring evidence of English Language Proficiency may also use Test of English as a Foreign Language (TOEFL) results. If you are submitting IELTs or TOEFL scores with your application, they should not be more than one year old at the time you make your application.", "Australia Awards Masters Scholarship", "Entitlements for holders of a Masters Scholarship include the following:", "The full costs of tuition fees for up to two years", "An economy class flight to and from Australia. Note: Excess baggage and travel insurance charges are not covered", "An approximate annual stipend of AUD30,000 to cover living expenses while on-Award in Australia", "Overseas Student Health Cover (OSHC), which covers basic medical costs", "A once-off Establishment Allowance of AUD5,000 to assist with the costs of starting life in Australia and commencing the course (e.g. course books and materials, rental deposits, household items, etc.)", "Awardees, whose families remain in their home country, may be entitled to a reunion airfare allowing them to travel home, midway through the course. This is only available to Awardees whose course is for two years or longer", "How to Apply:", "Apply by selecting your country in the Map", "In order to apply for a Masters Scholarship in Australia, you will first need to find the course at an Australian university.", "For more information please visit ", "www.studyinaustralia.gov.au", "For More Information:", "Visit the Official Webpage of the Australia Awards Masters Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/australia-awards-masters-scholarships-2019/"], [["Canon Collins Trust LLB Scholarships 2019 for study at the University of the Western Cape & University of Fort Hare – South Africa (Funded)", "date announced:September 13, 2018", "Application Deadline: Sunday 7th October 2018."], ["Application Deadline: ", "Sunday 7th October 2018.", "Canon Collins Trust invites applications from current 3rd year students (going into their 4th year in 2019) studying for an LLB at the University of the Western Cape & University of Fort Hare.", "Leigh Day LLB scholarship at University of the Western Cape", "The Leigh Day Scholarships are for fourth year study in Law at the ", "University of Western Cape", ".", "Are you eligible?", "To apply for this scholarship you must be:", "A current third year LLB student at the University of the Western Cape", "A South African citizen normally resident in South Africa", "In possession of good results for completed years of study, or be able to demonstrate improvement.", "What we offer", "Awards will be R40,000 per academic year.", "How to apply", "We are now open for applications. Please refer to the ", "guidelines ", " for more information on this scholarship, and apply by downloading the ", "application form", " and submitting it to ", "[email protected]", " no later than ", "Sunday 7th October 2018.", "Leigh Day LLB scholarship at University of Fort Hare", "The Leigh Day Scholarships are for fourth year study in law at the ", "University of Fort Hare", ".", "Are you eligible?", "To apply for this scholarship you must be:", "A current third year LLB student at the University of Fort Hare", "A South African citizen normally resident in South Africa", "In possession of good results for completed years of study, or be able to demonstrate improvement.", "What we offer", "Awards will be R40,000 per academic year.", "How to apply", "We are now open for applications. Please read the ", "guidelines ", "for more information about this scholarship and apply by downloading the ", "application form", ". Completed applications should be sent to ", "[email protected]", " no later than ", "Sunday 7th October 2018.", "Leigh Day LLB scholarship at University of Fort Hare", "Apply", "Leigh Day LLB scholarship at University of the Western Cape", "Apply", "For More Information:", "Visit the Official Webpage of the Leigh Day Scholarships"], "url : https://www.opportunitiesforafricans.com/canon-collins-trust-llb-scholarships-2019/"], [["Johnson & Johnson WiSTEM2D Scholars Award Program 2019 for female leaders in STEM discipline ( $150,000 award)", "date announced:September 10, 2018", "Application Deadline:September 25, 2018. "], ["Application Deadline:", "September 25, 2018. ", "The Johnson & Johnson Scholars Award Program", " ", "aims to fuel the development of female STEM", "2", "D leaders and feed the STEM", "2", "D talent pipeline by awarding and sponsoring women at critical points in their research careers, in each of the STEM", "2", "D disciplines: Science, Technology, Engineering, Math, Manufacturing and Design.", "The awards will fund one woman per discipline who has completed her advanced degree, who is working as an assistant professor and who is not yet tenured at an accredited university or design institution. The goal is to fuel the research passion of the awarded women and inspire career paths in their respective STEM", "2", "D fields.", "The Scholars Award is a three-year award in the gross amount of $150,000, which will be paid to the University (the “Recipient”) for the benefit of the Johnson & Johnson Scholar and her research, with the understanding that the Recipient will administer the funds. The Scholars Award will be paid in three (3) installments of U.S. $50,000 per year of the three-year scholarship period, payable in 2019, subject to compliance with the terms and conditions of the program’s Agreement.", "Requirements:", "You must be a woman working in the field(s) of Science, Technology, Engineering, Mathematics, Manufacturing and Design (STEM", "2", "D).", "You must be an assistant female professor or global equivalent faculty position at the time of application at an accredited academic university, institution or design school.", "The female scholar should have a minimum degree for the appropriate field:", "Science; M.D., Ph.D.", "Technology; Ph.D.", "Engineering; Ph.D.", "Math; M.S., Ph.D.", "Manufacturing; Ph.D.", "Design; M.A., M.S., MDes, MArch, MFA, MLA, Ph.D.", "Application Procedure:", "In addition to general contact details and demographics, the scholar applicant is responsible for the provision of documents into the ", "application ", "system, including non-confidential letters of recommendation.", "Submit a department head letter of recommendation (", "One applicant per university per letter of ", "STEM", "2", "D", ")", ".", "Write 1,000 words (plus one page of images) detailing your proposed area of research.", "Create and submit a one- to three-minute digital video describing, as simply as possible, the impact of the research on your area of STEM", "2", "D and your own personal impact as a potential future leader in STEM", "2", "D.", "Submit your resume (three pages, font size 11), including a list of publications, presentations, abstracts, current financial support already obtained, other folio work and two references.", "Submit a brief outline of your budget for proposed research.", "For More Information:", "Visit the Official Webpage of the Johnson & Johnson WiSTEM2D Scholars Award Program 2019 "], "url : https://www.opportunitiesforafricans.com/johnson-johnson-wistem2d-scholars-award-program-2019/"], [["Adobe Research Women-in-Technology Scholarship 2019 for Undergraduate Females Studying Computer Science ($USD10,000 Award)", "date announced:August 29, 2018", "Application Deadline: September 28th, 2018 at 5pm Pacific Time. "], ["Application Deadline: ", "September 28th, 2018 at 5pm Pacific Time. ", "The Adobe Research Women-in-Technology Scholarship", " recognizes outstanding undergraduate and masters female students anywhere in the world who are studying computer science.", "Eligibility Requirements:", "In order to be eligible for the 2019 Adobe Research Women-in-Technology Scholarship, applicants must meet all of the following criteria:", "Be a female student currently enrolled as an undergraduate or masters student at a university for the 2018-2019 academic year.", "Intend to be enrolled as a full-time undergraduate or masters student at a university for the 2019-2020 academic year.", "Be majoring in computer science, computer engineering, or a closely related technical field.", "Maintain a strong academic record", "Not have a close relative working for Adobe Research.", "Applications must include:", "A resume", "Academic transcripts from your current and/or past institution", "Three references (our online application system will request letters from your references via email)", "Answers to up to four essay questions, which will be available when we start accepting applications", "An optional 60-second video or multimedia submission describing your dream career.", "Scholarship Worth:", "The Adobe Research Women-in-Technology Scholarship includes:", "A $10,000 award paid once.", "A Creative Cloud subscription membership for one year.", "An Adobe Research mentor.", "An opportunity to interview for an internship at Adobe.", "Selection Criteria:", "The deadline for submitting a completed Women-in-Technology application is September 28th, 2018 at 5pm Pacific Time.", " ", "A committee of Adobe researchers will review all applicants and select the winners at their discretion.", "Recipients are selected based on their academic record, a personal statement, and three letters of reference.", "Students may be invited for phone interviews following the initial review.", "Scholarship recipients will be announced by November 21, 2018.", "If you have questions, please email ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the Adobe Research Women-in-Technology Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/adobe-research-women-in-technology-scholarship-2019/"], [["National Research Foundation (NRF) Honours & Final Year B-Tech Block Grant Bursaries Call 2019 for young South Africans.", "date announced:September 12, 2018", "Application Deadline: 14 December 2018"], ["Application Deadline: ", "14 December 2018", "The National Research Foundation (NRF)", " awards bursaries to students pursuing full-time Honours’ and final year B Tech studies at South African public universities.", "These bursaries are awarded to ", "South African citizens and South African permanent residents only", " and are released as Block Grants to South African public universities that nominate students that have applied for an Honours’ and final year B Tech bursaries.", "Students must submit an application on the NRF Online Submission system at: ", "https://nrfsubmission.nrf.ac.za", " and follow the application process set out in the attached Framework Document and Application Guide.  ", "South African citizens and South African permanent residents living with a disability are encouraged to apply. ", "For more details, applicants must read the ", "NRF Honours’ and final year B Tech Bursaries Framework Document", " which highlights the eligibility criteria and requirements for each funding category.", "Attachments", "\nApplicants’ must attach the following documents in the attachment section of the online application:", " Certified South African Identity Document. (Should be uploaded under Registration details)", "Certified academic record or, in case of applicants with outstanding fees due to the university, attach an official letter that is stamped and signed, stating that the transcript is not issued due to outstanding fees owed to the university.", "Proof of NSFAS or University Financial Aid funding for applicants that have indicated that they were previously funded by NSFAS or received University Financial Aid funding.", "Applicants with disabilities must upload a medical certificate, in support of the disability.", "Please Note the following:", "The call will be accessible on the NRF Online Submission system at: ", "https://nrfsubmission.nrf.ac.za", " from ", "5 September 2018", ".", "The NRF deadline for submission of applications is ", "14 December 2018", ".", "Institutions will nominate students for a bursary award on the NRF Online Submission System, based on the Block Grant allocation to each institution and set equity targets. This nomination process will take place from ", "23 January 2019 to 28 February 2019.", "NRF will review the nominations and communicate the outcomes to the institutions. If the nomination is approved by the NRF, the institution will have to upload and submit the duly signed and initialed agreement form and all the relevant documentation no later than ", "22 March 2019. ", "Unspent or unclaimed institutional funds under this allocation will automatically be cancelled by ", "28 June 2019", ".", "Institutions must report on student completion by ", "31 March 2020", " on the NRF student completion database.", "For More Information:", "Visit the Official Webpage of the National Research Foundation (NRF) Honours & Final Year B-Tech Block Grant Bursaries Call 2019"], "url : https://www.opportunitiesforafricans.com/nrf-honours-final-year-b-tech-block-grant-bursaries-call-2019/"], [["Korean Government Scholarship Program 2019 for study in South Korea (Fully Funded)", "date announced:September 3, 2018", "Korean Government Scholarship Program are open to international students for pursuing undergraduate programme at higher educational institutions in Korea. The scholarship will contribute to promoting the international exchange in education and to deepening the mutual friendship among countries."], ["Korean Government Scholarship Program", " are open to international students for pursuing undergraduate programme at higher educational institutions in Korea. The scholarship will contribute to promoting the international exchange in education and to deepening the mutual friendship among countries.", "GKS (Global Korea Scholarship) Program", " is a scholarship program that paid by the Government of the Republic of Korea for foreign nationals in the Republic of Korea and the Ministry of Education organized, responsible for the project implementation agency directly under the Ministry of Education National Institute for International Education.", "To provide international students with opportunities to conduct advanced studies in undergraduate & graduate programs at higher educational institutions in the Republic of Korea in order to promote international exchanges in education and mutual friendship between countries.", "Available Options in Universities", "Undergraduate course: 4-year courses at designated universities", "\nTransferring between universities is not allowed. (e.g. Starting studies at the junior year is not allowed.)", "Graduate course: Master’s or Ph.D. courses at general graduate schools of Korean universities", "Total Candidates to be Selected", "170 persons (undergraduate course), 700 persons (graduate course)", "Korea Language Training", "Grantees are required to take Korean language training courses for 1 year at a language institution located on-campus of the domestic universities. (Those who have attained a Korean language fluency score higher than level 5 in TOPIK are exempt from this requirement.)", "Qualifications", "Both an applicant and his/her parents must be citizens of their country of origin.", "\n※ Applicants should not hold Korean citizenship.- Applicants should have adequate health, both mentally and physically, to stay in a foreign country for a long time.", "\n– Should be under 25 years of age at the date of entrance. (Undergraduate)", "\n– Should be under 40 years of age at the date of entrance. (Graduate)", "\n– Have finished or be scheduled to finish formal education of all elementary, middle, high school courses by the date of arrival. (Undergraduate)"], "url : https://www.opportunitiesforafricans.com/korean-government-scholarship-program-2019/"], [["Pierre Elliott Trudeau Foundation Doctoral Scholarships 2018/2019 for study in Ryerson University, Canada ($60,000 per scholar)", "date announced:September 7, 2018", "Application Deadline: October 29th 2018"], ["Application Deadline: October 29th 2018", "The Pierre Elliott Trudeau Foundation", " award supports interdisciplinary research and original fieldwork by providing a substantial yearly allowance for research and travel, enabling the Scholars to gain first-hand contact with the diverse communities that can enrich their studies. Moreover, each Scholar is paired with a distinguished Trudeau Mentor selected by the Foundation among the most eminent Canadian practitioners in all sectors of public life. The Scholarship also offers the opportunity to interact with an exceptional community of leaders and committed individuals in every field of the social sciences and humanities, to participate in events organized by the Foundation and to hold their own workshops, through available financial support.", "Candidates are evaluated based on their academic achievement, which must be on par with the highest standards of the world’s most prestigious doctoral scholarship programs. Future scholars must also demonstrate an ability to engage in lively exchange with other researchers and scholars, and have an expressed desire to contribute to public dialogue.", "Worth:", "Annual value up to $60,000 (including an annual travel allowance of $20,000) per Scholar for a maximum of three years", "Eligibility Requirements:", "Be a Canadian citizen or landed immigrant applying to a doctoral program in the social sciences and humanities or registered full-time in the first or second year of such a program at a Canadian university.", "OR", "Be a Canadian citizen applying to a doctoral program in the social sciences and humanities or registered full-time in the first or second year of such a program at a foreign university.", "OR", "Be a foreign national [with a preference for candidates from the developing world] applying to a doctoral program in the social sciences and humanities or registered full-time in the first or second year of such a program at a Canadian university", "Present a research project linked to one of the Foundation’s four themes (Human rights and dignity; Responsible citizenship; Canada in the world; People and their natural environment)", "Be nominated by a university", "Application Deadline: ", "October 29, 2018", "Note: This is the internal YSGS Ryerson deadline for all candidates to submit their application packages.", "Nomination Process:", "Interested students must complete and submit their electronic application package through the Trudeau Foundation website online application system by the internal deadline stated above. ", "Create an account and follow instructions", ", external link", ".", "For More Information:", "Visit the Official Webpage of the Pierre Elliott Trudeau Foundation Scholarship"], "url : https://www.opportunitiesforafricans.com/pierre-elliott-trudeau-foundation-doctoral-scholarships-2018-2019/"], [["GE Africa/ALU Africa Industrial Internet Program 2019 for young African Professionals (Full Tuition Scholarships Available)", "date announced:September 12, 2018", "Application Deadline: October 31st 2018"], ["Application Deadline: October 31st 2018", "There are 2 rounds of applications for the 2019 AIIP Cohort:", "Round 1: September 3 – 30, 2018", "Round 2: October 8 – 31, 2018", "The Africa Industrial Internet Programme,", " a year-long programme, has been developed to address the demand for a digital-savvy workforce in the increasingly data-ridden industrial organisations. Developed by ALU and powered by GE, the programme empowers participants to develop the requisite skills for building applications for the Industrial Internet. We achieve this through offering modules in machine learning and big data analytics, Industrial Internet of Things (IIoT) and cloud-based application development to individuals and professionals interested in preparing for the Industrial Internet.", "Staggering amounts of data are generated every moment from millions of sensors connected to equipment and devices, especially in asset-rich industries. Unlocking the value of big data will dramatically improve business productivity and make significant bottom line impact. Capitalizing on the Industrial Internet, however, requires a new suite of skills – Data Exploration, Machine Learning Methods, Industrial Application Development and more.", "The in-person intensives will be held at GE Africa Innovation Centre in Johannesburg, South Africa. AAIIP is a very rigorous one year long program that focuses heavily on projects and the development of practical skills such that participants can apply their skills to their work directly as they progress.", "The AIIP will equip you to work in any data-rich environment across industries and enable you to add value by developing a data-driven decision making approach to business operations. Post-AIIP, you can continue working focused on specific verticals in analytics, industrial IoT, or further your studies in machine learning or application development on the cloud. The intrapreneurship skills will prepare you to lead innovation across functions such as asset maintenance, and plant operations that will impact the bottom line of your business.", "Requirements:", "AIIP is for individuals looking to pioneer innovations in the industrial internet, enhance their skills and advance their careers by learning how to take full advantage of industrial big data to influence the bottom line of their business.", "The programme is expecting to enroll up to 75 participants.", "Participants are required to:", "Have a quantitative background/ An engineering/software development background is preferred.", "Other desired attributes include:", "Being recent graduates or professionals in the following industries: Oil and Gas, Power generation and distribution, Manufacturing, Transportation", "Have basic business acumen particularly in engaging clients", "Familiarity with Python coding is a plus; not mandatory", "Strong analytical and statistical reasoning skills", "Excellent written and verbal communication skills", "Demonstrated intent or plans to champion digital change in their organisation", "Scholarship Available:", "GE is offering a limited number of competitive", " full tuition scholarships for the 2019 AIIP cohort", ".", "Scholarships will be awarded on a rolling basis, you are encouraged to apply into the program as early as possible in order to be considered for scholarship.", "To apply for the scholarship, simply indicate your interest in ", "the application form", " and submit an essay telling us why you think we should consider you for the scholarship.", "AIIP Structure", "AIIP is a year-long programme consisting of a blended learning approach with in-person sessions held in Johannesburg, South Africa and online learning. The in-person sessions are a unique opportunity to meet with and engage in peer-learning with the professionals in the programme from various industries in a community that elevates learning from the physical and virtual classroom to tangible application in the organization and workspace.", "12 MONTHS | 7 MODULES | 4 IN-PERSON INTENSIVES*", "AIIP Modules", "PYTHON AND STATISTICAL REASONING", "DATA ANALYTICS AND VISUALIZATION", "MACHINE LEARNING", "BIG DATA", "INDUSTRIAL APPLICATION DEVELOPMENT", "DIGITAL FOR INDUSTRIES", "INNOVATION & INTRAPRENEURSHIP", "Application Checklist", "Please see the application components below:", "Personal Information", "Education History", "Work Experience", "2 Motivational Essays", "Supporting Documents (Transcript(s) and CV)", "Optional: references or other self-selected material to support application", "For More Information:", "Visit the Official Webpage of the GE Africa/ALU Africa Industrial Internet Program 2019 "], "url : https://www.opportunitiesforafricans.com/ge-africa-alu-africa-industrial-internet-program-2019/"], [["National Information Technology Development Agency (NITDA) 2018/2019 (Masters & PhD) Scholarship Scheme for Nigerians", "date announced:August 30, 2018", "Application Deadline: October 11th 2018"], ["Application Deadline: October 11th 2018", "The National Information Technology Development Agency (NITDA)", " has as its mandate to develop and regulate the Information Technology in Nigeria. Developing and regulating IT will support in transforming Nigeria into an IT driven economy for global competitiveness and the dire need of digital literacy.", "The Agency has since 2010 established a", " scholarship scheme for Masters and Doctoral degree", " in relevant areas of Information Technology (IT) and ICT Law obtainable in Nigerian (Government and Private) Universities.", "Minimum requirements:", "PhD: ", "Only University and Polytechnic Lecturers with MSc in any Information Technology related field are eligible to apply for sponsorship.", "MSc: ", "Holders of First Class or Second Class (Upper) Honours Bachelor’s degree, in Information Technology related field and Law.", "Criteria", "The scholarship award is strictly based on merit and is evenly distributed between the six geo-political zones for the PhD, 36 States and FCT for MSc.", "Duration", "The sponsorship for the Masters programme will run for one year and the Doctorate programme for three years.", "A comprehensive Aptitude Test(s) will be conducted to determine successful candidates for the Award. Only candidates who are found eligible will be Shortliste", "For More Information:", "Visit the Official Webpage of the NITDA 2018/2019 (Masters & PhD) Scholarship Scheme"], "url : https://www.opportunitiesforafricans.com/nitda-2018-2019-masters-phd-scholarship-scheme-for-nigerians/"], [["Government of Canada Francophonie Scholarship Program (CFSP) 2019 for Study in Canada (Fully Funded)", "date announced:September 11, 2018", "Application Deadline: Varying by Country"], ["Application Deadline: Varying by Country", "The Canadian Francophonie Scholarship Program (CFSP)", " is a scholarship program designed to build institutional capacities by training employed nationals from developing countries of La Francophonie.", "The program is entirely funded by the", " Government of Canada", ", which has entrusted the management of the program to the consortium Canadian Bureau for International Education / World University Service of Canada since January 1st, 2015.", "Objective", "The long-term goal of the program is to promote the development of recipient countries by giving priority to:", "Training of trainers, particularly in the field of technical and vocational education", "Improving the skills of college and university personnel in the field of education and research", "Increasing and strengthening the skills of specialists and managers in the public and private sectors", "Selection process", "Candidates are selected by using a quota system for each recipient country. The quota approach allows recipient countries to define their own priorities for training, as well as the level of training required for the development of their institutions.", "Eligibility", "Institutions targeted by recipient countries conduct internal recruitment campaigns to identify qualified candidates who show the greatest aptitude for helping strengthen their institution’s capacities when they return to their country.", "Candidates identified and selected may apply for university studies leading to a master’s and doctoral degree, for technical and vocational training, or for short-term internships.", "Clinical training in pharmacy, medicine and dentistry is excluded.", "Application process", "Candidates must hold a key position so that the knowledge they acquire will benefit the capacity building of their institution.", "Evaluation of applications", "A local advisory committee formed by representatives of various ministries selects candidates in their country. The accredited Canadian diplomatic mission acts as observer to ensure transparency of the selection process.", "The local advisory committee takes into account the candidates’ jobs in the sector or institution to be strengthened and the level of academic excellence as defined by host institutions. An equal number of applications by gender and country is required, and fluency of candidates in spoken and written French is also mandatory.", "Final admission to college or university is the sole responsibility of the relevant institution, and the scholarship becomes effective only when the candidate is admitted to the educational institution.", "Apply Now for the Canadian Francophonie Scholarship Program ", "Download :", "Application Guide", "For More Information:", "Visit the Official Webpage of the ", "Canadian Francophonie Scholarship Program (CFSP)"], "url : https://www.opportunitiesforafricans.com/canadian-francophonie-scholarship-program-cfsp-2019/"], [["Standard Bank Derek Cooper Africa Scholarships 2019 for Young Africans to study in the UK (Fully Funded)", "date announced:September 10, 2018", "Application Deadline: Varying by Institution"], ["Application Deadline: Varying by Institution", "The Standard Bank Africa, Derek Cooper Scholarship", " marks the culmination of over thirty years of direction, vision and action attributed to Derek Cooper, a true African business leader and former Chairman of the Standard Bank Group. ", "“Africa is our home, and we are focused on driving her growth.”", " With a heritage of over 155 years, we are a leading integrated financial services group on the African continent with an on-the-ground presence in 20 countries in sub-Saharan Africa, where we also trade as Stanbic Bank.", "It is becoming clearer that Africa has a critical role to play in shaping the 21st Century. The continent is increasingly interacting with the rest of the world on its own terms. Through this commitment, Standard Bank aims to champion those African leaders who will actively build a future for Africa, led by Africans.", "These leaders will be asked to exercise global influence through visionary leadership. Nine students will be carefully vetted and selected to complete their post-graduate studies at the prestigious institutions of Cambridge, Oxford and The London School of Economics and Political Science in the United Kingdom. Each specializing in their unique areas of expertise, these individuals will represent the best and brightest Africa has to offer, introducing thoughtful challenge amongst their peers as they grow in courage, fair-mindedness and integrity.  Their stay and studies will be fully-funded and backed by Standard Bank as part of our commitment to enable and empower them to become effective leaders in Africa.", "Requirements:", "The Standard Bank Africa, Derek Cooper Scholarship is available to graduate students who are and will ordinarily remain resident in one of the African countries in which Standard Bank is present (see full list below). Prospective candidates must demonstrate an exceptional academic track record and will need to have successfully qualified on their own merit in their application for a one-year Master’s programme at either of the following partner university institutions: Oxford, Cambridge and London School of Economics and Political Science.", " ", "A preference will be given to students commencing a course of study in one of the following programmes:", " ", "University of Oxford", "MSC programme provided by the Mathematical, Physical and Life Sciences, Social Sciences and Humanities divisions at the University.", "London School of Economics and Political Science", "MSc Environmental Economics and Climate Change", "MSc Public Management and Governance", "MSc Finance", "MSc Risk and Finance", "MSc Finance and Private Equity", "MSc Real Estate Economics and Finance", "MSc African Development", "MSc Law and Accounting", "MSc Economics and Management", "MSc Management Information Systems and Digital Innovation", "MSc Management and Strategy", "MSc Financial Mathematics", "MSc Economics and Philosophy", "MSc Environment and Development", "University of Cambridge", "MPhil in Economics", "Mphil in Education", "Mphil in Engineering for Sustainable Development", "Mphil in Finance", "Mphil in Management", "Scholarship Worth:", "The scholarships will provide the tuition and college fee in full, and a maintenance grant (i.e. living costs incurred in the college such as rental of college accommodation, food taken in college, etc.) commensurate to the national minimum doctoral stipend of the UK Research Councils.", "How to apply for the Standard Bank Africa, Derek Cooper Scholarship:", "Please be advised that you will be required to apply for your programme of choice as well as funding. Application dates vary for each institution. Please therefore refer to your University of choice for application dates.", "Applications should be channeled directly through each University website, as follows: ", "For ", "Oxford applications", "For ", "London School of Economics and Political Science applications", "For ", "Cambridge applications", "For More Information:", "Visit the Official Webpage of the Standard Bank Derek Cooper Africa Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/standard-bank-derek-cooper-africa-scholarships-2019/"], [["Gates Cambridge Scholarship Programme 2019 for Study at the University of Cambridge, UK (Fully Funded)", "date announced:September 3, 2018", "Application Deadline: January 3rd 2019"], ["Application Deadline: January 3rd 2019", "The Gates Cambridge Scholarship programme", " was established in October 2000 by a donation of US$210m from", " the Bill and Melinda Gates Foundation", " to the ", "University of Cambridge;", " this is the largest ever single donation to a UK university.", "Gates Cambridge offer 90 full-cost scholarships each year to outstanding applicants from countries outside the UK to pursue a full-time postgraduate degree in any subject available at the University of Cambridge. The selection criteria are:", "outstanding intellectual ability", "leadership potential", "a commitment to improving the lives of others", "a good fit between the applicant’s qualifications and aspirations and the postgraduate programme at Cambridge for which they are applying", "Eligibility Requirements:", "You can apply for a Gates Cambridge Scholarship if you are:", "a citizen of any country outside the United Kingdom", "applying to pursue one of the following full-time residential courses of study at the University of Cambridge:\n", "PhD (three year research-only degree)", "MSc or MLitt (two year research-only degree)", "One year postgraduate course (e.g. MPhil, LLM, MASt, Diploma, MBA etc.)", "You can use the form below to quickly check if you are eligible to apply for a Gates Cambridge Scholarship and, if so, in which of the two application rounds you must apply.", "Scholarship Worth:", "A Gates Cambridge Scholarship covers the full cost of studying at Cambridge. It also provides additional, discretionary funding.", "The Gates Cambridge Scholarship is one of the most generous international scholarships available. It covers the following costs:", "Core components", "the ", "University Composition Fee", " at the appropriate rate*", "a maintenance allowance for a single student (£17,500 for 12 months at the 2018-19 rate; pro rata for courses shorter than 12 months)", "one economy single airfare at both the beginning and end of the course", "inbound visa costs & the cost of the ", "Immigration Health Surcharge", "Discretionary components", "The Trust also considers applications for several types of additional funding on a discretionary basis:", "Academic development funding – from £500 to £2,000, dependent on the length of your course, to attend conferences and courses.", "Family allowance – up to £10,120 for a first child and up to £4,320 for a second child (2018-19 rate). No funding is provided for a partner.", "Fieldwork – you may apply to keep up to your normal maintenance allowance while on fieldwork as part of your PhD (the Trust does not fund other fieldwork costs as these should be funded by the University Composition Fee).", "Hardship funding – for unforeseen difficulties", "Maternity/Paternity funding – should you require it, you may apply to intermit your studies for up to 6 months and continue to receive your maintenance allowance during this time", "Selection Criteria:", "Gates Cambridge uses a three-stage selection process to ensure Scholars meet all of our criteria to the highest degree.", "1. Departmental ranking", "In order to ensure only the most academically outstanding candidates are considered, the Trust asks academic departments in Cambridge to rank eligible applicants on academic ability only. Those who are put forward by their departments are considered the most academically outstanding applicants they have received that year.", "2. Shortlisting", "Once the Trust has a list of all ranked candidates, these are divided into broad subject areas and passed to our Shortlisting Committees. These Committees look at the candidates’ entire application pack (including the Gates Cambridge Statement and Reference) and apply all four Gates Cambridge criteria in order to identify those who will be invited for interview. Everyone who is shortlisted for interview will have gone through an exceptionally competitive process and will show evidence of meeting the four Gates Cambridge criteria.", "3. Interview ", "All shortlisted candidates have a short interview to assess how they meet all four Gates Cambridge criteria and Scholars are selected after interview. More details are available from the ", "interview page", ".", "Feedback", "Please note that Trust is not able to provide feedback to applicants.", "How to apply", "​Apply for admission, a College place and funding via the University’s Graduate Applicant Portal.", "For the majority of courses you can apply for admission and mutiple funding opportunities (including Gates Cambridge) at ", "www.graduate.study.cam.ac.uk", ".", "​There is a seperate application route if you  wish to apply for the ", "MBA ", "or ", "MFIN ", "at the Judge Business School", "Timeline:", "What stage?", "Round 1", "Round 2", "Applications open", "3 September 2018", "3 September 2018", "Application deadline", "10 October 2018", "Dependent on your course – either 5 December 2018 or 3 January 2019", "Departmental ranking", "October – November", "December – February", "Trust shortlisting", "Mid-December", "Early March", "Shortlisted candidates invited to interview", "Late December", "Early March", "Interviews", "25 & 26 January 2019 (USA)", "26 & 27 March 2019 (Cambridge, UK)", "Scholarships offered", "Early February", "Late March", "Scholarships accepted", "48 hours after offer", "48 hours after offer", "For More Information:", "Visit the Official Webpage of the Gates Cambridge Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/gates-cambridge-scholarship-programme-2019/"], [["Toptal 2018 Scholarships for Women ($10,000 for emerging female leaders)", "date announced:September 4, 2018", "Application Deadline: September 30, 2018"], ["Application Deadline: September 30, 2018", "Toptal Scholarships for Women: Empowering Future Female Leaders", " to Change the World. Toptal", "®", " is awarding $10,000 and a year of mentorship to five future female leaders who want to change the world.", "Requirements:", "Women Change the World", "This program is for ambitious women, 16 years or older, who are passionate about making some meaningful change for a community or cause they care about.", "Pursuing an Education", "Brilliance and wisdom come in many forms. This program is open to women from all walks of life who are currently pursuing or aiming to pursue any type of education program.", "Creating Momentum Around the World", "We are awarding one prize per region to current residents of Europe, the Americas, Africa, Asia, and Oceania. See below for application timelines.", "With an Idea — And a Plan", "Entries will be judged on the originality of the idea, your plan for making it happen, and your passion for the cause it represents.", "Prize:", "$10,000 Scholarship", "Meaningful support, so you can focus on developing yourself as a future leader.", "One year of Mentorship", "Mentoring from a Toptal expert with the skills and knowledge you need to set you on the right path.", "Timeline:", "Africa", "Application Deadline : September 30, 2018", "Winner Announced: November 7, 2018", "For More Information:", "Visit the Official Webpage of the ", "Toptal Scholarships for Women"], "url : https://www.opportunitiesforafricans.com/toptal-2018-scholarships-for-women/"], [["University of Dundee 2019 PhD Studentship in Digital Marketing for International Students (Fully Funded)", "date announced:August 27, 2018", "Application Deadline: September 10th 2018"], ["Application Deadline: September 10th 2018", "The School of Social Sciences is pleased to announce a", " fully-funded studentship in Digital Marketing, within the University of Dundee School of Business.", "As part of a large, growing and supportive research community, the successful candidate will benefit from being a member of the Institute of Social Science Research and the wider University research community.", "Requirements:", "Applicants are expected to have an excellent undergraduate degree and have successfully completed a Masters degree in a relevant area from a UK university, or have comparable qualifications from another recognised higher education institute.", "Previous work experience in marketing is desirable, ideally within the field of brand management.", "Applicants should be able to demonstrate evidence of self-motivation and the ability to set and achieve ambitious goals.", "The role will involve some teaching at both undergraduate and postgraduate levels. An international outlook, emotional intelligence, highly developed cultural awareness, and excellent interpersonal skills are required.", "University of Dundee particularly welcome applications including, but not limited to, the following areas of digital marketing:", "the role of augmented reality (AR), virtual reality (VR) and mixed reality (MR)", "social media marketing and influencer marketing", "digital asset management", "Benefits:", "The studentship is open for home, EU and overseas applicants on a full-time basis only and includes: (overseas applicants are welcome to apply, but will be required to pay the difference between the home/EU rate and the overseas rate).", "• Full home/EU rate tuition fees for 3 years", "\n• Annual stipend of £14,777 (increases annually in line with ESRC rates)", "\n• £2,000 per annum student travel allowance", "\n• £1,000 per annum conference allowance", "\n• £1,000 per annum project consumables allowance", "The award of a studentship will be based on a competitive selection process and its renewal for each subsequent year over the three-year course of study will be strictly subject to satisfactory progress.", "How to Apply:", "Please apply directly to", "[email protected]", " with the following documents:", "• Proposal (3,000-5,000 words) to include discussion of research aims, key literature and proposed approach", "\n• A summary CV", "\n• Qualifications", "\n• Letter of application (personal statement)", "Please include #udsbstudentship and your full name in the subject line.", "For More Information:", "Visit the Official Webpage of the University of Dundee 2019 PhD Studentship in Digital Marketing"], "url : https://www.opportunitiesforafricans.com/university-of-dundee-2019-phd-studentship-in-digital-marketing/"], [["National Student Financial Aid Scheme (NSFAS) 2019– Financial Assistance to Study at a tertiary institution in South Africa.", "date announced:September 3, 2018", "Application Deadline: November 30, 2018,"], ["Application Deadline: November 30, 2018,", "Are you in need of financial assistance to study at a tertiary institution?", "Apply for a", " National Student Financial Aid Scheme (NSFAS)", " study loan or bursary through the Financial Aid Bureaus at your tertiary institution or directly through the online application with the ", "National Student Financial Aid Scheme.", "NSFAS is a loan and bursary scheme funded by the Department of Higher Education and Training for those who do not have the financial means to fund their studies and / or cannot access bank funding, study loans or bursaries.", "Eligibility:", "• Grade 12 learners from poor and working class families who cannot afford to pay for their studies", "\n• Eligible students who were not funded in the previous years", " ", "For ", "postgraduate studies", ", only students who plan to do the following postgraduate qualification may apply:", "\n1. B Tech – Architecture/Architectural Technology", "\n2. B Tech – Biokinetics/Biomedical Technology/Biotechnology", "\n3. Postgraduate Certificate in Education", "\n4. Postgraduate Diploma in Accounting, and", "\n5. LLB", "Application Procedure:", "A.", " Before applying you should have decided ", "which course", " you want to study and at which public university/TVET college. You will need to select these choices in the application form.", "Make sure you have electronic (and certified copies) of the following:", "Your South African identity document/card or, an unabridged birth certificate", "IDs of parents and/or guardian (or death certificate where applicable)", "IDs of each person living with you in your home", "Pay advice/letter of employment/pension advice (not older than three months)", "Please ", "download the consent form", " and fill it in with your parent/guardian’s signatures. Applications without a consent form that is signed by all people whose incomes have been declared in the application will not be accepted, and will be considered as incomplete.", "If you have a disability, please ", "download the Disability Annexure A", " and fill it in", "For More Information:", "Visit the Official Webpage of the National Student Financial Aid Scheme (NSFAS) 2019"], "url : https://www.opportunitiesforafricans.com/national-student-financial-aid-scheme-nsfas-2019/"], [["Standard Bank Group 150 Bursary Programme 2019 for undergraduate & graduate studies in South Africa", "date announced:August 27, 2018", "Application Deadline: August 31st 2018"], ["Application Deadline: August 31st 2018", "In honour of our 150th anniversary in 2012, we launched our 150 bursary and scholarship fund, designed to promote academic excellence (in various disciplines within commerce, science, engineering and technology) and to target a range of recipients. To apply for this bursary you must be a well- rounded, undergraduate student with strong academic results and entering your second or third year of study in commerce, science, engineering, mathematics and technology.", "Requirements:", "The undergraduate fund is specific to students that are on track to successfully complete their 1st year and require funding from their 2nd year of studies. Applicants should be well-rounded with strong academic results in the fields of commerce, science, engineering, mathematics and technology at our preferred academic institutions.", "Applicants should have a 65% aggregate", "Applicants must register for  full time undergraduate studies", "Applicants must meet the entry requirements of the University (preference is given to University of Cape Town, Wits University, the University of Pretoria, Rhodes University, University of KwaZulu-Natal, Stellenbosch University, the University of Johannesburg)", "Applicants will be required to participate in a formal assessment process including but not limited to Psychometric evaluation and interviews", "Financial need is considered in applications", "Standard Bank Group 150 Postgraduate Bursary", "The 150 fund provides full-cost bursaries to financially deserving and academically sound students wishing to pursue postgraduate studies in commerce, science, engineering, mathematics and technology at our preferred academic institutions.", "Applicants should have a 65% aggregate", "Applicants must register for  full time postgraduate studies", "Applicants must meet the entry requirements of the University(preference is given to University of Cape Town, Wits University, the University of Pretoria, Rhodes University, University of KwaZulu-Natal, Stellenbosch University, the University of Johannesburg", "Applicants will be required to participate in a formal assessment process including but not limited to Psychometric evaluation and interview", "Financial need is considered in applications", "How to Apply:", "You can apply using one of the following options:", "Please note:", " All 2018 applications are closed. 2019 applications open from 1 August to 30 September 2018", " Mail:", " Write a letter containing your name, surname and a valid postal address and postal code to: ", "Standard Bank Bursary Programme, Studietrust,", " Private Bag X16, Braamfontein 2017", " Email:", " Send an email explicitly requesting a Standard Bank bursary application form, and containing your name, surname and a valid postal address and postal code to: ", "[email protected]", "SMS: ", "Sms the word STANDARD, your name, surname, postal address and postal code to 31022.", "Website application:", " Fill in an online application form on: ", "www.studietrust.co.za", "Enquiries can be directed to Susan Dube at ", "[email protected]", "Closing dates:", "\nThe closing date for submitting your completed application form with all supporting documents is 30 September. This deadline applies to all modes of application.", "♦   ", "Download", " the form below                                             ", "Standard Bank 150 Bursary Programme StudyTrust Application Form 2019", "For More Information:", "Visit the Official Webpage of the Standard Bank Group 150 bursaries 2018"], "url : https://www.opportunitiesforafricans.com/standard-bank-group-150-bursary-programme-2019-for-undergraduate-graduate-studies/"], [["2018 KPMG Nigeria University Scholarship Program for young Nigerians", "date announced:September 13, 2018", "Application Deadline: September 21st 2018"], ["Application Deadline: September 21st 2018", "In line with KPMG Nigeria’s commitment to improving communities, KPMG will be contributing to the advancement of education.", "Eligibility Criteria", "Candidates must meet the following criteria:", "Have completed their secondary education at a state public secondary school within the last 2 years", "A minimum of 5 Distinctions (As & Bs) from their WASSCE (including English and Mathematics)", "A minimum score of 230 in the Unified Tertiary Matriculation Examination (UTME)", "Already have an admission letter or a provisional letter of admission to a federal university in Nigeria", "How To Apply", "Send an email to ", "[email protected]", " with the following details: Name, Residential Address, E-mail Address, Phone Number.", "Also attach the following documents in a zipped folder;", "WASSCE Certificate", "UTME Result Slip", "Provisional Letter of Admission/Letter of Admission to a Federal University in Nigeria", "Birth Certificate", "Kindly state the code ", "KSP2018 ", "in the subject of the email", "“Please note that the deadline for application is ", "21st September 2018", "“", "For More Information:", "Visit the Official Webpage of the 2018 KPMG Nigeria University Scholarship Program "], "url : https://www.opportunitiesforafricans.com/2018-kpmg-nigeria-university-scholarship-program-for-young-nigerians/"], [["TÜBİTAK International Fellowships 2018/2019 for PhD & Post-Doctoral Study in Turkey (Fully Funded)", "date announced:September 4, 2018", "Application Deadline: October 5th 2018"], ["Application Deadline: October 5th 2018", "The Scientific and Technological Research Council of Turkey (TÜBİTAK)", " grants ", "fellowships for international highly qualified PhD students and young post-doctoral ", "researchers to pursue their research in Turkey in the fields of Natural Sciences, Engineering and Technological Sciences, Medical Sciences, Agricultural Sciences, Social Sciences and Humanities. The program aims to promote Turkey’s scientific and technological collaboration with countries of the prospective researchers.", "The purpose of the program is to advance international cooperation of Turkey in science and technology by providing financial support to international young researchers who have received their PhD or are still registered to a doctoral program abroad", "Requirements:", "Being a foreign citizen,", "As from the deadline of the application, h", "aving registered to a doctoral program abroad and being successful in ", "the PhD qualifying exam or having completed his PhD,", "Having an invitation letter from the universities or research institutes in Turkey*", "Certifying that they have sufficient command of language, which will be used in the proposed research,", "Being 35 years old or younger as from the application deadline.", "*Those having received their doctorates from a university in Turkey are required to receive an invitation letter from a different university than his/her university that they received their doctorates, and carry out their research with an academic advisor(s) other than their doctoral thesis advisor.", "Scope of the Fellowship", "The scope of the program includes monthly stipend, travel expenses and private health insurance cost.", "The Amount and Duration of the Support", "A monthly stipend of 2,500 Turkish Liras", "Travel costs (round trip up to 2,250 TL) and private health insurance premiums (up to 70 TL per month). * ", "Maximum duration of the support is 12 months.", "*In case of the decision of GYK, travel costs and health insurance for the fellow may be partially covered.", "Application Forms:", "Research Proposal Template", "CV template", "For More Information:", "Visit the Official Webpage of the TÜBİTAK International Fellowships 208/2019"], "url : https://www.opportunitiesforafricans.com/tubitak-international-fellowships-208-2019-for-phd-post-doctoral-study-in-turkey/"], [["Investec Tertiary Bursary Programme 2019 for Young South Africans.", "date announced:September 10, 2018", "Application Deadline: Sunday 30 September 2018."], ["Application Deadline: Sunday 30 September 2018.", "Investec, in partnership with StudyTrust,", " ", "provides the funding necessary to see young South Africans with academic potential get to university. With our assistance, they are able to study towards financial sector related degrees at various local universities.", "Requirements:", "If you’re a young South African citizen who is committed to their academic achievements but doesn’t have the financial means to study further, we are interested in speaking to you. You must, however, hold or be working towards a matric exemption with a minimum of 70% in English and Mathematics (not Maths Literacy) and a 60% pass rate in all your other subjects.", "Benefits:", "Investec offers a full bursary per year towards study-related expenses. Terms and Conditions apply.", "Apply Now for the Investec Tertiary Bursary Programme 2019", "For More Information:", "Visit the Official Webpage of the Investec Tertiary Bursary Programme 2019"], "url : https://www.opportunitiesforafricans.com/investec-tertiary-bursary-programme-2019-for-young-south-africans/"], [["Investec Information Technology (IT) Scholarship Programme 2019 for young South Africans", "date announced:September 10, 2018", "Application Deadline: September 30th 2018"], ["Application Deadline: September 30th 2018", "If you’re a dedicated undergraduate or honours student studying towards a degree in IT and need financial assistance, the", " Investec IT Scholarship Programme", " is for you. You’ll get to take part in the IT Explore hackathon and the IT Careers Fair.", "Eligibility Requirements:", "You can apply for an", " IT Scholarship", " if you meet the following criteria:", "You are a student in your 2nd to final year, studying towards a Bachelor of Science (BSc or BS) in Computer Science, a Business Computing or Computer Engineering, a Bachelor of Commerce (BCom) in Informatics or Information Systems or a Bachelor of Business Science (BBusSc) in Information Systems degree.", "You have achieved a 70% average for your final (year-end) result.", "You are ambitious, creative and academically talented", "You are a South African citizen", "The selection of candidates is based on merit and not financial need because we believe in those who are driven to consistently better themselves in the work place.", "Qualities", "•Critical and creative thinkers", "\n•Problem solvers", "\n•Effective communicators", "\n•Knowledgeable and informed", "\n•Leaders", "\n•Team players", "\n•Innovative and entrepreneurial", "\n•Self-motivated learners", "Application Procedure:", "\nDue to the volume of applications, we kindly request that you do not submit your documents outside of the application period.", "\nWhen applications open, please complete the application form and upload the following documents:", "Your CV", "Your matric certificate", "Your university academic transcripts (all courses completed to date)", "A clear copy of your ID", "A recent photograph of yourself", "Please ensure you submit all of the above. If you are unable to do so, your application will not be considered.", "E-Mail: ", "[email protected]", "\nFor More Information:", "Visit the Official Webpage of the Investec Information Technology (IT) Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/investec-information-technology-it-scholarship-programme-2019-for-young-south-africans/"], [["Holland Scholarships 2019 for Bachelor’s or Masters Study in the Netherlands (5,000 Euros)", "date announced:August 27, 2018", "Application Deadline: May 1st 2019"], ["Application Deadline: May 1st 2019", "The Holland Scholarship", " is meant for international students from outside the European Economic Area (EEA) who want to do their bachelor’s or master’s in the Netherlands. Are you ready for the chance of a lifetime? Apply for the Holland Scholarship!", "This scholarship is financed by the", " Dutch Ministry of Education, Culture and Science", " as well as several Dutch research universities and universities of applied sciences.", "Scholarship", "The scholarship amounts to € 5,000. You will receive this in the first year of your studies. Please note that this is not a full-tuition scholarship.", "Grant award period", "The grant is awarded for one year and can only be received once.", "Application criteria", "Your nationality is non-EEA.", "You are applying for a full-time bachelor’s or master’s programme at one of the participating Dutch higher education institutions.", "You meet the specific requirements of the institution of your choice. You can find these on the website of the institution.", "You do not have a degree from an education institution in the Netherlands.", "How to apply", "Find your programme in the overview of ", "participating research universities", " or in the overview of ", "participating universities of applied sciences", ". You will find detailed information about the application procedure and deadlines in the links provided in both lists.", "The university will contact you to let you know if you have been awarded a scholarship.", "Deadlines", "You can now apply for the 2018-2019 academic year. The deadline for application is either 1 February 2019 or 1 May 2019. Please check the website of the institution of your choice to confirm the correct deadline.", "For More Information:", "Visit the Official Webpage of the Holland Scholarships"], "url : https://www.opportunitiesforafricans.com/holland-scholarships-2019-for-bachelors-or-masters-study-in-the-netherlands-5000-euros/"], [["University of Groningen Eric Bleumink Fund Scholarships 2018/2019 for Students from Developing Countries in Netherlands (Funded)", "date announced:September 7, 2018", "Application Deadline: December 1st 2018"], ["Application Deadline: December 1st 2018", "The Eric Bleumink Fund", " awards scholarships to talented students from developing countries. Such scholarships enable them to further develop as individuals and to make important contributions to the development of their own countries.", "Since 2000, the year the fund was started, the EBF handed out more than sixty scholarships. This means more than sixty young, ambitious and very talented people were able to follow an additional study at the University of Groningen. Here they were introduced to an academic culture, libraries and  international contacts they are often lacking in their homeland.", "Selection criteria", "\nPurposes: Master programme, Master (MSc/MA/LL.M.)", "\nProgrammes: All", "\nCountries of origin: Afghanistan, Angola, Bangladesh, Benin, Bhutan, Burkina Faso, Burundi, Cambodia, Chad, Comoros, Djibouti, Equatorial Guinea, Eritrea, Ethiopia, Gambia, Guinea, Guinea-Bissau, Haiti, Kiribati, Laos, Lesotho, Liberia, Madagascar, Malawi, Mali, Mauritania, Mozambique, Myanmar, Nepal, Niger, Rwanda, Sao Tome and Principe, Senegal, Sierra Leone, Solomon Islands, Somalia, Tanzania, Togo, Tuvalu, Uganda, Vanuatu, Yemen, Timor-Leste, Sudan (Rep.), Congo (Dem Rep.), South Sudan, Central African Republic, Zambia, Armenia, Bolivia, Cape Verde, Congo (Rep.), Congo, El Salvador, Ghana, Honduras, India, Indonesia, Kosovo, Korea, Dem. Rep., Kyrgyzstan, Moldova, Mongolia, Morocco, Nigeria, Vietnam, Uzbekistan, Ukraine", "Additional information", "\nEligible candidates:", "Candidates for the Eric Bleumink Fund should:", "Have obtained conditional admission to the program of choice (see: www.rug.nl/masters/alphabetical )", "Have excellent academic performance, preferably to be confirmed by letters of recommendation", "Have excellent grades during their bachelor/undergraduate studies;", "Have excellent English language proficiency, in accordance with the admission requirements of the program of choice", "Be available for the whole period of the programme and be able to take part in the entire programme", "Be in good health, so that health insurance in the Hold the nationality of a country appearing in Appendix 1.", "Have no other means of financing the study in question", "Benefits:", "The grant is awarded for a 1 year or 2 years Master’s degree programme.", "The grant covers tuition fee, costs of international travel, subsistence, books, and health insurance.", "Application:", "The University of Groningen Admission Office, in consultation with the Admission Boards of its faculties, will determine which applicants will be nominated for an Eric Bleumink Fund scholarship.", "Only applicants that have received a (conditional) admission offer for a master programme before February can thus be considered. In order to allow for enough time to process the application to a master programme by the Admission Office, such a master application should be completed by the applicant before 1st of December.", "For More Information:", "Visit the Official Webpage of the University of Groningen Eric Bleumink Fund Scholarships 2018/2019 "], "url : https://www.opportunitiesforafricans.com/university-of-groningen-eric-bleumink-fund-2018-2019/"], [["Government of Ireland (Masters & PhD) Postgraduate Scholarship Programme 2019 for study in Ireland (Funded)", "date announced:September 10, 2018", "Application Deadline: 16:00 (Irish time) 1 November 2018"], ["Application Deadline: 16:00 (Irish time) 1 November 2018", "The Government of Ireland Postgraduate Scholarship Programme", " is an established national initiative, funded by the Department of Education and Skills and managed by the Council.", "The Government of Ireland Postgraduate Scholarship Programme is unique in the Irish research landscape and complements other channels for funded postgraduate education in the Irish eco-system. Among its features are:", "individual, prestigious awards for excellent research in the name of the applicant;", "an objective selection process using international, independent expert peer review;", "funding across all disciplines, from archaeology to zoology;", "with the exception of those funded by our strategic funding partners, awards for bottom-up, non-directed research.", "The Government of Ireland Postgraduate Scholarships Programme is highly competitive, with an average success rate of 19% over the last five years. Successful applicants who become scholars under the programme are recognised as demonstrating world-class potential as future research leaders and in the quality of their ideas.", "Eligibility Requirements:", "Applicants must fufil the following criteria:", "have a first class or second class upper honours bachelor’s, or the equivalent degree. If undergraduate examination results are not known at the time of application, the council may make a provisional offer of scholarship on condition that the scholar’s bachelor’s, or the equivalent degree result is a first class or upper second class honours. If a scholar does not have s first class or upper second-class honours bachelor’s, or the equivalent degree, they must possess a master’s degree. The Council’s determination of an applicant’s eligibility on these criteria is final;", "must not have had two previous unsuccessful applications to the programme, including strategic partner themes. This includes application since 2009 to the EMBARK scheme previously run by the Urush Research Council for Science, Engineering and Technology, and the Government of Ireland Scholarship Scheme previously run by the Irish Council for Humanities and Social Sciences;", "in the case of applications for a research master’s scholarship, applicants must not currently hold, or have previously held, a Council Postgraduate Scholarship;", "\nin the case of applications for a doctoral degree scholarship, applicants must not currently hold, or have previously held, any Council Postgraduate Scholarship other than those which would enable them to obtain a research master’s degree", "Benefits", "a stipend of €16,000 per annum", "a contribution to fees, including non-EU fees, up to a maximum of €5,750 per annum", "eligible direct research expenses of €2,250 per annum", "Key dates", "Deadline", "Date", "Call open", "6 September 2018", "FAQ deadline", "25 October 2018", "Applicant deadline", "16:00 (Irish time) 1 November 2018", "Supervisor and referee deadline", "16:00 (Irish time) 8 November 2018", "Research office endorsement deadline", "16:00 (Irish time) 15 November 2018", "Call outcome", "End of March 2019", "Scholarship start date", "1 September 2019", "Please note that the timings provided here are indicative and may be subject to change.", "If you do not find the answer to your query in the call documentation, you should contact the research office in your proposed institution which will provide information and clarification on the call. Research offices can send any queries they are unable to clarify to ", "[email protected]", ".", "Documents:", "Government of Ireland Postgraduate Scholarship Programme 2019", "Terms and Conditions 2019", "Guide for applicants", "For More Information:", "Visit the Official Webpage of the Government of Ireland Postgraduate Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/government-of-ireland-postgraduate-scholarship-programme-2019/"], [["Joint Japan/World Bank Graduate Scholarship Program 2019 for Developing Countries Nationals (Fully Funded to Japan)", "date announced:September 6, 2018", "Application Deadline: October 24th 2018"], ["Application Deadline: October 24th 2018", "Since 1996, ", "the Graduate School of Business and Commerce of Keio University", " has been training promising tax personnel in the field of tax policy and administration with its Master’s Degree Program in Taxation Policy and Management. This program brings together the cooperation of ", "Keio University, the National Tax Agency of Japan (NTA),", " and the World Bank in an alliance between public and private institutions.", "Funded by the GOVERNMENT OF JAPAN and administered by the WORLD BANK", "Keio University, a leading private university in Japan, established the program as one of the partnership programs of the Joint Japan /World Bank Graduate Scholarship Program (JJ/WBGSP). Funded by the Government of Japan and administered by the World Bank, the JJ/WBGSP is a personnel training project which awards scholarships to help developing countries strengthen their human resources.", "Number of scholarship awards", "\nUp to five awards for the 2019 academic year – 2020 academic year", "Scholarship Period", "\nTwo years （April 2019 to March 2021）", "Application Criteria", " Be a national of a Bank member country that is eligible to receive Bank financing and not be a national of any country that is not eligible to receive the Bank financing. For the list of eligible World Bank countries, see", " eligible country list", ".", " Not hold dual citizen of any developed country.", " Be in good health with respect to the capacity to be a productive scholar for the duration of the Graduate Program, as certified by a medical doctor.", " Hold a Bachelor’s degree or its equivalent with superior academic achievement earned at least three (3) years  prior to the Scholarship Application Deadline.", " Not received any scholarship funding to earn a Graduate degree or its equivalent from any sources funded by the government of Japan.", " Be employed in a paid and full time position at the time of the Scholarship Application Deadline unless the applicant is from a country identified in the World Bank’s “", "Harmonized List of Fragile Situations", "”.", " Have, by  the time of  the Scholarship Application Deadline, at  least three（3）years of recent full time paid professional experience in the field of tax policy and administration at a public body after a Bachelor’s degree or its equivalent in the applicant’s home country or in another developing country; If the applicant is from a country identified in the World Bank’s “", "Harmonized List of Fragile Situations", "” at the time of the Scholarship Application Deadline, the recent professional experience does not have to be full time or paid.", " Not be  an  Executive Director,  his / her alternate, staff of  the World  Bank Group（the  World Bank, International Development Association, International Finance Corporation, Multilateral Investment Guarantee Agency, and International Center for Settlement of Investment Disputes）, or a close relative of the aforementioned by blood or adoption with the term “close relative” defined as: Mother, Father, Sister, Half-sister, Brother, Half-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew.", " Accepted to the University unconditionally or conditionally only upon securing financing.", " Demonstrate proficiency in the English language at the level of a TOEFL score of 79 (iBT) or  better, or an IELTS score of 6.0 or better.", " Meet any other criteria for admission established by Keio University.", " Applicants must not be currently pursuing a Master’s or Ph.D. program in industrialized countries.", " Applicants must not have had one or more years of training / studies and / or residency in an industrialized  country.", " Applicants must not be permanent residents / nationals of industrialized countries.", "Scholarship Benefits", " A Monthly stipend: JPY 152,000   *To cover all living expenses (accommodations, food, etc., including books).", " Application Fee, Admission Fee, and Tuition", " Economy-class air travel between your home country and Japan at the start of your study program at Keio and immediately following the end of the scholarship period. In addition to the two-way air travel, scholars will receive a USD500 travel allowance for each trip;", "The JJ/WBGSP scholarship does ", "NOT", " cover:", " VISA application(s) costs", " Expenses to bring and/or support a scholar’s family members;", " Extra-curricular courses or training;", " Language training not provided by the graduate program;", " Additional travel during the course of the study program;", " Expenses related to research, supplementary educational materials, field trips, participation in workshops/seminars, or internships; or", " Educational equipment such as computers.", "Application Criteria", " Be a national of a Bank member country that is eligible to receive Bank financing and not be a national of any country that is not eligible to receive the Bank financing. For the list of eligible World Bank countries, see", " eligible country list", ".", " Not hold dual citizen of any developed country.", " Be in good health with respect to the capacity to be a productive scholar for the duration of the Graduate Program, as certified by a medical doctor.", " Hold a Bachelor’s degree or its equivalent with superior academic achievement earned at least three (3) years  prior to the Scholarship Application Deadline.", " Not received any scholarship funding to earn a Graduate degree or its equivalent from any sources funded by the government of Japan.", " Be employed in a paid and full time position at the time of the Scholarship Application Deadline unless the applicant is from a country identified in the World Bank’s “", "Harmonized List of Fragile Situations", "”.", " Have, by  the time of  the Scholarship Application Deadline, at  least three（3）years of recent full time paid professional experience in the field of tax policy and administration at a public body after a Bachelor’s degree or its equivalent in the applicant’s home country or in another developing country; If the applicant is from a country identified in the World Bank’s “", "Harmonized List of Fragile Situations", "” at the time of the Scholarship Application Deadline, the recent professional experience does not have to be full time or paid.", " Not be  an  Executive Director,  his / her alternate, staff of  the World  Bank Group（the  World Bank, International Development Association, International Finance Corporation, Multilateral Investment Guarantee Agency, and International Center for Settlement of Investment Disputes）, or a close relative of the aforementioned by blood or adoption with the term “close relative” defined as: Mother, Father, Sister, Half-sister, Brother, Half-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew.", " Accepted to the University unconditionally or conditionally only upon securing financing.", " Demonstrate proficiency in the English language at the level of a TOEFL score of 79 (iBT) or  better, or an IELTS score of 6.0 or better.", " Meet any other criteria for admission established by Keio University.", " Applicants must not be currently pursuing a Master’s or Ph.D. program in industrialized countries.", " Applicants must not have had one or more years of training / studies and / or residency in an industrialized  country.", " Applicants must not be permanent residents / nationals of industrialized countries.", "For More Information:", "Visit the Official Webpage of the Joint Japan/World Bank Graduate Scholarship Program 2019 "], "url : https://www.opportunitiesforafricans.com/joint-japan-world-bank-graduate-scholarship-program-2019/"]]