[[["PASET Regional Scholarship & Innovation Fund 2019/2020 for PhD Scholars from Sub-Saharan Africa (Funded)", "date announced:June 15, 2019", "Application Deadline: 22nd July 2019 at 5:00pm (GMT) "], ["Application Deadline: 22nd July 2019 at 5:00pm (GMT) ", "The Partnership for skills in Applied Sciences, Engineering and Technology (PASET)", " is an African-led initiative with the objective of strengthening skills in the Applied Science, engineering and Technology to further socio-economic transformation in sub- Saharan Africa (SSA). The Regional Scholarship and Innovation Fund (RSIF) is the flagship program of PASET. ", "The primary objective of RSIF is to train high quality PhD and post-doctoral students to address the human resource gap of highly qualified specialists in the fields of applied sciences, engineering, and technology (ASET) and to contribute to improving research and innovation capacities in those fields in sub-Saharan Africa. RSIF supports PhD students, post-doctoral scientists and universities in SSA to establish a high-quality training, research and innovation environment and to develop their institutional capacity for the benefit of the whole region.", "RSIF is currently funded by contributions from African governments,\nthe World Bank and the Government of Korea; and implemented by the\nInternational Centre of Insect Physiology and Ecology (icipe), Nairobi,\nKenya, as the RSIF Regional Coordinating Unit (RCU-icipe).", "The PASET priority thematic areas are: ICTs including big data and artificial intelligence; food security and agribusiness; minerals, mining and materials engineering; energy including renewables; and climate change.", " Applications are invited from candidates interested in receiving international-quality PhD training, and access to research and innovation ecosystems at a PASET RSIF African Host University:", " • 45 RSIF PhD scholarships are available for nationals of sub-Saharan countries who do not have a PhD degree, and who are not currently enrolled in any PhD Program", " • The scholarships cover costs of the PhD Program, including travel, living expenses, medical insurance, university fees, and supervisor and research support.", " • Scholars will spend 6-24 months ‘sandwich’ training at a selected international or regional partner university, research institute or private company.", " • The RSIF scholarships will be awarded in September 2019 to begin studies in October 2019.", "Eligibility Criteria", " • Master’s degree holders in a relevant field of study", " • Citizens of a sub-Saharan African country willing to enroll full-time in a PhD program at an RSIF African Host University", " • Priority will be given to women and existing young academic faculty at African Universities", " • Demonstrate leadership potential, such as community service in areas related to PASET RSIF fields of study", " • Further information on the PhD program specific requirements and RSIF AHU admissions criteria can be found here: RSIF African Host Universities and available PhD programs. ", "Application Procedure", "Completed application forms and accompanying supporting documents must be received ONLINE through the following website ", "LINK", ".", "Deadline", " Deadline for applications: 22nd July 2019 at 5:00pm (GMT)", "Please address any questions to : ", "Sagal Abdulle,", " Doctoral Scholarships Officer, Regional Coordination Unit (RCU), ", "icipe ", "[email protected]", "For More Information:", "Visit the Official Webpage of the PASET-RSIF PHD SCHOLARSHIPS 2019/2020"], "url : https://www.opportunitiesforafricans.com/paset-regional-scholarship-innovation-fund-2019-2020/"], [["University of the Witwatersrand’s WHO/TDR 2020 Postgraduate Training Scholarships in Implementation Science (Fully Funded)", "date announced:June 9, 2019", "Application Deadline: July 31st 2019"], ["Application Deadline: July 31st 2019", " ", "The University of the Witwatersrand’s School of Public Health,", " in conjunction with the Special Programme for Research and Training in Tropical Diseases (TDR – hosted at the World Health Organization in Geneva, Switzerland) invites suitably qualified candidates to apply for a full scholarship supported by TDR to undertake full-time Master Degree Programme in the field of Implementation Science.", " The degree programme is open to candidates from a range of disciplines including Clinical and other health-related fields; Statistics and other quantitative fields, as well as Demography and Social Sciences. The degree programme should also appeal to candidates who want to become more involved in research in health-related fields. ", " DEGREE PROGRAMME ON OFFER", "•MSc Epidemiology in the field of Implementation Science (18 months full-time)", "ELIGIBILITY", "•Be resident in and a national of a low- or middle-income country in the WHO African Region. ", "•Applicants should normally be under 35 years for the Master’s Programme. Women are encouraged to apply.", "•Be interested in developing a career in implementation research on infectious diseases of poverty", "•Be proficient in English", "•Meet the Programme’s requirements ", " SCHOLARSHIP PACKAGE", "The scheme will provide full scholarships for nine (9) Masters in the 2020 academic year and covers the following:", "•Return economy air fare", " •Tuition fees", "•Basic medical and accident insurance", "•Monthly stipend to cover living expenses including accommodation. ", "•Support for the research project expenses Further, recipients’ careers will be tracked with the new TDR Global alumni and stakeholder platform that will monitor the impact of the programme, as well as provide opportunities for networking and increased visibility opportunities for the Fellows. ", " HOW TO APPLY", "The application process is two-fold. ", "1.APPLICATION TO THE UNIVERSITY OF THE WITWATERSRANDApply by completing a University of the Witwatersrand postgraduate application form online at: http://www.wits.ac.za/postgraduate/applications/Application fee is R200 for both international and local applications. ", "Application deadline: 31 July 2019. ", "Applicants should also note to: i)apply for accommodation at: https://www.wits.ac.za/accommodation/applications/Accommodation application deadline is 30 October 2019.", "ii)apply to the South African Qualification Authority (SAQA) at: http://www.saqa.org.za/index.phpif with foreign certificates,to get their certificates evaluated.", " The SAQA certificate or evidence of application MUST be uploaded as part of the required application documents", "For more information on applications, please go to:www.wits.ac.za/askwits for general application queriesorContact Mrs Gloria Bowe at ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the WHO/TDR 2020 Postgraduate Training Scholarships in Implementation Science"], "url : https://www.opportunitiesforafricans.com/university-of-the-witwatersrands-who-tdr-2020-postgraduate-training-scholarships-in-implementation-science/"], [["2019 Facebook Grace Hopper Women in Computing Scholarships (Fully Funded to the 2019 Grace Hopper Celebration of Women in Computing – Orlando,USA)", "date announced:June 5, 2019", "Application Deadline: Friday, June 28th, 5:00pm PDT. "], ["Application Deadline: Friday, June 28th, 5:00pm PDT. ", " Facebook is committed to advancing women in technology, and we are very excited to announce the", " ", "2019 Facebook Grace Hopper Women in Computing Scholarship! ", " ", " This fall we’ll join thousands of remarkable women in technology in Orlando, Florida from September 30 – October 4, 2019 for our twelfth year at the Grace Hopper Celebration of Women in Computing. This unique scholarship program will be awarded to 50 women excelling in Computer Science. Each recipient will have the opportunity not only to attend the Celebration, but to spend valuable days before the conference with Facebook engineers learning, collaborating, and preparing for the conference. ", "\nMINIMUM QUALIFICATIONS", "The\nscholarship is open to all women currently enrolled in a 4-year\nundergraduate or graduate degree-seeking university program, majoring in\nComputer Science or a related field (i.e. Computer Engineering, Math,\nStatistics, Information systems)", "Students who are current interns at Facebook or who have accepted offers (2019-2020) at Facebook are ineligible.", "For\ninternational applicants: If you are selected, you would be responsible\nfor your own travel visa. Facebook will cover travel expenses.", "\nAward Details:\n", "\n– Paid registration for the Grace Hopper Celebration\n", "\n– Paid travel and lodging, including a pre-Grace Hopper Celebration\nprogram in Orlando that includes tech talks, mentoring sessions and\nnetworking events from September 30 – October 5, 2019.\n", "\n– An invitation to a private reception with Facebook’s Engineering Team during the Grace Hopper Celebration.\n", "\n– Additional meal stipend\n", "\nImportant Dates:\n", " – Applications for the Facebook Grace Hopper Celebration Scholarship must be submitted in full by Friday, June 28th, 5:00pm PDT. ", " – Award recipients will be notified by email of their acceptance by midnight PDT on Thursday, August 1st. ", " – Scholarship recipients MUST be available to attend Facebook and conference activities between Monday, September 30, 2019 and Saturday, October 5, 2019. ", "For More Information:", "Visit the Official Webpage of the 2019 Facebook Grace Hopper Women in Computing Scholarship"], "url : https://www.opportunitiesforafricans.com/2019-facebook-grace-hopper-women-in-computing-scholarship/"], [["Konrad- Adenauer -Stiftung (KAS) Media Africa Scholarship 2020 for young sub-Saharan African journalist (Fully Funded to study in South Africa)", "date announced:June 14, 2019", "Application Deadline: July 8th 2019"], ["Application Deadline: July 8th 2019", "KAS Media Africa", " is once again calling for suitably qualified African journalists to apply for a scholarship for a post graduate Journalism degree at the prestigious University of the Witwatersrand in Johannesburg. If you are a young African journalist eager to pursue further study and take your career to the next level.", "KAS\nMedia Africa is offering university scholarships for two promising,\nyoung sub-Saharan African journalists to do full-time Honours or Masters\nDegrees at the University of Witwatersrand’s Journalism Programme in\nJohannesburg in 2020.", "The scholarship includes:", "University fees", "Return flight to Johannesburg", "Modest monthly stipend", "Accommodation fees for student housing", "A one-time payment towards study materials", "Reimbursement of costs for study visa and SAQA assessment", "Requirements:", "Candidates should be under 30 years old, working as a journalist in a sub-Saharan African country and fluent in English.", "For\nHonours, candidates must have at least three years’ working experience\nand either an undergraduate degree or pass an entrance test.", "For\nMasters, candidates must have a degree equivalent to the BA Honours in\nJournalism (or related field) and at least three years’ working\nexperience.", "Candidates must work closely with KAS Media Africa\nduring their stay in Johannesburg and write regular narrative reports on\ntheir study progress.", "Applicants need to submit:", "A motivation letter", "A CV", "Two samples of published writing / broadcast clips", "Two letters of nomination/reference by a senior journalist, publisher or academic", "Timeline:", "Closing date for applications is 8 July 2019.", "Applications should be emailed to ", "[email protected]", " with “KAS scholarship” in the subject heading.", "Candidates\nshould make themselves available in early August for an interview by\nskype or telephone and be willing to sit a test exam.", "The decision on the award should be made by the end of August 2019.", "Successful\ncandidates will be expected to complete an online student application\nand supply all the necessary documentation, including a SAQA assessment.", "The\napplication for a student visa will be the responsibility of the\ncandidate, who must begin the process before the end of October 2019.", "The\nacademic year starts in the beginning of February 2020, and ends with\nthe submission of research in November or the following February. The\nsuccessful candidate should plan to travel in late January 2020.", "For More Information:", "Visit the Official Webpage of the KAS Media Africa Scholarship 2020"], "url : https://www.opportunitiesforafricans.com/konrad-adenauer-stiftung-media-africa-scholarship-2020/"], [["Carole Stone Foundation One Young World Scholarship 2019 (Fully Funded to attend the One One Young World Summit in London)", "date announced:May 30, 2019", "Application Deadline: June 18th 2019"], ["Application Deadline: June 18th 2019", "One Young World ", "is delighted to announce that longstanding ", "One Young World Counsellor, Carole Stone CBE,", " will again sponsor a young leader to participate in the One Young World Summit – this year in London – through The Carole Stone Foundation. Carole believes that connecting people, exchanging ideas and building friendships around the world is essential to help make a fairer society.", "This year’s iteration of the Carole Stone Foundation Scholarship seeks to support a young leader who is making an impact for SDG15: Life on Land.", "Human life\ndepends on the earth as much as the ocean for our sustenance and\nlivelihoods. Plant life provides 80 percent of the human diet, and we\nrely on agriculture as an important economic resource. Forests cover 30\npercent of the Earth’s surface, provide vital habitats for millions of\nspecies, and important sources for clean air and water, as well as being\ncrucial for combating climate change.", "If you are taking action to reduce the loss of natural habitats and biodiversity this the Scholarship is for you.", "Requirements:", "Nationals of all countries are eligible to apply for this scholarship", "Evidenced impact towards the ", "targets of SDG15", ".", "Aged 18-30*", "*Most\ndelegates are between the age of 18 and 30. The One Young World team\nwill consider applications from those who are older than 30, pending\ndemonstration of appropriate personal impact, initiative, and\nwillingness to engage. We are not able to accept applications from those\nwho will be aged under 18 at the time of the Summit.", "Benefits:", "Scholars will receive:", "Access to the One Young World Summit 2019 in London", "Hotel accommodation on a shared basis between 22 and 25 (inclusive) October, 2019", "The cost of travel to and from London (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "For More Information:", "Visit the Official Webpage of the Carole Stone Foundation One Young World Scholarship 2019 "], "url : https://www.opportunitiesforafricans.com/carole-stone-foundation-one-young-world-scholarship-2019/"], [["Rhodes Southern Africa Scholarship 2020 for study in the University of Oxford (Fully Funded)", "date announced:June 1, 2019", "Application Deadline: 23:59 SAST, 15 August 2019. "], ["Application Deadline: 23:59 SAST, 15 August 2019. ", " The Rhodes Scholarship programme", " is the oldest (established 1903) international scholarship programme in the world, and one of the most prestigious. Administered by the Rhodes Trust in Oxford, the programme offers 100 fully-funded Scholarships each year for postgraduate study at the University of Oxford in the United Kingdom – one of the world’s leading universities. ", "Rhodes Scholarships are for young leaders of outstanding intellect and character who are motivated to engage with global challenges, committed to the service of others and show promise of becoming value-driven, principled leaders for the world’s future. The broad selection criteria are:•Academic excellence – specific academic requirements can be found under ", "‘Eligibility Criteria’ below.", "•Energy to use your talents to the full (as demonstrated by mastery in areas such as sports, music, debate, dance, theatre, and artistic pursuits, including where teamwork is involved).", "•Truth, courage, devotion to duty, sympathy for and protection of the weak, kindliness, unselfishness and fellowship.", "•Moral force of character and instincts to lead, and to take an interest in your fellow human beings. ", " Countries, regions and schools", "Scholarships in Southern Africa are distributed as follows:a. South Africa-at-Large Scholarships: You should apply to the committee (the “Regional Selection Committee”) in whose area you permanently live or in which you have received, or are currently receiving, any considerable part of your education. Save for KwaZulu-Natal as explained below, all successful candidates from Regional Selection Committees are sent to the South Africa-at-Large Selection Committee, for the final round of interviews. ", " The South Africa-at-Large Selection Committee selects successful candidates and recommends them to the Rhodes Trust, which ultimately makes the scholarship awards. There are four regional selection committees, namely:", "i. Eastern Cape and Free State;", "ii. KwaZulu-Natal;", "iii. Gauteng, Limpopo, Mpumalanga and North-West; and", "iv. Western Cape and Northern Cape. b. KwaZulu-Natal ", "Scholarship: You may apply for the KwaZulu-Natal Scholarship if you live permanently or have received, or are currently receiving, a considerable part of your education in KwaZulu-Natal (KZN). ", "The KZN Selection Committee may make one direct recommendation (similar to those of the South Africa-at-Large Selection Committee) to the Rhodes Trust each year, and also acts as a Regional Selection Committee ", " c. Botswana, Lesotho, Malawi, Namibia and eSwatini (formerly Swaziland) Scholarship (BLMNS): You may apply to the BLMNS selection committee if you fulfil the citizenship or legal residence requirement in one of the mentioned countries. The procedure is the same as that for the South Africa-at-Large Scholarships. ", "d. Named and partner schools: Former pupils of the four named schools and their partner schools, namely:i. Diocesan College (Bishops), St Cyprian’s School, St George’s Grammar School, Herschel Girls School, and LEAP 1 School (all in Rondebosch);", " ii. Paul Roos Gymnasium, Rhenish Girls’ High School and Bloemhof Girls’ High School (all in Stellenbosch);iii. South African College School (SACS), Sans Souci Girls’ High School and Rustenburg High School for Girls (all in Newlands); andiv. St Andrew’s College and Diocesan School for Girls (DSG) (both in Grahamstown), may apply for their relevant school Scholarship, or for the South Africa-at-Large (including KZN) or BLMNS Scholarships. ", "NOTE – For South Africa applications, you may only apply to one region or one school.", " Eligibility Criteria", "a.Nationality/citizenship: You must be a citizen or legal permanent resident of South Africa, Botswana, Lesotho, Malawi, Namibia or eSwatini.", "b.Education/residency: You must have resided for at least five years within the period of ten years immediately preceding your application in South Africa, Botswana, Lesotho, Malawi, Namibia or eSwatini.", " c.Age: You must have reached your 19th and not have passed your 25th birthday on 01 October 2020, which means you must have been born after 30 September 1995 and on or before 01 October 2001.For medical students and medical doctors the age limit is extended by up to three years to allow them to complete internship and community service. This means applicants must have been born after 30 September 1992 and on or before 1 October, 2001. ", " d.Academic achievement: You must have completed (or will have completed by 30 June 2020) an undergraduate degree from a college or university (normally a Bachelor’s degree) to a sufficiently high standard to be admitted to postgraduate study at the University of Oxford. In this respect, please note carefully the requirements for your chosen course at Oxford.", "e.Given the very intense international competition for places at the University of Oxford, candidates (with the exception of those studying in South Africa and Namibia and, for some countries, those studying medicine) will have a greater chance of successful admission to Oxford if they have an Honours degree (or have taken an Honours year) from a University outside of their country or if they have studied to Masters level within their country. Please contact your National Secretary if you require further advice. ", " Application Procedure ", "a.You can apply online from 01 June 2019 at http://www.rhodeshouse.ox.ac.uk/scholarships/apply via the scholarships tab.", "b.You must submit your application online, with all supporting documents, by 23:59 SAST, 15 August 2019. ", " c.In preparation for making your application, you should read carefully the general information, particularly that held on the Scholarships tab, on the Rhodes website, the Conditions of Tenure for the Rhodes Scholarship, the information in this document and the graduate admissions pages of the University of Oxford: www.ox.ac.uk/admissions/graduate. ", "d.Shortlisted candidates will be invited to a social engagement (a dinner) and a final interview. You must be available to attend both, in person, as no accommodations can be made on date and time, or mode, of these events. Interviews will be held in the region to which you have applied , all interviews will have taken place by the end of Novermber. ", " The regional and school selection committees usually meet in October/November. The BLMNS selection committee will hold its interviews during November. The South Africa-at-Large selections are usually held on the last weekend of November. No candidate will be selected without an interview. Reasonable travel expenses to the nearest selection committee (and for those shortlisted by the KZN committee) for the purposes of interviews will be paid. The Trust will not be responsible for the cost of overseas travel. Accommodation within South Africa will, where necessary, be provided. ", "For More Information:", "Visit the Official Webpage of the Rhodes Southern Africa Scholarship 2020"], "url : https://www.opportunitiesforafricans.com/rhodes-southern-africa-scholarship-2020/"], [["The Vanier Canada Graduate Scholarship (Vanier CGS) program 2019/2020 for doctoral study in Canada ($50,000 per year)", "date announced:June 19, 2019", "Application Deadline: November 20th 2019"], ["Application Deadline: November 20th 2019", " The Government of Canada ", "launched the", " ", "Vanier Canada Graduate Scholarships (Vanier CGS) program", " in 2008 to strengthen Canada’s ability to attract and retain world-class doctoral students and establish Canada as a global centre of excellence in research and higher learning. Vanier Scholars demonstrate leadership skills and a high standard of scholarly achievement in graduate studies in the social sciences and humanities, natural sciences and/or engineering and health. ", "Scope", "Up to 166 scholarships are awarded annually", "Footnote 1", ";", "\nA total of up to 500 scholarships are active at any time.", "Value", "$50,000 per year ", "Duration", "3 years (non-renewable) ", "Scholarships are distributed equally between the three federal granting agencies:", "Canadian Institutes of Health Research (CIHR)", "Natural Sciences and Engineering Research Council (NSERC)", "Social Sciences and Humanities Research Council (SSHRC)", "Eligibility Requirements:", "Citizenship:", "Canadian citizens", "Permanent residents of Canada ", "Foreign citizens", "Areas of research:", "Health research", "Natural sciences and/or engineering research", "Social sciences and humanities research", "Selection Criteria", "Academic Excellence", "Research Potential", "Leadership (potential and demonstrated ability)", "Timelines", "July – November 2019", "Applicants seek a nominating institution, prepare and submit application package.", "Internal Deadline (varies)", "Deadline to submit application to the nominating institution. Contact nominating institution for specific date.", "November 6, 2019 (20:00 ET)", "Deadline for institutions to submit nominations to the Vanier CGS program.", "November 2019 – March 2020", "Review and evaluation of nominations.", "Early April 2020", "Anticipated notification of results.Nominees will be notified by email when the results are available on ResearchNet.", "May 1, 2020, September 1, 2020 or January 1, 2021", "Payments begin.", "For More Information:", "Visit the Official Webpage of the Vanier Canada Graduate Scholarship (Vanier CGS) program 2019/2020"], "url : https://www.opportunitiesforafricans.com/the-vanier-canada-graduate-scholarship-vanier-cgs-program-2019-2020/"], [["American Academy of Hospice and Palliative Medicine (AAHPM) International Physician Scholarship 2019", "date announced:June 12, 2019", "Application Deadline: August 1st 2019"], ["Application Deadline: August 1st 2019", "The International Physician Scholarship Fund ", "was established to provide access to quality education for physicians who reside in low and middle income countries (as defined by World Bank) to attend and participate in the Annual Assembly.", "This scholarship program provides financial support (up to $5,000) to scholarship recipients to cover ordinary costs associated with attending the Annual Assembly registration and travel-related expenses, including air fare, taxi fare, meals, and lodging. At the Annual Assembly, scholarship recipients will gain access to the latest clinical information and research updates in hospice and palliative care from leading experts in the field.", "Eligibility", "Scholarships are available to physicians who work in hospice and\npalliative medicine and who care for seriously ill patients. Eligible\nphysicians must permanently reside in low and middle income countries as\ndefined by World Bank. It is our hope that the scholarship recipients\nwill share the knowledge attained from the Annual Assembly to improve\nthe palliative care offerings in their home country. Preference will be\ngiven to applicants who are", "members of the AAHPM – physicians who reside in a low or middle\nincome country as defined by the World Bank & the HINARI list of\neligible countries are eligible for a complimentary international\nmembership.", "have not previously attended the Annual Assembly", "are junior in their career with 2-10 years of experience primarily\nin palliative care, including a resident or fellow, focused on studying\npalliative care, and", "whose organizations are considered least able to afford this opportunity.", "How to Apply", "Applications for the 2020 International Physician Scholarship are now open. The deadline to apply is August 1, 2019.", "You can complete the application one of two ways:", "Complete the ", "online application", "Download and email the ", "paper application", " to ", "[email protected]", "For More Information:", "Visit the Official Webpage of the AAHPM International Physician Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/aahpm-international-physician-scholarship-2019/"], [["Government of Colombia Master and PhD Scholarships 2019/2020 for study in Colombia (Funded)", "date announced:June 17, 2019", "Application Deadline: 28th June 2019 "], ["Application Deadline: 28th June 2019 ", " Financial grants offered to foreign citizens, in return for international cooperation received by ", "Colombia", " under existing cooperation agreements ", "Requirements:", "Foreign professionals in the range of age between 25-49 years old, who have undergraduate degree (university degree or bachelor) in different disciplines, who have a grade point average of 4.0 on the Colombian scale of 1 to 5, and at least 1 year of professional experience in their field of study.", "The candidate must master the Spanish language (reading,writing and speaking) He/she must deliver us a certificate of these competences and must have an admission letter from the Colombian educational institution in any career determined in the catalog annex to this call.", "The candidate must not live in Colombia and must not have Colombian nationality.", "Prove minimum one year experience in their field of study, after obtaining the degree.", "The candidate must have successfully completed college.", "The academic program should start in the second semester of 2018. Admission to programs starting in 2019 will not be contemplated.", "The candidate must be in arange of age between 25-49 years old.", "Applications from foreign citizens who are living in Colombia will not be accepted", "Scholarship Worth:\nTUITION FEES:\n100% coverage of all these costs granted by the Colombian universities (only for academic programs found in the catalog of this call).\n \nINCIDENTAL:\nGrant of $208.853 COP) for once during the period of studies, just in case of circumstances beyond the beneficiary control.\n \nSTIPEND FOR BOOKS AND MATERIALS:\nGrant of $401.321 COP for once, at the beginning of the academic program\n \nMONTHLY ALLOWANCE:\nGrant of the sum equivalent to 3 Minimum Monthly Legal salaries. $2.343.726 COP\n \nHEALTH INSURANCE:\nWide coverage in medical assistance only in Colombia, during the period of studies.\n \nINSTALLATION COSTS:\nGrant of {$401.321 COP for once at the beginning of studies\n \nPostgraduate scholarships in Colombia will have a maximum of twelve (12) months for\nspecialization and twenty-four (24) months to master and up to thirty-six (36) months for\ndoctorate. The scholarship holder of doctorates that last more than 3 years have to assume\nby themselves the allowance for the rest of the program. Nevertheless, the Colombian\nuniversity will cover all the tuition fees during the whole program.\n \n", "Selection Criteria:", "Academic excellence", "Coherence between the academic trajectory, work experience and academic program", "Professional working experience", "Study Project", "Reciprocity on educational cooperation", "How to Apply: ", " It is important for interested candidates to go through the Application requirements before applying.", "Required documents, which are detailed in this call, should be at ICETEX on the date indicated in the notice.", "No documents will be received outside the established dates.", "The documents required in this call must be translated into Spanish", "All application documents t o this call should be sent to ICETEX through the Embassy from the country of origin of the applicant in Colombia. In case of absence of diplomatic representation in Colombia, the applicant must send it directly to ICETEX.", "For More Information:", "Visit the Official Webpage of the Government of Colombia Master and PhD Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/government-of-colombia-master-and-phd-scholarships-2019-2020/"], [["Western Union Moving Money For Better Scholarships 2019 (Fully Funded to attend the One Young World Summit 2019 in London, United Kingdom.)", "date announced:May 30, 2019", "Application Deadline: June 12th 2019"], ["Application Deadline: June 12th 2019", "Western Union is a global leader in cross-border, cross-currency\nmoney movement. Our omnichannel platform connects the digital and\nphysical worlds and makes it possible for consumers and businesses to\nsend and receive money and make payments with speed, ease, and\nreliability. With our global reach, Western Union moves money for\nbetter, connecting family, friends and businesses to enable financial\ninclusion and support economic growth. Are you passionate about\nfinancial inclusion? Are you a problem-solver who believes in finding\ninnovative solutions? The Moving Money For Better Scholarship is an\nopportunity for creative leaders who believe in our purpose of moving\nmoney for better.", "The Moving Money For Better Scholarship", " will allow two leaders passionate about financial inclusion the opportunity to join the Western Union delegation at the ", "One Young World Summit 2019 in London, United Kingdom.", " During the Summit they will connect with fellow change makers from more than 190 countries!", "Requirements:", "Most delegates are between the age of 18 and 30. The One Young World\nteam will consider applications from those who are older than 30,\npending demonstration of appropriate personal impact, initiative, and\nwillingness to engage. We are not able to accept applications from those\nwho will be aged under 18 at the time of the Summit.", "Successful scholars will demonstrate:", "Evidenced\ncommitment to delivering positive change through the financial the\nfinancial inclusion of those who may be left behind by the rapidly\nhanging global economy.", "Demonstrated capacity for leadership", "Understanding of key local and/or global issues", "Track record of generating impactful and innovative ideas", "Scholars will receive:", "Access to the One Young World Summit 2019 in London", "Hotel accommodation on a shared basis (inclusive) between 22 and 25 October, 2019", "The cost of travel to and from London (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "For More Information:", "Visit the Official Webpage of the Western Union Moving Money For Better Scholarships 2019 "], "url : https://www.opportunitiesforafricans.com/western-union-moving-money-for-better-scholarships-2019/"], [["The SAAO Prize Scholarships 2019/2020 for African PhD Students", "date announced:June 13, 2019", "Application Deadline: 31 July 2019 "], ["Application Deadline: 31 July 2019 ", "The SAAO Prize Scholarship", " is a prestigious annually awarded scholarship offered to a top African student to work on a PhD project supervised by researchers at the SAAO. The scholarship is for a 3-year PhD registered at a South African university and the student will be required to spend a minimum of 60% of their time at the SAAO. The scholarship will cover tuition and a generous stipend for living expenses. Additional support for conference travel and equipment will be provided.  The advertisement for the scholarship can be found ", "here", " .   .", "Projects Offered:", "Mass Loss, Pulsation and Atmospheric Mixing in Intermediate Mass Stars", "\nSupervisors: John Menzies (", "[email protected]", "), Patricia Whitelock (SAAO and UCT; ", "[email protected]", ") : ", "Project details", "3D Simulations of Stellar Interactions", "\nSupervisor: Shazrene Mohamed (", "[email protected]", "): ", "Project details", "Planetary and substellar companions to Planetary nebulae and other post-AGB stars", "\nSupervisors: Brent Miszalski (", "[email protected]", ") and Rajeev Manick (", "[email protected]", "): ", "Project details", "Transients in the LSST Era", "\nSupervisors: David Buckley (", "[email protected]", "), Patrick Woudt (UCT; ", "[email protected]", "), and Brian", "\nvan Soelen (UFS; ", "[email protected]", "): ", "Project details", "Vertical structure evolution of spiral galaxy disks using optical and near-infrared", "\nintegral field spectroscopy", "\nSupervisors: Matthew Bershady (", "[email protected]", "): ", "Project details", "Design, development and commissioning of a fibre slit-mask integral-field unit for", "\nSALT prime-focus spectrograph", "\nSupervisors: Matthew Bershady (", "[email protected]", "): ", "Project details", "Further information about the scholarship application procedure and scholarship rules can be found ", "here", " .", " \nYou are strongly encouraged to contact potential supervisors to discuss\nthe project before applying. Contact ", "[email protected]", " if you have\nfurther queries.", "Eligibility:", "\nThe scholarship is currently open to South Africans or citizens of other\nAfrican countries who hold, or are studying towards, an MSc degree in\nphysics, astrophysics, or a closely related area (ideally with some\nastronomy background), and must be ready to register for a PhD at the\nstart of the 2020 academic year (typically the end of February 2020).", "Application:", "\nSend your CV, motivation, academic transcript to ", "[email protected]", "\nand arrange for 2 reference letters to be sent to the same address by\nthe closing date.", "Degree Funded: 3-year PhD", "\nFunding Amount: R180,000 per year (plus support for tuition, equipment and travel).", "\nStart of Funding: 2020", "\nApplications Open: 10 June 2019", "\nApplications Close: 31 July 2019", "For More Information:", "Visit the Official Webpage of the SAAO Prize Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/the-saao-prize-scholarships-2019-2020-for-african-phd-students/"], [["Canon Collins Scholarships 2019/2020 for Postgraduate Study in South Africa (Funded)", "date announced:June 20, 2019", "Application Deadline: Monday 19 August 2019. "], ["Application Deadline: Monday 19 August 2019. ", "Canon Collins Trust", " seeks to support exceptional individuals who are committed to social justice in Southern Africa and for whom a postgraduate qualification is an essential tool in working to create an open and just society.", "In 2015 the Trust revised its South African\nscholarship awards policy. We now offer scholarships only to those\nstudying in three areas:", "Justice", ", which includes Law, Economics, Politics and the Environment", "Education", ": policy and practice", "Humanities", ", which includes Literature, History, Anthropology and the Arts", "Applications for courses that are not within these areas (for example MBAs, medical sciences, sports sciences, applied sciences) will be rejected.", "Requirements:", "In addition, to be considered for a scholarship under this programme you  must:", "be a national of, or have refugee status in, one of the following countries: Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia, Zimbabwe", "be normally resident in one of the above countries", "be in possession of a good first degree (minimum second class, upper division or equivalent) or about to graduate in the year of application", "be studying or applying to study at a South African university", "In 2020, the value of the scholarship package will range from R20,000\nto R100,000 depending on student circumstances. We support both full\nand part-time study and will consider applications from those who wish\nto study by distance learning.", "We also organise an annual\nconference for current scholars, and hold several smaller events\nthroughout the year. Scholarship holders are expected to participate in\nthese activities and to become part of and contribute to our network.", "Eligible applicants will automatically be considered for these named scholarships:", "Ros Moger and Terry Furlong", "Sol Plaatje Canon Collins Scholarships", ".", "How to apply", "You can access the online application form through the link below.Click here to apply for the Canon Collins Scholarships for Postgraduate Study in South Africa. Deadline for applying is Monday 19 August 2019. ", "For More Information:", "Visit the Official Webpage of the Canon Collins Scholarships 2019/2020 "], "url : https://www.opportunitiesforafricans.com/canon-collins-scholarships-2019-2020-for-postgraduate-study-in-south-africa/"], [["MTN Ghana Foundation Bright scholarship scheme 2019 for young Ghanaian youths", "date announced:June 17, 2019", "Application Deadline: 13th July, 2019 "], ["Application Deadline: 13th July, 2019 ", "Are you a First year or continuing student pursuing first degree education in any of the public tertiary institutions in Ghana requiring financial assistance? ", "The ", "MTN Ghana Foundation", " ", "has launched a scholarship scheme to support 100 brilliant and needy Ghanaians to complete their tertiary education. 300 scholarship awards would be given over a period of three years and beneficiaries will be selected from all 10 regions of Ghana. This scholarship will cover the cost of Tuition, Accommodation and a Stipend for books and other relevant reading materials.", "For about two decades, 1000s of Ghanaian youth have been supported by MTN Ghana Foundation to pursue various courses at different levels of education in Ghana through the Scholarship scheme", "The applicant ", "Must be a citiz­en of Ghana­", "Must be prove­n to be; ", " c) Be hard-­worki­ng with excellent academic results", "(An applicant in the first year of any public tertiary institution in Ghana should have credit passes in six (6) subjects with overall aggregate of 24 at the WASSCE/SSSCE respectively.", " Three\nof the six subjects should be core subjects: English Language,\nMathematics, Integrated Science or Social Studies and three must be in\nrelevant electives.", " For the purposes of this Scholarship, a credit pass in: ", " i. WASSCE means A1 – C6", " ii. SSSCE means A – D", "AND ", "A continuing student applicant should have a minimum ", "GPA of 3.0 ", " ", "d) Be invol­ved in extra curri­cula activ­ities.", " e) Be prove­n to be without any academic disciplinary issue and/or must not be serving a bond to be of good behavior.", "Continuing\nstudents and first year students in any accredited public tertiary\ninstitution in Ghana who meet all criteria may apply. ", "Provi­de a ", "one page letter of motivation", "\nindicating why MTN Found­ation shoul­d award you a schol­arshi­p for\nyour education, including what your educa­tiona­l and profe­ssion­al\ngoals are.", "Attac­h\nWASSCE results, admis­sion lette­rs and writt­en Testi­monia­ls from\nyour Senior High School. Pleas­e note that thoro­ugh check­s will be\nmade on all docum­ents submi­tted.­", "Application must be submitted together with valid contact details (Phone number/E-mail address).", " Shortlisted appli­cants will be notif­ied and invit­ed to meet the scholarship panel.", "An applicant who enjoys any form of educational scholarship should not apply.", "Priority\nwould be given to persons pursuing courses in ICT, Computer Science,\nand Engineering. WOMEN, and PERSONS with disability are especially\nencouraged to apply.", "Application Requirements:", " Attach a one page letter of motivation or reason indicating why MTN Foundation should award you a scholarship for your education. This should touch on what your educational and professional goals are.", "• Attach WASSCE/ SSSCE results, admission letter and written testimonials from your Senior High School.", "• Attach evidence of Ghanaian citizenship", "• Date of submission of application (Between 13th June 2019 to 13th July, 2019) ", "For More Information:", "Visit the Official Webpage of the MTN Ghana Foundation Bright scholarship scheme 2019"], "url : https://www.opportunitiesforafricans.com/mtn-ghana-foundation-bright-scholarship-scheme-2019/"], [["Rhodes East Africa Scholarship Programme 2020 for study in the University of Oxford (Fully Funded)", "date announced:June 1, 2019", "Application Deadline: 23:59 East Africa Time (EAT), Saturday, 31 August 2019. "], ["Application Deadline: 23:59 East Africa Time (EAT), Saturday, 31 August 2019. ", " ", "The Rhodes Scholarship programme", " is the oldest (established 1903) international scholarship programme in the world, and one of the most prestigious. Administered by the Rhodes Trust in Oxford, the programme offers 100 fully-funded Scholarships each year for postgraduate study at the University of Oxford in the United Kingdom – one of the world’s leading universities. ", "Rhodes Scholarships are for young leaders of outstanding intellect and character who are motivated to engage with global challenges, committed to the service of others and show promise of becoming value-driven, principled leaders for the world’s future. The broad selection criteria are:", "•Academic excellence – specific academic requirements can be found under ", "‘Eligibility Criteria’ below.", "•Energy to use your talents to the full (as demonstrated by mastery in areas such as sports, music, debate, dance, theatre, and artistic pursuits, including where teamwork is involved).", "•Truth, courage, devotion to duty, sympathy for and protection of the weak, kindliness, unselfishness and fellowship.", "•Moral force of character and instincts to lead, and to take an interest in your fellow human beings. ", " Eligibility Criteria", "a.Nationality/citizenship: You must be a citizen of Burundi, Rwanda, South Sudan, Tanzania or Uganda.", "b.Education/residency: You must have been resident in one or more of the countries listed above, or in Kenya, for at least five of the last ten years.", "c.Age: You must have reached your 19th and not have passed your 26th birthday on 1 October 2020, which means you must have been born after 30 September 1994 and on or before 1 October 2001. Exceptions, extending the upper age limit by no more than 2 years, may be made for students who have undertaken an undergraduate degree of five years or more, at the discretion of the National Secretary. In such cases, exceptions will only be considered for applicants born after 30 September 1992 and on or before 1 October 2001.", "d.Academic achievement: You must have completed (or will have completed by no later than July 2020) an undergraduate degree from a college or university (normally a Bachelor’s degree) to a sufficiently high standard to be admitted to postgraduate study at the University of Oxford. This would normally be the equivalent of a First Class, or a GPA of 3.7 or more. ", "In this respect, please note carefully the requirements for your chosen course at Oxford.e.English Language requirement: You must have a sufficiently high standard of English to meet the English language proficiency requirements (at the Higher Level listed) of the University of Oxford: www.ox.ac.uk/admissions/graduate/applying-to -oxford/application-guide. ", " Application Procedure", " a.You can apply online from 01 June 2019 at http://www.rhodeshouse.ox.ac.uk/scholarships/apply via the scholarships tab.", "b.You must submit your application online, with all supporting documents, by 23:59 East Africa Time (EAT), 31 August 2019. ", "c.In preparation for making your application, you should read carefully the general information, particularly that held on the Scholarships tab, on the Rhodes website, the Conditions of Tenure for the Rhodes Scholarship, the information in this document and the graduate admissions pages of the University of Oxford: www.ox.ac.uk/admissions/graduate. ", "d.Shortlisted candidates will be invited to a social engagement (held on the eve of the interview) and a final interview. You must be available to attend both, in person, as no accommodations can be made on date and time, or mode, of these events. Interviews will be held in Kampala, Uganda in late October / early November. Further details will be communicated to shortlisted candidates. ", "No candidate will be selected without an interview. Reasonable travel expenses will be reimbursed for interview candidates traveling from an East African location outside of Uganda. Overnight accommodation will be provided if necessary. e.All applicants will be emailed with the outcome of their application by 15 November 2019. ", "\nInformation for Candidates – East Africa\n", "\nGuidance for Referees – East Africa\n", "For More Information:", "Visit the Official Webpage of the Rhodes East Africa Scholarship Programme 2020"], "url : https://www.opportunitiesforafricans.com/rhodes-east-africa-scholarship-programme-2020/"], [["DAAD-NRF Joint In-Country Master’s and Doctoral Scholarships 2019 for South Africans.", "date announced:June 9, 2019", "Application Deadline: July 31st 2019"], ["Application Deadline: July 31st 2019", "Together with the ", "National Research Foundation (NRF) ", "in South Africa, the DAAD awards funding for Master and PhD degrees at South African Universities to South Africans.", "The DAAD, in partnership with the National Research Foundation (", "NRF", "),\noffers scholarships for postgraduate studies on a Master and PhD level\nto South Africans at South African universities in any field of study. This scholarship is only open to South African citizens or Permanent South African Residency Holders.", "DAAD-NRF In-Country Scholarship holders are eligible for exciting funding and networking opportunities in addition to the scholarship they have received for their full-time Master or PhD degree in South Africa. ", " They may choose to apply for DAAD funding for a Short-Term Research Visit of 2 – 6 months to Germany and/or attend one of six summer schools on offer in Germany during their funding period with the DAAD and NRF. ", "The DAAD Information Centre Johannesburg furthermore delights in inviting DAAD-NRF Scholarship holders to a yearly conference for networking purposes. This scholarship is thus especially interesting to South Africans who would like to study in South Africa but still gain international research experience in Europe.", "Candidates must apply through their universities. Each university has its own internal deadline.", " For more information the candidate’s faculty or research office at the relevant university may be contacted.", "Universities must send students’ applications to the NRF by these deadlines:", "Master: 16 September 2019", "PhD: 31 July 2019", "For More Information:", "Visit the Official Webpage of the DAAD-NRF Joint In-Country Master’s and Doctoral Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/daad-nrf-joint-in-country-masters-and-doctoral-scholarships-2019-for-south-africans/"], [["RNTC Scholarships 2020 for media and communications professionals to study in the Netherlands (Fully Funded)", "date announced:June 12, 2019", "Application Deadline: July 11th 2019"], ["Application Deadline: July 11th 2019", " The Dutch Ministry of Foreign Affairs provides OKP (formerly known as NFP) and ", "MSP scholarships", " for the RNTC courses for media and communications professionals from a variety of partner countries. The scholarships include a contribution towards the cost of living, course fees, visa, travel and insurance. If applicable, the scholarship holder is expected to cover the difference between actual costs and the OKP or MSP scholarship amount. The scholarships are administered by Nuffic, the Netherlands Organisation for International Cooperation in Higher Education.  ", "Courses:", "\nAs of today you can apply with a scholarship for the following courses:", "Producing Media to Counter Radicalisation", "Media Campaigns for Development and Social Change", "Requirements:", "Apart from the RNTC course admission requirements, you must meet the following requirements to be eligible for a ", "OKP", " (formerly known as NFP) scholarship:", "You are a national and live and work in one of the countries in the Nuffic OKP list, which you can find ", "here;", "You must not be employed by an organisation that has its own means\nof staff-development. Organisations that are considered to have their\nown means for staff development are for example: multinational\ncorporations (e.g. Shell, Unilever, Microsoft), large national and/or a\nlarge commercial organisations, bilateral donor organisations (e.g.\nUSAID, DFID, Danida, Sida, Dutch ministry of Foreign affairs, FinAid,\nAusAid, ADC, SwissAid), multilateral donor organisations, (e.g. a UN\norganisation, the World Bank, the IMF, Asian Development Bank, African\nDevelopment Bank, IADB), international NGOs (e.g. Oxfam, Plan, Care);", "You have an ", "Employer’s Statement", "\nthat complies with the format Nuffic has provided. All information must\nbe provided and all commitments that are included in the format must be\nendorsed in the statement;", "You have an official and valid passport;", "You do not receive more than one fellowship for courses that take place at the same time;", "Check if you need to provide a Government Statement ", "here", ". If required, you must have a ", "Government Statement", " that complies with the format Nuffic has provided. ", "N.B. The OKP program has no age limit.", "How to Apply:", "1.    Register with RNTC to check that you are eligible for\nthe course you would like to do. You can register for a course by\nselecting a course. Make clear in your registration that you are\nintending to apply for an ", "OKP", " or ", "MSP", " fellowship. Note that you can ", "only ", "apply\nfor a scholarship for your chosen course during the scholarship\napplication window for that course. There are two or three of these\nscholarship windows open every year.", "2.    Once you have submitted your registration, RNTC will\ninform you by email whether you are eligible for a scholarship or not\n(usually within 10 working days).", "3.    If you are eligible for the scholarship, RNTC will\nsend you a link by email to apply for a OKP or MSP fellowship in the\nATLAS online system. This is where you complete your scholarship\napplication.", "Please note that your OKP or MSP application has to\nbe completed and submitted in one go via ATLAS! Once you have submitted\nyour application, you will not be able to make changes or additions.", "4.    Before applying for a OKP or MSP scholarship via\nATLAS, make sure you have all the documents mentioned below ready.\nPlease use the formats provided by Nuffic and submit all the required\ndocuments EXACTLY as specified. Otherwise, your application will be\nrejected by Nuffic! The file format should be PDF and your document must\nnot exceed 2 MB.", "\nCopy of a valid passport. The passport needs to be still valid at least ", "three months ", "after the submission date of the registration form.\n", "\nA Letter of motivation. Have this prepared so you can\ncopy/paste it into the online application form. This can be more or less\nthe same motivation as you prepared for your RNTC application. This\nmotivation will weigh heavily in the selection procedure. Make sure you\naddress the following questions:\n", "\n​What is the issue or problem you want to address in your country?\n", "\nHow will this course enable you to address this issue?\n", "\nHow will you address this issue considering your position within your organisation?\n", "\nAn Employer’s Statement. This is a very important document, please fill it out EXACTLY as specified by Nuffic and use this ", "format provided by Nuffic", ". PLEASE NOTE THAT THIS DOCUMENT CONSISTS OF TWO PAGES, BOTH HAVE TO BE FILLED IN, SIGNED & STAMPED.\n", "A Government Statement (if applicable for your country). A\nnumber of governments of OKP and MSP countries require a government\nstatement before candidates can apply for a scholarship. In this\nstatement, the government expresses its support for the scholarship\napplication. Please check ", "this overview", " to\nsee if this applies for your country. Also, it’s always good to check\nthis with your government and/or the Netherlands embassy. If a\ngovernment statement is required for your country, please use\n", "this format", "this format", "\nprovided by Nuffic for OKP countries and\n", "this format", "this format", "\n, if you are from a MSP country.", "5.     Download and read the ", "OKP and MSP registration instructions for ATLAS.", "6.    If you are certain that you are eligible for an OKP\nor MSP scholarship and you have collected all the necessary information\nand documentation, you can start with your application in Nuffic’s ATLAS\nonline application system using the online application form link that\nwas sent to you.", "For More Information:", "Visit the Official Webpage of the RNTC Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/rntc-scholarships-2020-for-media-and-communications-professionals-to-study-in-netherland/"], [["Singapore International Graduate Award 2020 Scholarships for PhD study in Singapore (Fully Funded)", "date announced:June 20, 2019", "Application Deadline: 1 December 2019 (2359hrs GMT +8 Singapore time) "], ["Application Deadline: 1 December 2019 (2359hrs GMT +8 Singapore time) ", "The Singapore International Graduate Award (SINGA)", " ", "is a collaboration between the Agency for Science, Technology & Research (A*STAR), the Nanyang Technological University (NTU), the National University of Singapore (NUS) and the Singapore University of Technology and Design (SUTD). ", "PhD training will be carried out in\nEnglish at your chosen lab at A*STAR Research Institutes, NTU, NUS or\nSUTD. Students will be supervised by distinguished and world-renowned\nresearchers in these labs. Upon successful completion, students will be\nconferred a PhD degree by either NTU, NUS or SUTD.", "Singapore is the gateway to some of the\nfastest-growing economies in the Asia Pacific region. And with SINGA,\nyou can pursue your PhD education in Singapore, establish global links\nand take your research career to greater heights.", "SINGA fosters a vibrant and culturally diverse research community of international students. You’ll be working in a multi-cultural environment alongside distinguished and world-renowned researchers in state-of-the-art facilities.", "Research Areas", "\nResearch areas under the PhD Programme fall broadly under two categories:\n", "\nBiomedical Sciences; and\n", "\nPhysical Science and Engineering.\n", "More information on:", "A*STAR Supervisors and Projects", "NTU Supervisors and Projects", "NUS Supervisors and Projects", "SUTD Supervisors and Projects", "Eligibility Requirements", " Open for application to all international graduates with a passion for research and excellent academic results Good skills in written and spoken English Good reports from academic referees ", "Benefits:", "The award provides support for up to 4 years of PhD studies including:", "Tuition fees", "Monthly stipend of S$2,000, which will be increased to S$2,500 after the passing of the Qualifying Examination", "One-time airfare grant of up to S$1,500*", "One-time settling-in allowance of S$1,000*", "* Subject to terms and conditions", "Estimated cost of living in Singapore", "Items", "Per Student Per Month (S$)", "\nFood\n", "\nUniversity Canteens\n", "\n250 – 350\n", "\nMeals outside Campus\n", "\n450 – 600\n", "\nAccommodation\n(based on a single room)\n", "\nOn- Campus*\n", "\n400 – 700\n", "\nTransport Expenses (local)\n", "\n100 – 150\n", "\nOther Expenses (stationary, laundry, toiletries, recreation, etc.)\n", "\n400 – 500\n", "Total Estimated Cost of Living", "1,400 – 2,000", " *Priority for on-campus accommodation is usually given to first year students.", "Application Procedure:", "1. Browse PhD Research Projects", "Go to Research Areas to browse the projects you are interested in.", "2. Documents Required", "\nDo prepare the following documents in advance before applying. ", "Note: Do NOT mail any hard copy documents to SINGA Office. All necessary documents are to be submitted online.", "\na. Identification card or Passport", "\nb. A recent passport-sized photo (in .jpeg or .png format)", "3.Transcripts & Reports", "\nALL transcripts need to be in English translation", "Mandatory", "Bachelor’s and/or Master’s academic transcripts.", "\nBachelor’s Degree certificate(s) / scroll(s) or a letter of\ncertification from the university on your candidature if your degree\ncertificate / scroll has not yet been conferred.", "\n2 recommendation reports (to be completed and submitted online by the referees).", "Optional", "GRE / IELTS / TOEFL / SAT I & II / GATE results. However, do note that you may be requested by the university to submit satisfactory scores as part of the university admission requirement.", "For More Information:", "Visit the Official Webpage of the Singapore International Graduate Award 2020 Scholarships"], "url : https://www.opportunitiesforafricans.com/singapore-international-graduate-award-2020-scholarships-for-phd-study-in-singapore/"], [["DAAD Postdoctoral Researchers International Mobility Experience – P.R.I.M.E. 2019 (Funded to Germany)", "date announced:June 12, 2019", "Application Deadline: 30 August 2019 "], ["Wissenschaftler diskutieren an einer Tafel des Max-Planck-Institut fuer Quantenoptik in Muenchen (MPQ)\nScientists discussing at a board of the Max-Planck-Institut fuer Quantenoptik in Muenchen (MPQ)\n(c) Copyright: DAAD/Volker Lannert\nD3S_5819.jpg", "Application Deadline: 30 August 2019 ", " In 2014 the German Academic Exchange Service (DAAD) initiated the ", "programme “Postdoctoral Researchers International Mobility Experience” (PRIME)", " to support the international mobility of postdoctoral researchers by temporary positions at German universities in place of conventional scholarships. The programme has been funded by the German Federal Ministry of Education and Research (BMBF) and the European Union (EU/FP7/Marie Curie Actions/COFUND). Funding is provided for 18 months, in which 12 months have to be spent abroad and 6 months (re-integration phase) at a German university. The re-integration phase is mandatory. The German university administrates the salary during the whole funding period. ", " Eligibility", "Eligibility to the programme is defined by four criteria:", "➢Applicants must have completed their PhD before starting the fellowship;", "➢Applicants must comply with the programme’s mobility rule, i.e. they are free to choose any country (except Germany) as destination for their research stay abroad, provided they have not resided or carried out their main activity (work, studies, etc.) in that country for more than 12 months in total during the three years preceding the application deadline of 30August 2019.", "Time spent as part of a procedure for obtaining refugee status under the Geneva Convention is not taken into account.", "If the research stay abroad is to be undertaken in a country other than an EU member state (MS) or an associated country(AC), the applicant must either be a national/resident citizen of an EU MS or AC, or have been continuously active in research for five years’ full-time equivalent in a MS or AC, immediately prior to the time of recruitment. If this condition is not met, the applicant will be deemed ineligible;", "➢Applicants who are already permanently employed by the research milieu where the research training activities are planned to take place and that is recruiting them may not be supported;", "➢Applicants must accept that the research stay abroad and the return phase to Germany are both mandatory parts of the programme ", " Duration", "The support is provided for 18 months, of which the first 12 months have to be spent abroad and the remaining six months in Germany (reintegration phase).", " Support", "Funding is provided through an 18-month temporary job position at the selected German university.The position will be remunerated according to the appropriate rate for postdoctoral researchers (according to the German pay scale “TV-L E13”).The specific level within the salary group “TV-L E 13” will be determined by the employing universities on the basis of the previous work experience of the fellows. ", "DAAD will provide the respective universities with a grant agreement to cover the costs for the regular salary and an additional monthly expatriate allowance for the research stay abroad.", " An additional lump sum travel allowance in accordance with DAAD rates for the selected candidate and, if applicable,accompanying spouse or partner (within the meaning of the German law on civil partnerships)and children will be paid directly by DAAD.", "Successful applicants will be invited to an orientation seminar before the start of the fellowship, together with current fellows and alumni.The seminar will presumably take place in Bonn on 9/10 March 2020.", "Applicants are asked to save the date but not to make any travel arrangements before receiving a letter of acceptance ", "Application Procedure:", " The following documents have to be submitted:", "1.completed application form;", "2.curriculum vitae with no chronological gaps and in tabular form in accordance with EU standards (or equivalent)http://europass.cedefop.europa.eu/en/documents/curriculum-vitae;", "3.short summary of the research project with a clearly recognizable working title and an indication of keywords. The summary should enable the assignment to a specific subject area and be suitable for use as preliminary information for potential reviewers.The length of the summary should not exceed 2,000 characters (including spaces);", "4.a detailed and independently prepared research proposal upon which both the German and foreign host institutions have agreed. In the evaluation of the proposal particular emphasis will be placed on the quality of the research plan. It should detail the preliminary work undertaken and the relevance of the topic for research, and explain why the chosen institutions are especially suitable for the realization of the planned project. The strategy for the investigation of the scientific problem should be readily understandable and the choice of methods and work equipment be adequately established. Please provide a precise description and a clear presentation. ", "The total length of the research proposal should not exceed 20,000characters (including spaces, but not bibliographical references). Bibliographical references may be included as an annex;5.time schedule for the realization of the planned work abroad and in Germany(e.g. in the form of a bar chart/Gantt-Chart); ", "For More Information:", "Visit the Official Webpage of the DAAD PRIME 2019"], "url : https://www.opportunitiesforafricans.com/daad-postdoctoral-researchers-international-mobility-experience-p-r-i-m-e-2019/"], [["Yousriya Loza-Sawiris Scholarship 2019/2020 for Egyptian Nationals (Fully Funded for Study in the USA)", "date announced:June 5, 2019", "Application Deadline: Thursday, October 17 2019 at 5pm Cairo time. "], ["Application Deadline: Thursday, ", "October 17 2019 at 5pm", " Cairo time. ", "T", "he Sawiris Foundation for Social Development", " ", " is proud to launch the fifth round of the", " fully funded Yousriya Loza-Sawiris Scholarship Program", " for candidates seeking the degree of ", "Masters of Development Practice (MDP) from the Hubert H. Humphrey School of Public Affairs, University of  Minnesota, USA", ". ", "Eligibility Requirements:", "​Egyptian national", "Hold a Bachelor’s degree or equivalent from a well reputed academic institution in a related field of study", "Satisfy the entry requirements into the academic MDP program", "Demonstrate excellent professional and academic track record", "Demonstrate strong interpersonal skills (extracurricular activities/community work/entrepreneurial initiative)", "Demonstrate inability to finance studies from own resources", "While no specific experience or academic track is required, students with a strong liberal arts education background and sound quantitative and analytical skills will be best prepared for academic success at the Humphrey School of Public Affairs.", "Previous coursework in mathematics, statistics, and economics is recommended", "English language proficiency is required. Valid TOEFL or IELTS exam scores with a minimum of 600 (paper-based), 250 (computer-based), 100 (internet-based, minimum 22 on each section) on the TOEFL, or 7 for the IELTS.", "A valid Graduate Record Exam (GRE) score is required. No specific score is required, however, Fall 2015 admitted students tested within average GRE Verbal Reasoning Percentile: 68% and average GRE Quantitative Reasoning Percentile: 54%", "Scholarship Worth:", "\nThe scholarship will cover full tuition, living expenses, travel and health insurance.\n", "Program Requirements:", "Completion of a 50-credit academic master’s program in two academic years", "Completion of an 8-10 week mid-program summer field experience", "Employment in the development sector in Egypt following graduation for no less than two consecutive years", "Required Documents:", "Completed application form including the personal statement", "Copy of valid passport ID page", "Updated resume", "All undergraduate and graduate (if applicable) transcripts", "TOEFL/IELTS score", "GRE score", "Two letters of recommendation", "One personal photo", "HR letter from current employer including salary/salary slip or a bank statement in case of unemployment.", "For More Information:", "Visit the Official Webpage of the Yousriya Loza-Sawiris Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/yousriya-loza-sawiris-scholarship-2019-2020-for-egyptian-nationals/"], [["Rhodes Global Scholarships 2020 for Postgraduate Study at University of Oxford (Fully Funded)", "date announced:June 1, 2019", "Application Deadline: 23:59 Greenwich Mean Time (GMT), Wednesday, 31 July 2019 "], ["Application Deadline: 23:59 Greenwich Mean Time (GMT), Wednesday, 31 July 2019 ", " The Rhodes Scholarship programme", " is the oldest (established 1903) international scholarship programme in the world, and one of the most prestigious. Administered by the Rhodes Trust in Oxford, the programme offers 100 fully-funded Scholarships each year for postgraduate study at the University of Oxford in the United Kingdom-one of the world’s leading universities. ", "Rhodes Scholarships arefor young leaders of outstanding intellect and character who are motivated to engage with global challenges, committed to the service of others and show promise of becoming value-driven, principled leaders for the world’s future. The broad selection criteria are:", "Academic excellence –specific academic requirements can be found under ", "‘Eligibility Criteria’ below.", "Energy to use your talents to the full (as demonstrated by mastery in areas such as sports, music, debate, dance, theatre, and artistic pursuits, including where teamwork is involved).", "Truth, courage, devotion to duty, sympathy for and protection of the weak, kindliness, unselfishness and fellowship.", "Moral force of character and instincts to lead, and to take an interest in your fellow human beings. ", " Eligibility Criteria", "a.Nationality/citizenship:Eligibility to any other Rhodes Scholarship renders you ineligible to apply for a Global Scholarship, i.e. if you are eligible to apply via any existing Rhodes Constituency (https://www.rhodeshouse.ox.ac.uk/scholarships/list-of-rhodes-scholarship-countries/), you must apply there. Please also see the information below and online regarding inter-jurisdictional consideration -it may be in your interest to pursue that route rather than to apply for a Global Scholarship, which will likely be the most competitive Scholarships offered by the Rhodes Trust.", "b.Age: You must have reached your 19th and not have passed your 25th birthday on 1 October 2020, which means you must have been born after 30 September 1995 and on or before 1 October 2001.", "c.Academic achievement:You must have completed (or will have completed by June / July 2020) an undergraduate degree with a First Class or minimum GPA minimum of 3.70 out of 4.0 (or equivalent). Please note carefully the requirements for your chosen course at Oxford, which may be higher still. Successful candidates typically feature within the top few ranks of their graduating classes.", "d.English language: You must have a sufficiently high standard of English to meet the English language proficiency requirements (at the Higher Level listed) of the University of Oxford. ", " Application Procedure ", "a.You will not be able to submit your application for the Global Scholarship without prior nomination by your University. Each university has a limited number of nominations that they can make each year. You must register the most appropriate nominator via the application form. Once their nomination has been received, you will be permitted to submit your form.You can apply online from 01 June 2019 at http://www.rhodeshouse.ox.ac.uk/scholarships/apply via the scholarships tab.", "b.You must submit your application online, with all supporting documents, by 23:59Greenwich Mean Time (GMT), 31 July 2019. ", "c.In preparation for making your application, you should read carefully the general information, particularly that held on the Scholarships tab,on the Rhodes website, the Conditions of Tenure for the Rhodes Scholarship, the information in this document and the graduate admissions pages of the University of Oxford: www.ox.ac.uk/admissions/graduate. ", "d. Long listed candidates might be invited to attend a preliminary interview via Skype.e.Shortlisted candidates will be invited to a social engagement(a reception and dinner)and a final interview. You must be available to attend both, in person,as no accommodations can be made on date and time,or mode,of these events.Interviews will be held at Rhodes House, Oxford, UK in November. No candidate will be selected without an interview. ", "Candidates for the Scholarship invited for the final interview and residing outside of the United Kingdom may apply to the Rhodes Global Scholarships Administrator for financial assistance to travel from their country of origin, provided that the travel could not funded by their University or other sponsorship source.f.All applicants will be emailed with the outcome oftheir application ", "For More Information:", "Visit the Official Webpage of the Rhodes Global Scholarships 2020 "], "url : https://www.opportunitiesforafricans.com/rhodes-global-scholarships-2020/"], [["Shell Petroleum Development Company of Nigeria (SPDC) 2019 Niger Delta Postgraduate Scholarship Scheme", "date announced:May 31, 2019", "Application Deadline: June 15, 2019. "], ["Application Deadline: ", "June 15, 2019", ". ", "The Shell Petroleum Development Company of Nigeria Limited (SPDC),", " operator of the SPDC Joint Venture, is delighted to announce the ", "Ninth annual SPDC JV Niger Delta Postgraduate Scholarship", " ", "for applicants from Bayelsa, Delta, Imo and Rivers states. The objective of the scholarship programme is to provide postgraduate study opportunity in courses that are relevant to the oil and gas industry, for qualifying students from these Niger Delta states", "In the eight years of this programme, 79\nstudents have won the opportunity to study at top-rated universities in\nthe UK on full scholarship", "For the academic year commencing\nSeptember 2019, SPDC in partnership with three universities in the\nUK–Imperial College London; University of Leeds; and University of\nAberdeen will award scholarships for one-year post-graduate M.Sc.\nstudies.", "The following courses qualify for award of scholarships at the three institutions:", "Universities", "Degree", "Imperial College London", "MSc Petroleum Engineering MSc Petroleum Geoscience ", "University of Abeerdeen", "MSc Geophysics MSc Safety & Reliability Engineering for Oil & Gas MSc Advanced Chemical Engineering MSc Integrated Petroleum Geoscience ", "University of Leeds", "MSc Exploration Geophysics MSc Electronic/Electrical Engineering ", "Eligibility Criteria", "To qualify for the scholarship, applicants must", "display sound intellectual ability and leadership potential.", "meet\nthe individual university’s English Language requirements (usually at\nleast 6.5 in IELTS score valid for Sept. 2018 admission). Please note\nthat TOEFL is no longer recognised by most UK universities. Candidates\nare advised that failure to meet each university’s English Language\nrequirement at the time of selection may invalidate their application.", "be aged between 21-28 years by 30/09/2019.", "be an indigene of Rivers, Delta, Imo or Bayelsa states (documentary proof of this will be required and will be verified).", "currently reside in Nigeria.", "plan to return to Nigeria on completion of the proposed programme of study.", "have obtained a university degree (at least of equivalent standard to a UK Second Class Upper Honours degree).", "not have studied previously in the UK or any other developed country", "have a Nigerian international passport valid till December 2020", "be\nneither a current nor former employee (who has left employment less\nthan 5 years before) of SPDC or the Royal Dutch Shell Group or any Shell\ncompany or the local Nigerian consultant", "not be a spouse, child or ward of staff of Shell Companies in Nigeria or the local Nigerian consultant", "Application Process", "Submit application for admission to any of the participating universities for any of the qualifying courses.", "Application forms for the scholarship will ", "ONLY", " be available through the websites of the ", "Imperial College London, the University of Leeds and University of Aberdeen, ", "following a formal offer of admission by the university.", "The universities ", "will process applications and select candidates to attend interviews before being considered for final selection.", "Completed scholarship application forms must reach participating universit", "i", "es and the local Nigerian consultant not later than ", "June 15, 2019", ".", "The\nscholarship will cover tuition, one economy return-flight ticket from\nNigeria to the UK and a contribution towards living expenses only*.", " ", " ", "More information on specific course admission requirements can be obtained ", "from the websites of the three individual universities.", "*Please\nnote that the stipends (living expenses) are based on the Association\nof Commonwealth Universities (ACU) published living rates and are\nlimited to this only.", "This is a non-committal scholarship. Note that ", "NEITHER", " SPDC ", "NOR", "\nany Shell company is obligated to offer employment of any sort to any\ncandidate upon graduation, neither are successful candidates bonded to\nSPDC for any period of time on account of the scholarship award.", "For More Information:", "Visit the Official Webpage of the SPDC 2019 Niger Delta Postgraduate Scholarship Scheme"], "url : https://www.opportunitiesforafricans.com/spdc-2019-niger-delta-postgraduate-scholarship-scheme/"], [["Business School Netherlands/Orange Knowledge Programme Scholarship 2019 (Fully- Funded International Action Learning MBA)", "date announced:June 6, 2019", "Application Deadline: July 1st 2019"], ["Application Deadline: July 1st 2019", "The International Action Learning MBA programme", " is ideal for the busy manager or for the business traveller considering a part-time, distance learning MBA. With their MBA structure, you can now save time on your studies as all your projects are real-time based, meaning that you use a portion of your time at work to focus and implement your projects on real-life problems.", " ", "The Orange Knowledge Programme (OKP) ", "aims to advance the development of the capacity, knowledge and quality of both individuals and institutions in higher and vocational education.", "Applicants from the 52 OKP countries are now able to apply for this fantastic MBA opportunity through Business School Netherlands, as the International Action Learning MBA is an OKP approved", " course.", "Benefits", " Successful applicants to both BSN and the OKP will receive a full MBA scholarship that covers the total cost of tuition fees, prescribed textbooks, accommodation at the two conferences held in the Netherlands, subsistence and internet costs.", "Eligibility", "\nApplicants must first meet the following eligibility criteria for the International Action Learning MBA", "\nprogramme:", "The applicant:", "  holds a Bachelor’s degree or equivalent qualification,", "  is a manager or management trainee,", "  has a minimum of 2 years appropriate and relevant post graduate work experience,", "  has approval from his or her organisation to do research and execute practical assignments within their work environment,", "  has internet and e-mail access,", "  should the applicants mother-tongue not be English, a TOEFL or IELTS language test will be required. The minimum pass mark for the TOEFL is 550 (paper); 213 (computer) or 79/80 (internet based) and IELTS 6.0", " Applicants must then meet the following eligibility criteria for the OKP scholarship:", "must be a professional and national of, and working and living in one of the 52 countries on the OKP country list,", "  must have an employer’s statement that complies with the format Nuffic has provided. All information must be provided and all commitments that are included in the format must be endorsed in the statement,", "  must not be employed by an organisation that has its own means of staff development.", " Organisations that are considered to have their own means for staff development are for example: multinational organisations (e.g. Shell, Unilever, Microsoft), large national and/or a large commercial organisation, bilateral donor organisations (e.g. USAID, DFID, Danida,Sida, Dutch Ministry of Foreign Affairs, FinAid, AusAid, ADC, SwissAid), multilateral donor organisations (e.g. UN organisation, the World Bank, the IMP, Asian Development Bank,African Development Bank, IADB), international NGO’s (e.g. Oxfam, Plan, Care),", "  must have an official and valid passport,", "  must not receive more than one fellowship for courses that take place at the same time,", "  must have a government statement that meets the requirements of the country in which the employer is established (if applicable).", " To apply, send an email to ", "[email protected]", " closing date for the September 2019 intake is July 1st 2019.", "For More Information:", "Visit the Official Webpage of the Business School Netherlands/Orange Knowledge Programme Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/business-school-netherlands-orange-knowledge-programme-scholarship-2019/"], [["Bayer Science & Education Foundation’s International Scholarship Programs 2019 for Study in Germany (Funded)", "date announced:June 6, 2019", "Application Deadline: July 14th 2019"], ["Application Deadline: July 14th 2019", "The Bayer Fellowship Program", " ", "targets students and apprentices in scientific and medical disciplines. Its goal is to support the next generation of researchers and teachers as they engage in “Science for a Better Life”.", "The Fellowship Program consists of five scholarship\nprograms that offer tailored financial support. Important requirements\nfor the support: The project to be supported must be innovative and\ninternational. Scholarships are granted to students and young\nprofessionals (up to two years after graduation) from Germany wishing to\nrealize a study or research project abroad or to foreign students/young\nprofessionals pursuing a project in Germany.", "The Bayer Science & Education Foundation\nsupports students and young professionals that would like to study or\nwork outside of their home country with the Bayer Foundation Fellowship\nProgram, which consists of five scholarships.", "All applicants should have a high level of commitment,\ndedication and an innovative project plan. Scholarships are granted to\nstudents and young professionals (up to two years after graduation) from\nGermany wishing to realize a study or research project abroad or to\nforeign students/young professionals pursuing a project in Germany. The\nfollowing application documents are required for the ", "Otto Bayer Scholarship", ", ", "Carl Duisberg Scholarship", ", ", "Jeff Schell Scholarship", " and ", "Kurt Hansen Scholarship", ":", "Confirmation letter from the foreign host institute/university on the planned project from September 2019 to August 2020", "A description of the project (duration of 2-12 months) with\nfinancial plan within the timeline of September 2018 to August 2019. The\nproject can consist of special study courses, laboratory assignments,\nresearch projects, summer classes, internships, Master’s or PhD\nprograms.", "Most recent transcripts ", "Any additional documents that would enhance the application", "Job application photo (no photo of your passport, please)", "CV ", "The amount per fellowship is individual, but limited per 20.000€ per request. ", "For the ", "Hermann Strenger Scholarship", ", applicants must submit the following:", "Confirmation letter from the foreign host institute/university on the planned project from September 2019 to August 2020", "Most recent transcripts with good to excellent grades", "A description of the project (duration of 2-12 months) with financial plan. The project can consist of", "special study courses, laboratory assignments, research projects, summer classes or internships", "Job application photo (no photo of your passport, please)", "For More Information:", "Visit the Official Webpage of the Bayer Science & Education Foundation’s International Scholarship Programs 2019 "], "url : https://www.opportunitiesforafricans.com/bayer-science-education-foundations-international-scholarship-programs-2019/"], [["National Research Foundation (NRF) Masters and Doctoral Scholarships 2020 for young South Africans", "date announced:June 7, 2019", "The Department of Science and Technology (DST) and the National Research Foundation (NRF) are pleased to announce a call for applications for Masters and Doctoral Scholarships for Full-time Studies in 2020."], ["The Department of Science and Technology (DST) ", "and the ", "National Research Foundation (NRF)", " are pleased to announce a call for applications for ", "Masters and Doctoral Scholarships for Full-time Studies in 2020.", "In the process of reducing the high volume of applications received yearly, duplication of applications into different programmes and increasing the turnaround time to informing successful applicants, ", "the NRF has consolidated all the Masters and Doctoral scholarship programmes such as DAAD, Extension Support for Masters and Doctoral studies, NRF Freestanding, Innovation, Scarce Skill Development Fund (SSDF), The World Academy of Sciences (TWAS) Doctoral and The Southern African Systems Analysis Center (SASAC) in this framework document", ".", " Conditions of Grant", "The NRF scholarship shall be held as the primarysource offunding. ", "The scholarship-holder may hold bursaries, awards, assistantships and receive emoluments from private institutionsin conjunction with the NRF scholarship.", "The scholarship-holder will be accepted as a full-time student during the tenure of the scholarship. Scholarship-holders may not concurrently hold the scholarship with any full-time salaried employment position.", "The scholarship holder must obtain the degree for which the scholarship was awarded by the contractual date, which is within one (1) year after NRF funding has ceased and notify the NRF via the relevant university authority,unless otherwise approved by the NRF in writing. Should the scholarship holder not complete the degree for which the scholarship was awarded, the funds will have to be returned to the NRF plus interest at the prevailing prime rate charged by the NRF bankers. ", "For More Information:", "Visit the Official Webpage of the National Research Foundation (NRF) Masters and Doctoral Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/national-research-foundation-nrf-masters-and-doctoral-scholarships-2020/"]]