[[["Music In Africa Foundation Media Sound Hamburg scholarship 2018 for young film/video music composers.", "date announced:April 16, 2018", "Application Deadline: 25 April 2018"], ["Application Deadline: ", "25 April 2018", "Media Sound Hamburg,", " in partnership with the ", "Music In Africa Foundation", ", is calling on young film music composers, video game music composers and sound designers to apply for a scholarship to take part in an exciting summer school in Hamburg, Germany, between 8 and 17 June 2018.", "The successful candidate will get to attend various masterclasses, workshops, forums and special events while interacting with international film composers and industry professionals throughout the 10 days of the summer school.", "The lecturers at this year’s Media Sound Hamburg will include Frans Bak (The Killing, Doctor Foster), Martin Hernandez (Oscar nominations for Birdman [2015] and The Revenant [2016]) and Ari Pulkkinen (video game music for Angry Birds, Dead Nation, Outland), among others.", "Eligibility", "Applicants need to:", "Be from an African country", "Be under 30 years old", "Have experience in music composition", "Have an interest in sound design/film music composition/video game music composition", "Have a valid passport", "Requirements", "Applicants will need to submit the following to be considered for the scholarship:", "CV", "Biography detailing previous work and interests", "Music In Africa profile (with extracts of your work such as videos and audio)", "What you will get:", "A scholarship to Media Sound Hamburg 2018 (8 to 17 June 2018)", "Free choice of any masterclass, workshop, forum or special event at Media Sound Hamburg", "Flights (economy), accommodation and a per diem.", "Application Procedure:", "Apply Now for the Music In Africa Foundation Media Sound Hamburg scholarship", " ", "If you do not hear from us by 3 May 2018 you may consider your application unsuccessful.", "For More Information:", "Visit the Official Webpage of the Music In Africa Foundation Media Sound Hamburg scholarship 2018 "], "url : https://www.opportunitiesforafricans.com/music-in-africa-foundation-media-sound-hamburg-scholarship-2018/"], [["MTN Ghana Foundation Bright scholarship scheme 2018 for young Ghanaian youths", "date announced:April 13, 2018", "Application Deadline: May 3, 2018 at 11:59pm."], ["Application Deadline: ", "May 3, 2018 at 11:59pm.", "• Are you a brilliant first year or continuing student pursuing first degree education in any of the public tertiary institutions in Ghana requiring financial assistance?", "Are you a First year or continuing student pursuing first degree education in any of the public tertiary institutions in Ghana requiring financial assistance? The ", "MTN Ghana Foundation", " has launched a ", "scholarship scheme", " to support 100 brilliant and needy Ghanaians to complete their tertiary education. 300 scholarship awards would be given over a period of three years and beneficiaries will be selected from all 10 regions of Ghana. This scholarship will cover the cost of Tuition, Accommodation and a Stipend for books and other relevant reading materials.", "For about two decades, 1000s of Ghanaian youth have been supported by MTN Ghana Foundation to pursue various courses at different levels of education in Ghana through the Scholarship scheme.", "CRITERIA", "The applicant ", "Must be a citiz­en of Ghana­", "Must be prove­n to be;", "\nc) Be hard-­worki­ng with excellent academic results", "(An applicant in the first year of any public tertiary institution in Ghana should have credit passes in six (6) subjects with overall aggregate of 24 at the WASSCE/SSSCE respectively.", "\nThree of the six subjects should be core subjects: English Language, Mathematics, Integrated Science or Social Studies and three must be in relevant electives.", "\nFor the purposes of this Scholarship, a credit pass in:", "\ni. WASSCE means A1 – C6", "\nii. SSSCE means A – D", "AND ", "A continuing student applicant should have a minimum ", "GPA of 3.0 ", "d) Be invol­ved in extra curri­cula activ­ities.", "\ne) Be prove­n to be without any academic disciplinary issue and/or must not be serving a bond to be of good behavior.", "Continuing students and first year students in any accredited public tertiary institution in Ghana who meet all criteria may apply.", "Provi­de a ", "one page letter of motivation", " indicating why MTN Found­ation shoul­d award you a schol­arshi­p for your education, including what your educa­tiona­l and profe­ssion­al goals are.", "Attac­h WASSCE results, admis­sion lette­rs and writt­en Testi­monia­ls from your Senior High School. Pleas­e note that thoro­ugh check­s will be made on all docum­ents submi­tted.­", "Application must be submitted together with valid contact details (Phone number/E-mail address).", " Shortlisted appli­cants will be notif­ied and invit­ed to meet the scholarship panel.", "An applicant who enjoys any form of educational scholarship should not apply.", "Priority would be given to persons pursuing courses in ICT, Computer Science, and Engineering. WOMEN, and PERSONS with disability are especially encouraged to apply.", "Application submission shall be opened from April 3, 2018 and closes on May 3, 2018 at 11:59pm.", "Successful Candidates would be contacted directly and their names published in the newspapers by ", "May 28, 2018.", "Applicants can go online and apply through the web portal ", "scholarships.mtn.com.gh ", "OR visit any of these MTN Service Centers to pick up forms", " ", "; Tamale Branch, Wa Branch, Bolgatanga Branch, Kumasi (Nhyaeso branch), Takoradi Main-Beach Road, Ho main Branch, MTN House, Accra, Cape Coast Branch, Sunyani main Branch, Koforidua Main Branch. For further clari­fication or assistance, mail to ", "[email protected]", " or call 0244300000.", "PLEASE NOTE: Under no circumstances whatsoever would an applicant be required to pay any money for the processing of their applications.", "For More Information:", "Visit the Official Webpage of the MTN Ghana Foundation scholarship scheme 2018"], "url : https://www.opportunitiesforafricans.com/mtn-ghana-foundation-bright-scholarship-scheme-2018-for-young-ghanaian-youths/"], [["Helen Lansdowne Resor (HLR) Scholarship 2018 for female creative students ($USD 10,000 & internship at a J. Walter Thompson Office)", "date announced:April 9, 2018", "Application Deadline: May 14th, 2018."], ["Application Deadline: May 14th, 2018.", "The", " international Helen Lansdowne Resor (HLR) Scholarship", " ", "supports and promotes ", "talented female creative advertising students", " from around the world in honor of the industry’s first female copywriter, Helen Lansdowne Resor. The program will run through 2020.", "Dating back to the early 1900s, Helen was an industry pioneer, credited with sparking celebrity testimonial campaigns with her use of endorsements from socialites, European royalty, and actresses in her work for Pond’s Cold Cream. Helen Lansdowne Resor’s creative capacity helped to push the barriers and shatter traditional formulas of advertising.", "Helen was a working mother and ardent feminist who championed the advancement of women’s rights both inside and outside of the agency. During her tenure, ", "J. Walter Thompson", " was known as the “Women’s Agency,” where bright young talented females were given opportunities that had been traditionally offered exclusively to men.", "Each year, the HLR Scholarship seeks to award five", " female creative students scholarships", " up to $10,000. In addition, each recipient will receive a paid summer internship at a J. Walter Thompson office in her respective region, an offer of a J. Walter Thompson mentor and “first look” placement consideration upon graduation.", "Requirements:", "Be a registered student at an undergraduate, graduate, and/or portfolio school with at least 12 months of school left as of May 14, 2018", "Show creative talent and potential in a course of study like Art Direction, Copywriting, Design, Experiential Design, Sculpture, Film, etc. Basically, if you think it applies to you, it probably does", "Maintain satisfactory academic and creative progress as determined by your school", "Benefits:", "Your shot to steer the future of advertising. Here’s what you’ll get if you win:", "A scholarship up to $10,000 to put towards your education", "An internship at a JWT office", "One-on-one mentorship", "First-look placement at JWT after graduation", "Application Procedure:", "Click ", "here", " to complete the application.", "You’ll have to submit your application form, a personal statement, a letter of recommendation and 3–5 creative samples by May 14, 2018.", "For More Information:", "Visit the Official Webpage of the Helen Lansdowne Resor (HLR) Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/helen-lansdowne-resor-hlr-scholarship-2018/"], [["Government of Colombia Master and PhD Scholarships 2018/2019 for study in Colombia (Funded)", "date announced:March 28, 2018", "Application Deadline:1st June 2018"], ["Application Deadline:1st June 2018", "Financial grants offered to foreign citizens, in return for international cooperation received by", "Colombia", " under existing cooperation agreements", " ", "Requirements:", "Foreign professionals in the range of age between 25-49 years old, who have undergraduate degree (university degree or bachelor) in different disciplines, who have a grade point average of 4.0 on the Colombian scale of 1 to 5, and at least 1 year of professional experience in their field of study.", "The candidate must master the Spanish language (reading,writing and speaking) He/she must deliver us a certificate of these competences and must have an admission letter from the Colombian educational institution in any career determined in the catalog annex to this call.", "The candidate must not live in Colombia and must not have Colombian nationality.", "Prove minimum one year experience in their field of study, after obtaining the degree.", "The candidate must have successfully completed college.", "The academic program should start in the second semester of 2018. Admission to programs starting in 2019 will not be contemplated.", "The candidate must be in arange of age between 25-49 years old.", "Applications from foreign citizens who are living in Colombia will not be accepted", "The documents must arrived through the embassies or directly to the International Relations Office of ICETEX in Bogotá-Colombia before the 1st June 2018", "Scholarship Worth:", "TUITION FEES:", "100% coverage of all these costs granted by the Colombian universities (only for academic programs found in the catalog of this call).", "INCIDENTAL:", "Grant of $208.853 COP) for once during the period of studies, just in case of circumstances beyond the beneficiary control.", "STIPEND FOR BOOKS AND MATERIALS:", "Grant of $401.321 COP for once, at the beginning of the academic program", "MONTHLY ALLOWANCE:", "Grant of the sum equivalent to 3 Minimum Monthly Legal salaries. $2.343.726 COP", "HEALTH INSURANCE:", "Wide coverage in medical assistance only in Colombia, during the period of studies.", "INSTALLATION COSTS:", "Grant of {$401.321 COP for once at the beginning of studies", "Postgraduate scholarships in Colombia will have a maximum of twelve (12) months for", "specialization and twenty-four (24) months to master and up to thirty-six (36) months for", "doctorate. The scholarship holder of doctorates that last more than 3 years have to assume", "by themselves the allowance for the rest of the program. Nevertheless, the Colombian", "university will cover all the tuition fees during the whole program.", "Selection Criteria:", "Academic excellence", "Coherence between the academic trajectory, work experience and academic program", "Professional working experience", "Study Project", "Reciprocity on educational cooperation", "How to Apply: ", " It is important for interested candidates to go through the Application requirements", " ", " before applying.", "Required documents, which are detailed in this call, should be at ICETEX on the date indicated in the notice.", "No documents will be received outside the established dates.", "The documents required in this call must be translated into Spanish", "All application documents t o this call should be sent to ICETEX through the Embassy from the country of origin of the applicant in Colombia. In case of absence of diplomatic representation in Colombia, the applicant must send it directly to ICETEX.", "For More Information:", "Visit the Official Webpage of the Government of Colombia Master and PhD Scholarships "], "url : https://www.opportunitiesforafricans.com/government-of-colombia-master-and-phd-scholarships-2018-2019/"], [["Civil Society Leadership Awards 2019 for Social Change Agents (Fully Funded Master’s Degree Scholarships)", "date announced:March 21, 2018", "Application Deadline: May 15th, 2018"], ["Application Deadline: ", "May 15th, 2018", "The Civil Society Leadership Awards (CSLA)", " provide fully-funded scholarships for master’s degree study to individuals who clearly demonstrate academic and professional excellence and a deep commitment to leading positive social change in their communities.", "Eligibility Criteria", "Applicants must meet all of the following criteria:", "be a citizen of an eligible country;", "demonstrate maturity, flexibility, and civil society leadership potential", "have an earned bachelor’s degree as of May 15, 2018 with an excellent academic record;", "demonstrate professional experience related to your chosen field of study;", "demonstrate proficiency in the language of instruction (English, German or French) at a level required for admission by host universities;", "be able to participate in an intensive pre-academic summer school in July or August 2019 and start their degree program in August or September 2019;", "be able to receive and maintain a visa or study permit as required by the host country; and", "demonstrate a clear commitment to their home country or region to strengthen open society development.", "The awards are available to citizens of the following countries:", "Afghanistan", "Azerbaijan", "Belarus", "Cambodia", "China", "Democratic Republic of Congo", "Egypt", "Equatorial Guinea", "Eritrea", "Ethiopia", "Laos", "Libya", "Myanmar/Burma", "Republic of Congo", "South Sudan", "Sudan", "Syria", "Tajikistan", "Turkmenistan", "Uzbekistan", "Benefits:", "CSLA", "grantees will receive financial and administrative support for the following:", "• Pre-academic preparation via summer schools;", "• Program-related travel;", "• Tuition and mandatory university fees;", "• Monthly stipend for room, board, and other living expenses;", "• Accident and sickness insurance during the program;", "• Funds for educational materials and professional development;", "• Attendance at a regional Scholarship Programs conference;", "• Accommodations during the application process and the duration of the grant for applicants with disabilities.", "Awards are available for study in the following areas:", "Communications, Journalism & Media", "Culture, History & Society", "Development Studies", "Economics", "Education Management & Leadership", "Environment & Natural Resource Management", "Gender Studies", "Human Rights", "Law (including Human Rights law)", "Politics & International Studies", "Public Health Policy & Health Management", "Public Administration", "Public Policy", "Social Policy", "Social Work", "Selection and Notification Cycle", "Applications must be submitted by midnight, May 15, 2018, Eastern Daylight Time.", "Uncompetitive and/or ineligible applicants will be notified in late June. Those chosen to continue will be sent out for external review and notified of their results in early September.", "Applicants who pass external review become semi-finalists and will be invited to an interview to be scheduled in late September or October.", "Semi-finalists are required to secure two (2) letters of recommendation which must be submitted directly to CSLA by referees by October 1, 2018.", "Semi-finalists will be required to take an official language test by the end of October 2018; all candidates invited to an interview are entitled to one (1) language test, arranged and paid for by CSLA.", "Final selection will be held in November; results will be sent via email by January 2019.", "Successful semi-finalists are now CSLA finalists, and CSLA staff will initiate their host university placement process.", "The CSLA university placement process takes time; CSLA will strive to confirm placements for finalists by late April 2019.", "Once placement is secured, CSLA finalists will be notified that they are now CSLA grantees, and will be asked to sign and return a formal grant document before any further actions can be taken.", "Interested applicants must complete an online or paper CSLA application and submit along with supporting documentation to be considered for CSLA support.", "Online Application", "All candidates are strongly encouraged to apply online if possible using Submittable, an online platform. To apply online, please register on ", "Submittable", " and then follow instructions.", "Paper Application", "Paper applications may be accessed in the Download Files section of this page. Please download the application form before completing or printing, and review the accompanying materials before submitting your application.", "Documents:", "2019 Civil Society Leadership Awards Guidelines", "Download the complete guidelines.", "277.96 KB pdf", "2019 Civil Society Leadership Awards: How to Apply & Application Checklist", "Download the application checklist.", "282.03 KB pdf", "2019 Civil Society Leadership Awards Host University Guide", "Download the host university guide.", "406.38 KB pdf", "2019 Civil Society Leadership Awards Frequently Asked Questions", "Download the list of frequently asked questions.", "315.95 KB pdf", "2019 Civil Society Leadership Awards Application", "Download the application form.", "153.5 KB docx", "For More Information:", "Visit the Official Webpage of the Civil Society Leadership Awards 2019"], "url : https://www.opportunitiesforafricans.com/civil-society-leadership-awards-2019/"], [["Petroleum Technology Development Fund (PTDF) 2018/2019 Overseas Postgraduate (Msc & PhD) Scholarship Scheme for study in United Kingdom (Fully Funded)", "date announced:March 28, 2018", "Application Deadline: April 28th 2018"], ["Application Deadline: April 28th 2018", "The Petroleum Technology Development Fund (PTDF),", " the Federal Government agency with the mandate of developing indigenous human capacity and petroleum technology to meet the needs of the oil and gas industry, invites applications from suitably qualified candidates for Overseas MSc and PhD Scholarships to specific programmes at selected Institutions in the United Kingdom.", "The PTDF Scholarship Scheme for UK Universities", " will offer candidates the opportunity to benefit from a diversified pool of knowledge and the facilities offered by world-class institutions in the United Kingdom.", "Under this scheme, candidates are invited to apply through PTDF to specific programmes at partner institutions in the United Kingdom (full list of sponsored courses is available below).", "As part of its efforts to continuously improve and streamline its programmes, the Fund has reduced the number of partner universities in the UK to 15 top universities ", "(see list below)", " where it feels the scholarship’s high standards can be maintained and the objectives of the scheme will be best served. Applications will therefore be limited to those choices and successful candidates will be awarded scholarships for programs commencing in the 2018/2019 academic session.", "Benefits:", "The award includes the provision of flight tickets, payment of health insurance, payment of tuition and bench fees (where applicable) as well as the provision of allowances to meet the costs of accommodation and living expenses.", "Requirements", "MSc", "A minimum of Second Class Upper (2.1) qualification in their first degree or a Second Class Lower (2.2) with relevant industry experience", "Must have completed the mandatory National Youth Service (NYSC)", "Must be computer literate", "Possession of 5 O/level credits including English Language and Mathematics.", "PhD ", "Must have completed the mandatory National Youth Service (NYSC)", "Must be computer literate", "A minimum of Second Class Lower (2.2) in their first degree and a good second-degree certificate;", "Must submit a research proposal relevant to the oil and gas industry (of not more than 5 pages) to include: Topic, introduction, objective, methodology and mode of data collection;", "Applicants must also include their master’s degree project", "All lecturers must produce a letter from their Vice Chancellor confirming that they are not in receipt of any other scholarships", " ", "UNIVERSITIES ", " ", "For 2018, the scholarships to the UK will be ", "restricted", " to select courses ", "(available on the PTDF website)", " at the following universities", "IMPERIAL COLLEGE, LONDON", "UNIVERSITY COLLEGE, LONDON", "KINGS COLLEGE, LONDON", "UNIVERSITY OF BIRMINGHAM", "UNIVERSITY OF NOTTINGHAM", "UNIVERSITY OF SOUTHAMPTON", "NEWCASTLE UNIVERSITY", "UNIVERSITY OF MANCHESTER", "UNIVERSITY OF LIVERPOOL", "CRANFIELD UNIVERSITY", "ROBERT GORDON UNIVERSITY", "HERIOT-WATT UNIVERSITY", "UNIVERSITY OF SALFORD", "PORTSMOUTH UNIVERSITY", "UNIVERSITY OF DUNDEE", "Selection Process, Criteria & Requirements", "PTDF scholarships are highly competitive and only candidates who are outstanding across the board are selected. A selection committee will be constituted to assess applications using the following criteria;", "Academic merit as evidenced by quality of degrees, full academic transcripts and other professional qualifications acquired", "Relevant publications to be referenced by applicant ", "(PhD applicants only)", "Membership of professional bodies", "The viability of the study/research plan.", "Applicants are required to make a case for their scholarship by submitting a statement of purpose (maximum 500 words) stating the reason(s) they want to undertake the study, the relevance of the proposed study to the industry and its expected impact on national development.", "For More Information:", "Visit the Official Webpage of the PTDF 2018/2019 Overseas Postgraduate Scholarship Scheme"], "url : https://www.opportunitiesforafricans.com/ptdf-2018-2019-overseas-postgraduate-scholarship-scheme/"], [["Southern African Music Rights Organisation Foundation (SAMRO) Overseas Scholarship 2018 for composers", "date announced:April 18, 2018", "Application Deadline: Thursday 31st May 2018"], ["Application Deadline: Thursday 31st May 2018", "The Southern African Music Rights Organisation (SAMRO)", " is the leading regional copyright", "administration organisation, dealing primarily with the administration of performing rights", "of composers, music publishers and authors. It does so by licensing music users, collecting licence fees and distributing royalties to music creators.", "SAMRO is a member of the International Confederation of Societies of Authors and Composers (CISAC) and is affiliated to many similar societies in over a hundred countries. In order to promote the opportunities for musical activity in SAMRO’s territory of operations for the benefit of its members, CISAC permits a proportion of distributable performing rights revenue to its affiliated societies to be devoted to the encouragement of the arts. This allocation towards artistic support in South Africa is administered by the SAMRO Foundation. The", "SAMRO Foundation’s three focus areas are: Music Education, Music Industry Support and the administration of the SAMRO Music Archive.", "These awards rotate over a four-year cycle:", "2018 Composers", "2019 Singers", "2020 Instrumentalists", "2021 Keyboard Players", "Requirements:", "The competition is open to music students and professionals from South Africa, Botswana, Lesotho and Swaziland, who are not older than 32 years of age.", "Each applicant must be within the field of jazz and Western art music.", "The age limit is 32 years. For this year’s competition, applicants must have been born on or", "after 31 May 1986.", "Applicants should have already completed (or expect to complete in 2018) their studies for", "a recognised undergraduate or postgraduate music degree/diploma. In exceptional cases,", "final acceptance of candidates without the necessary qualifications will be at the discretion of the SAMRO Foundation Board.", "Benefits:", "The value of the main Award in each genre is R200,000. The main scholarship winners’ awards should be used for master classes with internationally acclaimed composers, composition teachers or post-graduate study abroad, focussing on advancing their skills as composers.", "All monetary prizes must be used within 2 years of being awarded, failing which the Award will be forfeited. Candidates who foresee that the deferral of the use of any funds awarded may become necessary, must submit their reasons for a deferral request in writing 3 months before the end of the 2-year period.", "Requirements:", "The online Application Form will be on the SAMRO Foundation website by the beginning of December 2017", "Before completing the online form, please be sure to have the following (also see the checklist on page 8):", "a. A brief Curriculum Vitae including a list of your compositions as well as performances", "of your compositions (if any)", "b. Most recent academic record or degree/diploma certificate", "c. A brief biography of no more than 150 words, suitable for inclusion in the competition programme, publicity material and various relevant websites", "d. A description of plans for further study or master classes abroad and envisaged career path (max 300 words)", "e. Details of any other current study awards and bursaries", "f. A recent high resolution (300dpi) colour digital profile photo (flattering and professional quality)", "g. A certified copy of the candidate’s valid Identity Document as proof of age and citizenship", "h. Two current testimonials regarding the candidate’s composition abilities from the candidate’s", "i. most recent composition teacher", "ii. any other competent and recognised musical authority to whom the candidate’s compositional abilities are known", "i. Submission of a portfolio accompanied by mp3s of the works as detailed under", "Submission of Portfolios. Please ensure that the volume levels of the recording are at a suitable volume", "j. An affidavit from the candidate attesting to the fact that the compositions submitted", "are the candidate’s own original works. Any evidence of plagiarism or copyright", "infringement will immediately disqualify a candidate", "Applicants should take note of the following additional guidelines:", "Jazz applicants:", "Category A:  A short work for jazz trio (piano, bass and drums), including suitable sections for improvisation.", "Category B: A work for a standard 18-piece big band.", "Category C: A work in the clazz category and a work incorporating Indigenous African Music (IAM) styles and instruments.", "Western art music applicants:", "Category A: A short work for a standard piano trio (violin or flute, piano & cello).", "Category B: A work for chamber orchestra (minimum 14 players) or for standard orchestra.", "Category C: A work in the clazz category or a work incorporating IAM styles and instruments.", "For More Information:", "Visit the Official Webpage of the SAMRO Overseas Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/samro-overseas-scholarship-2018-for-composers/"], [["ICTP Scholarships 2018/2019 for Masters in High Performance Computing (Fully Funded)", "date announced:March 23, 2018", "Application Deadline: April 20th, 2018"], ["Application Deadline: ", "April 20th, 2018", "The ", "Master in High Performance Computing (MHPC) programme", ", coordinated by ICTP and the International School for Advanced Studies (SISSA), is now accepting applications for the 2018-2019 academic year.", "ICTP is pleased to provide scholarships for successful applicants from developing countries: the deadline for applicants interested in these scholarships is 20 April 2018.", "The Masters Degree in High Performance Computing is a cutting edge program designed to prepare students for the rapidly growing field of high performance computing. Set in the stimulating research environment of ICTP and SISSA, the programme combines lectures with hands-on and applied projects to prepare future HPC specialists for academia and industry.", "MHPC coursework is driven by challenging scientific and technical problems that require an HPC approach. Lectures are provided by ICTP and SISSA staff and highly recognized international experts. Both institutes have long histories and experience in developing and applying scientific and research computation models.", "Students who successfully complete the program will be able to address problems requiring advanced computational techniques in multiple domains, and communicate HPC technological issues in all scientific and industrial environments.", "REQUIREMENTS", "The ideal student for the MHPC has a strong interest in information technology problems driven by scientific research or industrial needs.", "An academic Master Degree is required, although equivalent work experience may also be considered. Work experience will be evaluated during the admissions interview.", "No prior HPC knowledge is assumed, but candidates should have some experience in programming and a competence in one of the following languages: C, C++, Fortran.", "A sound knowledge of Linux operating system is also needed.", "A knowledge of Python language is assumed at the level of the first 39 exercises of the ", "learn python the hard way", "APPLICATIONS FOR ICTP FULL SCHOLARSHIPS", "ICTP offers fellowships to candidates coming from Developing Countries: it covers the MHPC tuition fee, cost-of-living expenses and a return ticket from the origin country.", "Send your application form: ", "https://e-applications.ictp.it/applicant/login/2987", "STANDARD APPLICATIONS", "Standard applications will soon be opened!", "For standard applicants there are opportunities to have the fee waived  (and in some cases also a scholarship) by various supporters.", "Committed supporters (together with their offer) will be published on this page as soon as we receive them.", "SELECTION PROCEDURE", "Applications will be reviewed by the MHPC selection committee. Students will be selected based on information provided in their CVs, application forms, and recommendation letters. Short-listed candidates will be interviewed by phone, video conference or in person.", "For More Information:", "Visit the Official Webpage of the ICTP Scholarships 2018/2019 for Masters in High Performance Computing "], "url : https://www.opportunitiesforafricans.com/ictp-scholarships-2018-19-for-masters-in-high-performance-computing/"], [["Commonwealth Distance Learning Scholarships 2018/2019 for study in the United Kingdom (Fully Funded)", "date announced:April 5, 2018", "Application Deadline: 20 June 2018 23.59 (BST) "], ["Application Deadline: ", "20 June 2018 23.59 (BST) ", "Commonwealth Distance Learning Scholarships", " are for candidates from least developed and lower middle income Commonwealth countries, for part-time Master’s study by distance learning on selected courses offered by UK universities.", "Funded by the ", "UK Department for International Development (DFID)", ", Commonwealth Distance Learning Scholarships enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those unable to study in the UK for financial and other reasons. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Hold a first degree of at least upper second class (2:1) standard; a lower qualification and sufficient relevant experience may be considered in certain cases", "Be unable to afford to study your chosen course without this scholarship.", "Eligible Commonwealth countries", "Bangladesh", "\nCameroon", "\nThe Gambia", "\nGhana", "\nGuyana", "\nIndia", "\nKenya", "\nKiribati", "\nLesotho", "\nMalawi", "\nMozambique", "\nNigeria", "\nPakistan", "\nPapua New Guinea", "\nRwanda", "\nSamoa", "\nSierra Leone", "\nSolomon Islands", "\nSri Lanka", "\nSwaziland", "\nTanzania", "\nTuvalu", "\nUganda", "\nVanuatu", "\nZambia", "Benefits:", "Commonwealth Distance Learning Scholarships provide full tuition fees and all other compulsory costs of studying a UK Master’s course by distance learning. This includes the full cost of any residential components of a course.", "Selection process", "Each participating UK university will conduct its own recruitment process to select a specified number of candidates to be awarded Commonwealth Distance Learning Scholarships. Universities must put forward their selected candidates to the CSC by 4 July 2018. Universities will inform candidates of their results in August 2018.", "Selection criteria include:", "Academic merit of the candidate", "Potential impact of the work on the development of the candidate’s home country", "How to apply", "You should apply to study one of the taught Master’s courses offered under the ", "Commonwealth Distance Learning Scholarship scheme.", " These scholarships support courses offered in partnership with local providers in developing countries, as well as courses delivered directly by UK universities.", "All applications must be made through your chosen university. ", "You must check with your chosen university for their specific advice, admission requirements, and rules for applying. ", "You must take the necessary steps to secure admission to your course at the same time as applying for a Commonwealth Distance Learning Scholarship. When you submit your application, you must hold an offer to start your chosen course in the 2018-2019 academic year. You must also provide the details of at least one referee in your application.", "For More Information:", "Visit the Official Webpage of the Commonwealth Distance Learning Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-distance-learning-scholarships-2018/"], [["DW Akademie International Media Studies 2018 for Journalists to study in Germany (Scholarships Available)", "date announced:March 29, 2018", "Application Deadline: April 30th 2018"], ["Application Deadline: April 30th 2018", "Applications for the 10th intake of the ", "IMS Master’s program", " a", "re now being accepted. The program gets underway in September 2018 in Bonn.", "The program is targeted at students from around the world that want to work in a position of responsibility in journalism or the communications sector. It especially addresses journalists-in-training, media representatives from radio, TV, online and print and communication experts. Those interested must have completed an academic program (bachelor’s degree or equivalent) and have acquired at least one year of professional experience in a media-related field after their first degree. The program is bilingual (English and German), whereby English is the prevalent course language.", "Eligibility", "The program is designed primarily for young journalists, media managers and communications staff who come from developing and transition countries, and particularly from Africa, Asia, Latin America and Eastern Europe. However, Germans, EU citizens, Canadians, Americans and Australians can also apply.", "The program is targeted at students from around the world that want to work in a position of responsibility in journalism or the communications sector. It especially addresses journalists-in-training, media representatives from radio, TV, online and print and communication experts.", "Applicants must have a bachelor’s degree and, after graduating, at least one year of professional experience in a media-related field.", "Those interested must have completed an academic program (bachelor’s degree or equivalent) and have acquired at least one year of professional experience in a media-related field after their first degree.", "The program is bilingual (English and German), whereby English is the prevalent course language.", "For the Master’s Program, applicants must have a bachelor’s degree, at least one year of professional experience in a media-related field and advanced skills in German and English.", "Especially targeted at:", "\n• Media representatives from radio, TV, online and print", "\n• Journalists-in-training, especially from electronic media", "\n• Journalists and management from community radio stations", "\n• Communication experts", "\n• NGO employees", "\n• Employees from ministries", "\n• Employees from cooperative development groups and projects", "\n• Representatives from regional working groups and national broadcasters", "\n• Media association representatives", "Application Procedure:", "Application", "Application Process", "Our online application system is open between November and March each year to apply for the following winter semester. Please note that only online applications can be accepted.", "Prospective students will have to apply through an ", "online application system", ". Please read the information below, before you visit the application link.", "Before you start entering your data in the online-application form, please make sure you have all ", "documents required for application", " ready:", "\n• Letter of motivation (signed and dated)", "\n• Current Curriculum Vitae (Europass format, signed and dated)", "\n• Certificate of your first academic degree (including ALL transcripts)", "\n• Evidence of at least one year’s professional experience in a media-related field AFTER obtaining your first academic degree (for a full scholarship you must give evidence for at least two years of professional experience)", "\n• Certificate of APS (for applicants who completed their first degree in China, Vietnam or Mongolia)", "\n• Evidence of sufficient English language skills (TOEFL IBT: score of 83 or higher, IELTS: score of 6.5 or higher, BULATS: score of 70 or higher, APIEL at least Level 3) – English language certificates are valid for two years from the date of issue", "\n• Evidence of sufficient German language skills (TestDaF at least level TDN 3 in all four parts of the examination, Goethe Zertifikat at least level B2 or DSH at least level 1)", "\n• Copy of your passport", "For More Information:", "Visit the Official Webpage of the DW Akademie International Media Studies Scholarship Programme 2018"], "url : https://www.opportunitiesforafricans.com/dw-akademie-international-media-studies-scholarship-programme-2018/"], [["Embassy of the Republic of Lithuania Scholarships for South African youth in the field of corruption prevention (Funded to Transparency International School on Integrity Vilnius, Lithuania)", "date announced:April 18, 2018", "Application Deadline: April 29th 2018"], ["Application Deadline: April 29th 2018", "The Embassy of the Republic of Lithuania to the Republic of South Africa", " is looking for a partner organization to implement a project concept of the Development Cooperation and Democracy Promotion Programme – “", "The Education of South African youth in the field of corruption prevention", "”. The selected organization together with the Embassy will choose and finance the candidates to participate in the ", "Transparency International School on Integrity ", "(TISI), which is an annual anti-corruption and accountability training for future leaders.", "The upcoming TISI 2018 will take place 2 – 8 July in Vilnius, Lithuania. TISI exposes its participants to the latest developments in the field of anti-corruption and accountability and offers real opportunities to try to implement their ideas in practice. Transparency International School on Integrity is for senior students, graduates and young professionals eager to learn how to make a stand against corruption and to achieve greater transparency in South Africa. The Embassy will cover the costs of the selected candidates.", "Financing will be provided for the project that is in line with the ", "National Development Cooperation Action Plan ", "guidelines, adopted by the Resolution No. 937 of the Government of the Republic of Lithuania on 21 September 2016. Submitted applications for the project shall conform to the EU, Lithuanian and South African multilateral and (or) bilateral strategic agreements, and (or) development strategies of South Africa.", "Application:", "4 thousand EUR are allocated to the project in 2018.", "Legal entities of the Republic of South Africa are invited to submit signed and scanned project applications (", "Project application ", "and ", "Project estimate", ") in English together with required and, if available, additional attachments by e-mail ", "[email protected]", ".", "Please note that approved project shall be implemented and implementation activity and financial reports shall be submitted to the Embassy by July 31, 2018.", "For additional information, please contact ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the Embassy of the Republic of Lithuania Scholarships "], "url : https://www.opportunitiesforafricans.com/embassy-of-the-republic-of-lithuania-scholarships-for-south-african-youth-in-the-field-of-corruption-prevention/"], [["NRF-Nuffic Doctoral Scholarships 2018 for young South Africans", "date announced:April 6, 2018", "Application Deadline:  14th May, 2018"], ["Application Deadline: ", " 14th May, 2018", "In recognition of the long standing collaboration between South Africa and the Netherlands in education and research, and with the ambition to strengthen postgraduate training while enhancing sustainable collaboration between South African and ", "Dutch higher education institutions (HEIs),", " an agreement was signed in 2017 between the NRF and Nuffic (Netherlands organisation for internationalisation in education represented locally in South Africa by Nuffic’s Netherlands Education Support Office.", "Doctoral scholarships will be provided for South African citizens and permanent residents to study full-time in the Netherlands (i.e. single site mode). Institutional level agreements between Dutch HEIs and Partner Institutions in South Africa to enable full-time joint doctoral degrees will also be supported (i.e. split site mode).", "Objectives of the Programme", "Strengthen cooperation and internationalisation between Dutch HEIs and Partner Institutions in South Africa through joint supervision of South African doctoral candidates;", "Foster sustainable institutional collaboration between South African and Dutch HEIs, contributing to the bilateral research agendas;", "Promote and advance science, research and innovation;", "Support the development of a critical mass of globally competitive knowledge-workers in South Africa in prioritised areas;", "Contribute towards increasing the number and quality of South African postgraduate students in all areas of (i) Science, (ii) Engineering, (iii) Technology, (iv) the Social Sciences and (v) Humanities; and", "Effect transformation in the percentage representation of postgraduate students from designated groups, namely black, female and persons with disabilities.", "Doctoral Training Modalities", "The two modalities of doctoral training that will be funded are:", "full-time doctoral studies at a Dutch HEI, referred to as the ", "single site mode", ", and;", "full-time doctoral studies jointly developed and implemented by a Dutch HEI and a Partner University in South Africa, referred to the ", "split-site mode", " and resulting in a joint degree from the partner institutions.", "How to apply", "Applications must be submitted electronically to the NRF on the NRF Online Submission System at ", "https://nrfsubmission.nrf.ac.za", ".", "APPLICANTS MUST READ THE FRAMEWORK DOCUMENT AND APPLICATION AND FUNDING GUIDE PRIOR TO APPLYING.", "NRF Contacts", "\nMs Gugu Dube", "\nProfessional Officer: Human and Infrastructure Capacity Development (HICD)", "\nTelephone: 012 481 4169", "\nEmail address: ", "[email protected]", "Ms Lenor Tommy", "\nLiaison Officer: Grants Management and Systems Administration (GMSA)", "\nTelephone: 012 481 4093", "\nEmail address: ", "[email protected]", "Nuffic Contact", "\nMr Xhanti Mhlambiso", "\nEducation Promotion & Projects Officer", "\nTelephone: 012 346 0982", "\nEmail address: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the NRF-Nuffic Doctoral Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/nrf-nuffic-doctoral-scholarships-2018-for-young-south-africans/"], [["African Trans-Regional Cooperation through Academic Mobility (ACADEMY) Consortium Scholarships 2018 for young Africans (Fully Funded)", "date announced:April 5, 2018", "Application Deadline: 15th May-2018 (23:59 CET)"], ["Application Deadline: 15th May-2018 (23:59 CET)", "The ", "African Trans-Regional Cooperation through Academic Mobility (ACADEMY) Consortium,", " composed of five higher education institutions from four different regions in Africa, intends to address these challenges by providing a mutual and continuous support, and creating synergy using the strengths and resources of each institution to overcome the main constraints and threats. These can be viewed as opportunities for mutual learning, intercultural understanding, and exchange of know-how and best practices.", "It aims at improving both the capacity of the participating HEIs and beneficiaries’ competences through 109 grants related to five thematic fields. This will lead to:", "reinforced inter-institutional cooperation and the conclusion of new bi-lateral/multi-lateral cooperation agreements;", "peer learning and transfer of innovative practices;", "creation of new academic networks such as ACADEMY-NET;", "improved gender balance and equity in access to internationalization opportunities;", "increased visibility of partner institutions.", "Eligible areas of study", "Business, administration and law;", "Natural sciences;", "Information and Communication Technologies;", "Engineering, manufacturing and construction;", "Agriculture, forestry, fisheries and veterinary.", "Please notice that ", "the field of study will be taken into consideration in the selection process together with other factors such as application’s grade, balance between institutions, gender and other cross-cutting issues, etc.", "Scholarships", "The available scholarships are:", "Master", "\nFull degree : 20 months", "\nCredit-seeking mobility : 6 to 10 months", "PhD", "\nFull degree : 36 months", "\nCredit-seeking mobility : 6 to 10 months", "Academic and Administrative Staff", "\nMobility : 1 to 3 months", "Eligibility Criteria", "Applicants for all types of scholarships must :", "Be nationals and residents in any of the eligible African countries.", "Have sufficient knowledge of the language of instruction of courses in the host country.", "Fulfil the criteria of one of the target groups below:", "Students having previously benefitted from a scholarship under the Intra-ACP or the Intra-Africa Academic Mobility Schemes are NOT eligible.", "Target Group 1 (TG1)", "For credit-seeking mobility applicants: Students must be registered in one of the five partner universities: Université de Tlemcen (Algeria), University of Cape Coast (Ghana), Kenyatta University (Kenya), University of Ibadan (Nigeria), and University of KwaZulu-Natal (South Africa)", "For degree-seeking applicants: Students must have graduated from one of the five partner universities.", "For staff: Staff must be working in one of the five partner universities.", "Target Group 2 (TG2)", "For credit-seeking mobility applicants: Students must be registered in any African Higher Education Institution.", "For degree-seeking mobility applicants: Students must have graduated from any African Higher Education Institution.", "List of eligible countries", ":", "Algeria, Angola, Benin, Botswana, Burkina Faso, Burundi, Cabo Verde, Cameroon, Central African Republic (CAR), Chad, Comoros, Congo, Cote d’Ivoire, Djibouti, Egypt, Equatorial Guinea, Eritrea, Ethiopia, Gabon, Gambia, Ghana, Guinea, Guinea-Bissau, Kenya, Lesotho, Liberia, Libya, Madagascar, Malawi, Mali, Mauritania, Mauritius, Morocco, Mozambique, Namibia, Niger, Nigeria, Rwanda, Sao Tome and Principe, Senegal, Seychelles, Sierra Leone, Somalia, South Africa, South Sudan, Sudan, Swaziland, Tanzania, Togo, Tunisia, Uganda, Zambia, Zimbabwe", "The Scholarship covers:", "Monthly subsistence allowance for the entire mobility period", "Extra allowance per academic year to female students", " (for mobility equal to or longer than two academic years)", "Settling in allowance (for students only)", "Roundtrip flight ticket and visa costs – for mobility equal to or longer than two academic years, ", "two roundtrip tickets will be provided", " (arranged by the coordinating institution on behalf of students)", "Comprehensive insurance (Health, Accident and Travel) (arranged by the coordinating institution on behalf of students)", "Participation costs such as tuition fees, registration fees and service fees where applicable (paid directly to the hosting institutions)", "Research costs for students on mobility for 10 months or more (based on actual research needs and dependent on a request submitted by the students)", "Type of Mobility", "Participation Costs", "\n(per academic year)", "Subsistence Allowance", "\n(per month)", "Research Costs", "\n(per academic year)", "Insurance costs", "\n(per month)", "Duration", "Master", "€3,500", "€600", "€600", "€75", "Max 20 months", "Doctorates", "€4,000", "€900", "€2000", "€75", "Max 36 months", "Staff", "€1200", "€75", "Max 3 months", "Participation costs are transferred directly to the host institution.", "Insurance is arranged by the coordinating institution on behalf of students.", "For More Information:", "Visit the Official Webpage of the ACADEMY Consortium Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/african-trans-regional-cooperation-through-academic-mobility-academy-consortium-scholarships-2018/"], [["Master’s degree (LLM/MPhil) in Human Rights and Democratisation in Africa Scholarships 2018/2019 (Fully Funded to study in South Africa)", "date announced:April 4, 2018", "The LLM/MPhil in Human Rights and Democratisation in Africa is a prestigious one-year intensive course where 25-30 exceptional individuals spend 6 months in Pretoria and 6 months at one of the 13 partner universities all over Africa. They are taught by eminent lecturers in the field of human rights and undergo many practical training exercises. It is the only course of its kind in Africa. Graduates become members of the HRDA Alumni Association whose 482 members are currently active in the full spectrum of human rights work: from grassroots, through civil service, to international organisations including the African Union and the United Nations."], ["Application Deadline:  July 31st 2018", "The LLM/MPhil in Human Rights and Democratisation in Africa is a prestigious one-year intensive course where 25-30 exceptional individuals spend 6 months in Pretoria and 6 months at one of the 13 partner universities all over Africa. They are taught by eminent lecturers in the field of human rights and undergo many practical training exercises. It is the only course of its kind in Africa. Graduates become members of the HRDA Alumni Association whose 482 members are currently active in the full spectrum of human rights work: from grassroots, through civil service, to international organisations including the African Union and the United Nations.", "Requirements:", "The LLM/MPhil in Human Rights and Democratisation in Africa is a unique programme to which 25 to 30 applicants from African countries with the following degrees and preferably experience in the field of human rights are admitted:", "Law students", "\nA degree allowing access to the legal profession (eg LLB or ", "licence en droit", ")", "Other students", "\nAt least an Honours degree in a discipline relevant to human rights and democratisation", "During an intensive one-year course, they are taught by eminent lecturers in the field of human rights and gain invaluable practical exposure. It is the only course of its kind in Africa.", "The LLM/MPhil is a regional cooperation initiative presented by the Centre for Human Rights at the University of Pretoria (South Africa), in conjunction with the faculties of law at Université d’Abomey-Calavi (Benin), Addis Ababa University (Ethiopia), University of Alexandria (Egypt), Catholic University of Central Africa (Cameroon), University of Nairobi (Kenya), Universidade Eduardo Mondlane (Mozambique), Université Gaston Berger de Saint Louis (Senegal), University of Ghana, University of Lagos (Nigeria), University of Mauritius, Makerere University (Uganda), University of Venda and the University of the Western Cape (South Africa).", "Individuals from all African countries are invited to apply for admission to study for the Master’s Degree (LLM/MPhil) in Human Rights and Democratisation in Africa at the Centre for Human Rights, University of Pretoria, South Africa.", "Scholarships", "Up to 25 full scholarships are available for African citizens.", "For More Information:", "Visit the Official Webpage of the Master’s degree (LLM/MPhil) in Human Rights and Democratisation in Africa Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/masters-degree-llm-mphil-in-human-rights-and-democratisation-in-africa-scholarships-2018-2019/"], [["Alexander Rave Foundation Scholarships 2018/2019 for Artists to study in Germany (Fully Funded)", "date announced:March 28, 2018", "Application Deadline: July 30th 2018"], ["Application Deadline: July 30th 2018", "Rave Scholarships", " ", "support further practical training for young curators, restorers, museum technicians and cultural managers from countries in transition and developing countries who have arranged a guest period, a practical training or non-paid work at a museum, at a non-commercial gallery or at a non-commercial cultural institution in Germany.", "Target groups", "curators", "restorers", "museum technicians", "cultural managers", "from transformation and developing countries who have arranged a guest period, a practical training or non-paid work at a museum, at a non-commercial gallery or at a non-commercial cultural institution in Germany.", "Payments:", "The Rave Scholarship is a working scholarship and requires the holder’s presence. It includes the following payments:", "a monthly lump sum of 1,300 € for a scholarship period of three to six months", "travelling expenses (to and from Germany)", "health insurance", "Requirements:", "Scholarships will be awarded to applicants", "who come from a transformation or developing country and are still living there,", "who did not have the opportunity yet to come for a longer stay or did not have further training or working stay in Germany,", "who finished their professional training not longer than five years ago and are not yet over 40. Those still studying or training at the time of application will not be considered for selection,", "who have found a non-commercial partner institution in Germany that has agreed to take care of them or agreed to a joint project,", "who can provide a positive statement from their own country (reference),", "Knowledge of one of the three languages German, English or French is a requirement.", "Applicants who were rejected once cannot apply again.", "Application documents", "The application should be accompanied by", "a fully completed ", "application form", ",", "a CV (3 pages max.), including educational qualifications,", "a project sketch (1 page) developed together with the German institution – informing about tasks and responsibilities of the planned visit to Germany,", "consent form a non-commercial German institution to care for the applicant during the scholarship period in Germany,", "a letter of reference from the home country,", "an abridged report (1 page max.) on the current art scene in the home country", "a letter of motivation (1 page max.)", "Applications are submitted by e-mail or mail to", "Rave Foundation", "\nc/o Institut für Auslandsbeziehungen", "\nCharlottenplatz 17", "\nD-70173 Stuttgart", "\nFax +49.711.2225194", "rave-stiftung(at)ifa.de", "The application date is ", "30 July each year", ". Selections will be made within 3 months.", "Documents", "Information leaflet", "Application", "Letter of Commitment from the German host institution ", "For More Information:", "Visit the Official Webpage of the Alexander Rave Foundation Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/alexander-rave-foundation-scholarships-2018-2019/"], [["CPIJ Scholarships 2018 to Attend the International Justice and Victims’ Rights Summer School in Canada (Fully Funded)", "date announced:March 21, 2018", "Application Deadline: March 30th 2018"], ["Application Deadline: March 30th 2018", "The Canadian Partnership for International Justice", " is offering three $ 2,000 scholarships to graduate students from developing countries to attend the", " ", "International Justice and Victims’ Rights Summer School", ",", " to be held at the ", "Montreal Centre for International Studies, University of Montreal (CÉRIUM)", ", June 4 to 9, 2018.", "Benefits:", "This scholarship will be used to help pay students’ tuition, travel expenses, and lodging.", "Application", "Please send a file containing:", "A short CV (", "use this format", "), including the list of academic and professional achievements (e.g. education, scholarships, publications, presentations at conferences);", "A letter of motivation specifying your research interests and justifying the benefit of participating in the summer school for the advancement of your project;", "A copy of the grades obtained in your current program;", "A proof of current enrolment in a postsecondary institution.", "Filing the application", "Complete files must be sent by email to ", "[email protected]", ".", "The deadline to receive applications is Friday, March 30, 2018 at 5:00 PM.", "Files must be sent as a single file in PDF format. Only complete files will be considered.", "For More Information:", "Visit the Official Webpage of the CPIJ Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/cpij-scholarships-2018-to-attend-the-international-justice-and-victims-rights-summer-school-in-canada/"], [["Udacity Google Africa Scholarship Program 2018 for aspiring developers in Africa.", "date announced:March 20, 2018", "Application Deadline:April 24, 2018"], ["Application Deadline:April 24, 2018", "Web and Android Scholarships available for residents of African countries.", "Google have announced", " a partnership with Andela and Udacity to provide 15,000 “single-course” scholarships and 500 nanodegree scholarships to aspiring developers in Nigeria, Kenya, and South Africa.", "To apply for this scholarship, you need to be at least 18 years old and live in a country in Africa. When applying, you will choose between learning web development or Android development. From there, once you’re accepted, we’ll place you in one of two tracks (beginner or intermediate), depending on your existing skills and experience. After that, the learning begins! Some scholarship recipients may be able to participate in an Andela Learning Community with our partners from Andela. Finally, top students from each track will earn full scholarships to one of our Android or Web Development Nanodegree programs.", "Requirements:", "To receive one of these scholarships, you must be a current resident of a country in Africa and be at least 18 years of age when you submit your application.", "The program takes place 100% online.", "You can work from wherever you want to, as long as you have access to a working internet connection. Depending on where you live, you may also choose to participate in optional in-person meet-ups with your scholarship classmates.", "Benefits:", "Learn valuable skills to launch or advance your career as a mobile or web developer", "Master world-class curriculum developed with experts from Google and Udacity\n", "Join a rapidly growing community of mobile and web developers", "How to Apply", "Applications Due", "April 24, 2018", "Recipients notified", "May 2, 2018", "Recipients begin program", "May 8, 2018", "The application is straightforward, and should take 10-15 minutes. There is a single application for all, whether you’re interested in Mobile or Web, and whether you’re a beginner or already have experience.", "Answer what you can, to the best of your ability, and we’ll do the rest! Remember this application is open to residents of countries in Africa who are at least 18 years old.", "For More Information:", "Visit the Official Webpage of the Udacity Google Africa Scholarship Program 2018/2019"], "url : https://www.opportunitiesforafricans.com/udacity-google-africa-scholarship-program-2018/"], [["Ministry of Commerce of People’s Republic of China (MOFCOM) Scholarship 2018 for Study in China (Fully Funded)", "date announced:April 9, 2018", "Application Deadline: 30th April 2018."], ["Application Deadline: 30", "th", " April 2018.", "MOFCOM Scholarship", " is set up by ", "Ministry of Commerce of People’s Republic of China", " to further strengthen the communication and cooperation between China and other countries as well as to develop talents for developing countries. Starting from 2015, ", "MOFCOM Scholarship", " mainly sponsors the young and the middle-aged talents from recipient countries to pursue their postgraduate degree education in China and entrusts China Scholarship Council to administer the Scholarship.", "MOFCOM Scholarship supports Master’s program for 2-3 years or PhD program for 3-4 years. Scholarship winners must register for English-taught program if such program is available. When only Chinese-taught program is available, students should take Chinese language training courses for one to two years before moving on to their degree study.", "Eligibility", "To be eligible, applicants must:", "be a citizen of a developing country other than the People’s Republic of China, and be in good health;", "be a bachelor’s degree holder when applying for master’s program;", "be a master’s degree holder when applying for doctoral program;", "be under the age of 45 when applying;", "have sufficient English or Chinese proficiency which meets the academic requirements of the program. English: IETS 6.0 or above, Chinese: HSK level 4 (score180) or above, or other evidence which indicates your English or Chinese proficiency is adequate.", "Scholarship Coverage", "tuition waiver;", "teaching material fee waiver;", "research and survey fee waiver;", "dissertation guidance fee waiver;", "one-off resettlement fee:", "3000RMB per master student,", "3000RMB per PhD student;", "on-campus accommodation;", "stipend:", "3000RMB per month per master student,", "3500RMB per month per PhD student;", "medical insurance", "one-time round-trip international airfare for all the students (First time fly to China after enrollment, and Fly back to home country while graduation), and a maximum of “n-1” (“n” is for the length of schooling year which is set while the student was enrolled by the program) round-trip international airfares for home visits (one time per year set at the end of an academic year).", "Application Documents (written in Chinese or English)", "Application Online", "Application Form for MOFCOM Scholarship;", "Ensure you have both submitted it online and printed the hard copy via ", "www.csc.edu.cn/studyinchina or www.campuschina.org", "For more application instructions, please check Attachment I.", "Photocopy of highest diploma;", "Photocopy of academic transcripts;", "A Study Plan or Research Proposal with a minimum of 400 words;", " Photocopy of Foreigner Physical Examination Form", ";", "Photocopy of English or Chinese proficiency;", "Photocopy of a valid passport.", "Submission Offline", "1.Submit all the application materials listed above in both hard copy and scanned copy to the Economic and Commercial Counsellor’s Office of Chinese Embassy", " before 30", "th", " April, 2018", ". Hard copy must include both the original copy and the photocopy, as indicated above. For emails and addresses of the Economic and Commercial Counsellor’s Offices, please visit http://www.china-aibo.cn.", "2.Submit a written request to the Economic and Commercial Counsellor’s Office of Chinese Embassy for an official recommendation letter and clearly state:", "a) Whether the applicant is willing to be considered for a similar program at other universities if the applied programs could not accept the applicant.", "b) Other special requests if any.", "Note", "a) All the documents to be submitted should be in Chinese or English. Otherwise, a notarized copy in Chinese or English is required.", "b) An original copy of degrees, transcripts, Foreigner Physical Examination Form and language certificates must be presented for on-site verification.", "c) Applicants will get back all the hard-copy materials, both original copies and photocopies from the Economic and Commercial Counsellor’s Office. If admitted, they must take the documents to China and submit them to the University during on registration in early September.", "For More Information:", "Visit the Official Webpage of the MOFCOM Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/mofcom-scholarship-2018-for-study-in-china/"], [["CICOPS Scholarships 2019 for Researchers from Developing Countries for Study in Italy (Fully Funded)", "date announced:March 30, 2018", "Application Deadline: 31st May 2018"], ["Application Deadline: ", "31st May 2018", "Since 1998, ", "the University of Pavia", " and ", "the Institute for University Studies (EDiSU)", " have offered about ten scholarships yearly for a four to ten week stay in Pavia, during which time the scholars carry out research with professors in the department that hosts them and often hold seminars.", "In order to promote international cooperation, particularly with Developing Countries, the University of Pavia and EDiSU (Institute of the Right to University Studies) are offering 10 scholarships to visiting scholars for the year 2019 for a period of stay of 4 to 12 weeks at the University of Pavia.", "Eligibility Requirements:", "Applicants must have at least two years of either teaching experience or activity in international organizations and institutions.", "CICOPS Scholarships are foreseen for research collaboration in the short period (from 4 to 12 weeks) in order to encourage the mobility of researcher from Developing Countries.", "Applicants enrolled in a Doctoral or Postgraduate Course at an Italian University are not eligible to apply.", "Benefits:", "The Scholarship include travel (economy class), food and accommodation expenses, health insurance policy and a contribution of 150.00 Euro (gross) per week", "For further information please contact:", "University of Pavia – CICOPS Office", "\nStefania Ferrari", "\nTel: +39 0382 984232", "\nE-Mail: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the CICOPS Scholarships 2019 for Researchers"], "url : https://www.opportunitiesforafricans.com/cicops-scholarships-2019-for-researchers-from-developing-countries/"], [["Bertelsmann Data Science Scholarship Program 2018", "date announced:March 28, 2018", "Application Deadline: April 22nd, 2018"], ["Application Deadline: April 22nd, 2018", "Together with Udacity, Bertelsmann is investing in a scholarship program to provide job-relevant training, specifically for Data Science and analytics. The scholarship program consists of 15,000 seats for the Challenge Course “Intro to Descriptive Statistics”, as well as 1,500 seats (the top 10% of all 15,000 scholarship recipients) for one full Udacity Nanodegree program. The", "This scholarship is open to Bertelsmann employees as well as the general public interested in Data Science. Applicants 18 years of age or older are invited to apply. We’ll review all applications and select 15,000 recipients to participate in the Scholarship Challenge Course. This is where your learning begins! You’ll spend 3 months learning all about the statistics you need to succeed in the world of data. Top students from the initial Challenge Course will be selected for a full Nanodegree program.", "How to Apply", " Applications Due : April 22, 2018", "Recipients notified : May 02, 2018", "Recipients begin program : May 08, 2018", "The application is a single application for all who want to expand their Data Science capabilities and are at least 18 years old—whether you are a beginner or already have experience.", "For More Information:", "Visit the Official Webpage of the Bertelsmann Data Science Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/bertelsmann-data-science-scholarship-program-2018/"], [["Jim Ovia Foundation Leaders Scholarship 2018/2019 for study at Ashesi University, Ghana (Fully Funded)", "date announced:March 28, 2018", "Application Deadline:"], ["Application Deadline:", "Regular Deadline: 28th June 2018 Late Deadline: 23rd August 2018.", "The ", "Jim Ovia Foundation Leaders Scholarship", " is a partnership between the ", "Jim Ovia Foundation", " and ", "the Africa-America Institute,", " to educate young Africans to lead the continent. Through the University partners, ", "the Jim Ovia Foundation Leaders Scholarship", " will provide comprehensive scholarships to select high achieving students, from under resourced backgrounds, a full education that will provide them with the necessary skills for a dynamic and innovation-driven career.", "This scholarship is made possible through the generous philanthropy of the Jim Ovia Foundation and is currently offered through", " Ashesi University. ", "Eligibility Requirements:", "Students must also meet the following requirements:", "Must be a citizen of an African country, residing in Africa", "Exhibit strong academic record and penchant for high-achievement", "Demonstrate a Financial Need", "Present an active record of youth leadership within his/her community", "Benefits:", "The Jim Ovia Foundation Leaders Scholarship", " will provide the following benefits:", "Comprehensive Scholarships:", "the Jim Ovia Foundation Leaders Scholarship will provide tuition, room and board for undergraduate study.", "Career Support and Opportunities: ", "Scholarship recipients will receive career counseling and support while still students and also after graduation.", "AAI Global Alumni Network: ", "Recipients of the Jim Ovia Foundation Leaders Scholarship will graduate into one of the most prestigious alumni networks. AAI Alumni include prominent leaders in many sectors around Africa and the Globe and includes two sitting Presidents. Scholarship recipients will be connected to this network for potential opportunities, mentorship and the ability to collectively continue towards developing the continent.", "Application Procedure:", "To be considered for the Jim Ovia Foundation Leaders Scholarship, students must complete the application process for Ashesi University, including submission of a ", "General Scholarship Form", ", as detailed on ", "http://www.ashesi.edu.gh/admissions/how-to-apply.html", "For More Information:", "Visit the Official Webpage of the Jim Ovia Foundation Leaders Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/jim-ovia-foundation-leaders-scholarship-2018-2019/"], [["Singapore International Graduate Award 2019 Scholarships for PhD study in Singapore (Fully Funded)", "date announced:April 16, 2018", "Application Deadline: 1 June 2018 (2359hrs GMT +8 Singapore time)"], ["Application Deadline: ", "1 June 2018 (2359hrs GMT +8 Singapore time)", "Singapore is the gateway to some of the fastest-growing economies in the Asia Pacific region. And with the ", "Singapore International Graduate Award (SINGA),", " you can pursue your PhD education in Singapore, establish global links and take your research career to greater heights.", "A joint collaboration between A*STAR, Nanyang Technological University (NTU), National University of Singapore (NUS) and Singapore University of Technology and Design (SUTD), SINGA fosters a vibrant and culturally diverse research community of international students.", "Under SINGA, you’ll receive PhD training at an A*STAR Research Institute or one of the three top universities in Asia – NUS, NTU or SUTD. You’ll be working in a multi-cultural environment alongside distinguished and world-renowned researchers in state-of-the-art facilities.", "Research areas under the PhD Programme fall broadly under two categories:", "Biomedical Sciences; and", "Physical Science and Engineering.", "A*STAR Supervisors and Projects", "NTU Supervisors and Projects", "NUS Supervisors and Projects", "SUTD Supervisors and Projects ", "Eligibility Requirements:", "Open for application to all international graduates with a passion for research and excellent academic results", "Good skills in written and spoken English", "Good reports from academic referees", "The above eligibility criteria are not exhaustive.", "A*STAR may include additional selection criteria based on prevailing scholarship policies.  These policies may be amended from time to time without notice.", "Benefits:", "The award provides support for up to 4 years of PhD studies including:", "Tuition fees", "Monthly stipend of S$2,000, which will be increased to S$2,500 after the passing of the Qualifying Examination", "One-time airfare grant of up to S$1,500*", "One-time settling-in allowance of S$1,000*", "In order to be considered for the program, you", "Are international students", "Have good academic background", "Have good skills in written and spoken English", "Get good reports from academic referees", "Application Process:", "Once you have acknowledged acceptance of the SINGA award, the university (either NTU, NUS or SUTD) at which you will be enrolled in will send you its admission package which includes the offer of admission. You should send back a signed copy of the admission letter to the university to confirm that you accept its admission offer.", "The university will apply for the student pass on your behalf through the Immigration and Checkpoints Authority (ICA) web-based Student’s Pass Online Application and Registration (SOLAR) system. The SOLAR application number and other details that you need to log into the SOLAR system will be sent to you in your admissions package. You must follow the instructions to complete the application process prior to your departure for Singapore. Please note that it takes the ICA 2 – 4 weeks to process your application.", "Detailed information on student pass application could be found at ", "www.ntu.edu.sg/SAO/OurServices/Pages/StudentsPass.aspx", " for NTU candidates, and ", "www.nus.edu.sg/osa/iss/life-in-nus/student-pass/new-application", " for NUS candidates.", "For SUTD candidates, please email Office of Graduate Studies at ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the Singapore International Graduate Award 2019 Scholarships "], "url : https://www.opportunitiesforafricans.com/singapore-international-graduate-award-2019-scholarships/"], [["GENES MSc and PhD Scholarships 2018 for molecular plant breeders in Africa (Fully Funded)", "date announced:April 5, 2018", "Application Deadline: May 30th 2018"], ["Application Deadline: May 30th 2018", "Feeding the increasing populations in Africa requires radical transformation of a largely underdeveloped agriculture over the next four decades. A major challenge is how to increase agricultural production among resource-poor farmers without exacerbating environmental problems and simultaneously coping with climate change, a critical force driving low", "agricultural productivity in sub-Saharan Africa.", "GENES is funded by the Intra-Africa Program of the Education, Audiovisual and Culture Executive Agency (EACEA) of the European Commission. The consortium intends to:", "1) Produce for Africa 10 world-class PjD jolders molecular plant breeders who will accelerate cultivar development to adapt to current and future challenges related to climate change and food and nutrition security;", "2) Train 36 MSc jolders genomics scientists and 8 support staff with strong capacity in cultivar development and new molecular breeding approaches to increase knowledge and prospects of improving major crops including cereals, pulses, vegetables, fruits, and bio-fuels", "used in Africa for food and nutrition security and the crop production industry;", "3) Harmonize training programs and research agenda of the consortium members (universities) on the use of genomic breeding to accelerate cultivar development and increase the resilience of crop production systems;", "4) Foster national, regional, and global collaboration and programmatic agenda that promote genomic breeding research and training for agricultural innovations within Africa.", "Application process", "The GENES mobility grant is open to all students fr om any of the partner universities (Target Group 1) and to students from other African universities (Target Group 2). Currently, 10 PhD and 20 MSc scholarships are available.", "Target Group 1:", "This category includes students enrolled (for M.Sc application) or graduated (for PhD application) from all partner universities as follows:", "1. Ebonyi State University; Nigeria", "2. University of Abomey-Calavi; Benin", "3. Jimma University; Ethiopia", "4. University of Yaunde 1", "Target Group 2:", "Students from all African countries", "Eligibility", "To be eligible for a scholarship (i.e. financial support to third parties), master students as well as doctoral candidates referred to as ‘’students’’ must comply with the criteria below at the time of the application for a scholarship:", "a) be a national and resident in any of the eligible countries covered by the Intra-Africa Mobility programme of the EACEA, and", "b) be registered/admitted in or having obtained a HEI degree (or equivalent) from", "i. one of the HEIs included in the GENES consortium (Target group 1)", "ii. a HEI not included in the GENES consortium but established in an eligible country (Target group 2) and", "c) have sufficient knowledge of the language of the courses in the host countries.", "d) NB: students with one-year post B.Sc but not yet admitted or registered in any of the Partner HEIs is also eligible to apply. However, mobility will begin in second year of the study, i.e. sponsorship from GENES will be for research work, only. Students can only benefit from one scholarship under the Intra-Africa or IntraACP academic mobility scheme (regardless", "the type of mobility or the funding project).", "Benefits:", "In line with Agreement with", " Intra-Africa Mobility Scheme of EACEA,", " the scholarship will cover:", "Round trip flight ticket and visa costs (using a preferred travel agent and calculated against direct linear distance);", "Direct participation costs such as tuition fees, registration fees and service fees where applicable;", "Comprehensive travel insurance (Health, Accident and Travel)", "A monthly subsistence allowance for the mobility period.", "Application Requirements", "Other required documents are listed on the application form and include:", "Cover letter", "Scholarship Application form (download from GENES website)", "Student proposal (guidelines available from GENES website)", "National ID or Copy of Passport Data page", "Certificate of degree", "Transcript records", "Support letter from sending HEIs", "Recommendation letter of home supervisor (mandatory for all applicants)", "Enrollment proof in degree course from home institution (for MSc applicants)", "Curriculum Vitae", "Employment certificate (only for staff)", "Certificate of English or French language skills", "Proof of socio-economic vulnerability (if available)", "Application Procedure:", "Due to difference in the partners higher education system, specific academic arrangements will be performed to assure that scholars are admitted in the right program and can make benefit of the mobility programme. These arrangements will be fixed on a case-by-case basis between the host HEI and Coordinating Institution.", "For more information, please contact Dr Celestine Afiukwa ", "[email protected]", ", Head Department of Biotechnology, Ebonyi State University, Abakaliki, Nigeria. Contacts of HEIs representative are available on www.genes-intra-africa.org", "Applicants should submit completed application and all supporting documents by email to ", "[email protected]", " with a copy to Mr Dennis Okporie, ", "[email protected]", ", by 30 May 2018.", "They should indicate in the subject line (if submitting by email) or super scribe the envelope (if submitting by post) ‘Application for GENES MSc/PhDprogramme’. Incomplete applications will be rejected.", "Applications should be sent to: ", "[email protected]", " with copy to Mr Dennis Okporie, ", "[email protected]", " and Contact information: Department of Crop Production & Landscape Management Faculty of Agriculture & Natural Resources Management", "\nEbonyi State University, P. M. B. 053, Abakaliki, Nigeria.", "\n+234 8086612106", "\nEmail: ", "[email protected]", "Application Document", "For More Information:", "Visit the Official Webpage of the GENES MSc and PhD Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/genes-msc-and-phd-scholarships-2018/"], [["Italian government Scholarships 2018/2019 for foreign citizens to study in Italy ( 900 Euros per month)", "date announced:March 27, 2018", "Application Deadline: April 30th, 2018 2 pm (Central European Time)"], ["Application Deadline: April 30th, 2018 2 pm (Central European Time)", "The Ministry of Foreign Affairs and International Cooperation (MAECI)", " offers grants in favor of foreign citizens not residing in Italy and Italian citizens living abroad (IRE)* for the academic year 2018-2019 in order to foster international cultural, scientific and technological cooperation, to promote Italian language and culture and to support Italy’s economic system in the world (According to Law 288/55 and its subsequent changes and additions).", "ELIGIBILITY", "Applicants who will meet the following requirements by the deadline of this call ( April 30th, 2018) may apply for a grant.", "Academic qualifications", "\nApplications must only be submitted by foreign students not residing in Italy and by Italian citizens living abroad (IRE)* holding an appropriate academic qualification required to enroll to the Italian University/Institute", "Age requirements", "Applicants for Master’s Degree/Higher Education in Arts, Music, and Dance (AFAM) Program", "mes/Italian Language and Culture Courses should not be over 28 years old by the deadline of this call, with the sole exception of renewals.", "Applicants for PhD Programmes should not be over 30 years old by the deadline of this call,", "with the sole exception of renewals.", "Applicants for Research Projects under academic supervision should not be over 40 years old by the deadline of this call.", "Language proficiency", "Applicants must provide a certificate of their proficiency in Italian language. The minimum level required is B2 within the Common European Framework of Reference for Languages (CEFR):", "(https://www.linguaitaliana.esteri.it/data/lingua/corsi/pdf/tabella_certificazioni.pdf).", "Proof of proficiency in Italian is not required for courses entirely taught in English.", "Courses for which grants are available:", "       Master’s Degree (Laurea Magistrale 2° ciclo)", "       Courses of Higher Education in Arts, Music, and Dance (AFAM)", "       PhD programmes", "       Research under academic supervision (Progetti in co-tutela)", "       Italian Language and Culture Courses", "FUNDING PERIOD", "Grants are awarded for a period of study from October 1st, 2018 to September 30th, 2019.", "GRANTS OPPORTUNITIES", "Master’s Degree (Laurea Magistrale 2° ciclo)", "Grants for Master’s Degree courses are awarded for a period of study of 6 (six) or 9 (nine)", "months. Admission to the first year of a Master’s Degree course in Italy requires the completion of a Bachelor’s degree in the applicants’ country of origin; admission to the second year is g", "ranted to applicants upon evidence to be on track with their first year studies.", "Courses of Higher Education in Arts, Music, and Dance (AFAM)", "Grants for Courses of Higher Education in Arts, Music, and Dance (AFAM) are awarded for", "a period of study of 6 (six) or 9 (nine) months. To be admitted to an Italian AFAM Institute, applicants need to meet the entry requirements and academic qualifications established", "by the relevant University/Institute.", "PhD program", "Grants for a PhD program are awarded for a period of study of 6 (six) or 9 (nine) months.", "To be admitted to a PhD in Italy, applicants need to meet the entry requirements and academic", "qualifications established by the University; they are also required to provide a letter of", "acceptance on behalf of the relevant Italian University.", "Benefits:", "TUITION FEES", "Grantees may be exempted from the payment of enrollment and tuition fees depending on the", "policy of each University.", "HEALTH AND MEDICAL INSURANCE", "Grantees will be covered by a health and medical/accident insurance contracted by MAECI", "for the entire duration of the grant.", "TERMS OF GRANT", "Grantees will receive a 900 Euros monthly allowance on a quarterly basis, which will be paid", "on their Italian bank account.", "SUBMISSION OF APPLICATIONS", "Applicants must complete and submit the online application form available upon registration at the following link: ", "https://studyinitaly.esteri.it", "Click here to access the registration form ", "https://studyinitaly.esteri.it/registrazione", "Applications must be submitted by 2 pm (Central European Time) April 30th, 2018.", "Applications submitted after the deadline will not be considered.", "For More Information:", "Visit the Official Webpage of the Italian government Scholarships 2018/2019 "], "url : https://www.opportunitiesforafricans.com/italian-government-scholarships-2018-2019/"]]