[[["University of Adelaide Scholarships International (ASI) 2019/2020 for graduate study in Australia (Fully Funded)", "date announced:July 29, 2019", "Application Deadline: August 31st 2019"], ["Application Deadline: August 31st 2019", " The University of Adelaide", " offers a number of Adelaide Scholarships International to outstanding international graduates from any country to commence their education via a Masters or Doctorate degree by research.  Awards are available in all Discipline areas. ", "Eligibility", ": ", "Applicants must be international students who are acceptable to\ncommence a Masters or Doctorate by research degree at the University of\nAdelaide.  ", "Citizens and Permanent Residents of Australia, and citizens of New Zealand are ineligible. ", "Applicants who have applied for Australian permanent residency status, but have not yet received an outcome, can apply. ", "Successful recipients are required to apply and enrol in\ntheir intended program of study at The University of Adelaide as\n‘international students’ to retain their scholarship.", "Applicants with a qualification in progress will not be eligible\nfor consideration until the qualification has been satisfactorily\ncompleted (and acceptable evidence provided) or evidence of withdrawal\nhas been provided.", "Applicants are required to provide evidence of meeting the University of Adelaide’s minimum ", "English language proficiency requirements", " for direct entry by the application deadline.", "Applicants are required to have successfully completed at least\nthe equivalent of a First Class Australian Honours degree. (In\nAustralia an Honours degree is generally a one year qualification taken\nafter an undergraduate degree and involves further study in a\nparticular discipline area. In some areas, Honours is available as part\nof the final year of a four year undergraduate degree. It is\nrecognised as a prestigious qualification that further develops\nresearch, writing and organisational skills. It also demonstrates an\nability to undertake high-level study.  Achievement of a First Class\nHonours degree indicates that the recipient performed at the highest\nacademic level and indicates that they have had an introduction to\nindependent research.) ", "International applicants must not hold a research qualification\nregarded by the University of Adelaide to be equivalent to an\nAustralian Research Doctorate degree or, if undertaking a Research\nMasters degree, not hold a research qualification regarded by the\nUniversity of Adelaide to be equivalent to or higher than an Australian\nResearch Masters degree. ", "Successful recipients must commence study at the University of\nAdelaide in the semester the scholarship is offered. It is not possible\nto defer the award.", "International applicants are not eligible if they have already commenced the degree for which they are seeking an award. ", "The offer of a scholarship is contingent upon a student not being\noffered another award by the Commonwealth of Australia, the University\nof Adelaide, or an overseas sponsor. The University reserves the right\nto withdraw an offer of a scholarship at any time prior to enrolment\nif it is advised that an awardee has been offered a scholarship equal\nto or in excess of the financial value of the award offered by the\nUniversity. ", "NOTE: If an applicant has previously been awarded an international\nhigher degree by research scholarship by the University of Adelaide,\nand failed to successfully complete the corresponding academic\nprogram, that applicant will not be reconsidered for any future\ninternational higher degree by research scholarships.", "Benefits", ":  ", "Fee Waiver: Provides a 100% Tuition Fee Waiver which\ncovers the cost of tuition fees as a higher degree by research student\nof the University of Adelaide for up to 2 years for a Research Master\ndegree, and up to 3 years (with a possible 6 month extension) for a\nDoctor of Philosophy.", "Stipend: Provides a living allowance of AUD$27,596 (2019\nrate, indexed annually) per annum for up to 2 years for a Research\nMaster degree, and up to 3 years (with a possible 6 month extension)\nfor a Doctor of Philosophy. It is likely to be tax exempt, subject to\nTaxation Office approval.  ", "Allowances: Provides financial support for an Overseas\nStudent Health Cover (OSHC) Worldcare policy, plus relocation and\npublication expenses.", "Further details of terms and benefits can be found in the ", "Conditions of Award", ".\n", "Enquiries", ":", "\nAdelaide Graduate Centre Tel (08) 8313 5882 or email ", "[email protected]", "Applying:", "\nApplication for ‘Admission and a Scholarship’ must be submitted using the ", "Online Application Form", ".", "Closing dates:", "\nRound 1, 2020: Applications close 31 August 2019. ", "Applicants will be notified of the outcome of their scholarship application in early November 2019. ", "Recipients must commence their research program between 1 January 2020 and 30 June 2020. ", "Applicants are expected to commence studies as soon as possible in the approved semester. ", "It is not possible to defer the award.", "For More Information:", "Visit the Official Webpage of the University of Adelaide Scholarships International (ASI) 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-adelaide-scholarships-international-asi-2019-2020/"], [["NFP/MSP (MENA) Scholarship Programme 2020 for Study in the Netherlands (Fully Funded)", "date announced:August 7, 2019", "Application Deadline: November 2019"], ["Application Deadline: November 2019", "The MENA Scholarship Programme (MSP)", " offers scholarships to professionals for short courses in the Netherlands. ", "Aim", "The overall aim of the MSP is to contribute to the\ndemocratic transition in the participating countries. It also aims at\nbuilding capacity within organisations by enabling employees to take\npart in short courses in the Netherlands. ", "While the scholarship is awarded to individuals, all candidates\nmust be nominated by their employer to be able to participate. The need\nfor training has to be demonstrated in the context of the organisation\nthe applicant is employed by. ", "Target group", "The MSP is open to professionals who are nationals of – and living and working in – one of the countries listed below: ", "Algeria", "Egypt", "Iran", "Iraq", "Jordan   ", "Lebanon", "Libya", "Morocco", "Syria *", "Tunisia", " * MSP is not currently open to professionals applying from Syria. Applicants with the Syrian nationality may apply if they are residing and working in one of the other MSP countries listed.", "Requirements", "To be eligible for an MSP scholarship:", " ▪ one must be a professional and national of, and living and working in one of the countries on the MSP country list valid at the time of application;", " ▪ one must have a current employer’s statement that complies with the format Nuffic has provided. All information must be provided and all commitments that are included in the format must be endorsed in the statement;", " ▪ one must not be employed by an organisation that has its own means of staff development.", " Organisations that are considered to have their own means of staff", " development are for example:", " multinational corporations (e.g. Shell, Unilever, Microsoft);", "large national and/or a large commercial organisation;", "bilateral donor organisations (e.g. USAID, DFID, Danida, Sida, Dutch ministry of Foreign", " affairs, FinAid, AusAid, ADC, SwissAid);", "multilateral donor organisations, (e.g. a UN organisation, the World Bank, the IMF, Asian", " Development Bank, African Development Bank, IADB);", "international NGO’s (e.g. Oxfam, Plan, Care).", " ▪ one must have an official and valid passport (valid at least 3 months after the candidate", " submission date);", " ▪ one must have a government statement that meets the requirements of the country in which the employer is established (if applicable)", "the age of the MSP candidate must not exceed 45 years of age at the time of the grant submission.", " ▪ the candidate must not receive more than one MSP scholarship for courses that take place at the same time.", "How to apply", "Application for the MSP takes place via Dutch institutions. Each\ndeadline, these institutions provide a list of courses available for\nthat deadline. The short courses on offer fall within several fields of\nstudy, and have a duration of 2 to 12 weeks.", "Before you decide to apply, make sure to do these 2 things:", "Review the eligibility criteria carefully.", "Check whether your employer is willing to nominate you for the scholarship. ", "When you are certain you are eligible for an MSP scholarship, you can\nstart making the necessary preparations for your application. ", "Follow these steps to apply:", "1. Select a course on the MSP course list", "The application round is closed. Please visit this page regularly for updates on future application rounds.", "2. Contact the Dutch institution that is offering the course for information on:", "course content", "the application deadline (deadlines can differ per Dutch institution)", "the application and selection procedures", "the online application form and the supporting documents ", "3. Prepare your application and the supporting documents ", "4. Submit your online application via the Dutch institution offering the course", "\nWith your online application, you will be asked to upload a valid\npassport copy, a current statement from your employer, and depending on\nyour country of employment; a government statement. \n", "Selection procedure", "If your application meets all the course admission requirements and\nthe MSP eligibility criteria, you can be nominated by the Dutch\ninstitution for a scholarship. The Dutch institution will inform you\nabout the outcome of your selection. ", "The scholarships are awarded in a competitive selection to highly\nmotivated professionals who are in a position to introduce the\nnewly-acquired skills and knowledge into their employing organisation. ", "For any further questions concerning the MSP application and\nselection procedures, please contact the Dutch institution offering the\ncourse directly. You can find contact information for all institutions\non ", "studyfinder.nl", ".", "For More Information", "Visit the Official Webpage of the NFP/MSP (MENA) Scholarship Programme 2020"], "url : https://www.opportunitiesforafricans.com/nfp-msp-mena-scholarship-programme-2020/"], [["TORCH Global South Visiting Professorship 2020-2021 at the University of Oxford, UK", "date announced:July 31, 2019", "Application Deadline:12 noon on Monday, 14 October 2019. "], ["Application Deadline:", "12 noon on Monday, 14 October 2019. ", "The ", "TORCH ‘Global South’ Visiting Professorships", " ", " is a flagship scheme to support Visiting Professors from the Global South for a minimum of one term in the academic year in Oxford. All Souls College will host the visiting academic, and TORCH would provide the Faculty and additional logistical support. ", "TORCH\ncreated the ‘Global South Visiting Professorship’ scheme in 2015, with\nthe aim to support Visiting Professorships and Fellowships for academics\nfrom countries in the Global South (including, but not limited to,\nIndia, Pakistan, Brazil, Malaysia, Philippines, Mauritius, Nigeria,\nGhana, Kenya, Tanzania, and across Southern Africa and the Caribbean). ", "The\nTORCH Global South Visiting Fellowships are crucial in the work of\nproviding role models and embedding expectations on diversity and\ninclusivity in the wider University. The scheme builds on and reinforces\nexisting links between Oxford (including TORCH), Mellon, and\nUniversities in the countries named above.", "The\nscholars from the Global South are hosted in Oxford for a minimum of a\nterm to conduct their research, as well as contribute, where possible,\nto the teaching environment through open and public events, and\nparticipate in the academic life of the College and wider University.\nOxford researchers and students are then able to learn from them and\nbuild connections with the visiting Professors and their research areas.", "Eligibility     ", " ", "Proposed TORCH ‘Global South’ Visiting Professors should be holders of university or related posts in their Country, and active in Humanities research areas. ", "Visiting Professorships are not normally offered to candidates with doctorates awarded in the last seven years. This opportunity is not available to individuals holding posts in Oxford or who are already resident in or near Oxford. ", "Application Process ", "Applications are via the ", "IRAMS system", " and the ‘Case for Support’ form.", "\n ", "TORCH\nGlobal South Visiting Professors are put forward by an Oxford\nhumanities academic, and are selected from the gathered field by the\nTORCH Management Committee.", "\n ", "In\nthe application, the Oxford Humanities academic should outline why they\nhave selected the researcher and how their research and practice would\ncontribute to the students and researchers in Oxford, as well as how the\nresearch and student community can learn from the Global South\nProfessor, and develop longer term partnerships. ", "The\napplication should include the proposed Global South Professor’s CV,\nand research statement (‘Case for Support’ form – no more than 1000\nwords) on what they plan to do during their Visiting Professorship.", "For More Information:", "Visit the Official Webpage of the TORCH Global South Visiting Professorship 2020-2021"], "url : https://www.opportunitiesforafricans.com/torch-global-south-visiting-professorship-2020-2021/"], [["2020/2021 American University Emerging Global Leader Scholarship for International Students", "date announced:August 9, 2019", "Application Deadline: December 15th 2019"], ["Application Deadline: December 15th 2019", " The AU Emerging Global Leader Scholarship", " ", "promotes educational access and opportunity while enhancing international diversity. Bringing together the best of AU – academic excellence, leadership development, and global engagement – the AU Emerging Global Leader achieves, inspires, and serves with vision. The AU EGL is dedicated to positive civic and social change, and will return home to improve under-resourced, underserved communities in their home country. ", "The AU EGL scholarship covers all billable AU expenses (full tuition, room and board) for ", "one", "\ninternational student who will need a visa (preferably an F-1 or J-1\nstudent visa) to study in the United States. The scholarship does ", "not", "\ncover non-billable expenses such as mandatory health insurance, books,\nairline tickets and miscellaneous expenses (approximately U.S.$4,000 per\nyear).", "The AU EGL scholarship is renewable for a total of four years of undergraduate study, based on continued satisfactory academic performance.", "Important", ": Only ", "one", " AU Emerging\nGlobal Leader Scholarship is available for Fall 2020. If you are not\nselected as the 2020 AU EGL recipient and wish to continue the\napplication process, you may be eligible for partial merit scholarships.\nHowever, you will need to submit proof of additional funds beyond the\ninitial U.S.$4,000 you provided. Estimated costs for the\n2019-2020 academic year are U.S.$68,357.", "You are NOT eligible to apply if:", "You are a U.S. citizen, U.S. permanent resident, or dual citizen of the U.S. and another country.", "You are enrolled in or have already begun any post-secondary studies\nat another university in your home country or the United States.", "You graduated secondary school earlier than 2018.", "AU EGLS applicants must apply Regular Decision for fall (August) 2020. Do not apply Early Decision (ED).", "Preference will be given to:", "International students who have overcome various obstacles and\nchallenges as well as those from diverse and underrepresented global and\nsocioeconomic backgrounds.", "A minimum 3.8 GPA equivalent out of 4.0 GPA (or in the top 10% of graduating class) for 9th-12th grades.", "A demonstrated commitment to leadership, volunteerism, community\nservice and to advancing the needs of people in their home country.", "Students with", " one", " of the following:\n", "95+ TOEFL iBT (all subscores must be 20 or above)", "7.0+ IELTS (all subscores must be 6.0 or above)", "600+ paper-based TOEFL (taken on or prior to May 31, 2017)", "Sub-scores of 24+ on the paper-based TOEFL (Taken after May 31, 2017)", "Students who are still enrolled in secondary/high school and graduating by June 2020.", "Important: Students in the IB system should plan to graduate with a\nfull IB diploma with at least 3 HL subjects. Students studying in the\nBritish A-Levels system must complete at least 3 A levels and finish 13\nyears of study before August 2020.", "The AU EGLS selection process is most competitive. Priority\nconsideration will be given to those AU EGLS applicants who apply and\ncomplete the AU EGLS application, Common or Coalition Application, and\ninternational admissions process by December 15, 2019.", "Instructions", "Complete the ", "online AU EGLS application ", "and Questions 1-4. The application will be available after September 1, 2019.", "Submit a bank letter and the AU Certification of Finances (AU CFIS)\nform – each demonstrating a minimum of U.S.$4,000. These can be uploaded\nvia your ", "Future Eagle Portal ", "or sent by fax to +1-202-885-1025. ", "Examples of bank letters and the AU CFIS form template", "Submit your official TOEFL or IELTS score results if available. These can be scanned and emailed to ", "[email protected]", ". International Admissions will call ETS or IELTS to verify scores on your behalf.", "Complete and submit the Common Application or Coalition Application, together with all ", "supporting documents", "\nper checklist by AU EGLS priority deadline of December 15, 2019, or by\nJanuary 15, 2020 at the latest. Please note that students who do not\nsubmit a complete application packet with all supporting documents by\nthe deadline will not be reviewed.", "If you are applying through a program supported by ", "EducationUSA", "\nsuch as USAP, CCC, Opportunity Grants, Diana Kamal Scholarship Search,\nor similar, or if you are a past FLEX or YES high school scholarship\nrecipient from the U.S. Department of State, please provide a letter\nfrom your EducationUSA center’s adviser confirming your candidacy. You\nmay request for the letter to be sent to ", "[email protected]", " as a PDF.", "If you are not selected as one of the finalists, you may still be\nconsidered for admission to American University, Washington, DC and\neligible for partial merit scholarships. However, to continue the\napplication process, you will need to submit proof of funds totaling\nU.S.$68,357 (estimated costs for first year of study).", "Skype interviews and additional essay submissions will be required\nfor AU EGL semi-finalists and finalists. If you have any questions,\nplease contact ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the 2019/2020 AU Emerging Global Leader Scholarship"], "url : https://www.opportunitiesforafricans.com/2019-2020-american-university-emerging-global-leader-scholarship/"], [["Africa Initiative for Governance (AIG) Scholarships 2020/2021 for Study in the University of Oxford, UK (Fully Funded)", "date announced:July 31, 2019", "Application Deadline: September 23, 2019 "], ["Application Deadline: ", "September 23, 2019", " ", " Every year, ", "Africa Initiative for Governance (AIG)", " will fund five scholarships for outstanding individuals from West Africa to pursue the ", "Master of Public Policy degree at the Blavatnik School of Government, University of Oxford. ", "AIG Scholars will be expected, upon graduation, to return to their home country and apply their learning experience as change agents in their country’s public sector. ", "The AIG Scholarships are targeted at graduates between the ages of 25\nand 35 with strong intellectual capability, outstanding academic\nachievements, leadership skills and a passion to contribute to the\ndevelopment of Africa’s public sector.", "Eligibility Criteria: ", "To be eligible for consideration for the award of an AIG Scholarship, you must:", "Be a citizen of ", "Nigeria", " or ", "Ghana", "Be between the ages of 25 and 35 years (must not be 36 years old by December 31, 2019)", "Have a first-class or second-class upper undergraduate degree with honours (or equivalent international qualifications), as a minimum, in any discipline. For applicants with a degree from the USA, the minimum GPA sought is 3.7 out of 4.0", "Be preferably top 10% of graduating class (First, Second or Master’s Degree) – evidence to be provided", "Provide evidence of game-changing leadership and resultant impact", "Show skills and interests outside of academics (evidence to be provided)", "Benefits:", "\nThe AIG Scholarships are ", "fully funded", " covering fees, accommodation and living expenses, does not cover travel or visa expenses however.\n", "Please note that:", "Academic distinction and leadership potential are key priorities for selection. ", "In the case of candidates with second-class upper qualifications, a\nMaster’s, second degree or relevant professional qualification will be\nan advantage.", "Only applicants shortlisted for the next stage of the selection\nprocess will be contacted and any inquiries regarding individual\napplication status are strictly prohibited.", "Applications sent via post or in person are NOT acceptable.", "Candidates who emerge as finalists in the Africa Initiative for\nGovernance (AIG) selection process will be expected to apply directly to\nthe Blavatnik School of Government, University of Oxford, for\nadmissions. Finalists who are offered admission to the Master of Public\nPolicy will be considered by the School in the final selection of AIG\nScholars.", "For More Information:", "Visit the Official Webpage of the Africa Initiative for Governance (AIG) Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/africa-initiative-for-governance-scholarships-2020-2021/"], [["Joel Joffe LLB Scholarships 2020 for study at the University of the Western Cape and The University of Fort Hare.", "date announced:August 5, 2019", "Application Deadline: Sunday 15 September 2019. "], ["Application Deadline: ", "Sunday 15 September 2019.", " ", "Joel Joffe LLB Scholarships for study at the University of the Western Cape and The University of Fort Hare in 2020", "Joel Joffe LLB Scholarships", " invite applications from current 3rd year students (going into their 4th year in 2020) studying for an LLB at the University of the Western Cape or the University of Fort Hare.", "These scholarships are offered in memory of Joel Joffe, who was Nelson Mandela’s lawyer in the 1963/4 Rivonia Trial. He played a crucial role in the struggle for democracy in South Africa. The Trust continues to build on his legacy, inspiring others to do as much as possible to realise human rights and reduce poverty.", "Eligibility:", "Applicants must be:", "a national of, and normally resident in, South Africa", "in possession of a strong academic record and extra-curricular involvement", "a current undergraduate 3rd year student of Law at the University of the Western Cape or the University of Fort Hare", "Please apply only if you are eligible and meet ALL of the above criteria.", "Benefits:", "The Joel Joffe scholarship includes:", "R40,000 towards the last year of your LLB study", "a paid internship at Equal Education Law Centre or Legal Resources Centre after the completion of LLB study", "an opportunity to enhance your academic and leadership skills through organised events", "In\n2020, the value of the scholarship package is R40,000. Funding will be\nprovided for up to a maximum of two years. We support both full and\npart-time study and will consider applications from those who wish to\nstudy by distance learning.", "We also organise an ", "annual conference", " for\ncurrent scholars, and hold several smaller events throughout the year.\nScholarship holders are expected to participate in these activities and\nto become part of and contribute to our network.", "How to apply", "We are now accepting applications. Please download and read the ", "guidelines", " carefully before applying.", "You can apply by sending your completed application form to ", "[email protected]", ". Please download and save the copy of the applications form on to your computer before you fill it in.", "Application form for LLB students studying at the University of the Western Cape", "Application form for LLB students studying at the University of Fort Hare", "The deadline for applying is ", "Sunday 15 September 2019.", "For More Information", "Visit the Official Webpage of the Joel Joffe LLB Scholarships 2020 "], "url : https://www.opportunitiesforafricans.com/joel-joffe-llb-scholarships-2020/"], [["Nuffic Scholarships 2020 for Short Training Courses at the Hague Academy in the Netherlands (Fully Funded)", "date announced:August 2, 2019", "Application Deadline: 14th March 2020"], ["Application Deadline: ", "14", "th", " March 2020", "Nuffic scholarships", " ", "are available for short courses at The Hague Academy. Nuffic is a Dutch non-profit organisation which offers scholarships for training courses in The Netherlands. These scholarships seek to develop and strengthen the skills and abilities of professionals, in order to enable their organisations and communities to succeed in an ever-changing world. The Dutch Ministry of Foreign Affairs funds the Nuffic Scholarship programme.", "The Nuffic Scholarships for short courses at The Hague Academy (OKP, MSP and StuNed) cover the tuition fee, return flights (from an international airport to Amsterdam), insurance, and accommodation, in addition to a small Daily Subsistence Allowance. Follow the links below to find out more about the scholarship programmes available, the application deadlines and the application procedures.", "Available Courses:", "Deadline 8", "th", " October 2019 ", "(Registration opens 1st August 2019) ", "Migration and Local Authorities", " (24 February – 6 March 2020)", "Inclusive Service Delivery and the SDGs", " (9 -20 March 2020)", "Citizen Participation and Inclusive Governance", " (23 March – 3 April 2020)", "Climate Adaptation and Local Resilience", " (1 – 12 June 2020)", "Integrity and Anti-Corruption", " (15 – 26 June 2020)", "Deadline 7", "th", " March 2020", " (Registration opens 15", "th", " October 2019)", "Multilevel Water Governance", " (7 – 18 September 2020)", "Local Economic Development", " (21 September – 2 October 2020)", "Conflict, Rule of Law and Local Security", " (26 October – 6 November 2020)", "Gender Responsive Governance", " (16 – 27 November 2020)", "Deadline 4", "th", " July 2020 ", "(Registration opens 14", "th", " March 2020)", "Fiscal Decentralisation and Local Finance 2021 (Feb 2021)", "For More Information:", "Visit the Official Webpage of the Nuffic SCholarships 2020 "], "url : https://www.opportunitiesforafricans.com/nuffic-scholarships-2020-for-training-courses-at-the-hague-academy/"], [["Accenture’s 2020 Scholarships for young South Africans", "date announced:August 6, 2019", "Application Deadline: 15 August 2019. "], ["Application Deadline: 15 August 2019. ", "Accenture, through its independent Education Trust, helps economically disadvantaged students with strong academic backgrounds to further their studies at ", "tertiary institutions", " in South Africa. ", "If you are you a high achiever in your second, third, fourth or Honours year of study, we want to hear from you. ", "Successful\ncandidates will receive a full scholarship. The bursary programme covers\nthe following expenses: registration fees, tuition fees, examination\nfees, meals, residence, book allowance for prescribed books and a\nlaptop. In addition, the scholarship is backed up by ongoing mentorship.\n", "Applications will be considered from students who wish to major in one of the following disciplines at one of the universities listed below. ", "DEGREE COURSES AND UNIVERSITIES", "Degree courses", " BSc in Computer Science", "BCom or BSc in Informatics or Information Systems ", " BCom or BSc (Eng) in Information Technology + BIT ", "BEng or BSc (Eng) in Computer ", "BEng or BSc (Eng) in Electrical (Light Current)\t", "BEng or BSc (Eng) in Electronic ", "BEng or BSc (Eng) in Information ", "BEng or BSc (Eng) in Industrial", "Universities", "University of Cape Town", "University of Johannesburg", "University of Pretoria ", "Rhodes University", "University of the Western Cape ", "University of the Witwatersrand", "\nmore information on the Accenture South Africa Education Scholarship, please email ", "[email protected]", " and ", "[email protected]", ".", "Contact number : 0126222441\n", "For More Information", "Visit the Official Webpage of the Accenture’s 2020 Scholarships"], "url : https://www.opportunitiesforafricans.com/accentures-2020-scholarships-for-young-south-african/"], [["Holland Scholarships 2020/2021 for Bachelor’s or Masters Study in the Netherlands (5,000 Euros)", "date announced:August 2, 2019", "Application Deadline: 1st May 2020. "], ["Application Deadline: 1st May 2020. ", " ", "The Holland Scholarship", " ", "is meant for international students from outside the European Economic Area (EEA) who want to do their bachelor’s or master’s in the Netherlands. Are you ready for the chance of a lifetime? Apply for the ", "Holland Scholarship! ", " This scholarship is financed by the ", "Dutch Ministry of Education, ", "Culture and Science as well as several Dutch research universities and universities of applied sciences.", "Scholarship", "The scholarship amounts to € 5,000. You will receive this in the\nfirst year of your studies. Please note that this is not a full-tuition\nscholarship.", "Grant award period", "The grant is awarded for one year and can only be received once.", "Application criteria", "Your nationality is non-EEA.", "You are applying for a full-time bachelor’s or master’s programme at\none of the participating Dutch higher education institutions. ", "You meet the specific requirements of the institution of your choice. You can find these on the website of the institution.", "You do not have a degree from an education institution in the Netherlands.", "How to apply", "Find your programme in the overview of ", "participating research universities", " or in the overview of ", "participating universities of applied sciences", ". You will find detailed information about the application procedure and deadlines in the links provided in both lists. ", "The university will contact you to let you know if you have been awarded a scholarship.", "Deadlines", "You can now apply for the 2020-2021 academic year. The deadline for\napplication is either 1 February 2020 or 1 May 2020. Please check the\nwebsite of the institution of your choice to confirm the correct\ndeadline.", "For More Information:", "Visit the Official Webpage of the Holland Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/holland-scholarships-2020-2021/"], [["2019/2020 Slovak Republic Government Scholarships for Foreign Students to study in Slovakia (Funded)", "date announced:August 9, 2019", "Application Deadline: October 31st 2019"], ["Application Deadline: October 31st 2019", "The Government of the Slovak Republic", " approved the establishment of the National Scholarship Programme of the Slovak Republic for the support of mobility of students, PhD students, university teachers, researchers and artists in 2005. The National Scholarship Programme of the Slovak Republic (NSP) is funded by the Ministry of Education, Science, Research and Sport of the Slovak Republic.", "The National Scholarship Programme of the Slovak Republic supports mobility of international students, PhD students, university teachers, researchers and artists for scholarship stays at ", "higher education institutions", " and ", "research organisations", " in Slovakia.", "Eligible applicants", "Eligible applicants for a scholarship in the framework of the NSP:", "A) ", "students", " who:", "are university students at universities outside Slovakia;", "are students of the second level of higher education (master’s\nstudents), or are students who at the time of application deadline have\nalready completed at least 2.5 years of their university studies in the\nsame study programme;", "will be on a study stay in Slovakia during their higher education\noutside Slovakia and who will be accepted by a public, private or state\nuniversity in Slovakia for an academic mobility", "1", " to study in Slovakia.", "All 3 conditions must be met. This category does not apply to doctoral (PhD) studies (or their equivalent).", "Duration of a scholarship stay (students): 1 – 2 semesters (i.e. 4 –\n5 or 9 – 10 months) or 1 – 3 trimesters, in case the academic year is\ndivided into trimesters (i.e. 3 – 4 or 6 – 7 or 9 – 10 months).", "B) ", "PhD students", " whose\nhigher education or scientific training takes place outside Slovakia and\nwho are accepted by a public, private or state university or a research\ninstitution in Slovakia eligible to carry out a doctoral study\nprogramme", "2", " (e.g. the Slovak Academy of Sciences) for an academic mobility", "1", " to study/conduct research in Slovakia.", "Duration of a scholarship stay (PhD students): 1 – 10 months.", "C) international ", "university teachers, researchers and artists", "\nwho are invited to a teaching/research/artistic stay in Slovakia by an\ninstitution with a valid certificate of eligibility to carry out\nresearch and development, which is not a business company", "3", " and it has its headquarters in Slovakia.", "Duration of a scholarship stay (university teachers, researchers or artists): 1 – 10 months.", "[1] Section 58a of the Act No. 131/2002 on higher education institutions, as amended.", "[2] External education institution according to the Act No. 131/2002 on higher education institutions, as amended.", "[3] Legal entity according to the\nsection 7 letters a) – c) of the Act No. 172/2005 on organisation of\nstate research and development funding, as amended, which has a valid\ncertificate of eligibility to carry out research and development\naccording to the section 26a article 11 or article 12 of the same Act –\ni.e. public, private or state universities, research institutions\neligible to carry out a doctoral (PhD) study programme (i.e. external\neducation institutions), Slovak Academy of Sciences and its institutes,\ndepartmental research institutes or non-governmental organisations\ncarrying out research and development.", "Citizens of any country in the world (except the citizens of Slovakia) can apply for a scholarship stay in Slovakia in the framework of the NSP.", "Amount of the monthly scholarship", "\na) university student\n", "350 €", "\nb) PhD student\n", "580 €", "\nc)  university teacher/researcher/artist:\n", "\n \n", "\nwithout PhD degree (or its equivalent) and less than 4 years of work experience as a university teacher/researcher/artist\n", "580 €", "\nwith PhD degree (or its equivalent) and less than 10 years of work experience as a university teacher/researcher/artist\n", "850 €", "\nwith PhD degree (or its equivalent) and more than 10 years of work experience as a university teacher/researcher/artist\n", "1,000 €", "Note:", "To determine the monthly scholarship amount (in case of university teachers, researchers and artists) with regard to their work experience, only work experience until the day of the application deadline is taken into consideration.", "PhD studies are considered as work experience (max. 6 years of PhD studies can be considered as work experience).", "Application deadlines", "30 April till16:00 CET", " – scholarship stays during the next academic year", "31 October till16:00 CET", " – scholarship stays during the summer semester of the current academic year", " ", "Note: International applicants who need visa in order to enter the territory of the Slovak Republic are recommended to take into consideration time necessary for visa application procedure when determining the date of the beginning of their potential scholarship stay (up-to-date information about visa application procedure is provided by the Embassies of the Slovak Republic abroad).", " Application procedure", "Scholarship ", "applications are submitted", " ", "online", " at ", "www.scholarships.sk", ". ", "Online application system is opened at least 6 weeks prior to the application deadline.", " Applications can be filled in only in case that the online application system has already been opened.", "Note: Applicants\nare recommended not to submit their applications at the last moment.\nNumber of operations executed within the last minutes prior to the\napplication deadline may have an influence on the reaction time of the\napplication system. Please, keep that in mind, in order not to miss the\napplication deadline.", "Applicants must fill in their online applications and upload all the\nrequired attachments in required format to their online application.", "Students", " (eligible applicants under the category A) are allowed to submit (fill in) applications and the required attachments ", "in Slovak or English language only", "\n(documents written in other languages must be officially translated\ninto Slovak or English language – translation can be certified by the\nsame institution that issued the respective document).", "Other applicants", " (eligible applicants under the categories B) and C) are allowed to submit (fill in) applications in the following languages:", "Slovak language", " – in this case, ", "all attached documents", " must be in ", "Slovak or English language only", ";", "English language", " – in this case, ", "all attached documents", " must be in ", "Slovak or English language only", ";", "Russian language", " – in this case, ", "all attached documents", " must be in ", "Slovak, English or Russian language only", ".", "For More Information:", "Visit the Official Webpage of the 2019/2020 Slovak Republic Government Scholarships"], "url : https://www.opportunitiesforafricans.com/2019-2020-slovak-republic-government-scholarships-for-foreign-students-to-study-in-slovakia/"], [["University of Ghana-Tullow Scholarship Scheme 2019/2020 for Undergraduate & Graduate Study in Ghana", "date announced:July 27, 2019", "Application Deadline: September 4th 2019"], ["Application Deadline: September 4th 2019", "The University of Ghana Students Financial Aid Office (UG-SFAO)", " is accepting applications for the award of the ", "2019/2020 UG-Tullow Tertiary Scholarship Scheme", " ", "for both undergraduate and graduate students in relevant academic fields who are exceptionally brilliant but with dire financial needs.", "The UG-Tullow award is a full scholarship which covers tuition, stipend/subsistence/health insurance, modest subsidy for equipment (Laptop computer) and accommodation for students pursuing ", "4", " years undergraduate programmes and ", "1", " year master’s programmes (but in exceptional circumstances may also include ", "2", " years M.Phil programmes). The award recipients are expected to maintain excellent academic standards of at least a ", "B", " average or ", "3.0", " CGPA in order to be in good standing to keep the Scholarship.", "Download:", "Application Form", "For More Information:", "Visit the Official Webpage of the University of Ghana-Tullow Scholarship Scheme 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-ghana-tullow-scholarship-scheme-2019-2020-for-undergraduate-graduate-study-in-ghana/"], [["Chevening UK Government Scholarships Programme 2020/2021 for Study in the United Kingdom (Fully Funded)", "date announced:August 5, 2019", "Application Deadline: 12:00 GMT on 5 November 2019"], ["Application Deadline: 12:00 GMT on 5 November 2019", " Chevening Scholarships", " enable outstanding emerging leaders from all over the world to pursue one-year master’s degrees in the UK. Whilst there is no ‘typical’ Chevening Scholar, we are looking for the kind of people who have the passion, ideas, and influence to provide the solutions and leadership needed to create a better future. ", "\nSince 1983, Chevening has brought over 50,000 exceptional professionals\nfrom around the world to study in the UK through scholarships and\nfellowships funded by the UK government. This unique opportunity has\nhelped to elevate careers, transform communities, shift and deepen\nperspectives, and build intercontinental bridges.\n", "Eligibility Requirements", "To be eligible for a Chevening Scholarship you must:", "Be a citizen of a Chevening-eligible country or territory.", "Return to your country of citizenship for a minimum of two years after your award has ended.", "Have completed all components of an undergraduate degree that will enable you to gain entry onto a postgraduate programme at a UK university by the time you submit your application. This is typically equivalent to an upper second-class 2:1 honours degree in the UK.", "Have at least two years of work experience.", "Apply to three different eligible ", "UK university courses", " and have received an unconditional offer from one of these choices by 16 July 2020.", "Meet the Chevening ", "English language requirement", " by 16 July 2020.", "You must ensure that you meet the minimum work-experience requirement\nfor the scholarship before submitting your Chevening application.\nChevening Scholarships require that applicants have at least two years\nof work experience.", "If you do not already have the required level of work experience, you will be unable to submit your application.", "Eligible types of work experience", "The types of work experience that are eligible for Chevening can include:", "Full-time employment", "Part-time employment", "Voluntary work", "Paid or unpaid internships", "Work experience can be completed before, during, or after graduating from your undergraduate studies, however, any mandatory employment that counted towards your undergraduate or postgraduate course would not be eligible.", "Value of scholarship", "a) A full Chevening Scholarship normally comprises:", "Payment of tuition fees (see point 1.2.a in relation to MBA fee caps).", "Economy travel to and from your country of residence by an approved route for you only.", "An arrival allowance.", "The cost of an entry clearance (visa) application for you only.", "A departure allowance.", "A contribution of up to £75 for TB testing, where this is required.", "A travel top-up allowance.", "A monthly personal living allowance (stipend) to cover accommodation and living expenses. The monthly stipend will depend on whether you are studying inside or outside of London. These rates are subject to annual review. Stipend payments will be made to you on or around the 21st of the month for the following full month. Where you arrive in the UK or leave the UK partway through the month, the stipend for that month will be adjusted as appropriate.", "Timeline:", "5 August 2019 Applications open at 12:00 BST ", "Read our application ", "guidance", ", and then apply via your country/territory’s page at ", "www.chevening.org/apply", "\n5 November 2019\nApplications close at 12:00 GMT ", "The deadline will close at 12:00 GMT on 5 November. Please do not leave it to the last minute to submit your application, as late submissions can not be accepted. ", " 6 November 2019 Applications are sifted against eligibility criteria. ", "Read about Chevening’s ", "eligibility criteria", ".  Mid-November to December 2019 Reading committee assessments ", "Independent reading committees assess all eligible applications. Their scores and rankings are then passed back to the British embassy/high commission. ", " Early to mid-February 2020 Applicants shortlisted for interviews ", "Once the embassy/high\ncommission has reviewed the applications that were passed on to them,\nthey produce a shortlist of those who they will invite to interview.\nCongratulations if you make it this far. To prepare for your interview,\nplease read our ", "interview guidance", ".\n25 February 2020\nReferences and education documents deadline ", "The deadline to submit two references and education documents is 12:00 GMT (noon). Read about what we require from ", "your references", ".\n2 March to 1 May 2020\nInterviews take place ", "Candidates from all over the world are interviewed by panels at British embassies and high commissions. ", "From early June 2020 Results ", "After months of preparation and trepidation, the strongest candidates will experience jubilation when interview results are announced. ", " 16 July 2020 Offer deadline ", "The deadline to meet Chevening’s English language requirement and receive at least one unconditional UK university offer is 17:00 BST. Read about Chevening’s ", "English language requirement", ". ", "  September/October 2020 Studies begin in the UK ", "2020/2021 Chevening Scholars\ncommence their studies in the UK, and enter into an international\nnetwork that they’ll be a part of for the rest of ", "For More Information", "Visit the Official Webpage of the Chevening UK Government Scholarships Programme 2020/2021 "], "url : https://www.opportunitiesforafricans.com/chevening-uk-government-scholarships-programme-2020-2021/"], [["Lester B. Pearson International Scholarship Program 2020/2021 for study at the University of Toronto, Canada (Fully Funded)", "date announced:August 9, 2019", "Application Deadline: January 15th 2020"], ["Application Deadline: January 15th 2020", "The Lester B. Pearson International Scholarship Program at the University of Toronto", " is intended to recognize international students who demonstrate exceptional academic achievement and creativity and who are recognized as leaders within their school. A special emphasis is placed on the impact the student has had on the life of their school and community, and their future potential to contribute positively to the global community.   ", "Awarded annually, these scholarships recognize outstanding students from around the world, including international students studying at Canadian high schools. This is U of T’s most prestigious and competitive scholarship for international students.  Each year approximately 37 students will be named Lester B. Pearson Scholars.", "Eligibility:", " ", "The Lester B. Pearson International Scholarship Program at the University of Toronto ", "is intended to recognize international students who demonstrate exceptional academic achievement and creativity and who are recognized as leaders within their school. A special emphasis is placed on the impact the student has had on the life of their school and community, and their future potential to contribute positively to the global community.   ", "Awarded annually, these scholarships recognize outstanding students from around the world, including international students studying at Canadian high schools. This is U of T’s most prestigious and competitive scholarship for international students.  ", "Each year approximately 37 students will be named Lester B. Pearson Scholars. An international student nominated by their school will be invited to submit an application to the Lester B. Pearson International Scholarship program. ", "Eligibility Criteria: ", "an international student (i.e. a non-Canadian requiring a study permit)", "an original and creative thinker committed to school and community", "a high achiever in academic and creative pursuits", "enthusiastic about learning and intellectual exploration", "have demonstrated strong leadership skills", "currently in their final year of secondary school or have graduated no earlier than June 2019", "intending to begin university in the upcoming academic year (students already attending post-secondary studies cannot be considered; students starting their studies in January 2020 at another post-secondary institution cannot be considered)", "Award Type:", "\nScholarship – On Admission ", "Action:", "\nNomination Required ", "Availability:", "\nInternational Students ", "Level of Study:", "\nUndergraduate ", "Value/Amount:", " The Lester B. Pearson\nInternational Scholarships will cover tuition, books, incidental fees,\nand full residence support for four years. The scholarship is tenable\nonly at the University of Toronto.", "Best Link:", " ", "http://pearson.utoronto.ca", "Academic Year:", " 2020-2021", "How to Apply:", " To apply, you’ll need to:\n", "Receive a nomination from your school.  (High schools not already\ncontacted/verified are asked to submit an application to participate in\nour program which can be accessed within the main Lester B. Pearson\nInternational Scholarship webpage starting ", "here", ".", "Apply to study at the University of Toronto to begin your studies\nin 2020 and complete your application for admission by the appropriate\ndeadlines.", "Once we’ve received a nomination and you’ve applied to the\nuniversity, you can complete the online Lester B. Pearson Scholarship\napplication.", "\nSelection Procedure: On the basis of application/eligibility criteria,\napproximately 37 Lester B. Pearson Scholars at the University of Toronto\nwill be chosen annually. These scholarships are tenable only at the\nUniversity of Toronto.\n", "For More Information:", "Visit the Official Webpage of the Lester B. Pearson International Scholarship Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/lester-b-pearson-international-scholarship-program-2020-2021-for-study-at-the-university-of-toronto/"], [["Sasol Limitless Internship Programme 2019/2020 for South African women footballers", "date announced:August 5, 2019", "Application Deadline: August 13th 2019"], ["Application Deadline: August 13th 2019", "Sasol and SAFA have officially launched the ", "2019/20 edition of the Limitless Internship Programme", ". This programme gives women footballers the opportunity to acquire skills in their field of study, beyond football and gain valuable work experience at Sasol, SAFA and sports marketing agency Levergy. The internship is open to both Banyana Banyana and Sasol League players where candidates with degrees or diplomas in Media, Marketing, Communications and/or sports related courses are encouraged to apply.", "The Limitless Internship", " forms part of Sasol and SAFA’s Limitless initiative aimed at garnering more support for, and inspiring participation in women’s football. Since its inception in 2018, the one-year internship programme has seen Banyana Banyana players Jermaine Seoposenwe and Bontle Mashilo work at all three organisations, learning from experts in the sports marketing field. Now employed at Levergy, Bontle Mashilo will be pursuing a career in Public Relations.", " Applications for the internship will be open from 30 July 2019 to 13 August 2019. The top candidates will then go through an interview process where two candidates will be selected. The internship will run for a year, starting in September 2019, and will see the interns rotate, gaining work experience at the three organisations. ", "Sasol encourage all Banyana Banyana and Sasol League players with relevant degrees or diplomas to apply. This is a great and rare opportunity for them to gain experience in three different organisations. We wish the best of luck to all the applicants.” ", "For More Information", "Visit the Official Webpage of the Sasol Limitless Internship Programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/sasol-limitless-internship-programme-2019-2020/"], [["University of Groningen Eric Bleumink Fund Scholarships 2019/2020 for study in the Netherlands (Funded)", "date announced:August 9, 2019", "Application Deadline: December 1st 2019"], ["Application Deadline: ", "December 1st 2019", "The Eric Bleumink Fund", " awards scholarships to talented students from developing countries. Such scholarships enable them to further develop as individuals and to make important contributions to the development of their own countries.", "Since 2000, the year the fund was started, the EBF handed out more than sixty scholarships. This means more than sixty young, ambitious and very talented people were able to follow an additional study at the University of Groningen. Here they were introduced to an academic culture, libraries and  international contacts they are often lacking in their homeland.", "Countries of origin:", "Afghanistan,\nAngola, Bangladesh, Benin, Bhutan, Burkina Faso, Burundi, Cambodia,\nChad, Comoros, Djibouti, Equatorial Guinea, Eritrea, Ethiopia, Gambia,\nGuinea, Guinea-Bissau, Haiti, Kiribati, Laos, Lesotho, Liberia,\nMadagascar, Malawi, Mali, Mauritania, Mozambique, Myanmar, Nepal, Niger,\nRwanda, Sao Tome and Principe, Senegal, Sierra Leone, Solomon Islands,\nSomalia, Tanzania, Togo, Tuvalu, Uganda, Vanuatu, Yemen, Timor-Leste,\nSudan (Rep.), Congo (Dem Rep.), South Sudan, Central African Republic,\nZambia, Armenia, Bolivia, Cape Verde, Congo (Rep.), Congo, El Salvador,\nGhana, Honduras, India, Indonesia, Kosovo, Korea, Dem. Rep., Kyrgyzstan,\nMoldova, Mongolia, Morocco, Nigeria, Vietnam, Uzbekistan, Ukraine", "Requirements:", "\nCandidates for the Eric Bleumink Fund should:\n", "\nHave obtained conditional admission to the program of choice (see: ", "\nwww.rug.nl/masters/alphabetical ", "\n)\n", "Have excellent academic performance, preferably to be confirmed by letters of recommendation\n", "\nHave excellent grades during their bachelor/undergraduate studies;\n", "\nHave excellent English language proficiency, in accordance with the admission requirements of the program of choice\n", "\nBe available for the whole period of the programme and be able to take part in the entire programme\n", "\nBe in good health, so that health insurance in the Hold the nationality of a country appearing in Appendix 1.\n", "\nHave no other means of financing the study in question\n", "The grant is awarded for a 1 year or 2 years Master’s degree programme.", "The grant covers tuition fee, costs of international travel, subsistence, books, and health insurance.  Please note that a considerable number of students apply for this scholarship each year, whereas the University can issue only a limited number of grants.", "Application Procedure:", "\nThe University of Groningen ", "Admission Office", ",\nin consultation with the Admission Boards of its faculties, will\ndetermine which applicants will be nominated for an Eric Bleumink Fund\nscholarship.\n", "\nOnly applicants that have received a (conditional)\nadmission offer for a master programme before February can thus be\nconsidered. In order to allow for enough time to process the application\nto a master programme by the Admission Office, such a master\napplication should be completed by the applicant ", "before 1", "st", " of December", ".\n", "For More Information:", "Visit the Official Webpage of the University of Groningen Eric Bleumink Fund Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-groningen-eric-bleumink-fund-scholarships-2019-2020/"], [["Kader Asmal Fellowship Programme Scholarships 2020/2021 for Postgraduate Study in Ireland (Fully Funded)", "date announced:August 5, 2019", "Application Deadline: September 11th 2019"], ["Application Deadline: September 11th 2019", "The Embassy of Ireland in South Africa in partnership with", " Canon Collins Trust ", "invites applications for ", "scholarships for postgraduate study in Ireland", " commencing in September 2020.", "In 2020 fellwoships will be offered for postgraduate study in:", "Agriculture, Environmental Science, Conservation, Rural Development ", "Food Science, Food Engineering and related", "Pharmacy and Biotechnology", "Health, Medicine and Health Economics", "Development Studies, Peace Studies, Conflict Resolution and Humanitarian Action", "Social Policy, Social Research, Community Development and Sociology", "Law, Human Rights, Women’s Studies, Gender Studies, Equality Studies", "Engineering, Hydrology, Sustainable Technology", "Economics, Finance, Accounting, Management and Business", "Information Systems and Communkications Technology", "Tourism", "Eligibility Requirements:", "Applicants must:", "be a resident national of South Africa", "Have a minimum of two years relevant work experience (this can include internships and volunteering)", "Hold\nan honours’ level academic quealification with a minimum grade point\naverage of 75% (First class honour, or second class honour, Grade ", "be seeking funding for a full-time postgraduate programme in one of the above listed subject areas", "be able to take up fellowship in the academic year 2020/2021", "Must not have applied for ", "Kader Asmal Fellowship Programme ", "on more than one previous occasion.", "Please note applicants already in possession of a Master’s degree are not eligible", "Benefits:", "The Kader Asmal Fellowships will cover:", "university application fees", "tuition fees", "examination and other fees", "economy travel to and from your country of residence to Ireland;", "settling in allowance, book allowance and study allowance", "accommodation", "a monthly personal living allowance (stipend) to cover other living expense for you only and", "the costs of an entry clearance (student visitor visa) application", "How to apply", "You can access the online application form through the link below.", "Apply Now", " for the Kader Asmal Fellowship for Postgraduate Study in Ireland. Deadline for applying is Wednesday 11 September 2019.", "For More Information", "Visit the Official Webpage of the Kader Asmal Fellowship Programme Scholarships 2020/2021 "], "url : https://www.opportunitiesforafricans.com/kader-asmal-fellowship-programme-scholarships-2020-2021/"], [["MTN Foundation/Muson Music Scholarship Program 2019 for aspiring Musicians", "date announced:August 7, 2019", "The MUSON School of Music is staffed and equipped to meet internationally accepted standards in Music education. There will be examinations, auditions and interview. A written examination which will include theory questions at approximately grade 5 & 6 standard and an examination basic music knowledge."], ["The MUSON School of Music", " is staffed and equipped to meet internationally accepted standards in Music education.", " ", "There will be examinations, auditions and interview.", " A written examination which will include theory questions at approximately grade 5 & 6 standard and an examination basic music knowledge.", "A practical examination which will be a performance on a major\ninstrument or voice of at least grade 5 standard, before a faculty jury,\nfollowed by an interview", "Admission Requirements:", "Applicants for the MTNF/MUSON diploma course in Music are expected to possess the following minimum requirements:", "The General Certificate of Education (G.C.E) Ordinary Level with credits in five (5) subjects including English Language, or", "The Senior Secondary School Certificate (SSCE) with a credit in English Language", "The 5 credits must have been obtained at not more than two sittings and before admission to the diploma course.", "Other Requirements:", "PRACTICAL:", " Grade five (5) or higher pass certificate of\nThe MUSON School of Music or any other music examining body recognized\nby the MUSON School.", "THEORY:", " Grade five (5) or higher pass certificate of\nthe MUSON School of Music or any other music examining body recognized\nby the MUSON School.", "NB: Applicants who possess the above practical or theory certificates\nwould have also satisfied the GCE (O/L) or SSCE requirements.", "Applicants who are deficient in the theory requirements but show\noutstanding practical ability may be admitted. These students must take a\nremedial theory course and must pass the minimum requirements in the\nfirst year", "Method of Application", "Interested applicants who are deficient in the theory requirements\nare advised to take advantage of lessons available in the basic school\nto enable them prepare for the admission examination in August.", "\nLetters of application together with copies of certificates, two (2)\nrecent (within the last 6 months) passport photographs, and contact\ntelephone number(s) or e-mail address should be sent to:", "The Director", "\nMUSON School of Music", "\n8/9 Marina, Onikan,", "\nLagos.", "For More Information", "Visit the Official Webpage of the MTN Foundation/Muson Music Scholarship Program 2019"], "url : https://www.opportunitiesforafricans.com/mtn-foundation-muson-music-scholarship-program-2019/"], [["African Biomedical Engineering Mobility (ABEM) Scholarships 2020 for African postgraduate students & academics (Fully Funded)", "date announced:August 1, 2019", "Application Deadline: October 30th 2019"], ["Application Deadline: October 30th 2019", " ", "The African Biomedical Engineering Mobility (ABEM) project", " is funded by the Intra-Africa Academic Mobility Scheme of the Education, Audiovisual and Culture Executive Agency of the European Commission. The scheme is modelled on Europe’s well-established and successful Erasmus-Mundus programme. As part of the Roadmap 2014-2017 of the Joint Africa-EU Strategy, the Intra-Africa Mobility Scheme underlines the contribution of higher education towards economic and social development and the potential of academic mobility to improve the quality of higher education.", "ABEM will build human and institutional capacity in Africa for\nneeds-­based health technology research and development. The project\nwill train postgraduate students with skills and specialisations not\noffered at their home institutions. Furthermore, it will support the\ndevelopment of biomedical engineering programmes that are being\nestablished, or have recently been established, at partner institutions\nand contribute toward harmonising biomedical engineering curricula\nacross the continent. This will be achieved through the provision of\nscholarships to cover the full cost of mobility between African higher\neducation institutions.", "Overall, the project will enhance employment opportunities for graduates, enhance staff research profiles and teaching competencies, enhance institutional research profiles and inter-­university cooperation, and support the development of solutions for health challenges from an African perspective.", "ABEM will train up to 32 MSc and 10 PhD graduates, and offer development opportunities to up to 10 staff members.", "Mobility must be to an institution in an eligible country other than the home country / country of the home institution.", "Target groups and types of mobility", "\nThere are two target groups and three different types of individual mobility:", "Participants", "Mobility types", "Duration", "Target group 1", "Students ", "registered in or having obtained a degree from one of the six African partner institutions", "Master’s\nDoctorate", "6-24 months\n6-48 months", "Staff ", "working in or associated with one of six African partner institutions", "Visits for teaching and/or research, or for engagement on administration and management", "1 – 6 months", "Target group 2", "Students", " registered in or having\nobtained a degree from a higher education institution not included in\nthe partnership but established in an eligible country (see below)", "Master’s\nDoctorate", "6-24 months\n6-48 months", "The eligible countries are presented in the table below:", "Regions of Africa", "Countries", "Central", "Burundi, Cameroon, Central African Republic, Chad, Congo, Congo (DRC), Equatorial Guinea, Gabon and São Tomé and Principe", "Eastern", "Comoros, Djibouti, Eritrea, Ethiopia, Kenya, Madagascar, Mauritius,\nRwanda, Seychelles, Somalia, Sudan, South Sudan, Uganda and Tanzania", "Northern", "Algeria, Egypt, Libya, Tunisia and Morocco", "Southern", "Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia and Zimbabwe", "Western", "Benin, Burkina Faso, Ivory Coast, Cape Verde, Gambia, Ghana, Guinea,\nGuinea- Bissau, Liberia, Mali, Mauritania, Niger, Nigeria, Senegal,\nSierra Leone and Togo", "Master’s and doctoral students may undertake:", "Credit-seeking mobility of 6 to 12 months at a partner institution,\nleading to academic recognition of the study period towards a degree\nprogramme at the home institution,", "Degree-seeking mobility to complete a full degree at a partner\ninstitution. The project aims for 50% of students and at least 30% of\nstaff who participate in mobility visits to be women.", "PLEASE NOTE: PhD full degree-seeking mobility is no longer available", "Application process", "Preparation", "The applicant should:", "Verify the eligibility criteria (if a candidate does not fulfil all\nof the eligibility criteria, he/she should not submit an application, as\nthe application will be considered invalid and will not be evaluated).", "Identify the Target Group to which (s)he belongs and the available scholarships.", "Select at least one host institution. It is highly recommended that\napplicants select up to 3 different host institutions from the available\noptions but always with consideration to language and background\nrequirements defined by each host institution and programme.", "Create an account on the application website for the project.", "Read attentively the Guidelines for Applicants, the FAQs and the online Application Form.", "Collect all necessary information and documents to complete the Application Form:", "\nSeveral documents are mandatory and the online system will not allow the\napplication to be submitted without them. In case of unreadable\ndocuments, the application will be considered invalid and will not be\nevaluated.", "Select the host institution(s) with consideration to the following:\n", "The language requirements of the host institution.", "The identified areas of excellence and available projects in each partner institution.", "The required academic background for the field of study, research project or activity.", "The cost of living at prospective host institutions, personal needs\nfor subsistence, and the monthly stipend for the scholarship.", "The need to adapt to different cultural realities at the hosts\ninstitution and also to different climate conditions, in case of\nselection", "Prepare a mobility project proposal describing the aims, activities\nand foreseen study/work plan and taking into consideration the\nobjectives and goals of the host programme and of the ABEM project. The\nproposal must be clear in its methodology, impact and benefit, as well\nas its feasibility within the time-frame established by the duration of\nthe scholarship. Staff should liaise with the home and host universities\non the programme of activities, eg lectures or administrative work to\nbe delivered; research activities to be carried out; type of training to\nbe followed; etc.", "Prepare a motivation with regard to the benefits and expected outcomes of the mobility", "For More Information:", "Visit the Official Webpage of the African Biomedical Engineering Mobility (ABEM) Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/african-biomedical-engineering-mobility-abem-scholarships-2020/"], [["ATI Fellowship and Scholarship Fund (FSF) 2019/2020 for graduate study/postdoctoral research in the United States (Fully Funded)", "date announced:July 30, 2019", "Application Deadline: October 17, 11:59 PM Central Africa Time (CAT). "], ["Application Deadline: October 17, 11:59 PM Central Africa Time (CAT). ", "The Fellowship and Scholarship Fund (FSF) is funded by the ", "Agricultural Transformation Initiative (ATI)", ". The ATI FSF aims to strengthen the capacity of researchers and professionals in Malawi in high-priority areas that will help the country transform its agricultural sector by reducing dependence on tobacco exports. The ATI FSF is offered to Malawian citizens and residents to pursue master’s or postdoctoral study and/or research in the areas of agriculture, business, data science, ecology/environment, economics or engineering.", " Master’s programs will begin in Fall 2020 in the United States for two years.  ", "Eligibility:", "Bachelor’s degree", "Citizenship or residency in Malawi", "Strong interest in pursuing a master’s level program in the disciplines of agriculture, business, data science, ecology/environment, economics or engineering", "No age limits apply", "Commitment to the development goals of Malawi ", "Willingness to return to Malawi for at least two years after graduate school to work in a sector related to their master’s or postdoctoral program", "Postdoctoral Applicants", "Postdoctoral awards will begin in early 2020 in South Africa. This award may be one to two years. ", "Eligibility:", "A terminal degree (for example a Ph.D. or Ed.D.) in a field of study relevant to the goals of the ATI", "Strong interest in pursuing postdoctoral study/research in the disciplines and sub-fields of agriculture, business, data science, ecology/environment, economics or engineering", "Citizenship or residency in Malawi", "Recent university graduates, early career professionals in the private or public sector, early-career faculty and staff in Malawian universities", "No age limit applies", "Commitment to the development goals of Malawi", "Willingness to return to Malawi for at least two years after the fellowship to work in a sector related to their master’s or postdoctoral program ", "Benefits:", "Recipients of the Agricultural Transformation Initiative (ATI) Fellowship and Scholarship Fund (FSF) for graduate study or postdoctoral research", " will be eligible for the following benefits: ", "Full tuition", "Living allowance for housing/transportation/food", "Visa sponsorship", "Roundtrip airfare between Malawi and university in the United States or South Africa", "Health Insurance", "If needed, cost of qualifying exams (TOFEL/GRE/GMAT) ", "How to Apply:", "Application Deadline", " – October 17, 11:59 PM Central Africa Time (CAT).", "Application Components", "\nAll applicants must complete the online application form which includes:", "Biographical information", "Curriculum Vitae/Resume", "Transcripts", "GRE/TOFEL/GMAT scores, if available (not required at time of application)", "Two 1-2 page essays. Visit ", "Essay Questions", " for more details.", "Three reference letters. The letters can come from individuals\nwho know you well like a teacher, instructor, professor, mentor or\nemployer/supervisor. Please do not submit letters from family members.\nView guidance on ", "Letters of Reference", " for more information.", "For More Information:", "Visit the Official Webpage of the ATI Fellowship and Scholarship Fund (FSF) 2019"], "url : https://www.opportunitiesforafricans.com/ati-fellowship-and-scholarship-fund-fsf-2019-2020-for-graduate-study-postdoctoral-research/"], [["Bank of Tanzania Mwalimu Julius Nyerere Memorial Scholarship Fund 2019/2020 for young Tanzanians.", "date announced:August 6, 2019", "Application Deadline: 23rdAugust, 2019(16:00hr). "], ["Application Deadline: 23rdAugust, 2019(16:00hr). ", " The Mwalimu Julius Nyerere Memorial Scholarship Fund", " is announcing Scholarships for the 2019/2020 academic year. The primary objective of the Fund is to promote interest and excellence in Mathematics and Science courses among female students in the United Republic of Tanzania. ", "The Fund provides Scholarships to six students annually as follows: –", "a)Two scholarships to best female Tanzanian students to pursue undergraduate studies in Mathematics and Science in Tanzania’s accredited universities;", "b)One scholarship to a male to student and one scholarship to a female student who are Tanzanians best performers to pursue undergraduate studies in Economics,Information Technology, Accounting and Finance;and", "c)Two scholarships to students intending to pursue Master’s programmes in Economics, Information Technology, Accounting, Mathematics and Finance.The Scholarships are granted on academic merit and based on a rigorous selection process.Successful applicants are granted full scholarship which covers all university direct cost for tuition fees and student direct costs(meal, accommodation, book and stationery allowance, field practical training, special faculty requirement) as specified in the respective institutions’ costs structureas well as one laptop computer. ", " The scholarships are awarded as follows:1.Undergraduate Degree Programmes (4Scholarships)", "The Undergraduate Scholarships are granted to top performers in Advanced Certificate of Secondary Education Examinations (ACSEE) to pursue Undergraduate degree programmes in two categories:", "Category A: Science and Mathematics Studies(Female Students only)", "Category B:Information Technology, Economics, Accounting and Finance Studies (Male and Female Students) ", "The Fund will obtain the list of the 2019 ACSEE top ten (10) students from the National Examinations Council of Tanzania (NECTA) and the said Scholarship will be granted to qualified candidates.", " Master’s Degree Programmes (2 Scholarships) ", " The Scholarships are open to both female and male best students who are to enrol in Master’s degree programmes in the fields of Mathematics, Science, Economics, Information Technology, Accounting and Finance.Requirements:", "a)Applicant must be a Tanzanian citizen.", "b)Applicant must have obtained First Class or an Upper Second Class (honours) in the Bachelor degree with a minimum GPA of 4.0 from an accredited university within the United Republic of Tanzania.", "c)Applicant must not be more than thirty-five years of age and should have completed Bachelor’s degree in studies related to Mathematics, Science, Economics, Information Technology, Accounting or Finance.", "d)Applicant must have applied/be admitted to a full time Master’s degree programme in an accredited university within the United Republic of Tanzania. The programme should commence in 2019/2020 academic year in any of the following fields: Mathematics, Science, Economics, Information Technology, Accounting or Finance. ", " Applications are invited from qualified candidates.", "Mode of Application:", "Applicants are required to complete Scholarship Application Forms which can be accessed on the BOT website: www.bot.go.tz.", "Printed forms canbe obtained from the Fund Administrator, Bank of Tanzania Head Office,2 Mirambo Street, 11884, DAR ES SALAAM.", "The forms can also be obtained at the Bank of Tanzania Branch Offices (Arusha,Zanzibar, Mwanza,Mbeya, Dodoma, Mtwaraand the Bank of Tanzania Training Institute, Mwanza).", "All application forms should be completed and submitted to the Chairperson, Mwalimu Julius Nyerere Memorial Scholarship Fund, Bank of Tanzania Head Office,2 Mirambo Street,11884, DAR ES SALAAM by 23rdAugust, 2019(16:00hr). Note: Only shortlisted candidateswill be contacted. ", "For More Information", "Visit the Official Webpage of the Mwalimu Julius Nyerere Memorial Scholarship Fund 2019/2020"], "url : https://www.opportunitiesforafricans.com/bank-of-tanzania-mwalimu-julius-nyerere-memorial-scholarship-fund-2019-2020/"], [["World Congress of Science and Factual Producers (WCSFP) Emerging Producers Bursary Program 2019 (Fully Funded to Tokyo, Japan)", "date announced:July 30, 2019", "Application Deadline: August 30th 2019"], ["Application Deadline:", " August 30th 2019", "T", "he Emerging Producers Bursary Program", " offers up-and-coming producers and content creators working in science, history, and non-fiction media a range of financial support for accreditation, travel and accommodation for Congress ’19, presented by the", " World Congress of Science & Factual Producers. ", " The goal of the Bursary Program is to welcome and represent diverse emerging talent and encourage a new generation of Congress members. Producers and content creators working in all science and non-fiction media are encouraged to apply including those working in digital media, social media and gaming. ", " For Congress ’19, the Emerging Producers Bursary Program will expand to award up to five full bursaries and up to 20 partial bursaries. Additionally, for the first time, legacy support will be introduced offering this year’s recipients discounted accreditation for Congress ’20 and Congress ’21.", "Applicants must be first time WCSFP attendees", "Any producer or content creator under the age of 35 may apply for\nthe bursary. Exceptions will be made for producers and content creators\nwho have undergone a career change. Please self-identify in your\napplication", "For Tier 1 bursaries, two priorities have been identified:", "Digital Media Producers/Content Creators", "AND/OR", "Applicants from outside the WCSFP’s traditional attendance base\n(i.e. outside of Australia, Austria, Belgium, Canada, Denmark, Finland,\nFrance, Germany, Ireland, Italy, Japan, the Netherlands, New Zealand,\nNorway, Sweden, Switzerland, UK, USA)", "The Emerging Producer Bursary Program welcomes underrepresented\nvoices and encourages applications from across all cultural and\ngeographic backgrounds", "Applicants must demonstrate experience working in the science,\nhistory or factual genres in one of the following roles: executive\nproducer, producer, associate producer, assistant producer, or digital,\ngaming or social media content creator", "Applicants should be able to demonstrate that their careers are at a\nstage to benefit from attendance at a large international event", "Requirements", "A one-page application statement detailing the applicant’s\ninvolvement in science, history or non-fiction media, including a\ndescription of his/her most recent project and his/her goals for\nattending Congress. ", "CV and short bio that outlines the applicant’s experience as a producer.", "A letter of support from a broadcaster or senior producer. In lieu\nof a letter of support digital media content creators may submit a\nletter detailing their audience reach, including information on how they\ninteract with their audiences and numbers indicating their audience and\nsocial media reach.", "Links to the applicants previous work. Please indicate your role on the supporting footage.", "How It Works", "Qualified applicants will be selected to receive one of the following tiers of support for ", "Congress ’19 in Tokyo, Japan from December 2 – 5, 2019:", " ", "Full Bursary (Tier 1)", " ", "Full registration for the Congress ’19 in Tokyo, Japan", "Travel and accommodation", "Formal introduction at the Congress’ opening plenary", "Guaranteed one-on-one meetings with decision makers", "Orientation session with leading producers to help facilitate the most effective WCSFP experience", "Tailored assistance and advice to successfully navigate WCSFP", "Discounted accreditation to attend Congress 2020 and 2021", "Priority for the Full Scholarship will be given to producers from\nemerging markets and to digital media producers/content creators.", "Partial Bursary (Tier 2 – no travel support)", " ", "Full registration for the 2019 Congress in Tokyo, Japan;", "Formal introduction at the Congress’ opening plenary;", "Orientation session with leading producers to help facilitate the most effective WCSFP experience;", "Tailored assistance and advice to successfully navigate WCSFP.", "Discounted accreditation to attend Congress 2020 and 2021.", "For More Information:", "Visit the Official Webpage of the WCSFP Emerging Producers Bursary Program 2019"], "url : https://www.opportunitiesforafricans.com/world-congress-of-science-and-factual-producers-wcsfp-emerging-producers-bursary-program-2019-fully-funded-to-tokyo-japan/"], [["University of Pretoria Commonwealth Doctoral Scholarships 2020 for study in South Africa (Fully Funded)", "date announced:July 29, 2019", "Application Deadline:2 September 2019"], ["Application Deadline:2 September 2019", "The University of Pretoria", " is a research intensive university. Hence, it is seeking candidates for doctoral studies who will make significant contributions to its research endeavour. As part of South Africa’s contribution to the Commonwealth Scholarship and Fellowship Plan, the University of Pretoria has made funds available for two doctoral scholarships for students coming from Commonwealth Countries (excluding South African students). This scholarship is known as the University of Pretoria Commonwealth Doctoral Scholarship and will be awarded on a competitive basis.", "Eligibility", "  The UP Commonwealth Doctoral Scholarship will be awarded to applicants who are citizens of Commonwealth countries.", "  Applicants must conduct their studies at the University of Pretoria to commence in 2020.", "  Applicants must have completed the degree that will give them admission to a doctoral programme no more than two years prior to their application for the University of Pretoria Commonwealth Doctoral Scholarship.", "  Applicants must not be older than 35 years of age at the time of application.", "  PhD and Masters students currently registered at the University of Pretoria are not eligible for the Doctoral Scholarship.", "Value of Doctoral Scholarship", " The value of this Doctoral Scholarship will be R170 000 p.a.", " This amount must be used to cover the following student costs:", " Accommodation and living costs", " Fees p.a.", " Medical Aid", "Books/Stationery", " Note:", " Research costs will be covered by the Supervisor", " Additional costs covered by the University:", "  Flight ticket to RSA from home country on proof of study permit.", "  Return flight ticket to home country at the end of the programme as confirmed by the faculty.", "  Shuttle service on arrival in South Africa from OR Tambo International Airport to Pretoria and return from Pretoria to OR Tambo on completion.", "UP application fee and Visa costs which will be refunded on proof of receipts on arrival.", "\nCosts not covered by the Institution:", "\n Family expenses", "\n Additional baggage expenses", "Supplementary Funds", " The holder of this scholarship may hold supplementary external bursaries/ grants/scholarships", "Application Procedure", " In order to be considered for this scholarship, candidates must submit the following documentation to the University of Pretoria;", "  Application form for the UP PhD Commonwealth Scholarship", " Attached to the application form the following:", "  The UP Online application Ref “T” number or 2020 student number (if available)", "  A written motivation from the prospective Doctoral supervisor that applicant will be supervised by them and research funding is available.", "  An outline (one A4 page), of the proposed research work.", "  Curriculum Vitae (CV) – no more than 3 pages", "  Proof that study leave will be granted if the scholarship is awarded. (if applicable)", "  Copy of passport", "  Full academic transcripts of all qualifications obtained. (not certificates)", " Above documents to be sent as a single pdf to ", "[email protected]", " Subject Heading : UP Commonwealth", " 2x completed reference forms from two different academics/supervisors who have current knowledge of the applicant’s academic performance. (Reference form attached)", " Note: Referees form to be sent directly to ", "[email protected]", "Selection Criteria", "\nAward of this scholarship will be based on:", "\n Academic performance.", "\n Potential to undertake advanced research activities.", "\n Leadership qualities.", "\n Evidence of research accomplishment at the masters’ level by means of publications or other appropriate products of the work undertaken.", "\n Prizes and honours received.", "For More Information:", "Visit the Official Webpage of the University of Commonwealth Doctoral Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/university-of-pretoria-commonwealth-doctoral-scholarships-2020/"], [["South African Radio Astronomy Observatory Masters & Doctoral Scholarship Programme 2019", "date announced:August 1, 2019", "Application Deadline: 23 September 2019. "], ["Application Deadline: 23 September 2019. ", "The South African Radio Astronomy Observatory", " invites suitably qualified students to apply for Masters Scholarships for 2020", "Academically excellent students who have completed/are completing an\nundergraduate or Honours degree, which is relevant to the scientific or\ntechnical focus areas for 2020 may apply.", "Only South African citizens and citizens of Botswana, Ghana, Kenya, Madagascar, Mauritius, Mozambique, Namibia and Zambia, who wish to complete a relevant Masters degree at a South African university, or at a university in a SKA partner country in Africa may apply.", "South African Radio Astronomy Observatory Doctoral Scholarship Programme", "Academically excellent students who have completed/are completing a\nMasters degree, which is relevant to the scientific or technical focus\nareas for 2020 may apply.", "Only South African citizens and citizens of Botswana, Ghana, Kenya,\nMadagascar, Mauritius, Mozambique, Namibia and Zambia, who wish to\ncomplete a relevant Doctoral degree at a South African university, or at\na university in a SKA partner country in Africa may apply.", "For More Information:", "Visit the Official Webpage of the SARAO Masters & Doctoral Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/south-african-radio-astronomy-observatory-masters-doctoral-scholarship-programme-2019/"], [["Canon Collins Trust LLB Scholarships 2020 for study at the University of Fort Hare in South Africa", "date announced:August 5, 2019", "Application Deadline: Sunday 15th September 2019. "], ["Application Deadline: Sunday 15th September 2019. ", "The Leigh Day Scholarships", " are for fourth year study in law at the ", "University of Fort Hare", ".", " Law and human rights have long been within our priority areas for awarding scholarships. By investing in future members of South Africa’s legal profession we hope to support a new generation ofleaders to develop legal systems which are just and equitable. ", "This scholarship is generously supported by Leigh Day & Co, a London law firm specialising in personal injury and human rights law. ", "Canon Collins Trust invites applications from current 2nd and 3rd year students (going into their 3rd and 4th year in 2020) studying for an LLB at the University of Fort Hare. We will provide funding for maximum of two years.Awards in 2020 will be R40,000, per academic year.", " This will be paid into your student account, so initially it will go towards the cost of your fees, and any remaining funds can be used for accommodation, books, or other purposes relevant to your studies. ", "Requirements:", " Applicants must be:", " •a national of the following countries: Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia, Zimbabwe", "•in possession of a strong academic record and extra-curricular involvement", "•a 2nd or 3rd year undergraduate of Law student at the University of Fort Hare.", "Please apply only if you are eligible. ", " Application Process", " The application form is of primary importance as it serves as the basis for assessment. Please do not type in block capitals.", " The form should be completed on a computer and submitted via email to: ", "[email protected]", " Please put your name and surname in the subject line of the email.", " The following supporting documents must be included, and should ideally be sent with the application form in a single email. If this is not possible you may send extra email(s), but please make sure it is clearly labelled with your name.", "•Academic transcripts•Reference letters from two referees ( academic or professional)", "•ID document (passport, birth certificate, driving license)You should ask your referees to write a reference that relates to your application for this scholarship. It should outline your strengths as an applicant, demonstrate your capacity to study at the level required, and identify your potential impact in the future. ", "You can submit your references with all the other supporting documents or, should your referee prefer to submit their reference directly, ask them to email it directly to ", "[email protected]", " They must clearly label the email with your name. It is the applicant’s responsibility to ensure that the references are sent to us by the deadline. ", " Timetable ", "The deadline for applications is Sunday 15th September 2019. ", "Late applications will not beconsidered. We will interview shortlisted applicants at the University of Fort Hare.", "They will most likely take place week beginning 28th October 2019. Please make sure you are available for interview this week. We will let you know the outcome of your application in November 2019. ", "For More Information", "Visit the Official Webpage of the Canon Collins Trust LLB Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/canon-collins-trust-llb-scholarships-2020/"]]