[[["New Zealand Commonwealth Scholarships 2018/2019 for postgraduate study (Masters and PhD) in New Zealand Universities (Fully Funded)", "date announced:December 20, 2017", "Application Deadline: 30 March 2018."], ["Application Deadline: ", "30 March 2018", ".", "New Zealand Commonwealth Scholarships", " are prestigious scholarships that recognise New Zealand’s history and ties to the Commonwealth. The Commonwealth Scholarships are part of the", " Commonwealth Scholarship and Fellowship Plan (CSFP)", " – an international programme under which Commonwealth countries offer scholarships and fellowships to citizens of other Commwealth states. The purpose of the scholarships is set out in the ", "Commonwealth Scholarship and Fellowship Plan ", "(external link)", ", with the following key principles to:", "promote mutual cooperation and share educational experience among all Commonwealth countries", "be available across the Commonwealth", "recognise and promote the highest level of intellectual achievement.", "NZ Commonwealth Scholarships are funded by the New Zealand Aid Programme, the New Zealand Government’s overseas aid and development programme. They are managed by the New Zealand Ministry of Foreign Affairs and Trade (MFAT).", "Eligible countries", "The following Commonwealth countries are eligible to apply:", "Region", "Eligible countries", "Africa", "Botswana, Cameroon, Ghana, Kenya, Lesotho, Malawi, Mauritius, Mozambique, Namibia, Nigeria, Rwanda, Seychelles, Sierra Leone, South Africa, Swaziland, Tanzania, Uganda, Zambia.", "Caribbean", "Belize, Dominica, Grenada, Guyana, Jamaica, St Lucia, St Vincent and the Grenadines.", "Asia", "Bangladesh, India, Malaysia, Pakistan, Sri Lanka,", "Pacific", "Cook Islands, Fiji, Kiribati, Nauru, Niue, Papua New Guinea, Samoa, Solomon Islands, Tonga, Tuvalu, Vanuatu.", "Qualifications", "New Zealand Commonwealth Scholarships are available for the following postgraduate qualifications:", "Master’s Degree (1 – 2 years)", "PhD (up to 3.5 years)", "Financial benefits", "Our scholarships provide the following financial support:", "full tuition fees", "living allowance (stipend) – NZ$480 per week. This is  a contribution to basic living expenses", "an establishment allowance – NZ$3000. This is a contribution to assist with set up costs in New Zealand – for example  it can be used towards accommodation expenses, text books, study materials", "medical and travel insurance", "travel to and from your home country – this is for travel from your home country at the start of the scholarship, and for you to return to your home country at the end of your scholarship. Note that we offer our scholarships for the shortest amount of time needed for you to complete the academic programme.", "home leave or reunion travel for some scholars", "assistance with research and thesis costs for many postgraduate research students", "How to apply", "The application process for a New Zealand Commonwealth Scholarship is different to other New Zealand Scholarships. Applicants must submit their applications to their country’s ‘Nominating Agency’ first. The Nominating Agency then ‘nominates’ two applicants from the submitted applications to send to the New Zealand Ministry of Foreign Affairs and Trade. Read the Commonwealth section of the ", "How to Apply ", "page carefully before you submit an application.", "Application Process:", "The application process for a New Zealand Commonwealth Scholarship is different to other New Zealand Scholarships. Applicants must submit their paper applications to their country’s ‘Nominating Agency’ first. The Nominating Agency then ‘nominates’ two applicants from the submitted applications to send to the New Zealand Ministry of Foreign Affairs and Trade. Read the below information carefully before you submit an application.", "Note: Applications are open, and will close on 30 March. ", "Applications must arrive at your country’s Commonwealth Nominating Agency by 30 March 2018.", "Step 1: Prepare to apply", "Check that you meet all ", "eligibility criteria", ".", "Follow the steps under ", "‘Getting Started’ ", "above. (The selection process is very competitive and your choice of study ", "must ", "align to one of these sectors to go on to be shortlisted.)", "If you want to pursue a PhD or a Masters by Thesis you should also start contacting and securing a potential supervisor for your PhD. You will need to have a Letter of Support from a supervisor should you go on to be shortlisted.", "Step 2: Complete your application form", "Download and print the ", "New Zealand Commonwealth Scholarships Application Form for 2017 Selection", " [PDF, 830 KB]", ".", "Refer to the ", "Application Guidance", " page on this website for essential information and helpful tips.", "Complete all sections of the application form, and make sure you have attached the additional documents required.", "Step 3: Submit your application to your nominating agency", "Send your completed Application Form to your country’s nominating agency by ", "30 March 2018", ".", "For the contact details of Nominating Agencies – see pages 26-30 at the back of the application form.", "Note: any applications received directly from applicants will not be considered. (Do NOT send your application to New Zealand). Alll applications must be sent to your country’s Nominating Agency first. Nominating Agencies play a key role in the application process.", "For More Information:", "Visit the Official Webpage of the New Zealand Commonwealth Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/new-zealand-commonwealth-scholarships-2018-2019/"], [["New Zealand Development Scholarships 2018/2019 for Study in New Zealand (fully Funded)", "date announced:December 20, 2017", "Application Deadline: March 14th 2018"], ["Application Deadline: March 14th 2018", "New Zealand Development Scholarships (NZDS)", " give candidates from selected developing countries an opportunity to gain knowledge and skills through study in specific subject areas which will assist in the development of their home country.", "NZDS are funded by the New Zealand Aid Programme, the New Zealand Government’s overseas aid and development programme. They are managed by the New Zealand Ministry of Foreign Affairs and Trade (MFAT).", "NZDS are for postgraduate study in New Zealand and are available to candidates from specific African, Caribbean and Latin American countries, and from Bhutan, Jordan, Mongolia, Nepal and Timor-Leste.", "NZDS are also available for undergraduate study to candidates from Timor Leste.", "Eligible countries", "Region", "Eligible countries", "Africa (Commonwealth) ", "Botswana, Cameroon, Ghana, Kenya, Lesotho, Malawi, Mauritius, Mozambique, Namibia, Nigeria, Rwanda, Seychelles, Sierra Leone, South Africa, Swaziland, Tanzania, Uganda, Zambia", "Africa", "Algeria, Angola, Botswana, Cameroon, Dijbouti, Egypt, Ethiopia, Gambia, Ghana, Kenya, Lesotho, Malawi, Mauritius, Morocco, Mozambique, Namibia, Nigeria, Rwanda, Senegal, Sierra Leone, South Africa, Swaziland, Tanzania, Tunisia, Uganda, Zambia, Zimbabwe", "Asia", "Bhutan", ", ", "Jordan", ", ", "Mongolia,", "  ", "Nepal", ",  ", "Timor-Leste", "Latin America", "Argentina, Bolivia, Brazil, Colombia, Costa Rica, Cuba, Ecuador, El Salvador, Guatemala, Honduras, Nicaragua, Mexico, Panama, Paraguay, Venezuela", "Caribbean ", "Antigua & Barbuda, Bahamas, Barbados, Belize, Dominica, Dominican Republic, Grenada, Guyana, Haiti, Jamaica, St Kitts and Nevis, St Lucia, St Vincent and the Grenadines, Suriname, Trinidad and Tobago.", "Qualification Types", "New Zealand Development Scholarships are available for the following qualifications:", "Postgraduate Certificate (6 months)", "Postgraduate Diploma (1 year)", "Master’s Degree (1 – 2 years)", "PhD (3 – 4 years)", "Financial benefits", "Our scholarships provide the following financial support:", "full tuition fees", "living allowance (stipend) – NZ$480 per week. This is  a contribution to basic living expenses", "an establishment allowance – NZ$3000. This is a contribution to assist with set up costs in New Zealand – for example  it can be used towards accommodation expenses, text books, study materials", "medical and travel insurance", "travel to and from your home country – this is for travel from your home country at the start of the scholarship, and for you to return to your home country at the end of your scholarship. Note that we offer our scholarships for the shortest amount of time needed for you to complete the academic programme.", "home leave or reunion travel for some scholars", "assistance with research and thesis costs for many postgraduate research students", "Application Procedure:", "Online applications", "Online applications are for the following scholarship types:", "New Zealand Development Scholarships", "Make sure you are fully prepared before you begin your online application:", "Complete all the steps in the ", "Getting Started section ", "(see above)", "Make sure you read the ", "Application Guidance", " – especially the section about Online applications.", "We still find that many applications we get are low-quality and show that the applicant has not read the essential information and guidance on this website.", "The online application process has four steps, all completed on an ", "online application site ", "(external link)", ". The site will explain each step in more detail.", "Step one: Confirm your eligibility", "Complete the Online Eligibility Test. This will give you a number that you will need when you register (step three).", "Step two: Create a Real Me login", "This will give you a login and password that you will use through the application process.", "Step three: Register with New Zealand Scholarships online", "This creates your application account, and means you will be set up to complete an application.", "Step four: Complete your application", "This step will only become available when applications formally opens. Check ", "application dates", ".", "If you are interested in applying for a scholarship we encourage you to do all the things under ‘", "Getting started", "‘ ", "before", " applications open. There is a lot you should do before you begin your application.", "Start your online application process now:", "Start your online application process here ", "(external link)", ".", "For More Information:", "Visit the Official Webpage of the New Zealand Africa Development Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/new-zealand-africa-development-scholarships-2018-2019/"], [["French Embassy Master and PhD scholarship program 2018/2019 for young South Africans to study in France (Fully Funded)", "date announced:December 11, 2017", "Application Deadline: March 20th 2018"], ["Application Deadline: March 20th 2018", "Applications for the", " French Embassy Master and PhD scholarship program", " 2018/2019", " are now being accepted.", "South African graduates are invited to apply for the French Embassy Master and PhD scholarship program. ", "Applications from all academic disciplines, especially science and technology, will be considered for the academic year starting in September 2018.", "Since 2011", ", the French Embassy has invested over 1.5 million euros in South African student mobility", " and has sent ", "around 180 South African students", " to complete their tertiary degrees at elite French Higher Education Institutions.", "The French government has supported just under forty students during the 2016/2017 academic year in their Masters and Doctorate degrees. Some of the scholarship holders will continue with their studies in 2018/2019 at the ", "French Higher Education institutions", " while others will return as ", "France Alumni", " ambassadors to invest their acquired skills in South Africa.", "Requirements:", "Students must hold at least a Bachelor’s degree. The duration of the bursary is one year, once renewable should the student continue with the Master 2 programme.", "Eligibility:", "Citizenship of South Africa or Lesotho only (temporary or permanent residency excluded).", "Bachelor’s or Honour’s degree (depending on academic year the student is enrolling for), completed or to be completed by the time the student would depart for France. (Minimum requirement is at least a B-degree, i.e. B.Tech, B.A, B.Com, BSc, etc.)", "At least three selected French institutions of the candidate’s choice. Students should apply for admission to these universities concurrently to the bursary application (if you have not been accepted at an institution yet).", "You may contact Campus France to assist you with this process, but it remains the student’s responsibility to contact and apply on time to universities (see Terms and Conditions below).", "Applications from all academic disciplines will be considered", "Benefits:", "The French Embassy scholarships can completely or partially finance annual tuition fees, health insurance and Schengen visa fees for selected applicants.", "The round-trip airfare and monthly stipend towards living expenses can further be covered.", "Co-funding opportunities are strongly encouraged to strengthen the collaboration between South African and French institutions and the public and private sector.", "Downloads:", " ", "Masters scholarship Information sheet 2018-2019", "Masters Application form 2018- 2019 ", "PhD information sheet 2018", "PhD Application form 2018", "For More Information:", "Visit the Official Webpage of the French Embassy Master and PhD scholarship program 2018/2019"], "url : https://www.opportunitiesforafricans.com/french-embassy-master-and-phd-scholarship-program-2018-2019/"], [["U.S. Department of State’s U.S.-Middle East Partnership Initiative (MEPI) Tomorrow’s Leaders Scholarship Program for North Africans (Fully Funded)", "date announced:December 22, 2017", "Application Deadline: December 31st 2017"], ["Application Deadline: December 31st 2017", "The U.S. Department of State’s U.S.-Middle East Partnership Initiative (MEPI)", " and AMIDEAST are pleased to announce this year’s recruitment for the ", "Tomorrow’s Leaders Scholarship Program", ".", " ", "The Tomorrow’s Leaders Scholarship Program", " is a MEPI initiative for capable and highly motivated high school seniors in the Middle East and North Africa who are from underserved backgrounds. The program will provide four-year university scholarships and internship opportunities at select institutions of higher learning in the Middle East to students who have the potential to become leaders.", "Eligible students include men and women who represent the region’s cultural, religious, and geographic diversity and are from socio-economically disadvantaged backgrounds, who could otherwise gain admission to, but would be unable to afford, four years of college at an American university in the Middle East.  Tomorrow’s Leaders scholarship recipients should be prepared to begin the program in the Fall 2018 term.", "The primary objective of MEPI’s Tomorrow’s Leaders scholarship program is to build a cadre of university-age leaders who are civic-minded, intellectually able, and professionally skilled, who will become the community, business, and national leaders of the future. The program intends to nurture leadership skills and the spirit of civic engagement and volunteerism among outstanding university-age students at the American University of Beirut (AUB) and the Lebanese American University (LAU).  Selected students will join the 388 Tomorrow’s Leaders who have participated in this program.", "This program is open to high school graduates from traditionally under-served communities in the Middle East and North Africa, who are qualified but unable to afford a college education. Students enroll at the undergraduate level in a four-year program. Applicants must be citizens of ", "Algeria, ", "Bahrain, Jordan", ", Morocco,", " Lebanon,", " Libya,", " Syria, ", "Tunisia, ", "West Bank and Gaza, and Yemen, and cannot hold U.S. citizenship or be a U.S. Legal Permanent Resident.", "Applicants must meet the following criteria:", "High school senior or applicant who graduated from high school in 2017;", "Strong academic credentials;", "Proficiency in written and spoken English. Test scores of the Institutional TOEFL (ITP) that is less than two years old will be used to determine eligibility;", "Maturity, flexibility and leadership potential; and", "Ability to start the program in August/September of 2018.", "Benefits:", "Participation in the program includes: travel, academic fees for four years of university at AUB or LAU, a study abroad experience in the U.S., accident and sickness insurance, housing, and a monthly allowance during the school year.", "Application Procedure:", " Applicants are being recruited from ", "Algeria", ", ", "Bahrain", ", ", "Jordan", ", ", "Lebanon", ", ", "Libya", ", ", "Morocco", ", ", "Syria", ", ", "Tunisia", ", ", "West Bank/Gaza", " and ", "Yemen", ".  ", "Please see your country-specific information page for eligibility requirements and the application deadline.", "For More Information:", "Visit the Official Webpage of the MEPI Tomorrow’s Leaders Scholarship Program for North Africans"], "url : https://www.opportunitiesforafricans.com/mepi-tomorrows-leaders-scholarship-program-2018-for-north-africans/"], [["2018/2019 Skoll MBA Scholarships in Social Entrepreneurship at the University of oxford’s Saïd Business School (Funded)", "date announced:December 14, 2017", "Application Deadline: 5 January 2018 (at the latest)"], ["Application Deadline: 5 January 2018 (at the latest)", "Applications are now been accepted for the ", "2018/2019 Skoll MBA Scholarships in Social Entrepreneurship at Saïd Business School, University of Oxford.", "The Skoll Scholarship", " is a competitive scholarship for incoming MBA students to the University of Oxford who pursue entrepreneurial solutions for urgent social and environmental challenges. The Scholarship provides funding and exclusive opportunities to meet with world-renowned entrepreneurs, thought leaders, and investors.", "The Skoll Scholarship", " provides tuition for entrepreneurs who have set up or have been working in entrepreneurial initiatives with a social purpose or who have pursued an impact career, and who wish to improve their knowledge of market-oriented practices so they can be more effective in their subsequent social change pursuits.", "The Scholarship is given in recognition that the MBA may represent a significant financial burden, particularly for those who have chosen to work in the social impact/innovation space rather than the purely commercial or public sectors.", "Benefits", "The Skoll Scholarship provides full funding plus a living stipend to complete a ", "Masters of Business Administration (MBA) at the University of oxford’s Saïd Business School.", "The Skoll Scholarship covers the full costs of tuition and college fees for the MBA programme at Saïd Business School, University of Oxford.", "The Scholarship also covers partial living expenses based on need, up to an additional £8,000.", "In addition to financial support, the Scholarship provides access to the Skoll Scholar community, a group of leaders who are positively impacting the world through innovation and systems change, as well as exclusive opportunities to meet with world-renowned entrepreneurs, thought leaders and investors.", "Eligibility Requirements:", "By the time the candidates apply for the MBA, they must have spent preferably at least 3 years either:\n", "starting and growing a social venture;", "OR leading a major expansion of an existing social venture or programme within an organisation;", "OR pursuing positive change as an impact career professional, i.e. someone who has used entrepreneurial approaches to address the same social/environmental issue, with a clear core thread that unites his/her work.", "In each of these 3 cases, candidates should be able to describe the outcomes/impact that has been created as a result of their work.", "Candidates will have used entrepreneurial approaches to identify opportunities, taken action to positively shift the status quo, and produced proven impact that contributes to rectifying unjust systems and practices in their chosen area of work.", "Candidates must demonstrate evidence of ", "personal qualities ", "strongly resonating with entrepreneurial leadership, and illustrate how these have influenced their career path thus far. These qualities include:\n", "Single-mindedness and persistence in pursuit of a social/environmental benefit goal, including a willingness to face failure and start again;", "A bias towards action rather than reflection on an issue and a willingness to apprentice with a problem* if they are tackling a challenge they didn’t personally live;", "A tendency to explore the environment for opportunities and resources;", "A willingness to take personal, and sometimes financial, risks;", "A propensity to develop networks and draw upon their members to pursue mutual goals.", "Candidates must demonstrate how a business education can contribute to the wider development of their work. They will need to illustrate why a business degree at this stage of their career trajectory can help them amplify their impact.", "Candidates must demonstrate some evidence of their ", "need ", "for the Scholarship. This may be exhibited, for example, in previous work experiences or personal backgrounds which make self-funding the MBA a significant financial burden.", "Benefits", "Receive exclusive opportunities to meet with world-renowned entrepreneurs, thought-leaders, and investors", "Take your social impact to the next level", "Gain professional leadership and business skills", "Become part of the Skoll Scholar community, a group of leaders who are positively impacting the world through innovation and systems change", "How to Apply:", "To apply for the Skoll Scholarship ", "you first need to apply and be accepted onto the Saïd Business School’s MBA programme", ".", "Follow these steps:", "1. ", "Connect", " with us to register your interest in the Scholarship and make sure you’re kept up to date with announcements about upcoming deadlines.", "2. ", "Apply for the MBA", " programme directly to Saïd Business School. You’ll need to do this during stages 1 and 2 of the MBA admissions process for the 2018-19 academic year. All the information about the programme and relevant deadlines can be found ", "here", ".", "3. ", "Tick the “Skoll Scholarship” box ", "when you submit your MBA application! You’ll find this under the “Scholarships” section of the application.", "4. The MBA admissions team will assess your application to ensure you meet the academic requirements sought by the Saïd Business School. Then, ", "if you are accepted onto the MBA programme", ", you will be eligible to apply for the Skoll Scholarship.", "5. Once you’ve received confirmation that you have been accepted onto the MBA programme, ", "keep an eye on your emails", " as the Skoll Centre will send you a link to the Scholarship online application. See timelines below to know when to expect this.", "6. ", "Complete the Skoll Scholarship online application", ". This consists of a series of short essay questions asking about your experience as an entrepreneur, your social impact, and why you believe you are a strong candidate for the scholarship.", "7.", " That’s it", "! The Skoll Centre will then consider your candidacy for the Scholarship and advise you accordingly. If your written application is successful, you’ll be invited to join a Skype interview with the Skoll Scholarship Selection Committee.  If you are successful after your skype interview, you will be invited to interview in person in Oxford.  (Please see below for the steps and timelines of each interview stage; and please be aware you may be invited to further interviews if necessary.)", "Timeline:", "Timelines", "Candidates must apply to the Oxford MBA programme during specific stages of the School’s application rounds to be considered for the Skoll Scholarship.", "Timelines for the 2018-19 academic year are as follows:", "Apply for the Oxford Saïd MBA during stages 1 or 2", "Apply by 5 January 2018 (at the latest)", "MBA final decision from Oxford Saïd", "9 March 2018 (at the latest)", "Skoll Scholarship online application sent to candidates", "12 March 2018", "Skoll Scholarship online application deadline", "25 March 2018", "Skoll Scholarship skype interview decision announced", "9 April 2018", "Skype interviews", "Mid-April 2018 (to be confirmed)", "In person interviews in Oxford", "Mid-June 2018 (to be confirmed)", "Skoll Scholarship final decision", "20 June 2018", "For More Information:", "Visit the Official Webpage of the 2018/2019 Skoll Masters Scholarships in Social Entrepreneurship"], "url : https://www.opportunitiesforafricans.com/2018-2019-skoll-mba-scholarships-in-social-entrepreneurship/"], [["Commonwealth Master’s Scholarships 2018/2019 for full-time Master’s study at a UK university (Fully Funded)", "date announced:December 12, 2017", "Application Deadline: 22 February 2018 on 23.59 (GMT) "], ["Application Deadline: ", "22 February 2018 on 23.59 (GMT) ", "Applications for the", " 2018 Commonwealth Master’s Scholarship program", " are now being accepted", "Commonwealth Master’s Scholarships", " are for candidates from low and middle income Commonwealth countries, for ", "full-time Master’s study at a UK university.", "Funded by the ", "UK Department for International Development (DFID)", ", Commonwealth Master’s Scholarships enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those who could not otherwise afford to study in the UK. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2018", "By October 2018, hold a first degree of at least upper second class (2:1) honours standard, or a second class degree and a relevant postgraduate qualification (usually a Master’s degree)", "Be unable to afford to study in the UK without this scholarship", "Eligible Commonwealth countries", "Antigua and Barbuda", "\nBangladesh", "\nBelize", "\nBotswana", "\nCameroon", "\nDominica", "\nFiji", "\nGhana", "\nGrenada", "\nGuyana", "\nIndia", "\nJamaica", "\nKenya", "\nKiribati", "\nLesotho", "\nMalawi", "\nMalaysia", "\nMauritius", "\nMontserrat", "\nMozambique", "\nNamibia", "\nNauru", "\nNigeria", "\nPakistan", "\nPapua New Guinea", "\nPitcairn Islands", "\nRwanda", "\nSamoa", "\nSeychelles", "\nSierra Leone", "\nSolomon Islands", "\nSouth Africa", "\nSri Lanka", "\nSt Helena", "\nSt Lucia", "\nSt Vincent and the Grenadines", "\nSwaziland", "\nTanzania", "\nTonga", "\nTuvalu", "\nUganda", "\nVanuatu", "\nZambia", "Each scholarship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor usually the cost of journeys made before your award is finally confirmed)", "Approved tuition fees", "Stipend (living allowance) at the rate of £1,065 per month, or £1,306 per month for those at universities in the London metropolitan area (rates quoted at 2017-2018 levels)", "Warm clothing allowance, where applicable", "Thesis grant towards the cost of preparing a thesis or dissertation, where applicable", "Study travel grant towards the cost of study-related travel within the UK or overseas", "If you are widowed, divorced, or a single parent, child allowance of £458 per month for the first child, and £112 per month for the second and third child under the age of 16, if you are accompanied by your children and they are living with you at the same address in the UK", "How to apply", "You must apply to one of the following nominating bodies in the first instance – ", "the CSC does not accept direct applications for these scholarships", ":", "National nominating agencies", " – this is the main route of application", "Selected non-governmental organisations and charitable bodies", "All applications ", "must", " be made through one of these nominating bodies. Each nominating body is responsible for its own selection process. ", "You must check with your nominating body for their specific advice and rules for applying, their own eligibility criteria, and their own closing date for applications.", " The CSC does not impose any age limit on applicants, but nominating bodies may do so in line with their own priorities.", "You must make an application using the CSC’s Electronic Application System (EAS), in addition to any other application that you are required to complete by your nominating body.", "Your application must be submitted to and endorsed by one of the approved nominating bodies listed above. The CSC will not accept any applications that are not submitted via the EAS.", "All applications, including full transcripts detailing all your higher education qualifications, must be submitted by ", "23.59 (GMT)", " on ", "22 February 2018", " at the latest.", "You are advised to complete and submit your application as soon as possible, as the EAS will be very busy in the days leading up to the application deadline.", "You must provide references from at least two individuals, which must be received by the CSC by ", "23.59 (GMT)", " on ", "22 March 2018", " in order for your application to be eligible for consideration", ".", "Download", "Application Guideline for the Commonwealth Master’s Scholarships 2018/2019", "How to access the EAS", "Please note that the CSC does not charge candidates to apply for any of its scholarships or fellowships through its Electronic Application System (EAS), and it does not charge organisations to nominate candidates.", "Choosing a university/course", "You may find the following resources useful when researching your choices of institution and course of study in the UK:", "Study UK", " – British Council website, with guidance for international students and a course and institution search", "Postgrad.com", " – information for postgraduate students, with a course search", "Prospects", " – information on postgraduate study in the UK", "Research Excellent Framework 2014 results", " – results of a system for assessing the quality of research in UK higher education institutions", "Steps to Postgraduate Study", " – a guide to asking the right questions about taught postgraduate study in the UK", "UCAS Postgraduate", " – guidance on how to find and apply for a postgraduate course", "Unistats", " – the official website for comparing UK higher education course data", "UKCISA (UK Council for International Student Affairs)", " – advice for international students on choosing a course of study", "For More Information:", "Visit the Official Webpage of the Commonwealth Master’s Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-masters-scholarships-2018-2019/"], [["Hungarian Government Stipendium Hungaricum Scholarship Program 2018/2019 for study in Hungary (Fully Funded)", "date announced:December 13, 2017", "Application Deadline: 16 February 2018–noon (until 12:00 PM Central European Time)"], ["Application Deadline: 16 February 2018–noon (until 12:00 PM Central European Time)", "The Stipendium Hungaricum Scholarship Programme", " was launched in 2013 by the Hungarian", "Government. The main goal of the programme regarding the education policy is to support the", "internationalisation of the Hungarian higher education and its constant development, to strengthen the international relations of the Hungarian academic and research community, to enhance the cultural diversity of the higher education institutions and to promote the", "good reputation and competitiveness of the Hungarian higher education throughout the world.", "The programme also aims to establish and encourage the personal and professional attachment of foreign graduated students to Hungary and contribute to the promotion of the Hungarian culture and language abroad. The core mission of the programme is to increase the number of foreign students in Hungary and to encourage Hungarian higher education institutions to attract top foreign students.", "The programme is based on bilateral educational cooperation agreements signed between the", "Ministries responsible for education in the sending countries/territories and Hungary or between institutions. Currently 60 Sending Partners are engaged in the programme throughout 5 different continents and the geographical scope of the programme is spreading each year.", "Eligibility", "Eligible Sending Partners", "The Stipendium Hungaricum Programme is based on effective bilateral educational cooperation", "agreements between the Ministry of Human Capacities of Hungary and the partner’s Ministry", "responsible for higher education. Applications will be considered eligible if the applicant is nominated by the responsible authorities of the Sending Partner.", "For full time programmes, students can apply from the following Sending Partners:", "Arab Republic of Egypt, Bosnia and Herzegovina, Federal Democratic Republic of Ethiopia*,", "Federative Republic of Brazil, Federal Republic of Nigeria, Georgia, Islamic Republic of Iran, Islamic Republic of Pakistan, Japan, Kingdom of Cambodia, Kingdom of Morocco, Kingdom of Thailand, Kurdistan Regional Government/Iraq, Kyrgyz Republic, Lao People’s Democratic Republic, Lebanese Republic, Macedonia, Mongolia, Pacific Alliance (member states: Chile, Colombia, Mexico and Peru), Palestine*,People’s Democratic Republic of Algeria, People’s Republic of Bangladesh, People’s Republic of China (including the Hudec scholarships), Republic of Albania, Republic of Angola, Republic of Azerbaijan, Republic of Belarus, Republic of Cabo Verde, Republic of Colombia, Republic of Cuba, Republic of Ecuador, Republic of Ghana, Republic of India, Republic of Indonesia, Republic of Iraq, Republic of Kazakhstan, Republic of Kenya, Republic of Korea, Republic of Kosovo, Republic of Moldova, Republic of the Union of Myanmar,", "Republic of Paraguay, Republic of Serbia, Republic of Singapore, Republic of South Africa, Republic of the Sudan, Republic of the Philippines, Republic of Turkey, Republic of Yemen, Russian Federation *, Socialist Republic of Vietnam, State of Israel, State of Kuwait, Syrian Arab Republic, The Hashemite Kingdom of Jordan, Tunisian Republic, Turkmenistan, Ukraine, United Mexican States , United Republic of Tanzania", "Study Levels", "Stipendium Hungaricum scholarships are available for bachelor, master, one-tier master,", "doctoral and non-degree programmes (preparatory and specialisation courses).", "Benefits:", "Tuition- free education-exemption from the payment of tuition fee", "Monthly stipend-non-degree, bachelor, master and one-tier master level:", "monthly amount of HUF 40 460 (cca EUR 130) contribution to the living expenses in Hungary, for 12 months a year, until the completion of studies", " doctoral level: according to the current Hungarian legislation, the monthly amount of scholarship is HUF 140 000 (cca EUR 450) for the first phase of education (4 semesters) and HUF 180 000 (cca EUR 580) for the second phase (4 semesters) for 12 months a year, until completion of studies. P lease see details in section 1.2.1.", "Accommodation contribution-free dormitory place or a contribution of HUF 40 000/month to accommodation costs for the whole duration of the scholarship period", "Please note that if the student does not live in the dormitory, then the HUF 40 000/month is a contribution to that rental costs, and in bigger cities–especially in the capital city– this contribution would not cover the full amount of rental costs.", "Medical insurance- health care services according to the relevant Hungarian legislation ( Act No. 80 of 1997, national health insurance card) and supplementary medical insurance for up to HUF 65 000 (cca EUR 205) a year/person", "Application Timeline", "16 February 2018 : submitting application: to TPF and to Sending Partner", "30 March 2018 First selection point: technical check and nomination process", "April-May 2018 Second selection point: institutional admission procedure of applicants", "for the 1st and 2nd selected programme (3rd programmes: April-mid-July)", "beginning of June 2018 notification about selection results for 1st selected programme (2-", "3rd programmes: mid-June and second half of July)", "June-July 2018 visa application process", "until 30 September 2018 arrival to Hungary", "Application Procedure:", "Application to ", "Tempus Public Foundation", "All applications shall be submitted through the online application system of Tempus Public Foundation. After registration, the applicants are able to access the application surface and upload the required documents.", "Applications should be submitted, saved applications will not be considered. Please note that no applications will be accepted without the online submission and after the deadline. No hard copies are required.", "A guide for the online system will be available to download from the www.stipendiumhungaricum.hu website. The deadline for submitting the complete application package: 16 February 2018–noon (until 12:00 PM Central European Time)", "The online application system canbe reached here: apply.stipendiumhungaricum.hu", "For More Information:", "Visit the Official Webpage of the Hungarian Government Stipendium Hungaricum Scholarship Program 2018/2019"], "url : https://www.opportunitiesforafricans.com/hungarian-government-stipendium-hungaricum-scholarship-program-2018-2019/"], [["Commonwealth PhD Scholarships 2018/2019 for doctoral study in the United Kingdom (Fully Funded)", "date announced:December 12, 2017", "Application Deadline: February 22nd 2018"], ["Application Deadline: February 22nd 2018", "Applications for the ", "Commonwealth PhD Scholarships 2018/2019 for study in the United Kingdom", " are now being accepted", "The Commonwealth Scholarship and Fellowship Plan (CSFP)", " is one of the largest and most prestigious international scholarship schemes in the world. Since it was established in 1959, 35,000 individuals have held a Commonwealth Scholarship or Fellowship – 27,000 of them were funded by the UK government, through the Commonwealth Scholarship Commission in the United Kingdom (CSC).", "Commonwealth PhD Scholarships are for candidates from low and middle income Commonwealth countries, for full-time doctoral study at a UK university.", "Funded by the UK Department for International Development (DFID), Commonwealth PhD Scholarships enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those who could not otherwise afford to study in the UK.", "Purpose:", "To enhance individual teaching and research capacity leading to increased institutional capacity in academic and other sectors in Commonwealth countries, and to contribute to UK higher education and research by attracting high-calibre international candidates and encouraging links and collaboration.", "Intended beneficiaries:", "High-quality graduates who have the potential to become influential leaders, teachers, or researchers in their home countries, and whose proposed research topic has been described to the satisfaction of the selection committee as having a developmental and leadership focus", "ELIGIBILITY", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an eligible Commonwealth country, or be a British Protected Person", "Be permanently resident in an eligible Commonwealth country", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2018", "By October 2018, hold a first degree of at least upper second class (2:1) honours standard, or a second class degree and a relevant postgraduate qualification (usually a Master’s degree)", "NOT be registered for a PhD, or an MPhil leading to a PhD, at a UK university before September/October 2018", "Be unable to afford to study in the UK without this scholarship", "ELIGIBLE COMMONWEALTH COUNTRIES", "Antigua and Barbuda", "Bangladesh", "Belize", "Botswana", "Cameroon", "Dominica", "Fiji", "Ghana", "Grenada", "Guyana", "India", "Jamaica", "Kenya", "Kiribati", "Lesotho", "Malawi", "Malaysia", "Mauritius", "Montserrat", "Mozambique", "Namibia", "Nauru", "Nigeria", "Pakistan", "Papua New Guinea", "Pitcairn Islands", "Rwanda", "St Helena", "St Lucia", "St Vincent and the Grenadines", "Samoa", "Seychelles", "Sierra Leone", "Solomon Islands", "South Africa", "Sri Lanka", "Swaziland", "Tanzania", "Tonga", "Tuvalu", "Uganda", "Vanuatu", "Zambia", "Scholarship Worth:", "Each scholarship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor usually the cost of journeys made before your award is finally confirmed)", "Approved tuition fees", "Stipend (living allowance) at the rate of £1,065 per month, or £1,306 per month for those at universities in the London metropolitan area (rates quoted at 2017-2018 levels)", "Warm clothing allowance, where applicable", "Study travel grant towards the cost of study-related travel within the UK or overseas", "Provision towards the cost of fieldwork undertaken overseas (usually the cost of one economy class return airfare to your fieldwork location), where approved", "Paid mid-term visit (airfare) to your home country (unless you have claimed (or intend to claim) spouse and/or child allowances during your scholarship, or have received a return airfare to your home country for fieldwork)", "Family allowances, as follows:", "Spouse allowance of £229 per month if you and your spouse are living together at the same address in the UK (unless your spouse is also in receipt of a scholarship; other conditions also apply)", "Child allowance of £229 per month for the first child, and £112 per month for the second and third child under the age of 16, if you are accompanied by your spouse and children and they are living with you at the same address in the UK", "If you are widowed, divorced, or a single parent, child allowance of £458 per month for the first child, and £112 per month for the second and third child under the age of 16, if you are accompanied by your children and they are living with you at the same address in the UK", "HOW TO APPLY", "You should apply to study at a UK university which has a part funding agreement with the CSC. Part funding agreements are at the discretion of individual universities. For a list of universities that have agreed to part fund Commonwealth Scholarships, visit http://cscuk.dfid.gov.uk/apply/uk-universities/part-funding", "You must apply to one of the following nominating bodies in the first instance – the CSC does not accept direct applications for these scholarships:", "National nominating agencies – this is the main route of application. For a full list including contact details, visit http://cscuk.dfid.gov.uk/apply/national-nominating-agencies", "Selected universities/university bodies, which can nominate their own academic staff. For a full list, visit http://cscuk.dfid.gov.uk/apply/phd-scholarships-low-middle-income-countries/nominating-universities", "Selected non-governmental organisations and charitable bodies. For a full list, visit http://cscuk.dfid.gov.uk/apply/phd-scholarships-low-middle-income-countries/nominating-ngos", "All applications must be made through one of these nominating bodies. Each nominating body is responsible for its own selection process.", "You must check with your nominating body for their specific advice and rules for applying, and for their own closing date for applications.", "The CSC does not impose any age limit on applicants, but nominating bodies may do so in line with their own priorities.", "You must make your application using the CSC’s Electronic Application System (EAS), in addition to any other application that you are required to complete by your nominating body. Information on how to use the EAS, including detailed guides, is available at http://cscuk.dfid.gov.uk/apply/phd-scholarships-low-middle-income-countries", "Your application must be submitted to and endorsed by one of the approved nominating bodies listed above. The CSC will not accept any applications that are not submitted via the EAS.", "All applications, including full transcripts detailing all your higher education qualifications, must be submitted by 23.59 (GMT) on 22 February 2018 at the latest.", "You are advised to complete and submit your application as soon as possible, as the EAS will be very busy in the days leading up to the application deadline.", "You must provide the following supporting documentation, which must be received by the CSC by 23.59 (GMT) on 22 March 2018 in order for your application to be eligible for consideration:", "References from at least two individuals", "Supporting statement from a proposed supervisor in the UK from at least one of the institutions named on your application form", "Awards made by the CSC are subject to the ongoing endorsement of the nominating body. The CSC cannot accept nominations for these scholarships from other organisations or applications directly from individuals; such applications will not be acknowledged.", "Universities or other organisations that wish to be invited to nominate candidates for these scholarships should write to the Executive Secretary, Commonwealth Scholarship Commission in the UK, Woburn House, 20-24 Tavistock Square, London WC1H 9HF, UK.", "Download", "Application Guideline for the Commonwealth PhD Scholarships 2018/2019", "How to access the EAS", "Please note that the CSC does not charge candidates to apply for any of its scholarships or fellowships through its Electronic Application System (EAS), and it does not charge organisations to nominate candidates.", "Choosing a university/course", "You may find the following resources useful when researching your choices of institution and course of study in the UK:", "Study UK", " – British Council website, with guidance for international students and a course and institution search", "Postgrad.com", " – information for postgraduate students, with a course search", "Prospects", " – information on postgraduate study in the UK", "Research Excellent Framework 2014 results", " – results of a system for assessing the quality of research in UK higher education institutions", "UCAS Postgraduate", " – guidance on how to find and apply for a postgraduate course", "Unistats", " – the official website for comparing UK higher education course data", "UKCISA (UK Council for International Student Affairs)", " – advice for international students on choosing a course of study", "For More Information:", "Visit the Official Webpage of the Commonwealth PhD Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-phd-scholarships-2018-2019/"], [["TaiwanICDF’s International Higher Education Scholarship Program 2018 for study in Taiwan (Fully Funded)", "date announced:January 1, 2018", "Application Deadline: March 16, 2018."], ["Application Deadline: ", "March 16, 2018.", "Apply Now for the ", "2018 TaiwanICDF’s International Higher Education Scholarship Program.", "International education and training has long been one of the TaiwanICDF’s core operations, among many others. Human resources development programs play a vital role in assisting partner countries achieve sustainable development, and education is a crucial mechanism for training workforces in developing countries. The TaiwanICDF provides scholarships for higher education and has developed undergraduate, graduate and Ph.D. programs in cooperation with renowned partner universities in Taiwan.", "Eligibility Requirements:", "An applicant must:", "Be a citizen of a country on the List of Countries Eligible for TaiwanICDF Scholarship, and satisfy any specific criteria established by his or her country and/or government of citizenship.", "Neither be a national of the Republic of China (Taiwan) nor an overseas compatriot student.", "Satisfy the admission requirements of the partner university to which he or she has applied to study under a", " TaiwanICDF scholarship.", "Be able to satisfy all requirements for a Resident Visa (Code: FS) set by the Bureau of Consular Affairs, Ministry of Foreign Affairs, and an Alien Resident Certificate (ARC) set by the Ministry of the Interior, of the ROC (Taiwan) government (this means that the TaiwanICDF has the right to revoke a scholarship offered if an applicant cannot satisfy the visa requirements).", "Upon accepting a TaiwanICDF scholarship, not hold any other ROC (Taiwan) government-sponsored scholarship (such as the Taiwan Scholarship) in the same academic year in which the TaiwanICDF scholarship would be due to commence.", "Not be applying for another TaiwanICDF scholarship in unbroken succession—to apply for a 2018 scholarship, applicants who have already held a TaiwanICDF scholarship, MOFA’s Taiwan Scholarship or an MOE scholarship must have graduated before July 31, 2017.", "Have never had any scholarship revoked by any ROC (Taiwan) government agency or related institution, nor been expelled from any Taiwanese university.", "Note: All Undergraduate Programs only accept applications submitted by citizens of allied countries of ROC(Taiwan).", "Scholarship Benefits", "Entitlements: The TaiwanICDF provides each scholarship recipient with a full scholarship, including return airfare, housing, tuition and credit fees, insurance, textbook costs and a monthly allowance.", "1. Airfare: The TaiwanICDF arranges economy class, return tickets for the most-direct flights to and from Taiwan.", "2. Housing: All students must reside in student dormitories.", "3. Tuition fees: The TaiwanICDF covers tuition fees as required by a student’s university.", "4. Credit fees: Credit fees, which vary with the number of credits registered, are also covered as required by a student’s university.", "5. Insurance: In addition to the mandatory student safety insurance set by the Ministry of Education, each student must be insured for accident and medical coverage while in Taiwan. The TaiwanICDF covers insurance fees for the entire duration of a student’s program.", "6. Textbook costs: The costs of textbooks purchased as required by instructors are covered by the TaiwanICDF, subject to the approval of the director of the student’s institute.", "7. Allowance:", "(1) Undergraduate Program: Each student receives NT$12,000 per month as an allowance for food and miscellaneous living expenses. This is deposited into a student’s local bank account on a monthly basis.", "(2) Master’s Program: Each student receives NT$15,000 per month as an allowance for food and miscellaneous living expenses. This is deposited into a student’s local bank account on a monthly basis.", "(3) Ph.D. Program: Each student receives NT$17,000 per month as an allowance for food and miscellaneous living expenses. This is deposited into a student’s local bank account on a monthly basis. A student’s host institute may offer to continue paying this monthly allowance for courses exceeding four years; the duration and amount will be determined by the host institute.", "Application Procedure", "The annual application period runs, in principle, from January 1 to March 15.", " (For 2018 Scholarship program, the application period runs from January 1 to March 16, 2018.) ", "Applicants should submit the documents listed below to the ROC (Taiwan) Embassy/ Consulate General/ Representative Office in their country. ", "Applicants must ensure that they submit accurate and complete documentation; failure to do so will result in the application not being processed. Please also note: 1. Late submissions will not be accepted and/or processed. 2. All Undergraduate Programs only accept applications submitted by citizens of allied countries of ROC(Taiwan). ", "A photocopy of applicant’s passport or other document showing proof of nationality.", "A photocopy of applicant’s highest-level diploma and academic transcripts.", "A photocopy of applicant’s English proficiency certificate.", "Please note: This means a TOEFL test score or that of another recognized English proficiency exam, or documents certifying that the applicant has graduated from a program where all courses were taught in English. Applicants who are unable to provide such proof of English proficiency due to special circumstances may be assessed for English proficiency by an ROC (Taiwan) Embassy/ Consulate General/ Representative Office via interview or other forms of testing. Applicants whose official national language is English are exempt from needing to supply these documents. ", "Two letters of reference.", "Any other documents specifically requested by an ROC (Taiwan) Embassy/ Consulate General/ Representative Office. ", "In addition to the above documents requested as part of their scholarship application,", "applicants should also submit all documents required by the TaiwanICDF partner university that they are applying to before the admissions deadline of that university.", " For detailed information on such documents, please refer to the ", "2018 TaiwanICDF International Higher Education Scholarship Program Brochure", ".", "The ROC (Taiwan) Embassy/ Consulate General/ Representative Office will conduct a first review of applicants based on the eligibility requirements and selection criteria of the TaiwanICDF, and then submit their list of recommended applicants to the TaiwanICDF no later than March 31 each year.", "A second review of the qualified applicants will be conducted by an academic committee organized by the individual partner university in joint cooperation with TaiwanICDF representatives. Such reviews will be based on each university’s selection criteria, whilst also accounting for the eligibility requirements and selection criteria of the TaiwanICDF.", "After the second review has been conducted in cooperation with all partner universities, the TaiwanICDF will announce its list of scholarship recipients, in principle, no later than June 30 each year. Successful applicants will receive an acceptance letter through the ROC (Taiwan) Embassy/ Consulate General/ Representative Office to whom they originally applied.", "Please note: Gaining admission from the university does not necessarily mean that the applicant has also been given a TaiwanICDF scholarship. Only the applicant who receives the acceptance letter issued by the TaiwanICDF is the scholarship recipient. ", "Apply Now", "Applicants must complete an online application. Please go to our online application system to fill in your application (for 2018 Scholarship Application, this will be available at the beginning of 2018, and will be closed on March 16, 2018), and then submit a signed, printed copy along with all other application documents to the ROC (Taiwan) Embassy/ Consulate General/ Representative Office in their country.", "Please note that each applicant can only apply for one program at a time. The applicant also needs to submit a separate program application to his/her chosen universities.", "Online Application System", "For More Information:", "Visit the Official Webpage of the TaiwanICDF’s International Higher Education Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/taiwanicdfs-international-higher-education-scholarship-program-2018/"], [["Mobile telecommunication company (MTC) Bursary Programme 2018 for young Namibians", "date announced:December 26, 2017", "Application Deadline: January 9th 2018"], ["Application Deadline: January 9th 2018", "Mobile Telecommunications Limited", " is Namibia’s leading telecommunications company, with over 2,000 000 cellular customers. MTC now provides coverage to all major towns in Namibia and reaches an estimate 95% of the population.", "MTC invites qualifying students to apply for an MTC Bursary.", "Requirements:", "Namibian Citizenship", "Registration at a recognised tertiary institution within SADC", "Above 70% average academic performance during the 2017 academic year", "Qualifying courses:", "2nd & 3rd Year Bachelor of Computer Science/Information Technology", "2nd Year Bachelor of Engineering in Electronics and Telecommunications", "4th Year Bachelor of Marketing", "4th Year Bachelor of Human Resources Management", "4th year Bachelor of Accounting", "Scope of Bursary:", "All inclusive within the scope of the MTC Bursary Programme.", "A written motivation with comprehensive CV and academic records must be submitted to:", "MTC Head Office", "Att: Loide Martin", "P O Box 23051, WINDHOEK", "C/O Mose Tjitendero & Hamutenya Wanahepo Ndadi Streets", "Olympia, WINDHOEK", "Application closing date: 9th January 2018.", "Namibians from previously disadvantaged groups in need of financial assistance with strong academic track records are urged to apply.", "Only short listed candidates will be contacted.", "For More Information:", "Visit the Official Webpage of the MTC Bursary Programme 2018"], "url : https://www.opportunitiesforafricans.com/mobile-telecommunication-company-mtc-bursary-programme-2018/"], [["2018 Scholarship Foundation of the Republic of Austria for Undergraduates, Graduates and Postgraduates study in Austria (Funded)", "date announced:December 15, 2017", "Application Deadline: March 1st 2018"], ["Application Deadline: March 1st 2018", "Country of origin: ", "All except Austria", "Target country: ", "Austria", "Area of study or research:", " Natural Sciences, Technical Sciences Human Medicine, Health Sciences, Agricultural Sciences, Social Sciences, Humanities, Arts", "Detailed type of grant:", " Semester and/or one-year grants, Research grants", "Funding: ", "National", "Target group: ", "Undergraduates, Graduates, Postgraduates, PhD Students", "Funding organisation: ", "OeAD-GmbH on behalf of and financed by the Scholarship Foundation of the Republic of Austria", "Duration: ", "1 – 4 months", "Eligibility Requirements:", "Eligible for application are", "\n– descendents of forced labourers (regardless of their country of origin)", "\n– or people coming from countries that have suffered exceptionally from the Nazi regime, especially from the recruitment of forced labourers.", "Students meeting the above mentioned criteria can apply to pursue research", "– on their bachelor thesis", "\n– on their diploma or master thesis", "\n– or their dissertation.", "\nNo scholarships are awarded for Bachelor-, Master- or Doctoral/PhD studies pursued in Austria, summer courses, language courses, clinical traineeships or internships.", "Applicants must not have studied/pursued research/pursued academic work in Austria in the last six months before taking up the grant.", "Age limit", ":", "\nDoctoral students: 40 years (born on or after March 1, 1978)", "\nfor other students: 35 years (born on or after March 1, 1983)", " ", "The quota depends on the budget", "Grant benefit paid:", "1) monthly scholarship instalment: 1.050 EUR", "\n2) Health insurance: OeAD scholarship holders need to have health insurance that is accepted by the Austrian authorities for the duration of their stay in Austria. The OeAD can help with taking out such insurance. The monthly costs can vary, at the moment you should calculate 55 to 200 EUR (depending on your age, scholarship category and state of health). The costs for the insurance have to be covered from the scholarship.", "\n3) Accomodation: It is possible for OeAD scholarship holders to book accomodation (dormitory or apartment) with the OeAD Housing Office.The monthly costs are 220 to 470 EUR (depending on the level of comfort requested by the scholarship holder). The scholarship holder has to pay an administrative fee of 18 EUR/month to the OeAD Housing Office for the provision of accommodation. The costs for the accommodation have to be covered from the scholarship.", "\n4) Travel Costs: Applicants from countries which are neither members of the EU nor members of EFTA, EEA or OECD can be granted a travel allowance. The lump sum depends on the country of origin.", "Application Procedure:", "The following ", "documents ", "have to be uploaded for the ", "Online Application", " on ", "www.scholarships.at", ":", "\n– fully completed Online Application form “Application for a Scholarship of the Scholarship Foundation of the Republic of Austria” including a CV and a project plan, describing the plans and completed  preparatory work for the research stay in Austria", "\n– two letters of recommendation from university lecturers. For these letters of recommendation no specific form is required; they have to contain the letterhead, date and signature of the person recommending the applicant and the stamp of the university / department and must be no older than six months at the time of application. The letters of recommendation and the confirmation of supervision cannot be issued by the same person.", "\n– confirmation of supervision by a supervisor at the chosen Austrian university, university of applied sciences or research institution", "\n– scanned passport (showing the name and picture of the applicant)", "\n– university graduation certificate of your diploma, master, PhD or doctoral studies at a university outside Austria resp. proof of enrollment at a study programme at a university outside Austria", "– confirmation, that proves your participation in a study programme (Bachelor, Master/Diploma or PhD) at your home university", "\n– for descendants of forced labourers: processing number or photocopy of the letter of information or other relevant proofs", "For More Information:", "Visit the Official Webpage of the 2018 Scholarship Foundation of the Republic of Austria"], "url : https://www.opportunitiesforafricans.com/2018-scholarship-foundation-of-the-republic-of-austcria/"], [["Mawazo PhD Scholars programme 2018 for African female PhD students at Kenyan universities.", "date announced:December 14, 2017", "Application Deadline: 11.59 pm EAT on Friday, 26 January 2018.  A"], ["Application Deadline: ", "11.59 pm EAT on Friday, 26 January 2018", ".  A", "The", " Mawazo PhD Scholars programme", " is a one-year, non-residential fellowship aimed at ", "women pursuing PhD studies", " focused on climate change and energy at Kenyan universities.   The goal of this programme is to build a strong pipeline of future researchers who are prepared to ask insightful questions about African development, and effectively communicate their results to both government and industry leaders and the general public.", "The goal of this programme is to build a strong pipeline of future researchers who can ask insightful questions about African development, and effectively communicate their results to government and industry leaders and to the public.", "Eligibility", "You should apply for the ", "Mawazo PhD Scholars programme", " if you are:", "A woman under the age of 40 ", "(as of 1 January 2018)", "A citizen of an African country", "Enrolled in a PhD programme at a Kenyan university", "In any department in the social sciences or a STEM (science, technology, engineering and mathematics) field", "Studying a topic related to energy or climate change", "Working on or about to begin working on an academic research project which is intended for publication", "Currently living in Kenya, or otherwise able to travel to Nairobi at least two times per month for the rest of 2018", "Programme Components", "In 2018, the ", "Mawazo PhD Scholars Programme", " will support up to six ", "female PhD students at Kenyan universities.", "  Mawazo PhD Scholars receive the following benefits:", "A research grant worth Ksh 500,000 on average ", "(precise value will vary depending on the amount needed for each Scholar’s research)", "Training in research methods, academic writing, grant writing, public engagement, and the publication process", "Research and editorial support from the Mawazo staff", "Travel grants for participation in regional or international conferences", "Connections to mentors, and industry and government leaders, in their field", "A dedicated desk at Mawazo’s office at ", "Ikigai", ", Spring Valley, Nairobi", "Mawazo PhD Scholars", " are expected to achieve the following goals during their fellowship year:", "Make substantial progress in collecting data for and/or writing up their current research project", "Develop a plan for identifying suitable journals and submitting their article for publication once it’s complete", "Identify outside research grants or post-docs, and submit at least two grant applications", "Participate in at least one academic conference", "Regularly attend training sessions and networking events in Nairobi ", "(travel funding is available for Scholars who are based outside Nairobi)", "Publicise their work by speaking at public lectures arranged by Mawazo, writing blog posts and op-eds, and (if possible) making radio or TV appearances", "Application process", "The application includes the following materials:", "A current CV, including at least two references", "A letter from the applicant’s university department confirming current enrollment in the PhD programme", "A letter of support from a supervisor at the PhD programme (emailed directly to the ", "PhD Scholars contact address", " with the subject line “Letter of Support — [Applicant’s First and Last Name]”)", "A research proposal of 1000 words or less, including:\n", "Brief literature review", "Description of proposed research design and data collection methods", "Summary of work completed on the project to date", "List of next steps and estimated timeline to complete the project", "A budget for the project\n", "Applicants may request up to Ksh 500,000 from Mawazo", "Mawazo provides a conference travel grant on top of the research funding, so the project budget should not include any expenses related to conference travel", "Please use Mawazo’s ", "budget template", "All applications will be reviewed by the Mawazo Institute staff.  Successful applicants will demonstrate that they can do the following:", "Identify a challenge related to energy or climate change which has important implications for African development", "Demonstrate that current academic research has not identified a suitable solution to this challenge", "Propose a research project on this topic which has an appropriate research design for the question being asked, and can be feasibly answered given the financial resources and time that the applicant can dedicate to the project", "Write a summary of their project which is clear, concrete, and accessible to scholars outside their own field", "The Mawazo Institute is committed to non-discrimination in the application review process.  There is no cost to submit an application to the PhD Scholars programme.", "Apply Now for the Mawazo PhD Scholars programme 2018", "For More Information:", "Visit the Official Webpage of the Mawazo PhD Scholars programme 2018"], "url : https://www.opportunitiesforafricans.com/mawazo-phd-scholars-programme-2018/"], [["USEmbassy EducationUSA Opportunity Funds Program (OFP) 2018/2019 for young South Africans (Funded to School in USA)", "date announced:December 29, 2017", "Application Deadline: January 18, 2018"], ["Application Deadline: January 18, 2018", "U.S. Embassy South Africa Public Affairs Section, U.S. Department of State (PAS)", " is pleased to announce that funding has been requested for the following project:", "The grantee will work in coordination with the Public Affairs Sections in Pretoria, Durban, Cape Town, and Johannesburg in support of the ", "2018/2019 EducationUSA Opportunity Funds program.", " This program assists highly qualified students who are likely to be awarded full financial aid from U.S. colleges and universities but lack the financial resources to cover the up-front costs of international and domestic airfare, visa fees, SEVIS fees, and settling-in allowance. U.S. Mission to South Africa EducationUSA advisors located in Durban, Cape Town, and Johannesburg will select and advise the Opportunity Funds students.", "Institutions interested in bidding on this grant are asked to submit a quote to administer the Opportunity Funds of US$76,320 and manage two phases of the EducationUSA selection process. The first phase requires coordination and payment for qualified perspective students to take standardized tests.", "The second phase requires the recipient to manage the travel logistics of approximately 14-18 students, including visa and SEVIS fees, international airfare, domestic airfare, settling-in allowance, and other related expenses. The grantee will communicate with the students, coordinate visa appointments at the appropriate U.S. consulate, make travel arrangements for domestic and international travel, and coordinate payment to the student of settling-in and other related allowances. The successful grantee will demonstrate an ability to effectively handle funds, coordinate logistics, and finalize payments in a timely manner.", "For More Information:", "Visit the Official Webpage of the USEmbassy EducationUSA Opportunity Funds Program (OFP) 2018/2019"], "url : https://www.opportunitiesforafricans.com/usembassy-educationusa-opportunity-funds-program-ofp-20178-for-young-south-africans/"], [["ONASSIS FELLOWHIPS PROGRAM 2018/2019 FOR INTERNATIONAL SCHOLARS to Study in Greece (Funded)", "date announced:December 18, 2017", "Application Deadline: 28th February 2018."], ["Application Deadline: ", "28th February 2018", ".", "The Onassis Foundation", " announces its twenty-fourth (24th) annual Program of scholarships for the academic year 2018-2019", " which is addressed to non-Greeks, Professors, Postdoctoral Researchers and Ph.D. Candidates for research in Greece on topics linked to greek culture, society or economy. A total of ten (10) scholarships will be awarded from which three (3) scholarships will be allocated to university professors of all academic ranks, three (3) scholarships to post-graduate researchers and four (4) scholarships to PhD candidates.", "In 2001 the Foundation, following the successful publication in Greek of the Greek Scholars’ Album, produced the first bilingual (Greek-English) Album of Foreign Scholars, which records their academic and professional progress.", "The number of scholarships awarded by the Foundation to foreigners varies from year to year. On average, 35 scholarships are awarded annually. During the 22 years of the Program’s operation (1995 – 2017), 883 research grants and educational scholarships have been awarded, amounting to $ 11.307.812", "Eligible Countries:", "Albania, Argentina, Armenia, Australia, Austria, Belgium, Bosnia-Herzegovina, Brazil, Bulgaria, ", "Cameroon,", " Canada, Chile, China, Congo, Croatia, Cuba, Cyprus, Czech Republic, ", "Egypt,", " Estonia, Finland, France, Georgia, Germany, ", "Ghana,", " Greece, Hungary, Iceland, India, Iran, Ireland, Israel, Italy, Japan, Jordan, Kazakhstan, Latvia,  Lithuania, Mexico, Moldavia, Mongolia, Montenegro, ", "Morocco,", " Pakistan, Peru, Poland, Portugal, Romania, Russia, S. Korea, Serbia, Slovakia, Slovenia, ", "S. Africa,", " Spain, Sri Lanka, Sweden, The Netherlands,", " Tunisia,", " Turkey, Ukraine, United Kingdom, Uruguay, U.S.A., Uzbekistan, Venezuela.", "GENERAL CONDITIONS OF PARTICIPATION", "The Program covers scholarly research in Greece only and in the fields stated", "above.", "1. Eligible to participate are the following candidates:", "a) Persons of non-Greek descent", "b) Cypriot citizens are also eligible to apply for Category D and E fellowship only, provided they", "permanently reside and work outside Greece", "c) Persons of Greek descent (second generation and on) are also eligible to apply for a", "fellowship or scholarship, provided they permanently reside and work abroad or currently study", "in foreign Universities", "d) Category D and E also applies to Scholars of Greek descent or citizenship provided they have a professional academic career of at least ten (10) years in a University or Research Institute abroad", "e) The above mentioned clarification (d) also applies to Ph.D. candidates of Greek descent or citizenship, who pursue post-graduate studies outside of Greece ( Category C – please see below), have conducted their high school studies and have obtained a degree outside Greece and permanently reside outside Greece for more than fifteen (15) years", " ", "Downloads:", "Announcement", " (English)", "Announcement", " (French)", "Application Form for CATEGORY C", ":", "Application Form for CATEGORY D", ":", "Application Form for CATEGORY E", ":", "For further information, please contact the Onassis International Scholarships Department at:  210 37 13 018, E-mail: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the ONASSIS FELLOWHIPS PROGRAM 2018/2019"], "url : https://www.opportunitiesforafricans.com/onassis-fellowhips-program-2018-2019/"], [["Rotary/UNESCO-IHE Scholarships 2018/2019 for Water and Sanitation Professionals", "date announced:December 12, 2017", "Application Deadline: June 15th 2018"], ["Application Deadline: June 15th 2018", "Applications for the ", "Rotary/UNESCO-IHE Scholarship program 2018/2019 a", "re now being accepted", "Rotary and the ", "IHE Delft Institute for Water Education", " have teamed up to tackle the world’s water and sanitation crisis by increasing the number of trained professionals to devise, plan, and implement solutions in developing and emerging countries. Through this partnership, The Rotary Foundation will provide grants to Rotary clubs and districts to select and sponsor a limited number of students each year.", "The Rotary Scholarships for Water and Sanitation Professionals", " have been designed to promote long-term productive relationships between Rotarians and highly skilled water and sanitation professionals in their communities. Rotary scholars will benefit from the support they receive through regular contact with sponsoring Rotarians from their home country and the opportunity to interact with Rotarians in the Netherlands. After graduating, scholars’ expertise will be put to work improving water and sanitation conditions in their own community with a project the scholar and sponsoring Rotarians will design and implement together.", "In addition, Rotary Foundation alumni are part of an extensive network of fellow Rotary scholarship recipients and Rotarians worldwide. Becoming involved with a local Rotary club and the alumni association allows scholars to stay connected to Rotary’s global community and resources.", "Eligibility Requirements:", "Students eligible for this scholarship must be provisionally admitted to one of the following degree programs at IHE Delft (joint programs are not eligible):", "MSc in Urban Water and Sanitation", "MSc in Water Management and Governance", "MSc in Water Science and Engineering", "Students must also live or work near a Rotary club. To search for a Rotary club, visit the ", "Club Finder page", " on ", "rotary.org", ".", "Application Process", "Students provisionally admitted to one of the three eligible IHE Delft academic programs will seek the sponsorship of their local Rotary club or district. Please review the Application Tool Kit in the documents list below for further details regarding the application process.", "Scholars are selected in a competitive process. Candidates are chosen based on their ability to have a significant, positive impact on global water and sanitation issues during their career.  Successful applicants will have a strong academic background, significant and relevant professional experience, and demonstrated leadership in the community.Completed applications must be received by TRF from sponsor Rotarians no later than ", "15 June", " of the year in which studies begin. Applications submitted directly to TRF by the student will not be considered.", "TRF awards scholarships of approximately €34,000, paid directly to IHE Delft. Funding to cover additional costs (including international travel) related to participation in the academic program will be coordinated by IHE Delft.", "Application Toolkit", "Rotary Scholarship for Water and Sanitation Professionals – Application Toolkit for 2017-19", "Contact information", "Questions about the scholarship and application process can be sent to ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the 2018 The Rotary Scholarships for Water and Sanitation Professionals"], "url : https://www.opportunitiesforafricans.com/rotary-unesco-ihe-scholarships-2018-2019-for-water-and-sanitation-professionals/"], [["Ghent University Doctoral Scholarships 2018 for Candidates from Developing Countries to study in Belgium (Funded)", "date announced:December 29, 2017", "Application Deadline: 1 October 2018;"], ["Application Deadline: ", "1 October 2018", ";", "With support from its ", "“Special Research Fund”", " (BOF), ", "Ghent University grants PhD scholarships", " ", "to promising PhD students from developing countries who wish to carry out ", "half of their PhD research at Ghent University and half in a university in a developing country.", "Requirements:", "Before applying for a PhD scholarship at Ghent university students Always need to find a professor from Ghent University who is willing to act as the supervisor (‘promoter’) of their doctoral", " ", "research and who agrees to support their application", ".", " The best way to do this is by browsing the list of faculties and research topics available on our ", "research directory", "The proposals must be ", "jointly", " submitted by a candidate, a promoter at Ghent University and a supervisor at the partner university.", "No restrictions are imposed on the field of research, nevertheless  preference will be given to topics that are", " relevant for development", "Development relevance relates to the extent to which the proposals’ objectives are consistent with beneficiaries’ requirements, country needs, synergy opportunities, global priorities and partners’ and donors’ policies.", "Candidates need to", " come from", " – and have the ", "nationality", " of – a developing country (see ", "country list", ");", "There must be a ", "guarantee", " that the candidate will be able to work ", "fulltime on the PhD project", " for a period of ", "24 months", " at the ", "partner university", " in a selected developing country (South). This implies that the following conditions needs to be fulfilled:", "there must be a ", "local PhD supervisor at the partner university", " or research center in the South;", "A ", "written  statement", " is requested stating that the candidate is either a ", "funded fulltime PhD student or a staff member at this partner university", "and will be ", "sufficiently exempted", " from teaching or other assignments as to be able to fully concentrate on the ", "PhD research in the South.", "This statement should also mention that the candidate ", "receives a local PhD scholarship or salary", " for a period of ", "24 months", " when working on the PhD at the partner university in the South.", "This cofunding is only intended for students who  want to obtain", " a (joint ) PhD degree at Ghent University .", "Funding", "PhD scholarship", " at Ghent University  (", "24 months", ").", "24 months of PhD research will be executed at the partner university in the South, for which ", "no", " funding is provided through this scholarship. ", "This part of the research (24 months) must be funded (e.g. local PhD scholarship or salary) at the partner institution in the South.", "The Ghent University promoter receives a ", "bench fee", " of €15.440 to cover (part of) the operational costs, as well as part of the travelling costs of the student and both the Ghent University and the local promoter.", "Duration and start date:", "The earliest starting date of the scholarship at Ghent University is ", "1 October 2018", ";", "The candidate obtains a scholarship for ", "24 months to study at Ghent university", ";", "24 months", " of the PhD research/study must be ", "cofinanced ", "at the partner university;", "Students are obliged to divide the Ghent University scholarship into minimum ", "2 different research stays", " in Ghent (North) and need to return at least ", "once to their home university (South) ", " in between (= ", "‘sandwich- schedule’", ");", "At least 12 months", " of the ", "research stay in the South", " must be scheduled ", "after", " ", "the first BOF funded stay in Ghent (North)", " (earliest possible starting date of the BOF funding = 1 October 2018).", "How to apply", "Applications must be submitted on the application forms provided for this purpose.", "The Research Council makes a selection of the applications based in part on the recommendations obtained from members of the Council for Development Cooperation.", "Selection criteria:", "the qualifications of the applicant;", "the doctoral project;", "the relevance of the research topic for development;", "the scientific/scholarly potential of the promoter’s research group(s);", "the partnership between Ghent University and the local institute;", "the scientific/scholarly potential of the local institute.", "For More Information:", "Visit the Official Webpage of the Ghent University Doctoral Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/ghent-university-doctoral-scholarships-2018/"], [["Government of Flanders Master Mind Scholarships Programme 2018/2019 for study in Belgium.", "date announced:January 1, 2018", "0Application Deadline: April 30th 2018"], ["0Application Deadline: April 30th 2018", "The Flemish Ministry of Education awards scholarships", " to outstanding students for Master programmes in Flanders and Brussels. The programme aims to promote Flanders and Brussels as a top study destination.", "Applications will be accepted from all Flemish universities, Schools of Arts and the Antwerp Maritime Academy. It is estimated that 30 to 40 international excellent students can benefit from the ", "Master Mind Scholarships 2018-2019.", "Eligibility Requirements:", "The applicant applies to take up a Master degree programme at a higher education institution in Flanders (hereafter ‘Host institution’).", "The applicant should have a high standard of academic performance and/or potential:", "\no The student has a Grade Point Average of 3.0 out of 4.0: https://www.foreigncredits.com/resources/gpa-calculator/", "\no The student has a sufficient knowledge of the English language:", "\no an overall band score of minimum 7.0 on the IELTS test;", "\no a minimum total score of 100 on a TOEFL test;", "\no a C1 level on the Certificate in Advanced English (CAE);", "\no or a similar result in another official language test.", "\nStudents who apply for a Master programme in Arts have at least:", "\no an overall band score of minimum 6.5 on the IELTS test;", "\no a minimum total score of 90 on the TOEFL test;", "\no a B2 level on the Certificate in Advanced English (CAE);", "\no or a similar result in another official English language test.", "The Host institution also performs an academic check of the student’s file. The student has to be accepted by the Host institution to be able to receive the scholarship even if the Host institution’s decision is taken after awarding the scholarship to the student.", "All nationalities can apply. The previous degree obtained should be from a higher education institution located outside Flanders.", "Students who are already enrolled in a Flemish higher education institution cannot apply", "Student mobility during the master programme is allowed. However, at least half of the credits of the master programme must be obtained at the Flemish Host institution.", "Modalities", "The duration of mobility is minimum 1 academic year (60 ECTS) and maximum the full duration of the master programme (120 ECTS).", "The incoming student is awarded a maximum scholarship of €8.000 per academic year according to the modalities mentioned in the appendix 1 Payment of the scholarship.", "The Host institution can ask the applicant for a tuition fee that equals the rate of the yearly", "\ntuition fee for a student from who receives a study grant from the Flemish Government. The", "\nrate for the academic year 2018-2019 is €108,8. This rate may increase slightly from year to year. The exact applicable rate for 2019-2020 will be communicated to the Master Mind", "\nbeneficiaries before the 1st September 2019.", "There are a number of scholarships reserved for students from certain countries: Japan (3),", "\nMexico (3), USA (5). These countries are priority countries for the Flemish government. If these numbers of scholarships are not taken up, they will be awarded according to the ranking of the candidates as decided by the Flemish Selection committee.", "Students should not combine this fellowship with another scholarship from the Flemish", "\nGovernement.", "Upon completion of the mobility all students are expected to submit an essay for which a", "\nformat is provided and to fill in a short questionnaire about their mobility.", "A maximum of 20 applications can be submitted per higher education institution.", "Application", "\nStep 1: The applicant submits his/her application to the Host institution. Beware of internal", "\ndeadlines set by the Host institution; some institutions have as deadline 15th February 2018!", "\nStep 2: The Host institution accepts the application of the candidate.", "\nStep 3: The Host institution starts the application procedure for the Master Mind scholarship by", "\ncreating the candidate’s application file in the Mobility-Online tool.", "\nStep 4: The applicant receives an email generated by the Mobility-Online tool notifying him/her of being preselected for a Master Mind scholarship.", "\nStep 5: The applicant registers in the Mobility-Online tool and completes his/her application file in the Mobility-Online tool before the deadline.", "Documents to be uploaded:", "\n– Passport photo", "\n– International passport or national registration card", "\n– Transcript of records; if written in another language than Dutch, French or English, a certified", "\ntranslation must be enclosed.", "\n– English language test results or Letter of exemption provided by the Host university", "\n– Letter of motivation written in English", "\n– Two letters of recommendation from professors of your (previous) Home university, University", "\nof Applied sciences, School of Arts or recent employer written in English.", "\n– Copy of acquired diploma(s); if written in another language than Dutch, French or English, a", "\ncertified translation must be enclosed.", "\n– Three reasons of motivation for submission (at least 150 words) of the candidate’s file", "\nformulated by the Host institution in English; format: entry box in the application form or a", "\nseparate document.", "Step 6: The Host institution validates and submits the completed application file in the Mobility-", "\nOnline tool before the deadline of midnight 30th April 2018 GMT+1. Applications validated submitted after midnight 30th April 2018 GMT+1 will not be accepted.", "Selection", "\nIn collaboration with the Flemish Ministry of Education, a Selection Committee will make the", "\nselection after the application deadline, based on the following criteria:", "\no the quality of the applicant’s motivation (30 points);", "\no the applicant’s previous study results in the Transcript of records (30 points);", "\no the reasons for recommending the applicant in Recommendation letter 1 (10 points);", "\no the reasons for recommending the applicant in Recommendation letter 2 (10 points);", "\no motivation for submission by the Host institution (10 points);", "\no top talent profile of the applicant (10 points).", "Deadline for application at Host institution: (available on:", "http://www.studyinflanders.be/en/scholarship-programmes/master-mind-scholarships/", ")", "Deadline for application: 30th April 2018", "Selection: May 2018", "Announcement of selection results: June 2018", "Start of mobility: September 2018", "Should you have questions about the scholarship programme, please contact the Host institution or the VLUHR-secretariat: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Government of Flanders Master Mind Scholarships Programme 2018/2019"], "url : https://www.opportunitiesforafricans.com/government-of-flanders-master-mind-scholarships-programme-2018-2019/"], [["CSIR corporate functions Bursary Programme 2018 for young South Africans (Fully Funded)", "date announced:December 22, 2017", "Requirements:"], [" Application Deadline: January 19th 2018", "To realise how important and powerful science is, it helps to imagine a world without it. There would simply be no improvement. The reason that this world does not exist is because organisations like the CSIR are here. Armed with some of the best minds in the world, we work on trying to solve problems that can help all South Africans and make a significant contribution to the global wealth of knowledge. To achieve this, our scientists, engineers and technologists (SET base) are supported by equally committed employees in our various corporate functions portfolios.", "The ", "CSIR corporate functions Bursary Programme", " aims to build a pipeline and strengthen our capabilities in the corporate functions to ensure business excellence that will foster a conducive environment for the Research, Development and Innovation work to thrive. This bursary is open to academically qualifying young people and also aims to attract", "and increase participation of women and black people. The CSIR hereby invites bursary applications from talented young people wishing to pursue their studies in the following areas:", "BAchElOR Of cOMMERcE – hUMAn RESOURcE", "MAnAGEMEnt (IndUStRIAl PSYchOlOGY)", "BAchElOR Of cOMMERcE – cOMMERcIAl", "labour law", "BAchElOR OR nAtIOnAl dIPlOMA PROjEct MAnAGEMEnt", "BAchElOR OR nAtIOnAl dIPlOMA SUPPlY chAIn MAnAGEMEnt/PROcUREMEnt", "BAchElOR OR nAtIOnAl dIPlOMA SAfEtY MAnAGEMEnt", "BAchElOR Of ScIEncE cOMPUtER ScIEncE", "Requirements:", "If you are a south african citizen who is successfully pursuing the relevant qualification at a south african university or a Grade 12 learner aiming to study for a degree in one of the courses listed above, the Csir support Bursary is for you.", "Grade 12 learners:", "Must be a south african citizen", "a minimum of a level 5 for English first language or a level 4 for English second language", "pursuing to- or already enrolled in any of the areas listed above at a public tertiary institution", "university students:", "• Must be a south african citizen", "• Must have passed all courses for which you have registered at the university for the study period already completed your application must include:", "• Grade 12 final results if you have completed Grade 12", "• academic record if you are a university student", "Benefits:", "A comprehensive bursary that covers all the costs associated with university studies, such as:", "registration fees", "• tuition fees", "• Books", "• accommodation", "• living allowance", "• laptop allowance", "How to Apply:", "To apply for a bursary:", "send your curriculum vitae (cv), academic record and a copy of your identity document to ", "[email protected]", " should you experience any problems in submitting your application, please contact the Csir bursary office on (012) 841 2665.", "For More Information:", "Visit the Official Webpage of the CSIR corporate functions Bursary Programme 2018"], "url : https://www.opportunitiesforafricans.com/csir-corporate-functions-bursary-programme-2018/"], [["Romanian Government Scholarships 2018/2019 for Foreign Citizens to study in Romania (Fully Funded)", "date announced:December 18, 2017", "Application Deadline: March 15th 2018"], ["Application Deadline:", " March 15th 2018", "The scholarship program offered by the Romanian state, through the Ministry of Foreign Affairs, to foreign citizens, based on G.D. 288/1993, for the academic year 2018 – 2019.", "Number of scholarships", ":", "85 scholarships for under- and post-graduate studies in Romania, by means of selection of application files, organized by the Ministry of Foreign Affairs (MFA) and the Ministry of National Education and Scientific Research (hereafter, MNE), in keeping with Romanian current legislation.", "The fields of study are: political and administrative sciences, education sciences, Romanian culture and civilization, journalism, technical studies, oil and gas, agricultural sciences, veterinary medicine, architecture, visual arts.", "Qualification criteria", ":", "foreign citizens coming from all the states of the world, except for EU member states. Foreign citizens of Romanian origin and those belonging to the neighboring historic Romanian communities benefit from other scholarship programs.", "The applicant for the scholarship must not hold Romanian citizenship, did not request or did not obtain a form of protection in Romania, is not a stateless person whose residence on Romanian territory is officially recognized according to the law, is not a member of the diplomatic corps accredited to Bucharest or member of family of the diplomatic corps accredited in Romania, has not benefited from a scholarship from the Romanian state on the same course of study.", "The applicant for the scholarship must present study papers issued by accredited / recognized educational institutions, have ", "good results in education", ", ", "respectively an average of the study years of at least 7 (seven) corresponding to the scoring system in Romania or the “Good” score", ", ", "as the case.", "The applicant for the scholarship ", "has not, until 31 December of the year in which he / she was nominated, more than 35 years of age – for bachelor and master studies and 45 years respectively – for doctoral studies or for postgraduate studies, including health field", ".", "The scholarships are awarded for ", "3 study cycles", ":", "a) for the first cycle (licenta): This scheme is dedicated to graduates of high schools or of equivalent pre-university studies, as well as to candidates who require the continuation of their studies in Romania. The complete cycle of university studies lasts for 3 to 6 years, according to the specific requirements of the chosen faculty, and ends with a final examination (licenta).", "b) for the 2nd cycle (master): This scheme is dedicated to graduates of university/post-graduate studies; it lasts for 1,5 to 2 years and ends with a dissertation.", "c) for the 3rd cycle (doctorate) this scheme is dedicated to the graduates of university/postgraduate studies (i.e. master); it lasts for 3-4 years, in keeping with the specific requirements of the chosen faculty, and ends with a doctor’s thesis. Admission to a PhD course is conditioned by an entrance examination.", "Language of study", ":", "In order to promote the Romanian language and culture among foreign citizens, the beneficiaries of scholarships granted by the Romanian state should study only in the ", "Romanian language", ". The candidates who do not know Romanian are offered one supplementary preparatory year to study the language.", "The following categories of persons are exempted from the obligation to submit the Certificate of graduation of the preparatory year, when enrolling in Romanian language teaching programs:", "a) persons presenting Romanian studies (diplomas and certificates) or educational papers, school situations attesting at least four consecutive years of study followed in the Romanian language, in an educational facility / institution in the Romanian national system;", "b) those who, in order to enroll in university education, promote the Romanian language test organized according to the regulations in force.", "c) those who, for the purpose of enrolling in the university education, have attestations of linguistic competence for the Romanian language, the minimum level B1, issued according to the regulations in force.", "Steps to submit the application files", "Application files must be submitted through diplomatic missions. Application files submitted by post or directly to the MFA or to the MNE, as well as application files received after the announced deadline will not be taken into consideration.", "Application Procedure:", "The registration period begins on ", "15 December 2017", ". The candidate should enquire at the diplomatic mission where he intends to submit the application file about the enrolment calendar. The deadline for submitting the application files is established by each diplomatic mission.", "Foreign diplomatic missions accredited in Bucharest will submit their application files to the MFA – Public Diplomacy, Cultural and Scientific Directorate (DDPCŞ), accompanied by a verbal note, by ", "15 March 2018.", "Incomplete or non-compliant dossiers with the fields of study and methodology are considered disqualified and will not be evaluated by the MFA committee. The files of the rejected candidates following the evaluation of the MFA and MNE committees are not returned. ", "Dossiers filed directly with the MFA or MNE registration offices are not considered", ".", "Documents required completing the file", "The application file must contain the following documents:", "Official letter issued by the diplomatic mission", " of the country of origin accredited to Bucharest or the diplomatic mission of Romania in the country of origin or residence", ";", "The MFA application form (", "Appendix 1", ")", " for a scholarship in Romania, filled in correctly;", "The MNE application form (", "Appendix 2", ") ", "for the issue of the Letter of acceptance to study in Romania;", "Legalized copies of the ", "obtained study diplomas", " (baccalaureate diploma or its equivalent + bachelor’s, master’s and doctor’s degrees, if any) and their legalized translation into one of the following languages: English, French or Romanian, if required", ";", "Legalized copies of ", "matriculation sheets", " / diploma supplements related to graduate studies and their legalized translation, if applicable;", "Legalized copy of ", "the birth certificate ", "and certified translation in one of the following languages: English, French or Romanian", ";", "Copy of the ", "first 3 pages of the passport", ";", "The medical certificate", " attesting to the fact that the person enrolling in the study does not have contagious diseases or other conditions incompatible with the required studies;", "Curriculum Vitae", " of the applicant", ";", "Recent photos", " – 2 pieces, passport format", ".", "The files will also be filled in with the following documents (only for candidates falling within the specific category mentioned for each document):", "Proof of name change (if applicable) – copy and legalized translation;", "The certificate attesting the passing of the baccalaureate, bachelor’s, master’s or doctoral exam, as the case may be, for current year’s graduates – copy and certified translation;", "Certificate of graduation of the Romanian preparatory year or Language Proficiency Certificate, if applicable;", "Declaration on parental consent in case of juvenile candidates (in one of the following languages: English, French or Romanian).", "Announcement of results", "The selection results will be announced ", "by 15 June 2018", ", to each diplomatic mission that has submitted application files to the MFA. ", "For More Information:", "Visit the Official Webpage of the Romanian Government Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/romanian-government-scholarships-2018-2019-for-foreign-citizens/"], [["Government of ​Brunei Darussalam Scholarships 2018/2019 for Foreign Students (Fully Funded to Brunei)", "date announced:January 2, 2018", "Application Deadline: 1600 hrs (Brunei time) on   28 February 2018."], ["Application Deadline: ", "1600 hrs (Brunei time) on ", " ", " ", "28 February 2018.", "The Ministry of Foreign Affairs and Trade", " is pleased to invite applications for the Government of ", "Brunei Darussalam Scholarship", " under the above Scholarship Award Scheme for the 2018/2019 academic session.", "Tenable in Brunei Darussalam, the scholarship award provides applicants with the opportunity to study at any one of the following institutions of higher education:", "·       Universiti Brunei Darussalam (UBD),", "·       Universiti Islam Sultan Sharif Ali (UNISSA),", "·       Universiti Teknologi Brunei (UTB) and", "·       Politeknik Brunei (PB).", "The academic year commences July/August 2018.", "Eligibility Requirements:", "Applications are open to citizens of, but not limited to, ASEAN, Commonwealth and OIC member countries.", "Applicants should be nominated by their Government.", "Applicants must be certified to be medically fit to undertake the scholarship and to study in Brunei Darussalam, by a qualified medical practitioner who is registered with any Government Authority(ies) prior to arrival in Brunei Darussalam.  Any and all costs incurred in obtaining this certification are to be borne by the applicant.", "Applicants must be, between the ages of 18-25 for undergraduate and diploma programmes and must not exceed the age of 35 for postgraduate programmes on the 31", "st", " July 2018.", "The award is NOT eligible to Brunei Darussalam Permanent Residents.", "PROGRAMMES OFFERED AND ENTRY QUALIFICATIONS", "Programmes offered, entry qualifications and any further information are available from the following websites:", "i)     ", "Universiti Brunei Darussalam", " – ", "www.ubd.edu.bn", "ii)    ", "Universiti Islam Sultan Sharif Ali", "– ", "www.unissa.edu.bn", "iii)    ", "Universiti Teknologi Brunei", " – ", "www.utb.edu.bn", "iv)    ", "Politeknik Brunei", " ", "– ", "www.pb.edu.bn", "Scholarship Worth:", "The scholarship recipient will be facilitated with the benefits of the scholarship as follows:", "i)       exemption from paying tuition fees including acceptance, examination, registration and orientation fees for the duration of the programme;", "ii)     an economy class air-ticket to Brunei Darussalam from the scholarship recipient’s country of origin/ country of domicile prior to the commencement of the course and an economy class air-ticket from Brunei Darussalam to the scholarship recipient’s country of origin/country of domicile upon completion of the course;", "iii)    a monthly personal allowance of BND$500.00;", "iv)    a monthly meals allowance of BND$150.00;", "v)     an annual book allowance of BND$600.00;", "vi)    accommodation at the residential college of the University/ Polytechnic;", "vii)   baggage allowance for shipment of the scholarship recipient’s personal effects to his country of origin/country of domicile upon completion of the programme, at a maximum amount of:", "·       BND$250.00 to a country within the ASEAN region; or", "·       BND$500.00 to a country outside the ASEAN region;", "viii)  comprehensive insurance cover for the whole duration of the Scholarship. The scholarship recipient is urged to obtain additional insurance prior to his travel to Brunei Darussalam and for the whole duration of the Scholarship at his own expense.", "Application Procedure:", "Application forms can be downloaded from the following link:", "APPLICATION FORM 2018-2019", "Application forms must be duly completed and endorsed by the Ministry of Foreign Affairs or the National Focal Point for scholarships of the applicant’s country.", "Applicants are required to also submit a security clearance statement from their National Security Agency(ies)/ Police Station (i.e. a statement/ report certifying that applicants are clear from any civil and criminal charges).", "Completed application forms are to be emailed to the following address:", "[email protected]", "Applicants applying to Univeristi Brunei Darussalam must also complete an online application through ", "https://apply.ubd.edu.bn/orbeon/uis-welcome/", "Incomplete application forms will not be considered.", "The closing date for the reception of completed application forms, together with certified copies of relevant certificates and documents is, ", "not later than 1600 hrs (Brunei time) on ", " ", " ", "28 February 2018.", "For further enquiries please contact:", "Technical Assistance Unit", "\nDepartment of Administration", "\nMinistry of Foreign Affairs and Trade", "\nBandar Seri Begawan BD2710", "\nBrunei Darussalam", "Tel: +673 2261177 ext. 155", "\nFax: + 673 2261250", "\nE-mail: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Government of ​Brunei Darussalam Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/government-of-%e2%80%8bbrunei-darussalam-scholarships-2018-2019/"], [["Sanlam Bursary Scheme 2018 for young Namibian Undergraduates", "date announced:December 26, 2017", "Application Deadline: January 12th 2018"], ["Application Deadline: January 12th 2018", "Sanlam can help you shape your future through its bursary scheme. If you are enrolled for an undergraduate diploma/degree at a university in Namibia and are performing outstandingly, Sanlam invites you to submit your application.", "Courses supported by Scheme", "Accounting & Finance", "Commerce", "Business Computing and IT", "Human Resources", "Actuarial Science", "Marketing", "Business Administration", "Eligibility Requirements", "Namibian Citizens, in their second, third or final year, with a 75% average and without prior financial assistance.", "Previously disadvantaged Namibian citizens are encouraged to apply.", "Interested candidates should send a motivational letter together with latest results and copy of ID to Sanlam Marketing Department", "E-Mail: ", "[email protected]", "\nTel: (+264 61) 294 7528", "Only shortlisted candidates will be contacted.", "For More Information:", "Visit the Official Webpage of the Sanlam Bursary Scheme", "https://www.sanlam.co.za/careers/Pages/bursaries.aspx"], "url : https://www.opportunitiesforafricans.com/sanlam-bursary-scheme-2018/"], [["Commonwealth Split-site (PhD) Scholarships 2018 (for low and middle income countries) to Study in the UK (Fully Funded)", "date announced:December 19, 2017", "Application Deadline: 23.59 (GMT) on 15 February 2018"], ["Application Deadline: 23.59 (GMT) on 15 February 2018", "Commonwealth Split-site Scholarships are for PhD candidates from low and middle income Commonwealth countries,", " to spend up to 12 months at a UK university as part of their doctoral studies in their home country.", "Funded by the ", "UK Department for International Development (DFID)", ", Commonwealth Split-site Scholarships enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those who could not otherwise afford to study in the UK. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be registered for a PhD at a university in your home country by the time your scholarship is confirmed. Your final qualification will be awarded by your home country university (not your proposed UK university). This scholarship will not support your period of study at your home country university.", "Ensure that an institutional or departmental link exists between your home university and your proposed UK university. This link must be greater than simply a collaboration between individuals.", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2018", "By October 2018, hold a first degree of at least upper second class (2:1) honours standard, or a second class degree and a relevant postgraduate qualification (usually a Master’s degree)", "Be unable to afford to study in the UK without this scholarship", "Eligible Commonwealth countries", "Antigua and Barbuda", "\nBangladesh", "\nBelize", "Botswana", " Cameroon", "\nDominica", "\nFiji", "Ghana", "\nGrenada", "\nGuyana", "\nIndia", "\nJamaica", "Kenya", "\nKiribati", "Lesotho", " Malawi", "\nMalaysia", "Mauritius", "\nMontserrat", "Mozambique", " Namibia", "\nNauru", "Nigeria", "\nPakistan", "\nPapua New Guinea", "\nPitcairn Islands", "Rwanda", "\nSamoa", "\nSeychelles", "Sierra Leone", "\nSolomon Islands", "South Africa", "\nSri Lanka", "\nSt Helena", "\nSt Lucia", "\nSt Vincent and the Grenadines", "Swaziland", " Tanzania", "\nTonga", "\nTuvalu", "\nUganda", "\nVanuatu", "Zambia", "Scholarship Worth:", "Each scholarship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor usually the cost of journeys made before your award is finally confirmed)", "Approved tuition fees", "Stipend (living allowance) at the rate of £1,065 per month, or £1,306 per month for those at universities in the London metropolitan area (rates quoted at 2017-2018 levels)", "Warm clothing allowance, where applicable", "Study travel grant towards the cost of study-related travel within the UK or overseas", "If you are widowed, divorced, or a single parent, child allowance of £458 per month for the first child, and £112 per month for the second and third child under the age of 16, if you are accompanied by your children and they are living with you at the same address in the UK", "The CSC’s family allowances are intended to be only a contribution towards the cost of maintaining your family in the UK. The true costs are likely to be considerably higher, and you must be able to supplement these allowances in order to support any family members who come to the UK with you.", "HOW TO APPLY", "You should apply to study at a UK university which has a part funding agreement with the CSC. Part funding agreements are at the discretion of individual universities. For a list of universities that have agreed to part fund Commonwealth Scholarships, visit ", "http://cscuk.dfid.gov.uk/apply/uk-universities/part-funding", "You must make your application directly to the CSC using the CSC’s Electronic Application System (EAS). The CSC will not accept any applications that are not submitted via the EAS. Information on how to use the EAS, including detailed guides, is available at ", "http://cscuk.dfid.gov.uk/apply/split-site-scholarships-low-middle-income-countries", "All applications, including full transcripts detailing all your higher education qualifications (with certified translations if not in English), must be submitted by 23.59 (GMT) on 15 February 2018 at the latest.", "You are advised to complete and submit your application as soon as possible, as the EAS will be very busy in the days leading up to the application deadline.", "You must provide the following supporting documentation, which must be received by the CSC by 23.59 (GMT) on 19 February 2018 in order for your application to be eligible for consideration:", "Supporting statement from your supervisor at your home country university, highlighting current institutional links", "Supporting statement from your proposed supervisor at a UK university, highlighting current institutional links", "Reference from at least one other individual", "Copy of your valid passport showing your photograph, date of birth, and country of citizenship", "You are not required to apply via a nominating body for these scholarships.", "How to use the EAS", "You are not required to apply via a nominating body for these scholarships.", "Please note that the CSC does not charge candidates to apply for any of its scholarships or fellowships through its Electronic Application System (EAS), and it does not charge organisations to nominate candidates.", "For More Information:", "Visit the Official Webpage of the Commonwealth Split-site (PhD) Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/commonwealth-split-site-phd-scholarships-2018/"], [["Ernst Mach Grants 2018/2019 for Young Researchers to study in Austria (Funded)", "date announced:December 15, 2017", "Application Deadline: March 1st 2018"], ["Application Deadline: March 1st 2018", "The ", "Ernst Mach Grants", " ", "are named after the famous Austrian physicist and philosopher Ernst Mach (1838-1916). The grant program is financed by the ", "Austrian Federal Ministry of Science, Research and Economy (BMWFW).", "  Students and young researchers from foreign universities are invited to apply for this grant to come to Austria for a research or a study stay. Every year a board of representatives of the Austrian Ministry awards the Ernst Mach Grants based on the results of an expert examination procedure. Age limit for this grant program is 35 years at the time of the application.", "Funding organisation:", "OeAD-GmbH/ICM on behalf of and financed by the Federal Ministry of Science, Research and Economy (BMWFW)"], "url : https://www.opportunitiesforafricans.com/ernst-mach-grants-2018-2019-for-young-researchers/"], [["American College of Surgeons International Guest Scholarships 2018/2019 for young surgeons to study in USA (funded)", "date announced:December 13, 2017", "Application Deadline: July 2, 2018,"], ["Application Deadline: ", "July 2, 2018", ",", "The ", "American College of Surgeons", " offers", " International Guest Scholarships to young surgeons", " from countries other than the United States or Canada who have demonstrated strong interests in teaching and research. The scholarships, in the amount of $10,000 each, provide the scholars with an opportunity to visit clinical, teaching, and research activities in the U.S. and Canada and to attend and participate fully in the educational opportunities and activities of the American College of Surgeons Clinical Congress.", "This scholarship endowment was originally provided through the legacy left to the College by Paul R. Hawley, MD (FACS Hon), former College Director. More recently, gifts from the family of Abdol Islami, MD (FACS), the", " Stavros Niarchos Foundation", ", and others to the International Guest Scholarship endowment have enabled the College to expand the number of scholarship awards.", "Basic Requirements", "Applicants must be graduates of schools of medicine who have completed their surgical training.", "Applicants must be at least 35 years old, but under 50, on the date that the completed application is filed.", "Applicants must submit their applications from their intended permanent location. Applications will be accepted for processing only when the applicants have been in surgical practice, teaching, or research for a minimum of one year at their intended permanent location, following completion of all formal training (including fellowships and scholarships).", "Applicants must have demonstrated a commitment to teaching and/or research in accordance with the standards of the applicant’s country.", "Early careerists are deemed more suitable than those who are serving in senior academic appointments.", "Applicants must submit a fully completed application form provided by the College on its website. The application and accompanying materials must be submitted in English. Submission of a curriculum vitae only is not acceptable.", "Applicants must provide a list of all of their publications and must submit, in addition, three complete publications (reprints or manuscripts) of their choice from that list.", "Preference may be given to applicants who have not already experienced training or surgical fellowships in the U.S. or Canada.", "Applicants must submit independently prepared letters of recommendation from three of their colleagues. One letter must be from the chair of the department in which they hold an academic appointment or a Fellow of the American College of Surgeons residing in their country. The chair’s or the Fellow’s letter is to include a specific statement detailing the nature and extent of the teaching and other academic involvement of the applicant. Letters of recommendation should be submitted by the person making the recommendation.", "The online application form is structured to assist the Scholarship Selection Subcommittee and assists the applicant in submitting a structured curriculum vitae.", "The International Guest Scholarships must be used in the year for which they are designated. They cannot be postponed.", "Applicants who are awarded scholarships will provide a full written report of the experiences provided through the scholarships upon completion of their tours.", "An unsuccessful applicant may reapply only twice and only by completing and submitting a new application together with new supporting documentation.", "Financial Support", "The scholarships provide successful applicants with the privilege of participating in the College’s annual Clinical Congress held in San Francisco, CA, in October 2019, with public recognition of their presence.", "They will receive gratis admission to selected postgraduate courses plus admission to all lectures, demonstrations, and exhibits, which are an integral part of the Clinical Congress. Assistance will be provided in arranging visits, following the Clinical Congress, to various clinics and universities of their choice. In order to qualify for consideration by the selection committee, all of the requirements must be fulfilled.", "Application Procedure", "Completed applications for the International Guest Scholarships for the year 2019 and all of the supporting documentation must be received online prior to ", "July 2, 2018", ", in order for an applicant to receive consideration by the selection committee.", "All applicants will be notified of the selection committee’s decision in November 2018.", "Applicants are urged to submit their completed applications and supporting documents as early as possible in order to provide sufficient time for processing.", "Questions about and application materials for this scholarship should be sent to ", "[email protected]", ".", "Requirements and overview", "Apply online", "International Guest Scholarship Award Recipients 1968–2014", "Conflicts of Interest Disclosure Form", " ", "For More Information:", "Visit the Official Webpage of the American College of Surgeons International Guest Scholarships "], "url : https://www.opportunitiesforafricans.com/american-college-of-surgeons-international-guest-scholarships-2018/"]]