[[["Lady Barbara Judge Scholarship 2019 for South African Black Women", "date announced:December 3, 2018", "Application Deadline: 16:00 (UK local time) on Thursday, 31 January 2019."], ["Application Deadline: ", "16:00 (UK local time) on Thursday, 31 January 2019", ".", "The Lady Barbara Judge Scholarship", " will be awarded to one ", "South African Black Women", " who has received and accepted an offer of admission to one of the following eligible Masters Programmes at SOAS.", "The total value of the scholarship is £5,000, which will be used towards tuition fees. The scholarship award will be placed in the candidate’s online SOAS account and they will pay a reduced fee for each module upon registration. In 2018/2019 the portion that the student will be responsible for equates to £900 per module. Modest increases in module fees during the students registration are possible.", "Eligible Programmes", "MSc Climate Change and Development (Distance Learning Programme)", "MSc Sustainable Development (Distance Learning Programme)", "Candidate Criteria", "Be ordinarily resident in or a citizen of South Africa", "Must identify as a Black female", "Applicants must be starting in April 2019", "Applicants must hold an offer to pursue one of the eligible degree programme at SOAS by the scholarships deadline", "Applicants ", "must meet the English language condition", " of their offer of admission to study at SOAS as soon as possible. If your offer is conditional on English, please arrange your English test and ensure you meet the English requirements as soon as possible", "A student who withdraws, cancels, is suspended, or dismissed from the University will lose their scholarship eligibility", "The student must complete their programme of study within the five-year registration period", "Candidate Assessment", "Candidates will be shortlisted and assessed by a Selection Panel consisting of three staff members from the Centre of Development, Environment and Policy at SOAS University of London", "Applications will be assessed on academic merit along with the information supplied in the supporting statement", "Notification of Results", "Successful candidates will be notified by 16 February 2019. The offer will outline any conditions required to be met. If you have not heard from us by this date, you should assume your application was unsuccessful", "Once the scholarship award is issued, candidates must accept their offer, enrol on their first module by 29 March 2019 and be ready to start the programme 16 April 2019", "A student who declines an initial offer of admission and accompanying scholarship offer will not retain their scholarship offer if they choose to re-apply at a later date.", "Scholarships cannot be deferred to a future date", "Scholarships are non-transferrable and apply only to CeDEP programmes of study", "Scholarship Application Deadline & Application Material", "Scholarship applications must be received no later than ", "16:00 (UK local time) on Thursday, 31 January 2019", ".", "Late or incomplete applications will not be considered", "Scholarship Application Procedures", "Applicants should follow do the following:", "Applicants should apply for the programme according to ", "SOAS University of London’s application procedures", ". No separate scholarship application form is required. All applicants who meet the eligibility criteria will be considered.  As part of the application you will need to submit a 500-word supporting statement which will demonstrate how the scholarship will effectively support the completion of your studies and meaningfully contribute to the development and economic policies in the region.", "For More Information:", "Visit the Official Webpage of the Lady Barbara Judge Scholarship for Women"], "url : https://www.opportunitiesforafricans.com/lady-barbara-judge-scholarship-2019-for-south-african-black-women/"], [["Mobile telecommunication company (MTC) Bursary Programme 2019 for young Namibians", "date announced:December 5, 2018", "Application Deadline: 4th January 2019"], ["Application Deadline: ", "4th January 2019", "Mobile Telecommunications Limited", " is Namibia’s leading telecommunications company, with over 2,500,000 active subscribers. MTC now provides coverage to all major towns in Namibia and reaches an estimated 95% of the population.", "MTC invites qualifying students to apply for an MTC Bursary.", "Requirements:", "Namibian Citizenship", "Registration at recognized tertiary institution within SADC", "Primarily second year students", "Over 70% average academic performance during the 2018 academic year", "Qualifying courses:", "2nd Year Bachelor’s Degree in IT – Software Development", "2nd Year Bachelor’s Degree in IT Networks (majoring in Microsoft MCSE, Security or IP Networks)", "2nd Year Bachelor’s Degree in Cloud Full Stack Development", "Scope of Bursary:", "All is inclusive within the scope of the MTC Bursary Programme.", "A written motivation with comprehensive CV and academic records must be submitted to:", "MTC Head Office", "Att: Loide Martin", "E-mail address: ", "[email protected]", "P O Box 23051, WINDHOEK", "C/O Mose Tjitendero & Hamutenya Wanahepo Ndadi Streets", "Olympia, WINDHOEK", "Application forms available at MTC Head Office reception, MobileHomes countrywide or ", "here", ".", "Application closing date: 4th January 2019.", "Namibians from previously disadvantaged groups with strong academic track records who are in need of financial assistance are encouraged to apply.", "Only short listed candidates will be contacted.", "For More Information:", "Visit the Official Webpage of the MTC Bursary Programme 2019 "], "url : https://www.opportunitiesforafricans.com/mtc-bursary-programme-2019/"], [["Ghent University Doctoral Scholarships 2019 for Candidates from Developing Countries to study in Belgium (Funded)", "date announced:November 13, 2018", "Application Deadline:March 4th 2019"], ["Application Deadline:", "March 4th 2019", "With support from its ", "“Special Research Fund” (BOF), Ghent University", " grants ", "PhD scholarships", " to promising PhD students from developing countries who wish to carry out ", "half of their PhD research at Ghent University and half in a university in a developing country.", "Requirements:", "Before applying for a PhD scholarship at Ghent university students Always need to find a professor from Ghent University who is willing to act as the supervisor (‘promoter’) of their doctoral", " ", "research and who agrees to support their application", ".", " The best way to do this is by browsing the list of faculties and research topics available on our ", "research directory", "The proposals must be ", "jointly", " submitted by a candidate, a promoter at Ghent University and a supervisor at the partner university.", "No restrictions are imposed on the field of research, nevertheless  preference will be given to topics that are", " relevant for development", "Development relevance relates to the extent to which the proposals’ objectives are consistent with beneficiaries’ requirements, country needs, synergy opportunities, global priorities and partners’ and donors’ policies.", "Candidates need to", " come from", " – and have the ", "nationality", " of – a developing country (see ", "country list", ");", "There must be a ", "guarantee", " that the candidate will be able to work ", "fulltime on the PhD project", " for a period of ", "24 months", " at the ", "partner university", " in a selected developing country (South). This implies that the following conditions needs to be fulfilled:", "there must be a ", "local PhD supervisor at the partner university", " or research center in the South;", "A ", "written  statement", " is requested stating that the candidate is either a ", "funded fulltime PhD student or a staff member at this partner university", "and will be ", "sufficiently exempted", " from teaching or other assignments as to be able to fully concentrate on the ", "PhD research in the South.", "This statement should also mention that the candidate ", "receives a local PhD scholarship or salary", " for a period of ", "24 months", " when working on the PhD at the partner university in the South.", "This cofunding is only intended for students who  want to obtain", " a (joint ) PhD degree at Ghent University .", "Funding", "PhD scholarship", " at Ghent University  (", "24 months", ").", "24 months of PhD research will be executed at the partner university in the South, for which ", "no", " funding is provided through this scholarship. ", "This part of the research (24 months) must be funded (e.g. local PhD scholarship or salary) at the partner institution in the South.", "The Ghent University promoter receives a ", "bench fee", " of €15.440 to cover (part of) the operational costs, as well as part of the travelling costs of the student and both the Ghent University and the local promoter.", "Duration and start date:", "The earliest starting date of the scholarship at Ghent University is ", "1 October 2019", ";", "The candidate obtains a scholarship for ", "24 months to study at Ghent university", ";", "24 months", " of the PhD research/study must be ", "cofinanced ", "at the partner university;", "Students are obliged to divide the Ghent University scholarship into minimum ", "2 different research stays", " in Ghent (North) and need to return at least ", "once to their home university (South) ", " in between (= ", "‘sandwich- schedule’", ");", "At least 12 months", " of the ", "research stay in the South", " must be scheduled ", "after", " ", "the first BOF funded stay in Ghent (North)", " (earliest possible starting date of the BOF funding = 1 October 2019).", "How to apply", "Applications must be submitted on the application forms provided for this purpose.", "The Research Council makes a selection of the applications based in part on the recommendations obtained from members of the Council for Development Cooperation.", "Selection criteria:", "the qualifications of the applicant;", "the doctoral project;", "the relevance of the research topic for development;", "the scientific/scholarly potential of the promoter’s research group(s);", "the partnership between Ghent University and the local institute;", "the scientific/scholarly potential of the local institute.", "For More Information:", "Visit the Official Webpage of the Ghent University Doctoral Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/ghent-university-doctoral-scholarships-2019/"], [["ICTP Postgraduate Diploma Scholarship Programme 2019/2020 for young physicists and mathematicians for Developing Countries", "date announced:December 3, 2018", "Application Deadline: 28 February 2019"], ["Application Deadline:", " 28 February 2019", "ICTP", " is ", "now accepting applications", " from", " young physicists and mathematicians", " for the 2019-2020 class of the ", "Postgraduate Diploma Programme", ". The one year course of study prepares talented students for PhD studies, as part of the Centre’s efforts to promote advanced scientific research in developing countries. Each successful class of Postgraduate Diploma students helps bring this dream to life.", "Students have gone on to PhD programmes all over the world, launching them into successful scientific careers. Two semesters of classes are followed by a research project and dissertation. Interested students can apply to study in one of five subject areas:", "High Energy, Cosmology and Astroparticle Physics", "Condensed Matter Physics", "Earth System Physics", "Mathematics", "Quantitative Life Sciences ", "Requirements:", "The Programme is open to young (generally below 28 years of age) qualified graduates, with a degree equivilent to an MSc in physics, mathematics, or in a related field, and fluency in English.", "In each Postgraduate Diploma Programme subject area, scholarships and travel grants will be awarded to those 10 students selected from developing countries.", "There are no course fees.", "Application and Admission", "NEW: Applications are now being accepted for the 2019-2020 academic year! Deadline is 28 February 2019. ", "Apply online", ".", "Qualifications and Scholarships", "The Postgraduate Diploma Programme is open to young (generally below 28 years of age), qualified graduates from all countries that are members of the United Nations, UNESCO or IAEA.", "The minimum qualification for applicants is a degree equivalent to an MSc (or an exceptionally good BSc) in physics, mathematics or in a field related to the topics listed below. The selection of candidates will be based on their university record and on academic recommendations.", "Since the Postgraduate Diploma Programme is in English, fluency in speaking and writing is an essential qualification.", "The applicant is expected to have adequate knowledge of the following topics in the specific field for which he/she is applying:", "For Condensed Matter Physics", ": solid state physics; quantum mechanics; statistical mechanics; classical mechanics; electrodynamics; mathematical physics.", "For High Energy, Cosmology and Astropartical Physics", ": classical mechanics; electrodynamics; special theory of relativity; quantum mechanics; statistical mechanics.", "For Earth System Physics", ": a theoretical background in physics, mathematics or engineering; mathematical methods applied in geophysics and geosciences.", "For Mathematics", ": basic abstract algebra; elements of real and complex analysis; topology.", "For Quantitative Life Sciences", ": classical mechanics, thermodynamics and statistical mechanics, mathematical methods for physics, basic programming skills", "In each Postgraduate Diploma Programme, scholarships and travel grants will be awarded to those 10 students selected from developing countries. There are no course fees.  Students will receive a scholarship of 450 Euro per month for the entire year of study. Accommodation is provided by ICTP.", "A limited number of qualified candidates who meet the same selection criteria as others may attend the courses at their own cost. They must supply written evidence from a funding agency or a banking institution that funds are available for their entire year’s stay, and are equal to those offered by the Centre.", "Application", "In addition to completing an ", "online application form", ", candidates should upload the following as part of their application:", "Copies of transcripts of university academic records and university degrees in English (The selected candidates will be required to provide originals or certified copies of these documents as well as of their official English translation before he/she can be admitted to the Programme).", "Any certificates or documents that give proof of the student’s ability to follow advanced-level courses, study and write scientific literature in the English language.", "Two letters of recommendation, from senior scientists familiar with the applicant’s studies and work.", "If you have problems with the online application, please contact the Diploma Office at ", "[email protected]", ".", "The deadline to apply is 28 February 2019, and you can ", "apply online", ".", "For More Information:", "Visit the Official Webpage of the ICTP 2019/2020 Postgraduate Diploma Programme"], "url : https://www.opportunitiesforafricans.com/ictp-postgraduate-diploma-scholarship-programme-2019-2020-for-young-physicists-and-mathematicians-for-developing-countries/"], [["Obama Foundation Scholars Program 2019/2020 for emerging leaders to study at the University of Chicago (Fully Funded)", "date announced:December 8, 2018", "Application Deadline: January 1st 2019"], ["Application Deadline: January 1st 2019", "The Obama Foundation Scholars Program", " seeks to support dynamic, collaborative, rising leaders from around the world in an innovative one-year academic experience.", "The Obama Foundation Scholars Program", " will give rising young leaders around the world who are already making a difference in their communities the opportunity to take their work to the next level through a newly designed curriculum that brings together academic, skills-based, and hands-on learning. The Scholars Program empowers individuals with a proven commitment to service with the tools they need to make their efforts more effective, to identify innovative solutions to complex global problems, and promote change through values-based leadership.", "The program will build lasting relationships among emerging leaders who are committed to working together to solve the most pressing challenges of our time, creating a global network that reaches across issues and borders. After completing the program, Obama Foundation Scholars will return to their communities and continue the important work they started in the program by implementing their own personalized action plan. They will also have an opportunity to play a role in the Obama Foundation’s efforts to inspire, train, and connect rising leaders from around the globe.", "Obama Foundation Scholars at the University of Chicago", " will earn a Master of Arts degree focused on International Development and Policy at the ", "University of Chicago Harris School of Public Policy.", "Benefits:", "In addition to classroom studies, the Obama Foundation will offer a robust program of leadership development and service activities throughout the academic year to help Scholars gain the real-world skills, tools, and experiences to expand the impact of their work when they return home.", "These may include leadership development convenings; program experiences in New York and Washington, DC; speaker series with innovators across a variety of sectors; individual and group service projects; mentorship through the Obama Foundation network; potential internship placements; and action plan development for post-program activities.", "Some of these Foundation activities will include experiences throughout Chicago and the South Side. By engaging with the local community, students will have the opportunity to complement what they learn in the classroom and also to bring their unique perspectives to Chicago.", "For More Information:", "Visit the Official Webpage of the Obama Foundation Scholars Program 2019 "], "url : https://www.opportunitiesforafricans.com/obama-foundation-scholars-program-2019-university-of-chicago/"], [["Tanzanian-German Centre for Eastern African Legal Studies (LLM) Scholarships 2019/2020 for East African Lawyers (Funded)", "date announced:December 3, 2018", "Application Deadline: 15th January 2019."], ["Application Deadline: 15th January 2019.", "Applications for the ", "TGCL (LLM) Scholarships 2019/2020 program", " are now being accepted", "Tanzanian-German Centre for Eastern African Legal Studies (TGCL)", " invites applications from candidates from the East African Community Partner States (i.e. ", "Burundi, Kenya, Rwanda, South Sudan, Tanzania and Uganda", ") for LLM studies ", "starting 1", "st", " November 2019.", "The candidates will pursue an LLM programme on East African Community Law and Regional Integration Law. The programme takes one year of full-time attendance.", "\nOn successful completion of the programme, a student will obtain a Master of Laws degree from the University of Dar es Salaam and an additional TGCL Certificate.", "Research Agenda of the TGCL", "There is a significant research component to the LLM programme in the form of a dissertation. All LLM dissertations must focus on East African Community law (EAC law), if possible, in relation to the student’s national law.", "Scholarships", "\nThe TGCL will award scholarships to applicants from EAC Partner States only which will cover:", "the university fees and TGCL fees for the LLM programme;", "a reasonable health insurance; and", "a cost of living stipend of 3,360 EUR for one year", "Mode of Application", "The applicant must register online through the TGCL website and submit the following documents electronically:", "a signed curriculum vitae with clear evidence of periods of legal and other relevant education, training and practical experience. It is compulsory to use the Europass CV template (http://europass.cedefop.europa.eu).", "a one-page letter of motivation", "certified photocopies of all relevant certificates (birth certificate, school leaving certificates, academic transcripts, certificates of legal or other professional education, including provisional results for applicants who are in the final year of their LLB studies); in the case of documents not written in English, an official translation should be attached", "a recent passport picture", "a release letter from your employer (if you are employed)", "a proposal of the intended research (1,500 words) – see annexed guidelines. It is important to include your name on the proposal.", "Application for Admission to the University of Dar es Salaam", "This advertisement is for scholarships offered by the TGCL. Admissions to the University of Dar es Salaam are made by the University administration separately and independently.", "TGCL scholarships can be granted only to candidates admitted for studies at the University of Dar es Salaam.", "TGCL will inform successful scholarship applicants early enough to allow them to apply for admission in the University of Dar es Salaam.", "They will have to follow up postgraduate admission advertisements at the University of Dar es Salaam website and apply for admission as soon as the same is posted.", "An applicant must consider the following general points when drafting the research proposal:", "A comprehensive and thorough reading of relevant materials is necessary as part of the preparation for an acceptable research proposal.", "The topic and the research proposal should be on a very specific legal problem within a particular area of law. It is therefore advised to avoid general topics such as “A comparison of trade law in Tanzania and Kenya in the light of EAC law” or “The relevance of the rule of law in East Africa” as they are too broad and unspecific.", "The proposal should contain a detailed outline which reveals the intended structure of the dissertation.", "The proposal should be accompanied by a bibliography containing the most significant primary sources and secondary literature in the field with precise references.", "The proposal shall not exceed 1,500 words and must include your name at the top of the paper.", "For More Information:", "Visit the Official Webpage of the Tanzanian-German Centre for Eastern African Legal Studies (LLM) Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/tanzanian-german-centre-for-eastern-african-legal-studies-llm-scholarships-2019-2020/"], [["Wells Mountain Foundation Empowerment Through Education Scholarship 2019 for Developing Country Nationals", "date announced:December 4, 2018", "Application Deadline: April 1st 2019"], ["Application Deadline: April 1st 2019", "WMF’s signature program, Empowerment Through Education (ETE),", " provides undergraduate scholarships to ", "developing country nationals", " to study in their home country or a neighboring country. WMF believes it is important to educate people locally and to encourage WMF Scholars to become change agents in their local communities.", "The Ideal Candidate – A student, male or female, from a country in the developing world who:", "Successfully completed a secondary education, with good to excellent grades", "Will be studying in his or her country or another country in the developing world", "Plans to live and work in his or her own country after graduation", "Has volunteered prior to applying for this scholarship and/or is willing to volunteer while receiving the WMI scholarship", "May have some other funds available for his or her education, but will not be able to go to school without a scholarship", "The scholarship awards are determined by the board of directors of the Wells Mountain Initiative and awarded once a year. Applications must be received by April 1 of each year to be considered for the following academic year. The selected WMI Scholarship recipients will be emailed on August 1.", "Application Procedure:", "Before applying, we strongly encourage you to read the ", "WMI Scholar Program Information Sheet", " and also the ", "Frequently Asked Questions for Prospective Scholars", " document. These two documents will assist you in determining your eligibility and guide you in the application process.", "The following are required elements for an application to be considered complete:", "Clear personal photo", "Two essays (topics are stated on application form)", "2019 application form", "Personal essay statement", "Two recommendation letters*", "Official transcript of grades from secondary school", "Official grading key to interpret secondary school grades**", "Official transcript of grades from tertiary studies (if applicable)", "Official grading key to interpret tertiary grades**", "Official results from your national exam", "Official grading key to interpret scores on your national exam**", "How to Apply", "If you qualify, now is the time to apply for this exciting opportunity! Since 2005, we have supported more than 345 students worldwide. Please note that in our recent years, we have only been able to select approximately 5% of applicants to become a part of this program.", "The number we select is based solely upon limited funding, as nearly all applicants are extremely deserving. As our organization grows, so will the number of WMI Scholars we can accept each year. We encourage you to apply AND to continue searching for additional ways to finance your education.", "There are two ways to apply: Online, or by mailing in a completed application packet to our office.", "APPLYING ONLINE:", " You will be redirected to a portal where you will be asked to create a free account (username and password), fill out information and upload documents. We strongly suggest that you apply online as it will provide you with the opportunity to save your work and return multiple times. You will also guarantee that your application, once submitted online, will be received and reviewed.", "File format types accpeted are: JPG, PNG, GIF, DOC, DOCX, PDF (version 10 or newer).", "For More Information:", "Visit the Official Webpage of the Wells Mountain Foundation Empowerment Through Education Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/wmf-empowerment-through-education-scholarship-2019/"], [["Bilateral Education Agreement (BEA) Scholarship Awards 2019/2020 for Nigerians to Study Abroad (funded)", "date announced:December 7, 2018", "Application Deadline: 19TH JANUARY 2019"], ["Application Deadline: 19TH JANUARY 2019", "The Honourable Minister of Education (HME), Mallam Adamu Adamu,", " hereby invites interested and qualified Nigerians to participate in the 2019/2020 Nomination ", "computer Based Test (CBT) for the ", "Federal Government Scholarship Awards", " for:", "BILATERAL EDUCATION AGREEMENT (BEA)", "\ni) Undergraduate (UG) studies tenable in Russia, Morocco, Algeria, Serbia, Hungary, Egypt, Tunisia, Turkey, Cuba, Romania, Ukraine, Japan, Macedonia; and", "\nii) Postgraduate (PG) studies tenable in Russia (for those whose first degrees were obtained from Russia), China, Hungary, Serbia, Turkey, Japan, Mexico, South Korea.", "\n2.0 All qualified candidates are advised to:", "\na. Visit Federal Ministry of Education’s website www.education.gov.ng and click on READ MORE on Federal Scholarship Board ICON on the Home Page:", "\n. b. Read Guidelines and then Complete the Application Form online", "\nc. Print the completed Application Form", "\nd. Submit two sets of the Printed Application Forms at the venue of the interview as scheduled below.", "\n3.0 FIELDS OF STUDY", "\na. Undergraduate level – Engineering, Geology, Agriculture, Sciences, Mathematics, Languages, Environmental Sciences, Sports, Law, Social Sciences, Biotechnology, Architecture, Medicine (very limited), etc; and", "\nb. Postgraduate level (Masters Degree and Ph.D) in all fields.", "Eligibility Requirements:", "UNDERGRADUATE SCHOLARSHIPS:", "All applicants for undergraduate degree courses must possess a minimum qualification of Five (5) Distinctions (As & Bs) in the Senior Secondary School Certificates, WAEC (May/June) only in the subjects relevant to their fields of study including English Language and Mathematics. Certificates should not be more than Two (2) years old (2017& 2018)for African countries the age of certificate is one year (2018) only. Age limit is from 18 to 20 years.", "POSTGRADUATE SCHOLARSHIPS:", "All applicants for Undergraduate degree courses must hold a First Class (1st Degree with at least 2nd Class Upper Division. The applicants who are previous recipients of Foreign Awards must have completed at least two (2) years post qualification or employment practice in Nigeria. All applicants must have completed N.Y.S.C. Age limit is 35 years for Masters and 40 years for Ph.D. and only:", "\ni) N.Y.S.C discharge or exemption certificates only are accepted;", "ii) Evidence of readiness to be released by employer.", "\nNOTE (For all Applicants):", "\ni) Since the BEA countries are non-English speaking, applicants should be prepared to undertake a mandatory one year foreign Languare course of the country of choice which will be the standard medium of instruction;", "\nii) Japan applicants must have very strong background in further mathematics;", "\niii) The required certificates for candidates applying for Iman Preachers and Quaranic Professor for Islamic Religious studies in Algeria is WAEC as in other scholarship awards;", "\niv) All applicants for Hungarian Scholarship can apply for up to two fields of study in order of preference; and", "\nv) All applicants for Hungarian Scholarships must visit the website: www.stipendiumhungaricum.hu before 15th january, 2019.", "\nComplete the application form online", "Print the completed form and bring to the interview venue in addition to 2.0 above.", "VENUE OF INTERVIEW:", "All eligible applicants are to report for interview at the venues scheduled for accredidation a day to the date scheduled for examination. Two sets of completed application forms should be submitted at the various JAMB CBT centres with the following attachments:", "\ni. Two sets of Photocopies of Educational Certificates and Testimonials of previous schools attended with the originals for sighting;", "\nii. Only one certificate is accepted i.e WAEC of May/June for", "\nUndergraduate applicants;", "\niii. Two copies of Birth Certificate from National Population Commission;", "\niv. State of origin/LGA certificate duly signed, stamped and dated;", "\nv. Four (4) coloured passport sized photographs on white background; and", "\nvi. Postgraduate applicatns will be required to submit Academic transcripts and NYSC discharge or Excemption certificates only.", "\nNB: Candidates nominated by the Board will be required to submit to Federal Scholarship Board the following:", "\ni) Authenticated copies of academic certificates;", "\nii) Data page of current International passport; and", "\niii) Specified Medical Reports from Government hospitals.", "\niv) Police Clearance Certificate where necessary.", "NIGERIA AWARD SCHOLARSHIP (NA) 2019/2020 FEDERAL GOVERNMENT SCHOLARSHIP AWARDS TENABLE IN NIGERIA TERTIARY INSTITUIONS FOR NA, SDG (SUSTAINABLE DEVELOPMENT GOALS) FOR GIRLS ONLY", "\nTHE ELIGIBILITY CRITERIA FOR ", "NIGERIAN AWARD/SDG", " ARE AS FOLLOWS:", "Applicants for Postgraduate studies should possess a minimum of first degree with Second Class Honours Upper Division. Applicant must be registered Full-Time students of Federal or State Universities.", "All other applicants (UG, HND &NCE) must be registered full-time students in their second year or above in Federal or State Universities, Polytechnics, Monotechnics and Colleges of Education. All undergraduate Scholarship applicants (Physically challenged inclusive) must have at least 4.0 Cumulative Grade Points Aggregate (CGPA) on a five (5) point scale or its equivalents or 5.0 on a 7 point scale.", "METHOD OF APPLICATION", "\nApplication forms are completed online as follows: Complete form online Submit and Print a copy Attach Photocopy of the following documents to the Printed Copy", "\ni. Letter of Admission to the Institution", "\nii. Current Course Registration Form", "\niii. CGPA results of year 1, 2, 3, etc.", "\niv. Current School’s Identity Card", "\nv. Letter of Identification from your State/Local Government", "\nvi. Two (2) passport size photographs with your name written at the back and duly signed by you.", "NOTE:", "Printed Copy should be endorsed (signed and stamped) by your HOD or Dean of Faculty of your institution.", "GENERAL NOTICE: During the application candidates are expected to", "\nindicate the following:", "\ni) Centre of choice for the Computer Based Test (CBT); and", "\nii) Choice of programme preferred in order of priority (i.e. Bilateral Education Agreement (BEA), Nigerian Award (N/A), Sustaniable Development Goals (SDGs) scholarship for girls only).", "\niii) Warning : Double Enteries will be disqualied", "\nOFFICIAL PHONE NUMBERS:", "\ni) Bilateral Education Agreement (BEA): 08077884417/09094268637", "\nii) Nigerian Award/SDGs: 08077884418/08091155229", "\niv) ", "[email protected]", "/", "[email protected]", "/", "[email protected]", "Download Application Guideline", "For More Information:", "Visit the Official Webpage of the Bilateral Education Agreement (BEA) Scholarship Awards 2019/2020 "], "url : https://www.opportunitiesforafricans.com/bilateral-education-agreement-bea-scholarship-awards-2019-2020/"], [["Commonwealth Professional Fellowships 2019 for Mid-Career Medical Professionals to Study in the United Kingdom (Fully Funded)", "date announced:November 12, 2018", "Application Deadline: Monday 3 December 2018."], ["Application Deadline: ", "Monday 3 December 2018", ".", "Commonwealth Professional Fellowships", " are for mid-career professionals from low and middle income Commonwealth countries to spend between six weeks and three months at a UK host organisation working in their sector on a programme of professional development.", "Funded by the ", "UK Department for International Development (DFID)", ", Commonwealth Professional Fellowships provide talented and motivated professionals with the opportunity to enhance knowledge and skills in their given sector. These Fellowships are offered under six development themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Purpose: ", "To provide professionals with the opportunity to enhance knowledge and skills in their given sector, and to have catalytic effects on their workplaces.", "Intended  beneficiaries: ", "Mid-career  professionals  (with  five  years’  relevant  work  experience)  working  in development-related organisations in low and middle income Commonwealth countries.", "Eligibility", "To be eligible for these fellowships, you must:", "Be a citizen of or have been granted refugee status by an eligible Commonwealth country, or be a British Protected Person", "Be permanently resident in an eligible Commonwealth country", "Have normally at least five years’ relevant work experience in a profession related to the subject of the application, by the proposed start of the fellowship", "Be available to start your fellowship within prescribed dates as stated on the CSC website", "Not have undertaken a Commonwealth Professional Fellowship in the last five years", "Not be seeking to undertake an academic programme of research or study in the UK. Academics are eligible to apply for the scheme, but only to undertake programmes of academic management, not research or courses relevant to their research subject", "You must be available to undertake the Fellowship during the dates set out by the Host organisation. ", "All Fellowships must start between 15 April 2019 and 17 June 2019", ".  You should check exact dates with the prospective Host.", "Value:", "Each fellowship provides:", "Approved return airfare from the Fellow’s home country to the UK", "Stipend (living allowance) payable monthly (or pro rata) for the duration of the award at the rate of £1,656 per month, or £2,055 per month for those at organisations in the London metropolitan area (rates quoted at 2018-2019 levels). Exceptionally, depending on the programme arranged, a peripatetic living allowance may be payable. Further details if applicable will be given at the time of offer", "Arrival allowance of up to £931.10 at current rates, including an element for warm clothing and reimbursement of the visa application fee", "Flat rate contribution of £800 to the costs of the host organisation relating to the administration and support of the Fellow, setting up of appropriate meetings, any materials required, and incidental travel for the Fellow during the award (to be paid to the Host organization on receipt of an invoice)", "Fees of £2,000 will be agreed for awards under 2 months and up to a max of £3000 for awards of three months (to be paid to the Host organization on receipt of an invoice)", "Full justification must be given for the amount being claimed. Such claims can cover:", "Fees for any conferences or short courses attended during the fellowship, provided that these are approved as part of the original application", "Cost of travel for visits to other organisations in the UK, where these form an integral part of the programme", "Other fees, for which the CSC will consider requests on a case-by-case basis", "\nHost", "How to apply", "Applications must be made using the CSC’s online application system.", "A representative of all organisations wishing to apply will need to register to use our new online system. As part of this process, the CSC will undertake checks in order to ascertain whether each organisation has the capacity and resources to host a Professional Fellow.", "To register, potential host organisations should write to the CSC on their organisation’s headed paper providing the following information:", "Full name and email address of the person who is authorised by the organisation to make the application ", "and", " full name and email address of the person who will act as the main contact for the CSC should the fellowship go ahead", "Details of the status of the organisation (for example, company limited by guarantee, charity, etc)*", "A link to a copy of the organisation’s latest accounts registered at Companies House and/or with the Charity Commission or (if the organisations is not a company limited by guarantee or a charity) a copy of the organisation’s latest audited accounts*", "Details of any funding the organisation receives from the Department for International Development (DFID)", "* UK universities and NHS Trusts do not need to provide this information", "These letters should be sent as an attachment by email to ", "[email protected]", "There are three stages to the application process as follows: ", "Once registered to use the online system, a representative of the host organisation must complete the Host Application Form. ", "The closing date for submission of the Host form is 4pm on Friday 2 November 2018. ", "Applications for Fellows will open on Monday 12 November 2018", ". Information on the Host programmes available through the Scheme in 2018 will be made available on our Website to Fellows along with an online application form (We will notify nominators once the application form opens for Fellows).", "The closing date for submission by Fellows is Monday 3 December 2018", ". Once the closing date for Fellows’ applications and references has passed we will upload all applications submitted to each host organisation to a folder in Huddle so that they can assess them and finalise their selections. Selections should be made to the Commission through Huddle.  Full guidance will be given on using Huddle.", "Apply Now for the Commonwealth Professional Fellowships 2019", "For More Information:", "Visit the Official Webpage of the Commonwealth Professional Fellowships 2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-professional-fellowships-2019/"], [["Ernst Mach Grants 2019/2020 for Young Researchers to study in Austria (Funded)", "date announced:December 9, 2018", "Application Deadline: February 1st 2019"], ["Application Deadline: February 1st 2019", "The ", "Ernst Mach Grants", " is named after the ", "famous Austrian physicist and philosopher Ernst Mach (1838-1916).", " The grant program is financed by the ", "Austrian Federal Ministry of Science, Research and Economy (BMWFW).", "  Students and young researchers from foreign universities are invited to apply for this grant to come to Austria for a research or a study stay. Every year a board of representatives of the Austrian Ministry awards the Ernst Mach Grants based on the results of an expert examination procedure. Age limit for this grant program is 35 years at the time of the application.", "Goals:", "\n– To promote research cooperation", "\n– To promote young academics in the early stages of their scientific career", "\n– To establish an effective network of researchers with relations to Austria", "Eligible for application are ", "a) postgraduates pursuing a doctoral/PhD programme outside Austria;", "\nb) postgraduates and post-docs wishing to pursue research in Austria with a view to an academic career and who completed their studies (at a university outside Austria) after September 30th, 2017;", "c) post-docs who are working as lecturers at a university outside Austria.", "Applicants must not have studied/pursued research/pursued academic work in Austria in the last six months before taking up the grant.", "Maximum age:", " 35 years (born on or after Oct. 1st, 1983).", "Language skill", "s: Very good knowledge of English and/or German", "Duration:", "1 to 9 months", "Grant benefit paid:", "Supplementary grant, own funds are required", "1) Monthly grant rate", "\na) for graduates: EUR 1,050", "\nb) for graduates with a PhD degree: EUR 1,150", "\n2) Accommodation, health insurance", "a) It is possible for OeAD scholarship holders to book accommodation (dormitory or apartment) with the OeAD Housing office. The monthly costs are:", "·         monthly rent: roughly EUR 250 to 600 (depending on the amenities)", "·         monthly administrative fee: EUR 18", "b) ", "OeAD scholarship", " holders need to have health insurance that is accepted by the Austrian authorities for the duration of their stay in Austria. The OeAD can help with taking out such insurance. The monthly costs can vary, at the moment you should calculate EUR 55 to 200 (depending on your age, scholarship category and state of health).", "\nScholarship holders have to pay the costs for accommodation and insurance themselves.", "\nc) Applicants from non-EU/EEA countries who are planning a research stay of more than 6 months: If your monthly costs for accommodation in Austria exceed EUR 300, you may need to provide proof of additional funds to the Austrian residence authority when you apply for your residence permit. This figure may vary depending on your individual costs for health insurance and other liabilities.", "3) Grant holders do not have to pay tuition fees in Austria. They might have to hand in a request at the rector’s office of their respective host university and demonstrate that they are studying or doing research in the context of transnational EU, national or university mobility programs.", "\n4) Scholarship holders from non-European developing countries will also receive a travel costs subsidy of max.  EUR 1,000.", "Application Procedure:", "The following ", "documents", " have to be uploaded with the online application at ", "www.scholarships.at", ":", "Two letters of recommendation by university lecturers (for these letters of recommendation no specific form is required; they must contain the letterhead, date and signature of the person recommending the applicant and the stamp of the university / department and must not be older than six months at the time of application.)", "Consent of a lecturer at the Austrian target university to supervise the applicant academically", "Scanned copy of your passport (page with the name and photo)", "Scanned copy of your university graduation certificate of your diploma, master, PhD or doctoral studies", "only for", " PHD-students", ": confirmation, that proves your participation in a PHD-program at your home university", "only for ", "postdoc-lecturers", ": confirmation that proves your employment at your home university", "General Information:", "• Applicants who seek admission to an university in Austria have to contact the institution of their choice directly.", "\n• Short-term grants (1 to 3 months) have a priority in the period from January to June. In other cases problems can arise as regards accommodation. When applying for a short-term grant therefore consideration should be given to applying primarily for the period of January to June.", "\n• The selection process for all grants is competitive, i.e. there is no legal claim to a grant even if all application requirements are fulfilled. The number of grants that will be awarded during one call depends on the quota and/or the available budget. Applicants may apply for several grants at the same time.", "• Grant holders must be present at their place of study in Austria to study or conduct their research project.", "• Once an application has been rejected, it will not be considered any further within that call. However, it is possible to re-apply for this grant with a revised application in the future.", "For More Information:", "Visit the Official Webpage of the Ernst Mach Grants 2019/2020 "], "url : https://www.opportunitiesforafricans.com/ernst-mach-grants-2019-2020/"], [["Obama Foundation Scholars Program 2019/2020 for emerging leaders to study at the University of Columbia (Fully Funded)", "date announced:December 8, 2018", "Application Deadline: January 3rd 2019"], ["Application Deadline: January 3rd 2019", "The Obama Foundation Scholars Program", " seeks to support dynamic, collaborative, rising leaders from around the world in an innovative one-year academic experience.", "The Obama Foundation Scholars Program will give rising young leaders around the world who are already making a difference in their communities the opportunity to take their work to the next level through a newly designed curriculum that brings together academic, skills-based, and hands-on learning. The Scholars Program empowers individuals with a proven commitment to service with the tools they need to make their efforts more effective, to identify innovative solutions to complex global problems, and promote change through values-based leadership.", "The program will build lasting relationships among emerging leaders who are committed to working together to solve the most pressing challenges of our time, creating a global network that reaches across issues and borders. After completing the program, Obama Foundation Scholars will return to their communities and continue the important work they started in the program by implementing their own personalized action plan. They will also have an opportunity to play a role in the Obama Foundation’s efforts to inspire, train, and connect rising leaders from around the globe.", "Obama Foundation Scholars at Columbia University", " will participate in Columbia World Projects, a new initiative in which faculty and researchers from Columbia will partner with governments, nonprofits, the private sector, and intergovernmental organizations to create tangible solutions to real-world issues. The inaugural cohort at Columbia University will participate in a rigorous, immersive program that brings together academic, skills-based, and experiential learning, designed by Columbia University in consultation with the Obama Foundation. The program will also take advantage of the unique opportunities for engagement that come with being at one of the world’s most important centers of research and in the city of New York.", "In addition to classroom studies, the Obama Foundation will offer a robust program of leadership development throughout the academic year to help both cohorts of Scholars gain the real-world skills, networks, tools, and experiences to expand the impact of their work when they return home.  These may include leadership development convenings; program experiences in Chicago and Washington, DC; speaker series with innovators across a variety of sectors; individual and group service projects; mentorship through the Obama Foundation network; and action plan development for post-program activities.", "You can learn more about the Obama Foundation Scholars at Columbia University and apply for the 2019-2020 class here.", " ", "For More Information:", "Visit the Official Webpage of the Obama Foundation Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/obama-foundation-scholars-program-university-of-columbia/"], [["International Journalists‘ Programmes (IJP) Southern African Journalists’ Bursary Programme 2019 in Germany (3.000 Euro Stipend)", "date announced:November 19, 2018", "Application Deadline: February 15th, 2019 "], ["Application Deadline:", " February 15th, 2019 ", "International Journalists’ Programmes (IJP)", " ", "offer a bursary to up to six young Southern African (SADC-Member States: Angola, Botswana, Democratic Republic of Congo, Lesotho, Madagascar, Malawi, Mauritius, Mozambique, Namibia, South Africa, Swaziland, United Republic of Tanzania, Zambia and Zimbabwe + Kenia) and up to five young German journalists. For two months the Southern African delegates will have the chance to work in Germany. They will be integrated into the day-to-day journalism of their host newsroom while also researching stories for their home media.", "It is assumed that all candidates have a strong command of the English language. German language abilities are an advantage but are not mandatory.", "The Southern African-German Journalists’ Programme is a multiyear effort to shape an integrated understanding of the other country and region and to foster relations between Africa and Germany. It has been offered as a response to concerns about an increasing political and cultural detachment between Africa and Europe. The bursary is intended to enable young journalists to gain valuable insights into the political, economical, cultural as well as the social fabric of the host country.", "The bursary is named in honour of the former Federal President Horst Köhler and his exemplary dedication to the intensification of German-African relations.", "For all selected IJP fellows the programme starts with an Introductory Conference for all delegates. This will allow the participants from Southern Africa to familiarise themselves with the host country. After that they will work for several weeks with media houses before going out to undertake individual research within Germany. Applicants are asked to submit their preferences for the newspaper, radio or TV station or news agency they would like to work with. The possible location will be chosen by the IJP organisers in dialogue with each delegate. It is expected that former and new participants assist one another with regard to accommodation and contacts.", "Benefits:", "The Southern African delegates receive a fixed payment of 3,000 Euro. This is expected to cover most of their travel, accommodation and living expenses.", "No further payments will be made: delegates are expected to use their own funds for any further costs. Payment for their work with the host media is not envisaged.", "To receive the full grant participants are obliged to write a report of at least three pages and provide copies of their published journalistic work after returning home.", "Application Procedure:", "All journalists from Southern Africa (SADC Member States and Kenia) between the age of 25 and 40 who regularly work for a media organisation can apply.", "1. ", "Enclose a CV with a passport photograph.", "2. ", "Write a 800 word essay addressing the following topics: ", "Why you would like to work in Germany", "What you expect from IJP and what you think you can contribute to it?", "What are the 3 research topics you want to pursue during the fellowship? ", "What role you expect to play at your home media in the future?", "How you will spend the bursary?", "3. ", "Include a one-page resume detailing your education and work experience, your standard of German and English (copies of certificates/ e.g. Goethe Institut/Toefel), plus 2 copies of articles written by you (TV and radio journalists must type up their reports since no audio or video tapes can be considered)", "4. ", "A journalistic reference from your editor or head of department is required (freelancers should submit a reference from a senior journalist). It should also guarantee your leave of absence for the duration of the program. ", "Applicants are asked to send the application documents (E-Mail) not before December 15th, 2018 and until February 15th, 2019 to the following address: ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the IJP Southern African Journalists’ Bursary Programme 2019"], "url : https://www.opportunitiesforafricans.com/ijp-southern-african-journalists-bursary-programme-2019/"], [["SevenUp Botling Company Harvard Business School Scholarship 2020 for Nigerians (Fully Funded to Harvard Business School)", "date announced:November 28, 2018", "Application Deadline: January 4th 2019"], ["Application Deadline: January 4th 2019", "Launched in January 2011, the scholarship program is ", "SevenUp Bottling Company", "‘s way of contributing towards building a greener future for Nigeria. Each year, a deserving Nigerian youth, resident within the country, will be selected and given the privilege of the best quality education at the Harvard Business School.", "Benefits:", "The scholarship covers tuition, housing, a ticket to the United States to begin the MBA program and a ticket back from the United States at the end of the MBA program.", "Requirements:", "There is no minimum GMAT score required for acceptance and admitted applicants have a wide range of scores. However, recent class statistics can be used as a guide.", "The incoming class of 2014 has a GMAT score range 570-790 and a median score of 730.", "The MBA program is designed for students who have work experience. This way, students can both gain more from and contribute more to the program and to their fellow students’ learning experiences. HBS also encourages students approaching their final year in university to apply. If accepted, they will be offered a deferred admission and would be expected to complete 2 years of work experience.", "Selection Process:", "Once you gain admission from HBS, submit a copy of your electronic admission letter to us. All eligible applicants (Nigerian citizens resident in Nigeria who have gained admission to HBS) will be invited for multiple rounds of interviews with SevenUp Bottling Company Executives to determine their fit with SBC’s vision for the scholarship.", "One scholarship will be awarded annually.", "It is important to note that the Harvard Business School MBA application process is separate. Seven-Up only assesses candidates after they have succesfully navigated the entire HBS MBA application process on their own.", "Letter of Recommendation:", "HBS requires three letter of recommendation. The admissions team suggests that two of these should come from professional references. At least one professional reference should come from a current of recent manager or supervisor. A good recommendation letter would answer the questions, respect the word limits and give specific examples as they relate to the applicant.", "For More Information:", "Visit the Official Webpage of the SevenUp Botling Company Harvard Business School Scholarship 2020 "], "url : https://www.opportunitiesforafricans.com/sevenup-botling-company-harvard-business-school-scholarship-2020/"], [["Canon Collins Thekgo (Undergraduate & Postgraduate) Bursary 2019 for Study in South Africa.", "date announced:November 21, 2018", "Application Deadline: 17th December 2018 at 11pm GMT"], ["Application Deadline: ", "17", "th ", "December 2018", " at 11pm GMT", "Canon Collins invites applications for", " Thekgo Bursaries", ". These bursaries are for registration fees for courses at postgraduate and undergraduate level in the following disciplines:", "Languages and Literature", "Media Studies", "Gender Studies", "Education", "Arts (Digital Arts, Drama/Performance Studies, Visual Arts/Fine Arts, History of Art, Film and Television Studies, Music)", "For 2019 academic year, these bursaries will only be awarded to students admitted for ", "first year study", " (undergraduate or postgraduate) for any of the above disciplines, at public universities in ", "Kwazulu-Natal Province, South Africa", ". Eligible institutions are:", "Durban University of Technology", "University of Kwazulu-Natal", "University of Zululand", "Mangosuthu University of Technology", "Applications will not be considered for other courses or institutions.", "Eligibility Requirements:", "You must:", "be a national of, or have refugee status in any African country.", "be accepted for your first year of study at a university in Kwazulu-Natal province in South Africa in 2019, for a full-time programme (undergraduate or post-graduate).", "demonstrate academic merit", "be admitted to study within one of the areas listed above", "demonstrate financial need", "Benefits:", "Thekgo usually dispense about 5-7 bursaries per year depending on the number of applicants.", "The selection committee decides on the actual amount that will be awarded to individual successful applicants, up to a maximum of R7500.", "How to apply", "Thekgo is currently open for applications. Please read the ", "guidelines ", "before applying. We are now accepting applications.", "You can apply by sending your completed ", "completed application form", " and supporting documents to ", "[email protected]", ".", "The deadline for applications is ", "17", "h", " December 2018", " at 11pm GMT. Late applications will not be considered.", " ", "For More Information:", "Visit the Official Webpage of the Canon Collins Thekgo (Undergraduate & Postgraduate) Bursaries 2019"], "url : https://www.opportunitiesforafricans.com/canon-collins-thekgo-undergraduate-postgraduate-bursaries-2019/"], [["African Institute for Mathematical Sciences (AIMS) Master’s & Co-operative Master’s Program 2019/2020 for young Africans (Fully Funded)", "date announced:December 4, 2018", "Application Deadline: March 31st 2019"], ["Application Deadline: March 31st 2019", "The co-operative version of the ", "AIMS Structured Master’s program,", " ", "offered only at AIMS Senegal, AIMS Cameroon and AIMS Rwanda builds on the core ", "AIMS Master’s program", " and leads to the same AIMS Structured Master’s degree in mathematical sciences.", "The 18-month program takes a work-integrated learning approach by combining course work with practical industry experience. This allows students to apply their scientific knowledge to real world problems while gaining work experience in an industrial environment. The program enables students to develop the necessary professional skills to transition from academic studies to progressive careers in industry (defined as private or public businesses, government, non-governmental organisations, and civil society). The Co-operative Master’s program includes two work placements of three and four months throughout the regular coursework. Successful completion of all coursework and both work placements is required for graduation.", "The Co-operative Master’s program is designed specifically to prepare students for work in the areas of big data and IT security. Applicants are requested to choose their preferred area of focus.", "Eligibility requirements include;", "Applicants must have a conferred 4-year university degree in mathematics and science or engineering subject with a significant mathematics component or anticipate completing by the start date of the AIMS course.", "Applicants should demonstrate a strong aptitude in mathematics, leadership and community service. ", "Women applicants are strongly encouraged to apply", ".", "Selection Process", "Potential applicants must demonstrate both a high degree of motivation and the ability to complete the course successfully. Late applications will be considered on a case-by-case basis. Master’s degrees are awarded in partnership with leading local academic institutions affiliated with AIMS centers.", "Financial Assistance", "\nThere are no course fees for successful applicants. Full bursaries covering tuition, accommodation, meals, and travel costs are also awarded to successful applicants.", "Applications close on 31st March 2019.", "Core-Masters: ", "https://", "applications.nexteinstein.org/?application_t", "ype=Masters+Intake", " ", "…", "Co-Op Masters: ", "https://", "applications.nexteinstein.org/?application_t", "ype=Co-Op+Masters+Intake", " ", "…", "For More Information:", "Visit the Official Webpage of the AIMS Master’s & Co-operative Master’s Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/aims-masters-co-operative-masters-program-2019-2020/"], [["Petroleum Technology Development Fund (PTDF) 2019/2020 Overseas Postgraduate (Msc & PhD) Scholarship Scheme for study in UK, France & Germany", "date announced:November 19, 2018", "Application Deadline: December 31st 2018"], ["Application Deadline: December 31st 2018", "The Petroleum Technology Development Fund (PTDF),", " the Federal Government agency with the mandate of developing indigenous human capacity and petroleum technology to meet the needs of the oil and gas industry, invites applications from suitably qualified candidates for Overseas MSc and PhD Scholarships to institutions under its UK, Germany and France strategic partnership initiative. Successful candidates will be awarded scholarships to study in these countries commencing in the 2019/2020 academic session.", "The Scheme", "Under this scheme, candidates are invited to apply through PTDF to specific programmes at the partner institutions in any of the countries (full list of sponsored courses is available below). The award includes the provision of flight tickets, payment of health insurance, payment of tuition and bench fees (where applicable) as well as the provision of allowances to meet the costs of accommodation and living expenses. The programmes will also include language classes to aid scholars settle into their new environments.", "Selection Process, Criteria & Requirements", "PTDF scholarships are highly competitive and only candidates who are outstanding across the board are selected. A selection committee will be constituted to assess applications using the following criteria;", "Academic merit as evidenced by quality of degrees, full academic transcripts, other professional qualifications acquired, and relevant publications (where available) to be referenced by applicants", "Awards for leadership and/or academic excellence (where available).", "Membership of professional bodies", "The viability of the study/research plan.", "Applicants are required to make a case for their scholarship by submitting a statement of purpose (maximum 500 words) stating the reason(s) they want to undertake the study, the relevance of the proposed study to the oil & gas industry and its expected impact on national development.", "Requirements", "MSc", "A minimum of Second Class Upper (2.1) qualification in their first degree or a Second Class Lower (2.2) with relevant industry experience", "Must have completed the mandatory National Youth Service (NYSC)", "Must be computer literate", "Possession of 5 O/level credits including English Language.", "PhD ", "Must have completed the mandatory National Youth Service (NYSC)", "Must be computer literate", "A minimum of Second Class Lower (2.2) in their first degree and a good second-degree certificate;", "Must submit a research proposal relevant to the oil and gas industry (of not more than 5 pages) to include: Topic, introduction, objective, methodology and mode of data collection (", "Click here for a sample of Ph.D. research proposal format", ")", "Applicants must also include their master’s degree project", "Required Documents ", "Applicants are advised to scan copies of the following documents and attach to their online application forms:", "First Degree Certificate or Statement of Result", "NYSC discharge certificate", "WAEC/GCE/SSCE/NECO results as well as the PIN numbers on the application forms to enable PTDF view the O’level results on the relevant website).", "Recent Passport Photograph", "Local Government Identification Letter", "Master’s Degree Certificate ", "(PhD Applicants only)", "Evidence of membership of professional associations", "IMPORTANT NOTE:", "Ongoing PhD Candidates could only apply provided their Universities are among the PTDF Partnership Universities as listed above;", "Candidates who have benefitted from any of the PTDF scholarships in the past cannot apply for the same type of programme, except a higher programme;", "Candidates who successfully scale through the first round of screening will be requested to submit their transcripts; all applicants are therefore advised to prepare their transcripts for submission in anticipation of such a request.", "LIST OF APPROVED COURSES FOR SPONSORSHIP ", "Candidates may select up to 3 ", "different", " courses (1", "st", ",2", "nd", " and 3", "rd", " choice) in any country or university, but are not to contact the schools directly for admissions as they will be placed in relevant universities by the PTDF", "FRANCE", "GERMANY", "UNITED KINGDOM", "Application Process:", "Application Process", "Apply Now for the PTDF 2019/2020 Overseas Postgraduate Scholarships", "For More Information:", "Visit the Official Webpage of the PTDF 2019/2020 Overseas Postgraduate Scholarships"], "url : https://www.opportunitiesforafricans.com/ptdf-2019-2020-overseas-postgraduate-msc-phd-scholarship-scheme/"], [["IAS/AVAC Media Scholarship Programme 2019 for Journalists (Fully Funded to attend the 10th IAS Conference on HIV Science in Mexico City, Mexico", "date announced:December 2, 2018", "Application Deadline: 24 January 2019, 23:59 CET."], ["Application Deadline: ", "24 January 2019, 23:59 CET", ".", "The IAS/AVAC Media Scholarship Programme", " makes the conference accessible to a select group of highly-qualified journalists who would not otherwise be able to attend and report on the conference proceedings. The programme also provides a training on HIV research, a series of briefings through the conference week and targeted support to help journalists strengthen their HIV reporting skills.", "The partnership between the IAS and AVAC builds off the traditional ", "IAS Media Scholarship Programme", " to offer increased media support.", "The 10th IAS Conference on HIV Science – known as IAS 2019 – will take place on 21-24 July 2019 in Mexico City, Mexico.", "The IAS Conference on HIV Science", " is the world’s most influential meeting on HIV research and its applications. This biennial conference presents the critical advances in basic, clinical and operational research that moves science into policy and practice. Through its open and inclusive programme development, the meeting sets the gold standard of HIV research featuring highly diverse and cutting-edge studies.", "Eligibility", "The IAS/AVAC Media Scholarship Programme is open to all journalists and community educators reporting on HIV for a recognized print, radio, broadcast or online consumer, medical, community or AIDS Service Organization-sponsored media outlet in any country who is at least 18 years old at the time of the conference.", " ", "Priority will be given to journalists:", "Representing national top tier media outlets or wire services with a wide regional or national reach, regardless of the medium.", "With a proven history of covering HIV and/or AIDS and/or infectious diseases. Scientific and broader reporting are both encouraged.", "Based in resource-limited settings as well as journalists representing target countries/regions of interest, including South East Asia, Latin America and the Caribbean and sub-Saharan Africa.", "Demonstrating a strong commitment to reporting on HIV and/or AIDS. Emphasis will be given to journalists and outlets with a background in reporting on global health topics, infectious diseases and HIV and/or AIDS more specifically.", "Who are part of a key population or living with HIV.", "Benefits", "Recipients of the ", "IAS/AVAC Media Scholarship", " will receive:", "Travel ", "to and from the 10th IAS Conference on HIV Science (IAS 2019) (roundtrip ticket at lowest fare available from the nearest international airport)", "Accommodation ", "(in a budget hotel for the days of the conference)", "A ", "daily living allowance", " for each of the days of the conference (21-24 July 2019)", "Participation in the IAS/AVAC Media Scholarship programme", " including a day-long training with HIV experts, briefings, press conferences and site visits, and dedicated support in the conference media centre.", "Application Process:", "The application process is entirely free. Applicants must create a ", "user account", " to fill in an individual application form.", "A letter of recommendation and three bylined work samples are required to complete the application.", "Contact the Scholarship Programme team : ", "[email protected]", "Timeline", "Applications are now open online through the ", "profile platform", " until ", "24 January 2019, 23:59 CET", ".", "All applicants will be notified at the end of March 2019.", "For More Information:", "Visit the Official Webpage of the IAS/AVAC Media Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/ias-avac-media-scholarship-programme-2019-for-journalists/"], [["University of Essex Africa Scholarship Programme 2019/2020 for Young Africans to study in the United Kingdom", "date announced:November 26, 2018", "Application Deadline: September 30th 2019"], ["Application Deadline: September 30th 2019", "The University of Essex Africa Scholarship Programme 2019/2020", " – If you’re an international student from an African nation and are self-funding your postgraduate studies, you could be eligible for a scholarship of £4,000, paid as a discount on your tuition fee. If you are from any of the following countries, please check the academic requirements below to see if you could be eligible.", "Ghana", "CGPA 3.0/4.0 or above", "Nigeria", "CGPA 3/5 or above", "Other member states of the African Union", "2:1 or above (or equivalent as defined by our Postgraduate Admissions selection criteria)", "Degree qualification", "You will also be considered for this award if you are a national of an African nation and you have a degree:", "from a recognised UK university, other than Essex, with a 2:1 or above, or", "from a recognised university with a 2:1 or above (or equivalent as defined by our Postgraduate Admissions selection criteria) or from any of the following countries:\n", "Bangladesh", "Canada", "China", "Hong Kong", "India", "Indonesia", "Japan", "Jordan", "Kazakhstan", "Malaysia", "Norway", "Pakistan", "Russia", "Taiwan", "Thailand", "Turkey", "USA", "Vietnam", "Eligibility", "You must meet ", "all", " of the following conditions.", "be classified as an international student for fee purposes", "be a national of an African nation (defined as a member state of the African Union) and ordinarily resident in an African nation (see the full terms and conditions for definition of “ordinary residence”)", "be entirely self-funding your studies", "be a graduate of any African country, or any of the countries specified above", "for 2019-20 entry:", " be applying for a full-time Masters course starting in 2019-20 (excluding MBA)", "meet the academic criteria in the table above", "Payment arrangements", "\nThese scholarships will only be made available as a reduction on the tuition fee that is payable on registration at the University. If you intermit from your course, you may, with the agreement of your department and at the discretion of the Director of Marketing and Student Recruitment, be entitled to a pro-rata payment of the remainder of your award on your return to study.", "How to apply", "We’ll assess your eligibility based on the information that you submit with your application for your place at Essex.", "If you meet all the eligibility criteria, you will automatically be awarded this scholarship. You don’t need to complete an application form.", "For 2019-20 entry:", " If you meet all the eligibility criteria and firmly accept the offer of your place by 13 September 2019 then you will automatically be awarded this scholarship. You’ll be notified of your award when your place at Essex is confirmed or by end of October 2019.", "For More Information:", "Visit the Official Webpage of the University of Essex Africa Scholarship Programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-essex-africa-scholarship-programme-2019-2020/"], [["Rotary/UNESCO-IHE Scholarships 2019/2020 for Water and Sanitation Professionals", "date announced:December 3, 2018", "Application Deadline: April 15th 2019"], ["Application Deadline: April 15th 2019", "Through this partnership, a limited number of scholarships are awarded annually for graduate students at ", "IHE Delft Institute for Water Education’s campus in the Netherlands.", " ", "These scholarships are designed to promote long-term productive relationships between Rotarians and highly skilled water and sanitation professionals in their communities.", "Rotarians interview and select from local candidates who have already been admitted to one of IHE Delft Institute for Water Education’s eligible 18-month Master of Science degree programs.", "Thespecializations of the following IHE Delft MSc programs are eligible for a 2019-2021 Rotary Scholarship:", "Water Management and Governance", "Urban Water and Sanitation", "Water Science and Engineering", "Joint specializations of these programmes are not eligible.", "Sponsor Rotarians maintain contact with the scholar throughout his or her studies. After completion of the program, the scholar and sponsor Rotarians partner on a water-related activity in the scholar’s home country. Rotarians in the Netherlands involve the scholars in local cultural and Rotary-related events during their academic program. The financing of the successful candidates will be managed through Rotary’s Global Grant process.", "Recipients of this scholarship will benefit from the support they receive through regular contact with sponsor Rotarians from their home country and the opportunity to interact with Rotarians in the Netherlands. Rotary alumni constitute an extensive network of Rotary scholarship recipients and Rotarians worldwide. Becoming involved with a local Rotary club and the alumni association allows scholars to stay connected to Rotary’s global community and resources.", "Application Procedure:", "Students admitted to IHE Delft Institute for Water Education’s eligible programs can be nominated by a local Rotary Club in their home community by submitting the application form for a scholarship to the Rotary/IHE Delft committee in the Netherlands, together with the student’s resume and the IHE Delft admission letter. Only fully completed application forms submitted by the sponsoring Rotary Club will be considered. You can consult this website to find your nearest Rotarian club: ", "https://my.rotary.org/en/search/club-finder", "Only specializations of the following IHE Delft MSc programs are eligible for a 2019-2021 Rotary Scholarship: Urban Water and Sanitation, Water Management and Governance, Water Science and Engineering. Joint specializations of these programmes are not eligible.", "The application form has to be submitted by email to the Rotary/IHE Delft committee in the Netherlands: ", "[email protected]", "The deadline for applying for admission to one of the IHE eligible MSc programs is ", "1 April 2019", " and for submitting Rotary-scholarship applications is ", "15 April 2019", ". Any application forms submitted after this date will not be considered.", "In the document: ", "2019 Rotary Scholarship for Water and Sanitation Professionals at IHE Delft – application form", ", you will find more information on the application process and the terms and conditions. This document is also the application form, which needs to be submitted by e-mail to the Rotary/IHE Delft committee in The Netherlands.", "Application procedure in short:", "You apply for admission for one of the IHE Delft eligible Master programmes before 1 April 2019", "You search for your nearest Rotarian club", "You approach them and ask them if they will nominate you for a Rotary scholarship", "The application form needs to be completed by you and by the Rotary Club", "After full completion the sponsoring Rotary Club submits your application to the Rotary/IHE Delft selection committee in The Netherlands before 15 April 2019", "After the selection all candidates will be informed about the outcome before 1st July.", " ", "For More Information:", "Visit the Official Webpage of the Rotary/UNESCO-IHE Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/rotary-unesco-ihe-scholarships-2019-2021/"], [["Hungarian Government Stipendium Hungaricum Scholarship Programme 2019/2020 for study in Hungary (Fully Funded)", "date announced:December 7, 2018", "Application Deadline:15 January 2019 – 23:59 (Central European Time)"], ["Application Deadline:15 January 2019 – 23:59 (Central European Time)", "The Stipendium Hungaricum Scholarship Programme", " was launched in 2013 by the Hungarian Government. The main goal of the programme regarding the education policy is to support the internationalisation of the Hungarian higher education and its constant development, to strengthen the international relations of the Hungarian academic and research community, to enhance the cultural diversity of the higher education institutions and to promote the good reputation and competitiveness of the Hungarian higher education throughout the world. The programme also aims to establish and encourage the personal and professional attachment of foreign graduated students to Hungary and contribute to the promotion of the Hungarian culture and language abroad.", "The core mission of the programme is to increase the number of foreign students in Hungary and to encourage Hungarian higher education institutions to attract top foreign students.", "The programme is based on bilateral educational cooperation agreements signed between the Ministries responsible for education in the sending countries/territories and Hungary or between institutions. Currently nearly 70 Sending Partners are engaged in the programme throughout 5 different continents and the geographical scope of the programme is spreading each year.", "Thousands of students from all around the world apply for higher educational studies in Hungary each year. The number of Stipendium Hungaricum applicants is continuously increasing as well as the number of available scholarship places. In the 2018/2019 round of applications, more than 4100 scholarships were awarded. In the academic year 2019/2020 more than 5000 students can begin their studies in Hungary in the framework of the Stipendium Hungaricum Programme.", "Study Levels", "\nStipendium Hungaricum scholarships are available for bachelor, master, one-tier master, doctoral and non-degree programmes (preparatory and specialisation courses).", "Study Modes", "\nBoth full degree and partial (exchange) study modes are available, depending on/defined in the specific bilateral educational cooperation agreement. Full degree programmes are programmes that lead to a bachelor, master or doctoral degree. One-year programmes do not lead to a degree but provide a preparatory course before a degree programme or a specialisation course after a degree programme.", "Scholarship Worth:", "Tuition-free education", "\nexemption from the payment of tuition fee", "Monthly stipend", "\n– non-degree, bachelor, master and one-tier master level: monthly amount of HUF 40 460 (cca EUR 130) contribution to the living expenses in Hungary, for 12 months a year, until the completion of studies", "\n– doctoral level: according to the current Hungarian legislation, the monthly amount of scholarship is HUF 140 000 (cca EUR 450) for the first phase of education (4 semesters) and HUF 180 000 (cca EUR 580) for the second phase (4 semesters) – for 12 months a year, until completion of studies. Please see details in section 1.2.1.", "Accommodation contribution", "\n– free dormitory place or a contribution of HUF 40 000/month to accommodation costs for the whole duration of the scholarship period", "\n– Please note that if the student does not live in the dormitory, then the HUF 40 000/month is a contribution to that rental costs, and in bigger cities – especially in the capital city – this contribution would not cover the full amount of rental costs.", "Medical insurance", "\n– health care services according to the relevant Hungarian legislation (Act No. 80 of 1997, national health insurance card) and supplementary medical insurance for up to HUF 65 000 (cca EUR 205) a year/person", "Eligible Sending Partners", "\nThe Stipendium Hungaricum Programme is based on effective bilateral educational cooperation agreements between the Ministry of Human Capacities of Hungary and the partner’s Ministry responsible for higher education. Applications will be considered eligible if the applicant is nominated by the responsible authorities of the Sending Partner.", "\nFor full time programmes, students can apply from the following Sending Partners: Arab Republic of Egypt, Argentine Republic, Bosnia and Herzegovina, Federal Democratic Republic of Ethiopia, Federal Republic of Nigeria, Federative Republic of Brazil, Georgia, Islamic Republic of Iran*, Islamic Republic of Pakistan, Japan, Kingdom of Cambodia, Kingdom of Morocco, Kingdom of Thailand, Kurdistan Regional Government/Iraq, Kyrgyz Republic, Lao People’s Democratic Republic, Lebanese Republic, Macedonia, Malaysia, Mongolia, Montenegro, Oriental Republic of the Uruguay, Pacific Alliance (member states: Chile, Colombia, Mexico and Peru), Palestine, People’s Democratic Republic of Algeria, People’s Republic of Bangladesh, People’s Republic of China (including the Hudec scholarships), Republic of Albania, Republic of Angola, Republic of Azerbaijan, Republic of Belarus, Republic of Cabo Verde, Republic of Colombia, Republic of Cuba, Republic of Ecuador, Republic of Ghana, Republic of India, Republic of Indonesia, Republic of Iraq, Republic of Kazakhstan, Republic of Kenya, Republic of Korea, Republic of Kosovo, Republic of Moldova, Republic of Namibia, Republic of Paraguay, Republic of Serbia, Republic of Singapore, Republic of South Africa, Republic of the Sudan", "The deadline for submitting the complete application package:", "\n15 January 2019 – 23:59 (Central European Time)", "\nThe online application system can be reached here: ", "apply.stipendiumhungaricum.hu", "For More Information:", "Visit the Official Webpage of the Hungarian Government Stipendium Hungaricum Scholarship Programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/hungarian-government-stipendium-hungaricum-scholarship-programme-2019-2020/"], [["African Biomedical Engineering Mobility (ABEM) Scholarships 2019/2020 for African postgraduate students & academics (Fully Funded)", "date announced:December 6, 2018", "Application Deadline:11:59pm East African Time on 29 January 2019"], ["Application Deadline:11:59pm East African Time on 29 January 2019", "The African Biomedical Engineering Mobility (ABEM) project", " is funded by the ", "Intra-Africa Academic Mobility Scheme of the Education, Audiovisual and Culture Executive Agency of the European Commission.", " The scheme is modelled on Europe’s well-established and successful Erasmus-Mundus programme. As part of the Roadmap 2014-2017 of the Joint Africa-EU Strategy, the Intra-Africa Mobility Scheme underlines the contribution of higher education towards economic and social development and the potential of academic mobility to improve the quality of higher education.", "ABEM will build human and institutional capacity in Africa for needs-­based health technology research and development. The project will train postgraduate students with skills and specialisations not offered at their home institutions. Furthermore, it will support the development of biomedical engineering programmes that are being established, or have recently been established, at partner institutions and contribute toward harmonising biomedical engineering curricula across the continent. This will be achieved through the provision of scholarships to cover the full cost of mobility between African higher education institutions.", "Overall, the project will enhance employment opportunities for graduates, enhance staff research profiles and teaching competencies, enhance institutional research profiles and inter-­university cooperation, and support the development of solutions for health challenges from an African perspective.", "Benefits:", "The ABEM individual scholarships cover one roundtrip flight ticket, visa costs, participation costs (which may include tuition fees, registration fees and service fees), comprehensive insurance coverage (health, accident and travel) and a monthly subsistence allowance from which scholarship recipients are to cover accommodation expenses.", "Target groups and types of mobility", "\nThere are two target groups and three different types of individual mobility:", "Participants", "Mobility types", "Duration", "Target group 1", "Students ", "registered in or having obtained a degree from one of the six African partner institutions", "Master’sDoctorate", "6-24 months6-48 months", "Staff ", "working in or associated with one of six African partner institutions", "Visits for teaching and/or research, or for engagement on administration and management", "1 – 6 months", "Target group 2", "Students", " registered in or having obtained a degree from a higher education institution not included in the partnership but established in an eligible country (see below)", "Master’sDoctorate", "6-24 months6-48 months", "The eligible countries are presented in the table below:", "Regions of Africa", "Countries", "Central", "Burundi, Cameroon, Central African Republic, Chad, Congo, Congo (DRC), Equatorial Guinea, Gabon and São Tomé and Principe", "Eastern", "Comoros, Djibouti, Eritrea, Ethiopia, Kenya, Madagascar, Mauritius, Rwanda, Seychelles, Somalia, Sudan, South Sudan, Uganda and Tanzania", "Northern", "Algeria, Egypt, Libya, Tunisia and Morocco", "Southern", "Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia and Zimbabwe", "Western", "Benin, Burkina Faso, Ivory Coast, Cape Verde, Gambia, Ghana, Guinea, Guinea- Bissau, Liberia, Mali, Mauritania, Niger, Nigeria, Senegal, Sierra Leone and Togo", "Master’s and doctoral students may undertake:", "Credit-seeking mobility of 6 to 12 months at a partner institution, leading to academic recognition of the study period towards a degree programme at the home institution,", "Degree-seeking mobility to complete a full degree at a partner institution. The project aims for 50% of students and at least 30% of staff who participate in mobility visits to be women.", "PLEASE NOTE: PhD full degree-seeking mobility is no longer available", "The fourth call for ABEM scholarship applications is now open. The submission deadline is 11:59pm East African Time on 29 January 2019. Applications for the following mobility types will be considered:", "Master’s degree-seeking mobility for ", "women only", ":", "\nHost universities: Kenyatta University and Addis Ababa University", "\nHome universities: any of the partner universities (i.e. Target Group 1 only)", "Master’s credit-seeking mobility for ", "women only", ":", "\nHost universities: Kenyatta University and Addis Ababa University", "\nHome universities: any African university (i.e. Target Group 1 and Target Group 2)", "PhD credit-seeking mobility for women and men:", "\nHost universities: Kenyatta University and Cairo University", "\nHome universities: any African university (i.e. Target Group 1 and Target Group 2)", "Staff mobility for women and men:", "\nHost universities: Partner universities excluding the University of Cape Town", "\nHome universities: All partner universities", "For More Information:", "Visit the Official Webpage of the ABEM Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/african-biomedical-engineering-mobility-abem-scholarships-2019-2020/"], [["Edinburgh Global Research Scholarship Awards 2019/2020 for overseas research students", "date announced:November 27, 2018", "Application Deadline:1st February 2019."], ["Application Deadline:", "1st February 2019", ".", "These awards are designed to attract high quality overseas research students to the University of Edinburgh.", "Award", "30 Edinburgh Global Research Scholarships will be awarded for session 2019-2020.", "Each scholarship will cover the difference between the tuition fee for a UK/EU postgraduate student and that chargeable to an overseas postgraduate student. The awards do not cover maintenance expenses.", "Subject to satisfactory progress, the awards are tenable for up to ", "three years", ".", "Eligibility", "The awards are open to overseas nationals commencing a PhD in any field of study in 2019-2020.", "Applicants must be liable to pay tuition fees at the rate applicable to overseas students and must have been offered admission to a full-time ", "PhD", " research programme of study.", "Academic merit", "Applicants must be of outstanding academic merit and research potential.", "Although candidates with an upper second class honours Bachelor’s degree (or the overseas equivalent) can be considered, in order to be competitive you should really have a first class Bachelor’s degree supplemented by an excellent Master’s degree.", "Other factors such as financial status, nationality and the proposed field of study are not taken into account.", "Excluding factors", "The University of Edinburgh will not generally consider candidates who have already obtained a ", "PhD", ", or formal equivalent, as a result of direct research training.", "Students already on a PhD programme cannot be considered for these awards.", "Please also note that if you have applied for consecutive registration where you will start your Masters programme of study in 2019 and your ", "PhD", " the following year in 2020, that you will not be eligible to apply for an award in 2019.", "Edinburgh Global Research Scholarships cannot be held concurrently with fully-funded scholarships such as a Commonwealth Scholarship, or a Marshall Scholarship.", "Applying​", "Information on how to apply will follow shortly – the closing date will be ", "1st February 2019", ".", "Notification of award", "It is anticipated that all applicants will be notified of the outcome by the end of April 2019.", "For More Information:", "Visit the Official Webpage of the Edinburgh Global Research Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/edinburgh-global-research-scholarship-awards-2019-2020/"], [["The Women Deliver 2019 Conference Media Scholarships (Fully Funded to Vancouver, Canada)", "date announced:December 5, 2018", "Application Deadline: January 15th 2019"], ["Application Deadline: January 15th 2019", "The Women Deliver Conference 2019 Media Scholarships", "The Women Deliver 2019 Conference", " is where the world gathers to drive progress on gender equality and the health, rights, and wellbeing of girls and women. All journalists attending the conference will have access to high-level speakers and attendees representing experts in development, elected officials, global advocates and the next generation of leaders.", "The Women Deliver 2019 Conference", " will take place 3-6 June 2019 in Vancouver, Canada and will be the world’s largest conference on gender equality and the health, rights, and wellbeing of girls and women in the 21st century. It will serve as a catalyst for advocates working to achieve a more gender equal world.", "More than 6,000 world leaders, influencers, advocates, academics, activists, and journalists will flock to Vancouver with the drive to accelerate progress for girls and women everywhere.", "The conference will present new knowledge, promote world-class solutions, and engage a broad spectrum of voices. It will focus on several issues from health, nutrition, education, economic and political empowerment to human rights, good governance, and girls’ and women’s agency and equality.", "Benefits:", "A select group of media representatives will also receive a fully-funded scholarship.", "Media Scholarship Includes:", "Conference registration", "Economy roundtrip airfare", "Hotel accommodation for days of the conference", "Ground transportation for days of the conference", "Per diem for days of the conference", "Visa reimbursement", "Health insurance", "Application Requirements:", "Demographic and biography information", "Outlet and beat", "Explanation of why you want to cover", "Link to relevant article(s)", "For More Information:", "Visit the Official Webpage of the 2019 Women Deliver Conference"], "url : https://www.opportunitiesforafricans.com/the-women-deliver-2019-conference-media-scholarships/"], [["French Embassy Master and PhD scholarship program 2019/2020 for young South Africans to study in France (Fully Funded)", "date announced:December 7, 2018", "Application Deadline:15 March 2019"], ["Application Deadline:15 March 2019", "South African graduates are invited by the Embassy of France to apply to their competitive ", "Masters and Doctorate scholarship program", ". Applications from all academic disciplines, especially science and technology, will be considered for the academic year starting in September 2019.", "The French Embassy scholarships", " can completely or partially finance the annual tuition fees, health insurance and Schengen visa fees for selected applicants. The round-trip airfare and monthly stipend towards living expenses can further be covered. Co-funding opportunities are strongly encouraged to strengthen the collaboration between South African and French institutions and the public and private sector.", "The French Embassy in South Africa", " has supported just over forty five students during the academic year 2017 /2018 with their Masters and Doctorate degrees. Some of the scholarship holders will continue with their studies in 2019/2020 at the French Higher Education institutions while others will return as France Alumni ambassadors to invest their acquired skills in South Africa.", "Start identifying and applying to your French institutions now using the ", "Campus France search engine", ".", "Application form for ", "French Embassy Master Scholarship programme 2019 – 2020", "\nDocuments required for a complete application:", "\n1. Fully completed and signed application form.", "\n2. Certified copy of passport (valid for the period of your stay in France).", "\n3. Certified copies of all degree certificates and academic transcripts, chronological according to", "\ndate of completion (both for complete and incomplete qualifications).", "\n4. Curriculum vitae (no longer than two pages).", "\n5. Motivation letter (no longer than two pages).", "\n6. Acceptance letters from 3 academic institutions in France (if you have not yet been accepted,", "\nproof of correspondence with the institutions will be required indicating that you have", "\ncommenced the application process).", "\n7. The internet links of the three academic institutions indicating the tuition fees of the three selected", "\ncourses.", "\no Maximum academic fees (administration and tuition fees combined) financed with a full", "\nscholarship: 5000€.", "\no For academic fees higher than 5000€ co-financing options must be provided (personal", "\nsavings and/or enterprise sponsorship).", "\nE-mail complete application folder (7 attachments in PDF format only) before 15 March 2019 to", "[email protected]", "Application form for ", "French Embassy PhD Scholarship programme 2019 – 2020", "\n1. PERSONAL DETAILS", "\nSurname (as it appears on your passport)", "\nFirst name(s) (as it appears in your passport)", "\nSex (mark with X) Male Female", "\nNationality", "\n(please inform in case of dual nationality)", "\nDate of birth (dd/mm/yyyy)", "\nPlace (city) of birth", "\nCountry of birth", "\nMarital status (mark with X) Single Married /", "\nCivil Union Other", "\nRequired documents (to accompany this form):", "\n1. Fully completed and signed application form", "\n2. Certified copy of valid passport", "\n3. Certified copies of all degree certificates and academic transcripts (both for complete and", "\nincomplete qualifications)", "\n4. Motivation letter (no longer than two pages)", "\n5. Curriculum vitae (no longer than two pages)", "\n6. Outline of research project (no longer than two pages)", "\n7. Supporting letter from supervisor in South Africa", "\n8. Invitation letter from supervisor in France", "\n9. Proof of registration at a South African university", "\nA hosting agreement signed by the Prefecture in France and the French academic institution will be", "\nrequested upon visa application. Please apply for this document at least 2 months in advance of your", "\ndeparture for France – once you have secured funding for your stay in France.", "\nE-mail the complete application (9 attachments in PDF format): ", "[email protected]", "\nPlease note that there is no deadline and applications are accepted throughout the year.", "Remember, you do not have to speak French to study in France – numerous Master ", "programs taught in English", " are available at French Higher Education institutions.", " PhD French Embassy application form 2019", "PhD French Embassy information sheet 2019", "Masters French Embassy application form 2019_2020", "Masters French Embassy information sheet 2019_2020", "For More Information:", "Visit the Official Webpage of the French Embassy Master and PhD scholarship program 2019/2020"], "url : https://www.opportunitiesforafricans.com/french-embassy-master-and-phd-scholarship-program-2019-2020/"]]