[[["Deutsches Museum Scholar-in-Residence Program 2019 in Munich Germany (Funded)", "date announced:July 1, 2019", "Application Deadline: October 11, 2019"], ["Application Deadline:", " October 11, 2019", " The Deutsches Museum", " in Munich has several attractive scholarships to offer research scholars interested in working for six or 12 months on projects involving the museum`s vast and heterogeneous collections. The scholarship programme is international and interdisciplinary in scope.", "There are myriad opportunities at the Deutsches Museum for innovative research into scientific processes and the changing cultures of technology. Founded in 1903, the museum’s holdings comprise some 100,000 objects; an ", "archive", " of 4,500 shelf metres including an extensive collection of scientific photographs, technical illustrations, trade literature and private papers; and a specialist ", "research library", " with 875,000 volumes, 5,000 journals, and an extensive collection of rare books on te history of science and technology.", " The museum’s collections have evolved over the years, absorbing the instruments, books and archives of individual scientists and engineers as well as of companies and scientific institutions, and reflect bygone experimental systems and cultures of innovation. The unique structure of this collection enables scholars to develop innovative cross-disciplinary methods of research on the basis of texts, images and artefacts available on site and to engage in both the historical and archaeological exploration of science and technology.", " Applicants are invited to base their projects on the collections of the Deutsches Museum and to cooperate closely with museum staff on site when formulating their research proposals. Projects involving innovative approaches to artefact-oriented research are especially welcome. ", "During their stay, visiting scholars will have daily contact with the\nmuseum´s curators, archivists and librarians (approx. 50 staff members)\nas well as members of the ", "Münchner Zentrum für Wissenschafts- und Technikgeschichte", " (Munich Center for the History of Science and Technology; approx. 50 staff members).\n", "Scholarship holders will have their own workplace with a desktop\ncomputer and telephone, and the opportunity to reside temporarily in\nsubsidized apartments of the museum complex insofar as these are\navailable. They will present their research projects to colleagues at\nthe beginning of their stay and will be expected to participate\nregularly in the museum’s and the Munich Centre’s Monday colloquium\nseries and workshops.", " ", " Pre-doctoral stipends: € 7,500 (six\nmonths) / € 15,000 (full year). Post-doctoral stipends: € 15,000 (six\nmonths) / € 30,000 (full year). Scholars at any level of seniority are\neligible to apply, provided they have at least one university degree\n(Master or PhD). BA is not sufficient. There are no restrictions\nregarding nationality. All scholars are requested to make their own\nprovisions for health insurance.\n", "The ability to read German is a prerequisite for the application (passive language skills). ", "Please send applications,", " including: ", "completed application form (", "pdf-file", ", 20 kB or ", "rtf-file", " 60 kB)", "curriculum vitae", "project description (3 to 5 pages)", "two confidential references (can be sent directly by the referees)", "to the following address:", "Andrea Walther", "Coordinator of the Research Institute", "Deutsches Museum", "80306 Munich", "Tel.: 00 49 (0) 89 2179-280", "Fax: 00 49 (0) 89 2179-239", "E-Mail: ", "a.waltherdeutsches-museum.de", "Detailed information available upon request: ", " Prof. Dr. Elisabeth Vaupel", "For More Information:", "Visit the Official Webpage of the Deutsches Museum Scholar-in-Residence Program 2019"], "url : https://www.opportunitiesforafricans.com/deutsches-museum-scholar-in-residence-program-2019/"], [["Aurecon South Africa Bursary Scheme 2019 for young South Africans", "date announced:July 2, 2019", "Application Deadline: 31 August 2019 "], ["Application Deadline: 31 August 2019 ", "Aurecon bursaries", " are awarded to deserving students for studies at various tertiary institutions in fields specifically related to the company’s activities. Students from approved universities which offer programmes that lead to professional careers in engineering are considered, with bursaries available for students studying towards a BSc or BEng in the fields of Civil, Mechanical or Electrical Engineering.", "We fund up to R90,000.00 (subject to change) per annum to every bursar to support them in their studies. We also provide practical training applicable to the qualification, as required by their educational institution. The bursary will be renewed annually if the student’s academic performance is satisfactory.", "Requirements", "You must be a South African citizen", "You must be studying or intending to study BSc or BEng in Civil, Mechanical or Electrical Engineering undergraduate Degrees at recognised Universities in South Africa. Proof of registration/acceptance is required", "Grade 12 students must have maintained a 5 symbol or higher in Mathematics and Science since Grade 11", "Tertiary students must have maintained a minimum of 70 per cent aggregate", "The bursary will be renewed annually if the student’s academic performance is satisfactory", "Application Process", "Upon receipt of your application, screening and shortlisting\nwill be conducted and only shortlisted candidates will be contacted. You\nwill be required to submit the following documentation to complete your\napplication: ", "Completed application form", "Copy of your CV in Word or PDF format", "Certified copy of your South African ID Book", "Certified copy of all your Academic Transcripts", "Should your application be shortlisted, you will be invited to attend panel interviews in Johannesburg, Cape Town or Durban", "Bursary agreements are then offered to successful candidates", "For More Information:", "Visit the Official Webpage of the Aurecon South Africa Bursary Scheme 2019"], "url : https://www.opportunitiesforafricans.com/aurecon-south-africa-bursary-scheme-2019-for-young-south-africans/"], [["University of Lausanne (UNIL) Master’s Grants Scholarships 2019/2020 for Study in Switzerland.", "date announced:July 7, 2019", "Application Deadline: November 1st 2019"], ["Application Deadline: November 1st 2019", " UNIL Masters scholarships", " are scholarships for excellence awarded exclusively to students who have graduated from a foreign university and whose academic results are of a very high level.", " UNIL grants around ten scholarships a year.", " The scholarship is granted for the minimum statutory period of the programme chosen by the student. It amounts to CHF 1,600 per month from 15 September to 15 July (or 10 months a year) for the complete duration of the masters (one and a half years or two years depending on the chosen masters), with the exception of cases of definitive failure after the first year.", " Candidates are made aware of the fact that the sum of the scholarship awarded is not sufficient to live in Switzerland. ", "Requirements:", "To have obtained a foreign university degree considered equivalent to a bachelor at UNIL before the beginning of the masters programme at UNIL.", "To have distinguished yourself during your studies, especially through particularly brilliant academic results.", "To have a language level of at least B2 (according to the European Language Portfolio global scale) in French or English according to the language in which your chosen masters is taught.", "Not to have been registered with UNIL in the past.", "To have paid the CHF 200.00 administration fee (see document, “list of documents to attach to your application”).", "Application Procedure:", "You must not make an application for admission to the masters degree via the Admissions Department (SII).", "Candidates must send their completed application (refer to the\ndocument, “list of documents to attach to your application”), unbound,\nby post only to the following address:", "\nUniversité de Lausanne", "\nService des affaires sociales et de la mobilité étudiante (SASME)", "\nBâtiment Unicentre", "\nCH – 1015 Lausanne", "\nSwitzerland", "\nThe application form must be completed on a computer and duly signed by the candidate.", "\nThe application for the Masters scholarship also serves as an\napplication for admission to your chosen masters (and therefore an\napplication to register at UNIL).", "\nThe ", "deadline for applications is 1 November", " to begin a\nmasters degree during the following academic year, in the autumn\nsemester or the spring semester if the programme allows. The postmark\nwill attest to the date sent.", "For More Information:", "Visit the Official Webpage of the University of Lausanne (UNIL) Master’s Grants Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-lausanne-unil-masters-grants-scholarships-2019-2020/"], [["London School of Tropical Medicine (LSTM) Global Health Future Leaders Scholarship 2019/2020", "date announced:June 27, 2019", "Application Deadline: July 14th 2019"], ["Application Deadline: July 14th 2019", "LSTM\nis delighted to offer new scholarship opportunities to future leaders\nin global health from Ghana and Nigeria applying for a postgraduate\nqualification on our brand new, innovative and flexible ", "Global Health programme", ".", "The Global Health programme allows students to study online, part-time from anywhere in the world and has a modular structure with three routes: A Master of Science (MSc), Postgraduate Diploma or Postgraduate Certificate.", "LSTM is committed to developing the next generation of Global Health\nLeaders. This new funding, The Global Health Future Leaders Scholarship,\nconsists of :", ".          Two fully funded Postgraduate Certificate places (60 credits)", ".          Two fully funded Postgraduate Diploma places (120 credits)", ".          Partial tuition fee scholarships up to a maximum of £2,500 (These partial scholarships are open to all nationalities)", " Eligibility Criteria", "•For students who are domiciled in Nigeria or Ghana and who hold Nigerian or Ghanaian Nationality ", " LSTM is looking for people who can have a real impactin-country, the next generation of Global Health Leaders. Global Health is not just the realm of healthcare professionals. As a result, we are looking for a wide rangeof people from other disciplinesthat are impacted by global health issues ", " Academic Requirements:", "The programmes are open to university graduates in health, or related disciplines. Graduates from other disciplines are encouraged to apply. Non-graduates with considerable work experience in the health sector and who can provide evidence of continued academic development through appropriate in-service training will also be considered ", " HOW TO APPLY", "Please submit your application for the programme through our website: ", "https://www.lstmed.ac.uk/study/courses/global-health", ". ", "The online portal can be accessed by clicking the ‘APPLY’ tab on the courseinformation page.Once you receive your conditional offer, a scholarship form will be providedvia email ", "For More Information:", "Visit the Official Webpage of the LSTM Global Health Future Leaders Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/lstm-global-health-future-leaders-scholarship-2019/"], [["German Development Bank-KFW/East African Community (EAC) Scholarship Programme 2019 for Masters Studies", "date announced:July 10, 2019", "Application Deadline: 1st August 2019, not later than 17:00 hours East Africa Time. "], ["Application Deadline: 1st August 2019, not later than 17:00 hours East Africa Time. ", "The EAC Scholarship Programme", " is an initiative by the ", "East African Community (EAC), the Inter-University Council for East Africa (IUCEA)", " and ", "German Development Bank-KFW.", " The project begun in 2018 when the EAC and IUCEA entered into a memorandum of understanding (MoU) with KFW geared towards the training of students within the EAC region. This Project aims at creating future change agents, who identify themselves with the integration agenda of the EAC and are willing to share economic and development-oriented expert knowledge. The goal of this initiative is to contribute towards training leaders that will foster EAC regional integration. ", "This goal will be partly achieved through the establishment of academic collaboration and an exchange programme between universities/Institutions within the EAC region, by encouraging students to study in countries other than their own. In order to achieve these impacts, the project offers a comprehensive package including scholarships for masters programmes, internships, mentoring, networking events and further leadership training activities. ", "The scholarship will support masters students in Mathematics, Engineering, Informatics, Science, Technology and Business Science programmes. The programme will include a minimum 30 percent females students in order to support women’s participation and enhance gender equality. IUCEA hereby invites applications from students who are citizens of the East African Community (EAC) Partner States to apply for the ", "KFW funded Masters Scholarships.", "Objective", " The objective of the programme is to train masters scholars who will serve as change agents for regional economic development and integration in the EAC.", "Requirements:", "Selection Criteria", "\nThe following criteria is mandatory. Students should:", "\na) Be citizens of a partner state of the East African Community;", "\nb) Possess the required academic qualifications for admission to the programme", "\nc) Submit a well written motivation letter in English elaborating on the following:", "\n Motivation for wanting to pursue a the Masters Programme chosen in section 2 above", "\n Foreseen professional engagement in EAC Integration agenda after completing the Masters", "\n Expect application of the acquired skills and knowledge from the Masters Programme to contribute the EAC Integration Agenda", "\n Personal professional and academic vision in the next 5 to 10 years", "\nNote: Please note that all the above should be covered in one letter of not more than 500 words", "\nd) Be below 35 years of age", "\ne) Have applied to study in an EAC Partner State other than their country of citizenship", "Design", " The project offers financial support to academically skilled and disadvantaged masters students with the main focus on priority programmes. Women and persons with disabilities are encouraged to join the programme. Masters students shall be given a fixed amount of money to cover living as well as costs for teaching and research materials. The students shall be required to apply to study in an EAC Partner State other than their own.", " At the universities/Institutions, mentors will be selected in order to support the students during the time of study and research. With the help of integrated internships, and extra-curricular activities, practical learning will be ensured through the universities and public-private partnerships undertakings. IUCEA will support the universities/Institutions in selection of the mentors and facilitation of the internships during the implementation of masters programmes.", " The financial cooperation arrangement shall finance the first three cohorts of approximately 157 masters students over their full study time of 2 years. After the first cohort has completed the studies, an independent evaluation of the level of attainment of the objectives of the project will be carried out, with the desirable impact being assessed.", " The students will take part in extracurricular events at minimum of one event-visit per year per student. These could be networking events with representatives from political and socio-economic spheres, whereby training on regional integration topics and other subjects based seminars are organized.", "Application process", "\nApplications will be submitted through the following process and steps:", "Identify the programme and University of your choice", "Fill the application form for admission to the university (available from the university, visit their website for more details)", "Fill an application form for the scholarship (available on the IUCEA website at http://www.iucea.org;", "Append the supporting documentation for the admission as per university requirements and for the scholarship as per section 7 below;", "Submit both application forms electronically to the University and copy to the following email addresses:", "  ", "[email protected]", "  ", "[email protected]", " Note: Where universities have online application system, please send the scholarship application form to the specified email addresses", "Supporting Documents", " Please submit the following supporting documents together with the application forms", " a. Signed curriculum vitae", " b. Certified copies of all university degree certificates. Please combine into one file. If necessary, you may zip the file to make it smaller for uploading.", " c. Certified copies of all university transcripts. Please combine into one file. If necessary, you may zip the file to make it smaller for uploading.", " d. If applicable, an official letter confirming release from your employer. The letter must be on letterhead.", " e. Recent passport photograph in colour of your full head and upper shoulders.", "f. Evidence of citizenship of a Partner State in the East African Community such as copy of national identity card/ passport/birth certificate;", "\ng. A well written motivation letter in English showing the relevance of intended programme of study to the EAC integration and development agenda", "\nPlease note the following:", "\na. A student may apply to more than one University.", "\nb. It is highly recommended that you submit your application well before the closing date for applications, especially if you commonly experience slow Internet speeds or frequent Internet outages.", "\nc. Kindly reduce the sizes of your files as much as possible to make them easier to upload.", "\nd. Preferrably all files including scanned ones should be saved and uploaded in pdf format", "\ne. The maximum size for any complete application is 25 MB.", "\nThe deadline for receiving applications is 1st August 2019, not later than 17:00 hours East Africa Time.", "For More Information:", "Visit the Official Webpage of the EAC Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/eac-scholarship-programme-2019-for-masters-studies/"], [["German Academic Exchange Service (DAAD) Development-Related Postgraduate Scholarships 2020/2021 for study in Germany.", "date announced:July 26, 2019", "Application Deadline: Varying by Institution"], ["Application Deadline: Varying by Institution", " From among the large number of postgraduate courses offered by German institutions of higher education, the ", "German Academic Exchange Service (DAAD) ", "supports a carefully chosen selection of programmes of particular interest to junior executives from developing countries.", " These degree courses, which consist of one to two years of concentrated study, provide young, academically-trained professionals in leading positions from developing countries with the opportunity to engage in postgraduate education and training in their particular field or profession.", "At present, postgraduate courses are offered in the following fields:", "•Economic Sciences/ Business Administration/ Political Economics", "•Development Cooperation", "•Engineering and Related Sciences", "•Mathematics ", "•Regional and Urban Planning", "•Agricultural and Forest Sciences", "•Natural and Environmental Sciences", "•Medicine and Public Health", "•Social Sciences, Education and Law", "•Media Studies ", " The courses are open to all eligible candidates. Applications are welcome from professionals with personal financial resources, from those who are funded by their government or company, or from those who are recipients of financial support from international sponsoring organi-sations. ", "In addition, a limited number of full DAAD scholarships are available. The DAAD only awards these scholarships for postgraduate courses supported in this funding programme. ", " Postgraduate courses for young professionals from developing countries", "•Internationally recognised Master’s and PhD degree•Duration: 12-24 months for Master (depending on the particular institution) and 36 months for PhD", "•Includes German Universities and Universities of Applied Sciences ", "•Support of selected programmes with a variety of scholarships (including German language courses)", "•Funded by the BMZ (Federal Ministry for Economic Cooperation and Development),but admission also open to self-financed participants or students financed through government or other sources", "•Academic year 2020/2021 ", "Selection criteria and procedures for DAAD scholarship recipients ensure that:", "•priority target candidates have proven, development-related motivation and can be expected to make full use of their scholarship and education by taking on social responsibility later in their careers, acting as agents of change who stimulate and support development in their personal and professional surroundings (motivation, commitment to development),", "•the candidates have the professional and academic qualifications necessary to ensure suc-cessful completion of the degree programme in Germany (final scores on previous academic examinations, language skills), ", "•women and candidates from disadvantaged groups who meet the required academic and professional standards and show proven commitment to development-related issues are especially targeted for programme admission. ", " The Typical Scholarship Holder:", "•Works either for a public authority or a state or private company in a developing country and, as such, is engaged in the planning and execution of directives and projects with emphasis on development policies having a bearing on technological, economic or social areas.", "•Holds a Bachelor’s degree (normally four years) in a related subject.", "•Has completed an academic degree with far above average results (upper third) and at least two years of related professional experience after the first degree (bachelor) at the time of application.", "•His/her academic degrees should normally not be more than six years old. ", " Required Documents for a DAAD scholarship application (in the following order):", "•Signed DAAD application form with current date (https://www.daad.de/medien/deutschland/stipendien/formulare/forschungsstipendium_en.pdf)•Personally signed CV (please use the sample europass form at http://europass.cedefop.europa.eu/) with current date•Personally signed Letter of Motivation (with reference to current occupation and choice of postgraduate programme(s), two pages maximum) with current date.", "•IMPORTANT: When applying for more than one postgraduate course (maximum 3 courses), you have to submit one motivation letter explaining why you are applying for these specific courses and why you chose that priority.", "•Academic Letter/s of Recommendation from your university; the letter must have a letterhead, signature and official stamp and must be of current date (not in a sealed envelope)•Letter of recommendation from your current employer; the letter must have letterhead, a signature and official stamp and must be of current date (not in a sealed envelope)", "•Certificate(s) of Employment from the employer(s) that proof a minimum of two years of rele-vant working experience (after the bachelor degree) at the time of application and if possible, a guarantee of re-employment from your current employer upon returning home. ", "•Pro of of Language Skills: English – IELTS or TOEFL (Note: The institutional TOEFL is not accepted) German – required for courses taught in German", "•Copies of Academic Degrees (certified translation if necessary)", "•Copies of Academic Transcripts, incl. grading-scale (certified translation if necessary)", "•Applicants from the People’s Republic of China are asked to submit an APS Certificate with their application documents.Note: Some courses may require additional documents. ", "For detailed information, please see the relevant course description on the following pages and on the respective websites. ", " Application and Selection Procedure", "•Step 1:You send your complete application directly to the according postgraduate course.", "•Step 2:A selection committee suggests potential candidates for a DAAD scholarship. •Step 3:The suggested candidates will be contacted by DAAD to upload their complete application to the DAAD Portal. ", "•Step 4:The selection process will be finalized and the suggested candidates will be informed accordingly", "IMPORTANT:Make sure that you have a copy of each document of your application ready, as those documents (as PDF files) have to be uploaded to the DAAD Portal in case you are suggested for a DAAD scholarship! ", "For More Information:", "Visit the Official Webpage of the DAAD Development-Related Postgraduate Scholarships"], "url : https://www.opportunitiesforafricans.com/daad-development-related-postgraduate-scholarships-2020-2021/"], [["Quebec Government 2019/2020 Merit scholarship program for foreign students (PBEEE) for study in Canada.", "date announced:July 25, 2019", "Application Deadline: October 1st 2019, 4 pm "], ["Application Deadline: ", "October 1", "st ", "2019, 4 pm", " ", " The Fonds de recherche du Québec – Nature et technologies (FRQNT)", " is responsible for managing the program. It was commissioned by the Ministère de l’Éducation et de l’Enseignement supérieur du Québec (MEES) which provides the funding. The program has a component open to students of all countries and six specific components reserved for students from Brazil, China, India, Israel, Mexico and Wallonia. These specific components arise from agreements concluded between Québec and foreign governments.", "\nThe objective of the Merit Scholarship Program for Foreign Students\n(PBEEE) is to support the internationalization of research activities in\nQuébec’s institutions of higher education, to attract the best foreign\nresearchers and students, and to promote abroad Québec universities and\nCollege Centres for the Transfer of Technologies (CCTT).", "\nThe program covers higher education as a whole by giving to the CCTT\nresearchers and administrators the opportunity to participate.", "\nIn a more generic way, the attribution of scholarships for foreign\nstudents aims at creating cultural links and allowing the setting up of\npossible common scientific research projects.", " The program also represents an instrument for the MEES to support the Government of Québec’s scientific policy.", "Eligibility Requirements:", "Candidates:", " \nMust meet all eligibility conditions at the closing date of the\ncompetition (a different closing date has to be confirmed for the\nstudents preselected by CSC).", " \nMust have been preselected by a university or Synchronex (a CCTT).", " \nFor the Québec-China scholarship, must be preselected by the CSC.", " \nCannot have already received a Merit Scholarship for Foreign Students\nfrom MEES, FRQNT or theFonds de recherche du Québec – Société et culture\n(FRQSC).", " \nCannot be a Canadian citizen or a permanent resident of Canada.", " \nCannot have applied for permanent resident status under Canadian immigration law.", "Features of the scholarships", "\nThe Merit Scholarship Programs for Foreign Students has three components:", " \nDoctoral research scholarships (V1, 1B, 1C, 1I, 1IS, 1M, 1W);", " \nPostdoctoral scholarships (V2, 2B, 2C, 2I, 2M);", " \nShort-term research or professional development scholarships (V3, 3B, 3C, 3I, 3IS, 3M, 3W)", "Value of Scholarships", "\nIn addition to the scholarship, MEES offers all scholarship recipients\nan exemption from paying the higher tuition fees required for foreign\nstudents and the medical insurance coverage offered by the Régie de\nl’assurance maladie du Québec (RAMQ).", "Value of scholarships for each component", "Doctoral research scholarships (V1, 1B, 1C, 1I, 1IS, 1M, 1W):", "\n$25,000 a year. The duration of the scholarship is three years, with a\npossible extension of up to 12 months (monthly allowance of $1,000).", "Postdoctoral scholarships (V2, 2B, 2C, 2I, 2M)", ": $35,000 for one year (cannot be renewed).", "Short-term research or professional development scholarships (V3, 3B, 3C, 3I, 3IS, 3M, 3W)", ": $3,000 a month for a period of up to four months.", "All countries scholarships ", "\nDoctoral research scholarships (V1)", "\nPostdoctoral scholarships (V2)", "\nShort-term research or professional development scholarships (V3)", "Québec-Brazil scholarships", "\nQuébec-Brazil Doctoral research scholarships (1B)", "\nQuébec-Brazil Postdoctoral scholarships (2B)", "\nQuébec-Brazil Short-term research or professional development scholarships (3B)", "Québec-China scholarships", "\nQuébec-China Doctoral research scholarships (1C)", "\nQuébec-China Postdoctoral scholarships (2C)", "\nQuébec-China Short-term research or professional development scholarships (3C)", "Québec-India scholarships", "\nQuébec-India Doctoral research scholarships (1I)", "\nQuébec-India Postdoctoral scholarships (2I)", "\nQuébec-India Short-term research or professional development scholarships (3I)", "Québec-Israel scholarships", "\nQuébec-Israel Doctoral research scholarships (1IS)", "\nQuébec-Israel Short-term research or professional development scholarships (3IS)", "Québec-Mexico scholarships", "\nQuébec-Mexico Doctoral research scholarships (1M)", "\nQuébec-Mexico Postdoctoral scholarships (2M)", "\nQuébec-Mexico Short-term research or professional development scholarships (3M)", "Québec-Wallonia scholarships", "\nQuébec-Wallonia Doctoral research scholarships (1W)", "\nQuébec-Wallonia Short-term research or professional development scholarships (3W)", "For More Information:", "Visit the Official Webpage of the 2019/2020 Merit scholarship program for foreign students (PBEEE)"], "url : https://www.opportunitiesforafricans.com/quebec-government-2019-2020-merit-scholarship-program-for-foreign-students/"], [["2019/2020 KNUST-Tullow Tertiary Scholarship Scheme for Undergraduate and Postgraduate study in Ghana.", "date announced:July 16, 2019", "Application Deadline: September 10, 2019 "], ["Application Deadline: ", "September 10, 2019", " ", "The College of Engineering, KNUST is accepting applications for the award of the ", "2019/2020 KNUST-Tullow Tertiary Scholarship Scheme", " for both ", "Undergraduate and Postgraduate students ", "who are exceptionally brilliant but with dire financial needs. Scholarship is for ", "Engineering Courses", ".", "The KNUST-Tullow award is a full scholarship scheme which covers Undergraduate and Postgraduate education inclusive of:", "Full tuition and provision of learning materials", "Comprehensive financial support for on or off campus accommodation and monthly stipend", "This is for a period not exceeding a maximum of four (4) academic\nyears for Undergraduates and for a period not exceeding a maximum of two\n(2) academic years for Postgraduate Students who are also entitled to\nresearch support", "The award recipients are expected to maintain excellent academic standards of at least a ", "B average or 3.0 CGPA (CWA of not less than 65%) ", "to be in good standing to keep the Scholarship.", "Eligibility:", "To qualify and/or be eligible to apply for the KNUST-Tullow\nScholarship, student applicants must meet all of the following\nrequirements:", "All Applicants with WASSCE or equivalent qualification\napproved/accepted by KNUST and satisfies admission requirements are\neligible for the Undergraduate scholarship.", "The Applicant must be enrolled at Kwame Nkrumah University of\nScience and Technology in full time Undergraduate or Postgraduate\nProgramme in Engineering", "The Applicant must be a Ghanaian citizen", "The Applicant must have Critical Economic Needs", "The Applicant must have Proven Records of Leadership and Community Engagement(s).", "Females and Physically Challenged Applicants are encouraged to apply.", "The Applicant must be prepared to Go-Back and Give-Back to his or her Community.", "All Engineering Programmes are considered.", "Indigenes from the Western Region will be given priority.", "How to Apply:", "Write a personal statement and provide the following;", "Evidence of the income of parents/guardian. E.g. copies of the payslip of your parents/guardian. (if applicable).", "Provide three (3) reference letters from persons of higher reputation. All the letters must be signed and sealed independently.", "Attach any other relevant documents that you believe will support your application and submit all to the address below:", "The Office of the Provost,", "College of Engineering", "KNUST, Kumasi.", "For More Information", "Visit the Official Webpage of the 2019/2020 KNUST-Tullow Tertiary Scholarship Scheme"], "url : https://www.opportunitiesforafricans.com/2019-2020-knust-tullow-tertiary-scholarship-scheme-for-undergraduate-and-postgraduate-study-in-ghana/"], [["David Oyedepo Foundation Scholarship program 2019 for Postgraduate African Students", "date announced:July 1, 2019", "Application Deadline:July 14, 2019"], ["Application Deadline:July 14, 2019", "The David Oyedepo Foundation scholarship program", " is our major platform for promoting the Foundation’s vision and goals. The scholarship program awards full ride scholarships to qualified individuals who are indigenes and residents of African countries. The scholarship seeks to develop youth leaders who are ready to put their learned skills to work in leading organizations, communities and their local countries. The scholarship grants students the opportunity to study at Covenant and Landmark University, Nigeria. ", "ELIGIBILITY REQUIREMENTS", " ", "The David Oyedepo Foundation Scholarship program", " is open to Young Africans who meet the", " following criteria:", " • Are citizens and permanent residents of any African Nation", " • Are between the ages of 22 and 30 at the time of application submission", " • Are eligible to receive a Nigerian student visa Are proficient in reading, writing and", " speaking English", " • Have a record of exceptional performance in first degree; which is benchmarked by:", "At least a CGPA of 4.5.", "Already have begun admission applications to Covenant or Landmark University", "FINANCIAL PROVISIONS OF THE SCHOLARSHIP", " • Full Academic fees for a maximum of 1 year (In accordance to the University stipulated", " time for duration of chosen course).", " The scholarship does not cover;", " • Travel allowances", " • Feeding allowances", " • Medical/Health Insurance or allowance", " • Any other fees outside University generated Academic fees for a course at any level.", "SELECTION PROCESS AND CRITERIA", " The David Oyedepo Foundation Scholarship Program selection process is a need dependent, merit-based open competition. After the deadline, all eligible applications will be reviewed by a selection panel. Following this review, chosen finalists will be interviewed by the David Oyedepo Foundation team, through an online video conferencing platform. If advanced to the final round, the applicant must provide;", " • Proof of application to Covenant or Landmark University", " • Proof of citizenship", "• All original copies of documents uploaded during application.", "For More Information:", "Visit the Official Webpage of the David Oyedepo Foundation scholarship program 2019 "], "url : https://www.opportunitiesforafricans.com/david-oyedepo-foundation-scholarship-program-2019/"], [["2020-21 Fulbright African Research Scholar Program (ARSP) for postdoctoral research", "date announced:July 15, 2019", "Application Deadline: August 16, 2019. "], ["Application Deadline: August 16, 2019. ", "The U.S. Mission is now accepting applications for the", " ", "2020 Fulbright African Research Scholar Program", ". This award funds African university lecturers and professors to conduct ", "postdoctoral research", " or undertake a planned program of reading and research.", "Program Information:", "Two categories of grants are offered in the ARSP:  research grants and program and curriculum development grants.", "Research Grants:", "Awards of 3 to 9 months are offered for African university faculty or\nresearch institute professionals to conduct research in any academic\ndiscipline at a U.S. academic or research institution beginning no\nearlier than August 2020 and no later than March 2021.  Applicants must\nhold a doctorate or equivalent terminal degree in their fields. \nPreference will be given to individuals who have at least three years of\nuniversity teaching experience and a productive scholarly record.", "Program and Curriculum Development Grants:", "Awards of 3 to 5 months are offered for African university faculty or\nadministrators to conduct research in any academic discipline at a U.S.\nacademic or research institution beginning no earlier than August 2020\nand no later than March 2021.  Proposals should be linked to\nprofessional duties and demonstrate how the scholar will use the\nknowledge gained to develop new courses, curricula, or other academic\nprograms at the home institution.  These grants are designed for\nuniversity faculty or administrators with less experience and who may\nnot have had recent access to research or instructional developments in\ntheir disciplines.  A doctorate degree is not required, but applicants\nmust hold a minimum of a master’s or equivalent graduate degree.", "Additional Information on Eligibility:", "The ARSP is open to scholars in all disciplines\nand without regard to gender or age; however, proposals for clinical\nmedical research involving patient contact cannot be approved under the\nFulbright Program.", "Applicants must be citizens of the country from which they apply or\npermanent residents qualified to hold a valid passport issued by that\ncountry.", "Applicants for research grants must hold a doctorate degree or\nequivalent terminal degree in their fields.  Preference is given to\nindividuals who have at least three years of university teaching\nexperience and a productive scholarly record.", "Applicants without doctorate degrees but who hold a master’s or\nequivalent graduate degree are eligible in the program and curriculum\ndevelopment category.", "Applications for doctoral dissertation research, postdoctoral\nresearch immediately following the completion of a doctorate degree, or\ngeneral professional travel, are ineligible.", "Preference will be given to candidates who have not previously received a Fulbright scholar grant.", "Preference will be given to candidates who have had no experience or limited experience in the U.S.", "Applicants must have sufficient proficiency in English to carry out\ntheir research projects and collaborate effectively with colleagues. \nTOEFL exams are not required, but Posts may choose to institute local\nEnglish language testing, if necessary, to evaluate applicants’ language\nskills.  At a minimum, Posts should evaluate English-language\nproficiency through a documented interview conducted in-person or by\nvideoconferencing, or by telephone if videoconferencing is not a viable\noption.", "Applicants must be in good health.  Successful candidates will be asked to submit a Medical History and Examination Report.", "Scholars who were unsuccessful in previous competitions may\nre-apply.  Repeat applicants should revise their proposals, update\ncurriculum vitae, and obtain current letters of reference.", "Additional Information on Applications:", "Scholars must indicate the grant category for which they are\napplying (research or program and curriculum development).  The Council\nfor International Exchange of Scholars (CIES) will assign scholars who\ndo not indicate a preference to an appropriate category.", "Each application must include three letters of reference.", "Letters of invitation are strongly encouraged but not required. \nApplicants are discouraged from requesting affiliation with an alma\nmater.  CIES will honor institutional affiliation preferences as far as\npossible.  Applicants unfamiliar with U.S. institutions may request that\nCIES identify suitable placements.", "Laboratory fees are not part of the standard benefits\npackage for the ARSP and are awarded on a limited, case-by-case basis,\nand only if funding is available.", "All applications are reviewed by a local selection panel; final\nnominations are reviewed in the United States by independent review\ncommittees. Final selection of awardees is made by the J. William\nFulbright Foreign Scholarship Board.", "For Applications:", "Applications must be submitted using the Embark Visiting Scholar system, accessible at ", "https://apply.iie.org/fvsp2020", "For More Information", "Visit the Official Webpage of the 2020-21 Fulbright African Research Scholar Program (ARSP)"], "url : https://www.opportunitiesforafricans.com/2020-21-fulbright-african-research-scholar-program/"], [["South African Reserve Bank (SARB) Bursary Programme 2019 for young South Africans", "date announced:July 4, 2019", "Application Deadline: September 30th 2019"], ["Application Deadline: September 30th 2019", " ", "The South African Reserve Bank (the Bank),", " as part of addressing the severe shortage of skills in South Africa, provides bursaries to students in relevant fields of study who are from disadvantaged backgrounds.", "The\npurpose of the bursary scheme is to assist financially needy students\nwho obtain good results in Matric/Grade 12 and who want to study in\nfields relevant to the Bank. ", "The bursary is intended for undergraduate studies at a South African university on a full-time basis.", "Studies for which bursaries will be granted ", "The studies that students intend to pursue shall have a bearing on, and be applicable to, the functions and activities of the Bank. (For more information on the Bank, visit the Bank’s website: he studies that students intend to pursue shall have a bearing on, and be applicable to, the functions and activities of the Bank. (For more information on the Bank, visit the Bank’s website: ", "www.reservebank.co.za", "). This includes, for example, Economics, Actuarial Sciences, Mathematical Statistics, Information Technology, Finance, Law and Accounting, and excludes for example, Medicine, Dentistry and Social Work.", "A\nbursary will be granted from the first academic year and reviewed\nannually. Bursary holders need not reapply for the bursary each year.\nThe total number of students and related bursary costs will be reviewed\nannually.", "The Bank will provide students who are Bank bursary   holders, vacation work opportunities that are funded by the Bank. ", "Criteria for awarding bursaries ", " Over and above the criteria set out in paragraphs 1 to 3 above, the following will be used as guidelines in the awarding of bursaries:", "·          Bursaries will be awarded to students who obtain 70 per cent in the June Matric/Grade 12 examinations with final awarding subject to final results and enrolment acceptance at a South African university·          Bursaries will be awarded to South African citizens only.", "Only students who would not have the means of attending university, had it not been for a bursary, would be considered.   ", "Post-bursary obligations", " ", "  The Bank will have first right of refusal with regard to funded students, that is, bursary holders will be obliged to work for the Bank after completion  of their studies, unless the Bank chooses not to employ them.", "Students who choose not to work for the Bank despite the Bank offering them a position after completing their studies will be required to pay the full cost of the bursary back to the Bank.    ", " How to apply", " The closing date for submission of applications shall be 30 September of each year.", "Examination\nresults, university enrolment form (student number) and any other\nsupporting documents must be submitted with the application form.", "Application to be posted to:", "Mr John Legoete", "P.O. Box 30632", "BRAAMFONTEIN", "2017", "or ", "Fax: 086 609 7183", "or ", "Email: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the South African Reserve Bank (SARB) Bursary Programme 2019 "], "url : https://www.opportunitiesforafricans.com/south-african-reserve-bank-sarb-bursary-programme-2019/"], [["UNHCR Albert Einstein German Academic Refugee Initiative (DAFI) UNHCR’s scholarship programme 2020 for refugee students", "date announced:June 28, 2019", "Application Deadline: June 30th 2019"], ["Application Deadline: June 30th 2019", "UNHCR’s scholarship programme,", " ", "the Albert Einstein German Academic Refugee Initiative (DAFI)", ", enables access to higher education for refugee students in their country of asylum since 1992.", "The DAFI programme provides undergraduate refugee students with scholarships that cover a wide range of costs: from tuition fees and study materials, to food, transport and accommodation.", " To support their academic achievements and skill development, DAFI scholars receive additional support through close monitoring, academic preparatory and language classes based on students’ needs, as well as psychosocial support, mentoring and networking opportunities. ", "Requirements:", "In order to be eligible, a candidate must:", "be a refugee with recognised refugee status;", "have successfully completed secondary schooling to a high standard;", "have no other means of support for university studies;", "select a course of study that is likely to lead to employment in the country of origin with maximum three to four years duration;", "not be older than 28 years at the beginning of studies;", "have no other family member receiving a DAFI scholarship.", "In 2019, DAFI scholarships are available in 52 countries, namely:", "Sub-Sahara Africa", ": Benin, Botswana, Burkina Faso,\nBurundi, Cameroon, Chad, Cote d’Ivoire, Eritrea, Ethiopia, Gambia,\nGhana, Guinea, Guinea Bissau, Kenya, Liberia, Mali, Malawi, Mozambique,\nNamibia, Niger, Nigeria, Rwanda, Senegal, South Africa, South Sudan,\nSudan, Tanzania, Togo, Uganda, Zambia & Zimbabwe.", "Middle East & Northern Africa (MENA):", " Algeria, Egypt, Kurdistan Region of Iraq, Jordan, Lebanon, Mauritania, Morocco, Syria & Yemen.", "Asia & Pacific:", " Afghanistan, Bangladesh, India, Iran, Kyrgyzstan, Pakistan &Tajikistan.", "The Americas", ": Ecuador & Mexico.", "Europe", ": Azerbaijan, Russian Federation, Turkey & Ukraine.", "How to apply?", "Check in the list above if there is a current DAFI Programme in your country of asylum.", "Check if you meet the above-mentioned criteria.", "You can contact the respective office by emailing your country of interest in the following ", "contact form", ".", "Complete the country specific application form and submit as indicated on the form.", "For More Information:", "Visit the Official Webpage of the DAFI UNHCR’s scholarship programme 2019"], "url : https://www.opportunitiesforafricans.com/dafi-unhcrs-scholarship-programme-2020-for-refugee-students/"], [["Toyota South Africa Graduate Programme 2020 for young South Africans", "date announced:June 27, 2019", "Application Deadline: July 12th 2019"], ["Application Deadline: July 12th 2019", "Toyota invites graduates to share in a journey aimed at producing future leaders through its exciting ", "Graduate Programme.", "Toyota is based in Durban and Johannesburg, with the opportunity of a structured journey with wide career progression in various sectors.", " The Toyota Way Pillars of Continuous Improvement and Respect for people are the foundation of the Graduate Programme which strives to develop excelling individuals through a combination of 70% on-the-job development, 20% classroom training and 10% mentorship.", "2 year development programme starting February 2020", "Benefits", "Rotation – Incumbents are exposed to a variety of disciplines and projects.", "Training – World class TOYOTA learning and problem solving concepts.", "Employee Assistance – Access to a wide variety of services such as: Study assistance, Car benefits , Relocation, Competitive salary packages, subsidised canteen facilities and Employee health services.", "Performance Management – Competency and value driven performance management system aimed at developing future leaders.", "Requirements:", "Individuals who are agile learners and who are committed to self-development.", "\nIndividuals who demonstrate leadership qualities.", "\nIndividuals who share our values.", "\nIndividuals who share our passion for change and improvement.", "\nApplicants must be in their final year of studying or have completed a qualification in one of the following qualifications and disciplines.", "Qualifications: National Diploma, Bachelor’s Degree.", "Disciplines: Electrical, Mechanical, Mechatronics and Industrial engineering", "\nHuman resources", "\nStatistics", "\nInformation technology, Computer science, Information systems", "\nAccounting, Finance, Economics, Marketing", "\nOperations Management", "For More Information:", "Visit the Official Webpage of the Toyota South Africa Graduate Programme 2020"], "url : https://www.opportunitiesforafricans.com/toyota-south-africa-graduate-programme-2020/"], [["2019 Grace Hopper Celebration of Women in Computing Conference Google Travel Scholarship", "date announced:June 27, 2019", "Application Deadline: July 7 at 11:59 p.m. PT "], ["Application Deadline: July 7 at 11:59 p.m. PT ", " As part of Google’s ongoing commitment to increasing the number of women in engineering, we are excited to offer travel and attendance scholarships to the ", "2", "019 Grace Hopper Celebration of Women in Computing Conference", " taking place in Orlando, FL from October 1-4, 2019. ", "While all university students and industry professionals in the US and Canada as well as current Google interns who are excelling in computing and passionate about diversity, equity and inclusion in the tech industry are encouraged to apply, this year’s scholarship has a dedicated focus on engaging women of color. This includes but is not limited to women of Black/African American/Caribbean/WestIndies and Hispanic/Latinx descent. ", "Eligibility", "To be eligible for a scholarship to attend an international conference, applicants must:", "Be a student enrolled with a recognized university in Africa who is in need of conference travel funds.", "Studying computer science, computer engineering, or a technical field related to the conference subject.", "Have a paper accepted for presentation (oral or poster) in the ", "main conference", " program at a top-tier Computer Science conference. We prefer to support conferences in research areas where Google has a strong interest. Please visit ", "research.google.com", " for a list of areas. The paper must be accepted for full publication and preferably full oral presentation. Workshop papers will not be approved for travel scholarships.", "Be the sole or joint first author of the accepted paper.", "To encourage attendance at technical conferences, Google will provide selected recipients:", "Free conference registration", "North America", ": Up to 1,000 USD (unless otherwise\nnoted) reimbursement to retroactively be used toward airfare and\naccommodation costs (will be awarded after the conference)", "Europe", " : Up to 1,000 EUR towards travel and accommodation costs (will be paid after the conference)", "India", " : An award in the range of 1,000 – 3,000 USD\nthat will cover conference registration, travel, accommodation and other\nrelated expenses.", " Africa", " : An award in the range of 1,000 – 3,000\nUSD that will cover conference registration, travel, accommodation and\nrelated expenses. Scholarship amount depends on cost for the\ninternational conference.", "Japan & South Korea", " : Up to 3,000 USD towards\nair tickets and lodging cost (will be paid after the conference).\nScholarship amount depends on cost for the international conference.", "For More Information:", "Visit the Official Webpage of the 2019 Grace Hopper Celebration Google Travel Scholarship"], "url : https://www.opportunitiesforafricans.com/2019-grace-hopper-celebration-of-women-in-computing-conference-google-travel-scholarship/"], [["Jones & Wagener Undergraduate Bursary Scheme 2020 for South Africans to Study Engineering in South Africa", "date announced:June 26, 2019", "Application Deadline:"], ["Application Deadline:", " Jones & Wagener is pleased to offer a limited number of bursaries for South African B.Eng or BSc Civil Engineering students studying at South African Universities. The bursaries will cover as a minimum university tuition fees, but could also include accommodation and a limited textbook allowance.Current South African tertiary students and Grade 12 scholars are invited to submit applications. ", " The award of bursaries will be carried out based on academic merit, financial need and company specific considerations. Applicants who have achieved less than 70% in both Maths and Physical Science will not be considered. Jones & Wagener is required to implement Black Economic Empowerment and therefore bursaries will be awarded to reflect the population composition of South Africa. ", "Students studying with Jones & Wagener bursaries may be required to do six weeks paid vacation work at our offices in Rivonia or Centurion during the July and/or December recess. After completion of their studies, bursary students will be required to work for Jones & Wagener for a period equal to the period for which the bursary was held. ", " The closing date for applications is 31 July 2019. ", "If you have not heard from us regarding your application by 28 September 2019, pleaseconsider your application as unsuccessful.Application forms are available from our website www.jaws.co.za The completed forms must be sent to the Bursary Administrator at the Jones & Wagener preferably by email to ", "[email protected]", " or alternatively by post to PO Box 1434, Rivonia, 2128.Suggestions on completing your bursary application form. ", "The competition for bursaries is very tough. Having no prior knowledge of the applicants, Jones & Wagener has to gather all the information about whom to invite for a bursary interview from the application form. Please ensure that the form is completed in full and in legible writing.Academic results play the most important role in our decision; it is therefore essential that you provide us with the most recent, complete and clear academic record.", " In completing the other questions, remember that you are “marketing” yourself and your interests and abilities. It is therefore important to spend some time to think carefully about what to write. ", "For More Information:", "Visit the Official Webpage of the Jones & Wagener Undergraduate Bursary Scheme 2020"], "url : https://www.opportunitiesforafricans.com/jones-wagener-undergraduate-bursary-scheme-2020/"], [["Afro Asiatisches Institut Salzburg 2019/2020 One World Scholarship Programme", "date announced:July 5, 2019", "Application Deadline: July 31th, 2019. "], ["Application Deadline: ", "July 31th, 2019.", " ", " The One-World-Scholarship-Programme", " is a partial scholarship aimed at students from Africa, Asia and Latin America who have come to Austria on their own initiative, in order to complete their education. Prospective awardees are required to focus on questions related to development in their studies and research. ", "Formal requirements and conditions:", "nationality of a non-European developing country (", "country list", ")", "admission to a Master or PhD programme at a university or university\nof applied sciences in Salzburg or Tyrol (Uni Salzburg, Uni Innsbruck,\nFH Salzburg, MCI, FH Kufstein)", "for PhD students: approved disposition", "age limit: Master studies max. 30 years (mothers: 35 years), PhD\nstudies max. 35 years (mothers: 40 years) at the time of application", "residence permit “student”", "No scholarships are awarded for", "studies at private universities", "postgraduate study programmes (“Lehrgänge”, e.g.\n“Universitätslehrgang” or “Fachhochschullehrgang”) or other\nnon-degree certificate programmes", "applicants  with a residence title other than “student”", "non-degree programme students („außerordentliche Studierende“)", "short term visits and exchange programmes", "Requirements for a succesful application:", "Financial need", "We\nconsider own income, savings, other means of support, profession and\nincome of parents in order to select students who would hardly be able\nto successfully finish their studies without financial support.", "Evidence of good progress in studies", "Good\nstudy progress documented by transcript of records of current and past\nstudies. In programmes without entry exams, students who have already\ncompleted at least one semester at an Austrian university have a\ndistinctive advantage.", "Interest in development and according specialisation in studies", "Prospective\nawardees are expected to show a strong interest in development related\nissues, which is supposed to be reflected in the choice of study fields,\nprior work experience, voluntary activities etc. ", "Possible fields of\nspecialisation are poverty reduction, social justice, global\nmigrations, gender equality, climate change, sustainable use of\nresources, food security, renewable energies, environmental protection,\nsustainable tourism, urbanisation, health, human rights,\ndemocratisation, good governance, fighting corruption, conflict\nprevention and resolution, international relations, intercultural\ndialogue. This list should provide applicants with an idea of relevant\ntopics, it is, however, not exclusive.", "The scholarship will\ncontribute to exercise the right to education for those critical and\nintellectual young people who encounter poor conditions in their home\ncountries. These aspects still apply more strongly to women. Regarding\napplications from equally qualified individuals,", " priority is given to female students", ".", "Application Process", "Please send your complete application documents to ", "[email protected]", " using a free data transfer such as ", "wetransfer ", "or ", "sendspace", "After your application has been reviewed, you will be invited for an interview (in person or via skype)", "The decision is taken by the scholarship committee in mid August. You will be informed about the decision shortly after. ", "Application form Master", "Application form PhD", "For More Information:", "Visit the Official Webpage of the Afro Asiatisches Institut Salzburg 2019/2020 One World Scholarship Programme"], "url : https://www.opportunitiesforafricans.com/afro-asiatisches-institut-salzburg-2019-2020-one-world-scholarship-programme/"], [["Canon Collins Trust 2019 Tom Queba Engineering Scholarships for Social Change (Funded study in South Africa)", "date announced:July 11, 2019", "Application Deadline: Monday 12 August 2019. "], ["Application Deadline: ", "Monday 12 August 2019.", " ", "Canon Collins Trust", " in partnership with ", "Tom Queba Memorial Fund", " is delighted to offer scholarships for Masters level study in engineering subjects at South African universities. CCT will award two scholarships per year in the name of Tom Queba.", "These scholarships are offered in memory of ", "Tom Queba, ", "who was a leader in the ", "George taxi industry", ". His passion, commitment and vision for improved public transport, and for the future of the minibus taxi industry in George, have contributed greatly to the achievement of the GO GEORGE bus service. He was tragically killed in 2014, which prompted Pegasys to form the Tom Queba Memorial Fund and establish this scholarship in his memory.", "Eligibility", "Applicants must:", "be a black female national of, and normally resident in, South Africa", "be in possession of a good first degree (minimum second class, upper division or equivalent) or about to graduate in the year of application", "be studying or applying to study at a Masters level in engineering subjects at a South African university", "Preference will be given to those studying engineering subjects that have a societal benefit. ", "Benefits:", "In 2020, the value of the scholarship package will range from R20,000\nto R100,000 depending on student circumstances. Funding will be\nprovided for up to a maximum of two years. We support both full and\npart-time study and will consider applications from those who wish to\nstudy by distance learning.", " ", "Canon Collins Trust", " also organise an ", "annual conference", " for current scholars, and hold several smaller events throughout the year. Scholarship holders are expected to participate in these activities and to become part of and contribute to our network.", "Application Procedure", " ", "Canon Collins Trust", " are now accepting applications. Please download and read ", "the guidelines", " carefully before applying.", "You can apply by sending your completed ", "application form", " to ", "[email protected]", ".\nPlease download and save the copy of the applications form on to your\ncomputer before you fill it in. The deadline for applying is ", "Monday 12 August 2019.", "For More Information:", "Visit the Official Webpage of the Canon Collins Trust 2019 Tom Queba Engineering Scholarships "], "url : https://www.opportunitiesforafricans.com/canon-collins-trust-2019-tom-queba-engineering-scholarships-for-social-change/"], [["Miles Morland Foundation 2019 Morland Writing Scholarships for African writers (£18,000 in Scholarships)", "date announced:July 1, 2019", "Application Deadline: Monday 30th September 2019"], ["Application Deadline: Monday 30", "th", " September 2019", "The Miles Morland Foundation is pleased to announce that the ", "2019 Morland Writing Scholarships for African writers.", "It can be difficult for writers, before they become established, to write while simultaneously earning a living. To help meet this need the MMF awards annually a small number of Morland Writing Scholarships, with the aim being  to allow each Scholar the time to produce the first draft of a completed book. The Scholarships are open to anyone writing in the English language who was born in Africa or both of whose parents were born in Africa.​", "The purpose of the Scholarships is to promote literature and good writing. Submissions, including non-fiction submissions, will be judged solely on literary merit. Before you submit an entry ask yourself, or ask an objective friend, “does my entry show literary merit?” If the answer is “no” please do not make a submission.", "Qualifications:", "To qualify for the Scholarship a\ncandidate must submit an excerpt from a piece of work of between 2,000 –\n5,000 words, written in English that has been published and offered for\nsale,. This will be evaluated by a panel of readers and judges set up\nby the MMF. The work submitted will be judged purely on literary\nmerit. It is not the purpose of the Scholarships to support academic or\nscientific research, or works of special interest such as religious or\npolitical writings. Submissions or proposals of this nature do not\nqualify.", "Scholarship Requirement:", "The only condition imposed on the Scholars during the year of their Scholarship is that they must write. They will be asked to submit by email at least 10,000 new words every month until they have finished their book, or their Scholarship term has ended. If the first draft of the book is completed before the year is up, payments will continue while the Scholar edits and refines their work. ", "Proposed Work", ":", "The candidates should submit a\ndescription of between 400 – 1,000 words of the work they intend to\nwrite. The proposal must be for a full length book of no fewer than\n80,000 words. The MMF does not accept proposals for collaborative\nwriting or short story collections. The proposal should be for a\ncompletely new work, not a work in progress, and must be in English.", "Biography:", "Please also tell us in 200 –\n300 words something about yourself and your background. People who reach\nthe shortlist will be asked for further information about themselves\nand how they propose to write their book.", "Fiction or Non-Fiction:", "The Foundation welcomes both\nfiction and non-fiction proposals. We are aware that non-fiction\nScholars may need extra time for research, so the Foundation may\nexercise its discretion to offer non-fiction writers a longer\nScholarship period of up to 18 months.", "Starting times:", " The\nScholars may elect to start at any time between January and June in the\nyear following the Scholarship Award. Their payments and the 10,000\nword monthly submission requirement will start at the same time.", "Accepted works:", "The Scholarships are meant for full length works of adult fiction or non-fiction. Poetry, plays, film scripts, children’s books, and short story collections do not qualify.", "Mentoring:", "The Foundation will not review\nor comment on the monthly submissions as they come in. However, each\nScholar will be offered the opportunity to be mentored by an established\nauthor or publisher. In most cases the mentorship will begin after the\nbook has been finished and the Scholarship period has ended. At the\ndiscretion of the Foundation, the cost of the mentorship will be borne\nby the MMF. It is not the intention of the MMF to act as editor or a\npublisher. Scholars will need to find their own agents and publishers\nalthough the MMF is happy to offer advice.", "Residency:", "Please note that this is not a\nresidential Scholarship. It is up to the Scholars what their living\narrangements are during their Scholarship year.", "Important Dates:", "Applications  will be received\nbetween 30th June 2019 and 30th September 2019. Applications submitted\noutside that period will not be looked at.", "For More Information:", "Visit the Official Webpage of the Miles Morland Foundation 2019 Morland Writing Scholarships"], "url : https://www.opportunitiesforafricans.com/miles-morland-foundation-2019-morland-writing-scholarships/"], [["South African National Space Agency (SANSA) Postgraduate Bursary Programme 2019 for South Africans", "date announced:July 2, 2019", "Application Deadline: September 15th 2019"], ["Application Deadline: September 15th 2019", "South Africa needs an increase in science and engineering graduates if we are to effectively resource the country with necessary and scarce skills to achieve goals of the National Development Plan and ensure a successful and sustainable future for our citizens.", " SANSA", " provides post graduate degree bursaries to contribute to the national target for qualified post graduates in science and engineering.", "The main criteria used in the selection of successful applicants are\nfinancial need, academic potential and career-oriented study programmes.", "Please note the following:", "An application will only be considered if it has been completed properly and in full.", "Documents that accompany the application form must be ", " uploaded ", " and ", " certified ", ".", "Testimonial form must be completed by the supervisor and uploaded to the application form.", "For the ", "2020", " academic year successful applicants will receive bursaries with values as stated below:", "Hons – R60 000 (one year).", "Masters – R98 000 per year for two years.", "PhD – R120 000 per year for three years.", "Applicants may not hold a combination of bursaries that exceed these\namounts. Should an applicant have another bursary of lessor amount,\nSANSA will consider providing a top-up amount to the student provided\nthe student meets the criteria mentioned above.", "Support for continuing years is not guaranteed and will depend on satisfactory progress during the previous year.", "The completed application must be submitted no later than ", "15 September 2019 ", " if you want to be considered for a bursary for ", "2020", ".", "For More Information:", "Visit the Official Webpage of the SANSA Bursary Programme 2019"], "url : https://www.opportunitiesforafricans.com/south-african-national-space-agency-sansa-postgraduate-bursary-programme-2019/"], [["Windows Insider Women in Computing Award 2019 (Fully Funded to the Grace Hopper Celebration in Orlando,USA)", "date announced:June 21, 2019", "Application Deadline: July 10th 2019"], ["Application Deadline: July 10th 2019", " You could join Microsoft at the Grace Hopper Celebration for a week of networking, professional development, and inspiring discussion. ", "Eligibility", "Registered Windows Insiders can apply for the Windows Insider Women in Computing Award.", "To be eligible for the award, join the Windows Insider Program by registering at ", "https://insider.windows.com/en-us/getting-started/#register", ".", "The award is open to all women currently in the process of\ncompleting a university computer science or related degree program.\nEntrants must be currently enrolled in an accredited degree-granting\ninstitution in order to qualify for the award (first year college\nstudents through post-doc students are eligible).", "Students who have accepted employment offers (2019-2020) at Microsoft are ineligible.", "International students arriving from outside of the U.S. will be responsible for securing their own travel visas.", "Award recipients MUST be available to attend both the Grace Hopper\nCelebration conference in Orlando, FL between October 1-4 and the\none-day post-conference program on October 5, 2019, in Orlando.", "Award recipients also agree to participate in at least one community\nevent or promotional media campaign for the Windows Insider Program.\nAward recipients may participate in the above virtually, such as through\nvideo conference.", "Benefits", "Microsoft will provide a sponsorship that covers registration, airfare, lodging, and meals for up to 14 winners. Your trip to the Grace Hopper Celebration in Orlando, Florida will be followed by a one-day professional development program hosted by Microsoft and the Windows Insider Program in Orlando. ", "How to Win", "Submit a short video and brief written\nstatement about your journey pursuing computer science and your vision\nfor making an impact in your field in the future.", "Your application will be judged on:", "Fit to Contest Theme: We’re looking for compelling stories from\nhigh-achieving women who are passionate about computing and their goals.", "Quality of Submission: We’ll be considering your ability to\ncommunicate effectively, including your potential for engaging with\nsenior leaders within Microsoft, as well as members of the media.", "Creativity: We want to see your spark! The originality of the\nsubmission will also be considered. (Tip: Entries will be assessed for\nthe quality of the content, rather than the production of the video\nitself or how flashy it is. The best submissions clearly communicate the\nstory behind your passion and the impact you would like to make.)", "For More Information:", "Visit the Official Webpage of the Windows Insider Women in Computing Award"], "url : https://www.opportunitiesforafricans.com/windows-insider-women-in-computing-award-2019/"], [["2020 Australian Government Research Training Program (RTP) Scholarships for study in Australia.", "date announced:July 19, 2019", "Application Deadline: September 1st 2019"], ["Application Deadline: September 1st 2019", "Applications are invited from suitably qualified students to apply for an", " Australian Government Research Training Program (RTP) Scholarships ", "to undertake a Higher Degrees by Research (HDR) at Curtin University. The purpose of the RTP Scholarship is to attract top quality postgraduate students to the University so they can receive high quality research training that will contribute to the research and educational excellence of the university. ", "These scholarships are funded by the Australian Government and cover one or more of the following types of support:", "Tuition fees offset for up to 4 years (full time load) depending of course and mode of study;", "A stipend to assist students with their living costs while undertaking HDR study; and/or ", "An RTP allowance to assist students with ancillary costs which may include:", "for\noverseas students, a standard Overseas Student Health Cover policy\napproved by the Commonwealth Department of Health which covers the\nstudent and may cover their spouse and any dependants; ", "Relocation costs to undertake a HDR at Curtin University; and/or  ", "HDR thesis printing and applicable publication costs.", "\nStudent type\n", "\nCurrent Students\n", "\nFuture Students\n", "\nFaculty\n", "\nCentre for Aboriginal Studies\n\n", "\nFaculty of Business and Law\n", "\nFaculty of Health Sciences\n", "\nFaculty of Humanities\n", "\nFaculty of Science & Engineering\n", "\nScience courses\n", "\nEngineering courses\n", "\nWestern Australian School of Mines (WASM)\n", "\nCourse type\n", "\nHigher Degree by Research\n", "\nCitizenship\n", "\nAustralian Citizen\n", "\nAustralian Permanent Resident\n", "\nNew Zealand Citizen\n", "\nPermanent Humanitarian Visa\n", "\nInternational Student\n", "\nScholarship base\n", "Merit Based", "\nValue\n", "The 2019 value of the Australian Government Research Training Program (RTP) was $27,596 pa (indexed annually).", "The 2020 value will be released by the Australian Government in October 2019.", "Scholarship Details", "\nEligibility criteria\n", "To be eligible to apply you must:", "Be a current or future student, either domestic or international; and ", "Satisfy\nthe entry requirements or be already admitted into a Masters by\nResearch or Research Doctorate at Curtin University including meeting\nthe Curtin University English proficiency levels.", "Application process", "Applicants will be assessed against the following metrics:", "Basis of admission;", "Academic qualifications;  ", "Achievement of candidacy;  ", "Work-related research experience;  ", "Academic accomplishments;  ", "Research and creative outputs of demonstrable quality;  ", "Referee report; and ", "Strategic aligned projects.", "For information and how to apply for admission and scholarship, please visit: ", "https://students.curtin.edu.au/essentials/higher-degree-by-research/hdr-scholarships/", "For More Information:", "Visit the Official Webpage of the 2020 Australian Government Research Training Program (RTP) Scholarships"], "url : https://www.opportunitiesforafricans.com/2020-australian-government-research-training-program-rtp-scholarships-for-study-in-australia/"], [["Brian O’ Connell (BOC) Scholarship Programme 2019 for young Southern Africans", "date announced:July 22, 2019", "Application Deadline: August 15th 2019"], ["Application Deadline: August 15th 2019", " SANORD is committed to re-directing membership fees to member institutions through the", " BOC Scholarship Programme", " that encourages capacitation and development through student mobility and research collaboration.", "The BOC Scholarship programme aims to provide such scholarships to students from a SANORD member institution in theSouthern African region to spend 3-5 months at aSANORD Nordic member institutionfor time to work on their research and dissertation. The primary focus will be mobility for academic and research collaboration with our Nordic partnersbased on scholarly merit. ", " The BOC Scholarship makes provision for PARTIAL scholarship funding of R84 000per applicant. Qualifying Master’s students who are registered at a SANORD member institution of higher education in the Southern African region are eligible to apply. Qualifying Master’s students will be required to spend 3 to 5 months at a SANORD Nordic member institution of their choice. ", "Successful candidates will be required to engage in activities that will support the completion of the Master’s degree. Preference will be given to those projects aligned to the SANORD Strategy 2022. (see attached n application form) The scholarship funds will be disbursed during the 2020 academic year. ", " SELECTION CRITERIA:", "Applicants should:", "1.Be enrolled for a Masters’ degree at a SANORD member Southern African institution in the current the year that they will be travelling. ", "2.Provide a detailed study plan (academic activities the student aims to undertake at the host institution? e.g. which courses, what kind of research, is the research aligned to the host institution’s areas of scholarship? Is it aligned to SANORD’s 2022 Strategic Goals). ", "3.A motivation for why you wish to pursue this collaborative international study abroad opportunity, and how it will benefit your development and contribute to Southern Africa’s knowledge production. ", "4 .Provide an accredited transcript of records for both the Bachelor’s degree and Master’s degree.", "5.Provide a written Letter of Acceptance from the HOST institution.", "6.Provide evidence (Letter of support) from the HOME supervisor and the relevant Dean of the faculty that supports your stay at the host institution. ", " 7.Sign a binding contract with the SANORD Central Office (SCO) in line with the objectives of the programme.", "8.Submit a report within 1 month on return from the home institution to share experiences gained.", "9.Present your work and experience at a seminar hosted by the SANORD Central Office ", "10.Utilize the required knowledge to contribute towards Southern Africa’s development.", "11.Be committed to return to the home institution to graduate ", " Partial Funding: ", "Students must provide a budget for the costs that will be incurred to the value of R84 000.", "•A total amount of R 84 000 could cover the following costs:oA return, economy class airline ticket.oAccommodationoA living allowance", "oTravel Insurance for the period (could be included with your air ticket)", "oTuition fees (if fees are not subsidized by the host institution) ", "Please submit your applications to ", "[email protected]", " and ensure that all the required supporting documents are attached. ", "Only full applications with all the supporting documents in one single email will be accepted for logistical reasons. ", " DATES: ", "•Due date for applications – 15 August 2019. •Announcement date -30 September 2019. ", "For More Information:", "Visit the Official Webpage of the Brian O’ Connell (BOC) Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/brian-o-connell-boc-scholarship-programme-2019/"], [["Japan-WCO Human Resource Development Scholarship Programme 2019/2020 for study in Japan (Funded)", "date announced:July 4, 2019", "Application Deadline: August 10th 2019"], ["Application Deadline: August 10th 2019", " ", "The Japan-WCO Human Resource Development Programme", " (Scholarship Programme) provides a grant covering travel, subsistence, admission, tuition and other approved expenses to enable promising young Customs managers from a developing country member of the WCO to undertake Master’s level studies at the Aoyama Gakuin University (AGU) in Tokyo, Japan.", "Requirements", "A candidate must be a customs officer of a developing member of the\nWCO with quality work experience of at least three years in the field of\ncustoms policy and administration in his/her home country.", "Preference will be given to candidates who have experience in IPR\nborder enforcement, and who are expected to work in the IPR-related\nsection of their Customs administration after this Scholarship\nProgramme.", "A candidate must be in good health and preferably under 40 years of age as of April 1, 2020.", "Individuals who have already been awarded a scholarship under the\nJapan-WCO Human Resource Development Programme in the past will not be\nentitled to apply for this Scholarship Programme.", "After the completion of the Programme, the candidates should\ncontinue to work in their home Customs administration for 3 years at\nleast.", "Benefits", "A monthly stipend covers accommodations, meals, transportations, and\nother expenses. It cannot be increased to cover family members, if any.\nThe amount of stipend is subject to change according to the decision of\nthe Japanese Government.*", "Admission and tuition fees.**", "Round-trip economy-class air tickets between your home country and Japan.", "\n*The current amount of monthly stipend is 147,000 yen (as of 2019).", "\n**The current amount of admission fee is 290,000 yen and annual tuition fee is 917,000 yen (as of 2019).", "For More Information:", "Visit the Official Webpage of the Japan-WCO Human Resource Development Scholarship Programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/japan-wco-human-resource-development-scholarship-programme-2019-2020-for-study-in-japan-funded/"], [["HIV Research Trust Scholarships 2020 for Health Professionals from Developing Nations (funded)", "date announced:July 24, 2019", "Application Deadline: 30th Sept 2019: "], ["Application Deadline: 30", "th", " Sept 2019: ", " ", "The HIV Research Trust scholarships", " are awarded each year in open competition. The scholarships are provided to physicians, nurses, scientists and other health care professionals, in particular those who are in the early to mid-stage of their career (for example, undertaking a PhD; a first or second post doc position; or other professionals in an early phase of their research career), working in resource-poor settings from low-income and lower-middle income countries. The scholarship enables the individual to travel to other centres to acquire skills necessary to conduct their research more effectively when they return to their home institution. ", "The HIV Research Trust ", "is a charitable foundation that provides financial support to physicians, nurses, scientists and other health care professionals in resource-limited settings from low-income and lower-middle-income countries* working in the field of HIV infection. The Trust supports early/mid career researchers.", "The support is in the form of financial awards allowing the scholar to undertake a placement or course of a few months’ duration intended to cover course or placement costs, travel, consumables and living expenses. The scholarships are awarded competitively based on a peer-review process on an annual basis. They are designed to enable the candidate to travel to another research unit to learn skills and techniques which should develop the candidate’s career and, on return to the home institution, add to the capacity of the department to carry out research related to treatment and prevention.", "Eligibility", "\nThe scholarships are for health care professionals in early/mid-career\nwho are located in resource-limited settings from low-income and\nlower-middle-income countries working in the field of HIV infection.\n", "Timeline", " 30", "th", " Sept 2019: Applications Close ", "2", "nd", " December 2019: Scholarships announced ", "For More Information:", "Visit the Official Webpage of the HIV Research Trust Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/hiv-research-trust-scholarships-2020-for-health-professionals-from-developing-nations/"]]