[[["Nordic Africa Institute’s Nordic Scholarship Programme 2019 for Africa-oriented studies in the Nordics (Funded)", "date announced:August 23, 2018", "Application Deadline: October 8th 2018"], ["Application Deadline: October 8th 2018", "The aim of the", " Nordic Africa Institute’s Nordic Scholarship Programme", " is to offer a 1-month stay at the ", "Nordic Africa Institute", " in order to facilitate use of the Institute’s library collections on contemporary Africa (books, periodicals, newspapers, and government publications), and to create links to existing research at the Institute.", "Eligibility Requirements:", "Master students, PhD candidates and postdoctoral researchers pursuing Africa-oriented studies/research in Social Sciences and Humanities and affiliated to universities and research centers in Sweden, Finland and Iceland are eligible candidates, regardless of citizenship.", "Africa-oriented journalists and writers within the discipline of Social Sciences and Humanities in Sweden, Finland and Iceland can also apply for a scholarship.", "Financial", " ", "support and other benefits", "The scholarship covers travelling expenses for the least expensive fare from residential address (in Sweden, Finland and Iceland) to Uppsala and return.", "The scholarship holders are provided with a desk and computer in a shared office at the Institute and free accommodation centrally located in Uppsala.", "The scholarship also include a subsistence allowance of SEK 200 per day and free photocopying up to a maximum of 1,000 copies.", "Please", " ", "note", ": The scholarship does ", "not ", "include health care insurance or other insurances.", "Appendices", "Up-to-date CV, including list of publications (if any).", "Outline of research project, 3-5 pages:", "\n– Objective of the research project: The research topic should be clearly identified and contextualized within its academic discipline.", "\n– Method and time frame: Describe how the research project will be accomplished, state the research method, data gathering techniques and time frame.", "\n– Theoretical explication: A brief indication of the theoretical basis of the research project must be included.", "\n– The applicant should clarify what part of the research project he/she will work upon during the stay at the Nordic Africa Institute.", "Reference: A signed letter of support from the applicant’s supervisor or head of department, which ", "confirms current affiliation and field of research", ". (Scanned versions of signed support letters can be emailed by the applicant.)", "Submission of applications", "\nThe scholarships are awarded once per year. Applications must be in by ", "8 October 2018.", " (for scholarships in 2019)", "Applications can be sent by email or by post.", "Applications sent by email should be addressed to", "\nAnnika Franklin, Research Administrator, email: ", "annika.franklin", "@nai.uu.se ", "Applications sent by post/airmail should be addressed to", "\nThe Nordic Africa Institute", "\nAnnika Franklin", "\nP.O. Box 1703", "\nSE-751 47 Uppsala, Sweden.", "For More Information:", "Visit the Official Webpage of the Nordic Africa Institute’s Nordic Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/nordic-africa-institutes-nordic-scholarship-programme-2019/"], [["Banting Postdoctoral Fellowships program 2018/2019 for postdoctoral study in Canada ($70,000 per year in funding)", "date announced:August 6, 2018", "Application Deadline: September 19, 2018 (20:00 EDT)"], ["Application Deadline: ", "September 19, 2018 (20:00 EDT)", "The ", "Banting Postdoctoral Fellowships program", " provides funding to the very best postdoctoral applicants, both nationally and internationally, who will positively contribute to the country’s economic, social and ", "research-based", " growth.", "The objective of the Banting Postdoctoral Fellowships program is to:", "attract and retain top-tier postdoctoral talent, both nationally and internationally", "develop their leadership potential", "position them for success as research leaders of tomorrow", "70", " fellowships are awarded annually;  a total of up to ", "140", " awards are active at any time.", "Value", "$70,000", " per year (taxable)", "Duration", "2 years", " ", "(non-renewable)", "Eligibility Requirements:", "Citizenship", "Citizenship and location of host institution", "Canadian citizens, permanent residents of Canada ", "and", " foreign citizens are eligible to apply, provided they meet the following conditions:", "Applicants who are not Canadian citizens or permanent residents of Canada may only hold their Banting Postdoctoral Fellowship at a Canadian institution.", "Applicants who are Canadian citizens or permanent residents of Canada and who obtained their PhD, PhD-equivalent or health professional degree from a foreign university may only hold their Banting Postdoctoral Fellowship at a Canadian institution.", "Applicants who are Canadian citizens or permanent residents of Canada and who obtained their PhD, PhD-equivalent or health professional degree from a Canadian university may hold their Banting Postdoctoral Fellowship at either a Canadian institution or an institution outside of Canada.", "For a list of eligible health professions, please see ", "CIHR’s webpage", ".", "Eligibility window for degree completion", "Applicants to the 2018-19 Banting Postdoctoral Fellowships program must fulfill or have fulfilled all degree requirements for a PhD, PhD-equivalent or health professional degree:", "between September 15, 2015 and September 30, 2019 (inclusively), and", "before the start date of their award.", "Applicants who have not fulfilled all requirements for their degree at the time of application must submit proof no later than October 15, 2019.", "Areas of research", "Health research", "Natural sciences and/or engineering", "Social sciences and/or humanities", "Fellowships are distributed equally among:", "the Canadian Institutes of Health Research (CIHR)", "the Natural Sciences and Engineering Research Council (NSERC)", "the Social Sciences and Humanities Research Council (SSHRC)", "Features", "The Banting Postdoctoral Fellowships program", " is unique in its emphasis on the synergy between:", "the applicant", " – their individual merit and potential to launch a successful research-intensive career; and", "the host institution", " – their commitment to the research program and alignment with the institution’s strategic priorities", "An applicant to the Banting Postdoctoral Fellowships program must complete their application in full collaboration with the proposed host institution", "Timeline:", "Timelines", "April – September 2018", "Applicants seek endorsement from host institution to apply, prepare and submit application (institutions may have internal deadlines).", "September 19, 2018", "\n(20:00 EDT)", "Deadline for complete application submission", "October to December 2018", "Evaluation of applications", "Mid February, 2019", "Anticipated notification of results. Applicants will be notified by email when the results are available on ResearchNet.", "April to October 2019", "Payments begin", " ", "For More Information:", "Visit the Official Webpage of the Banting Postdoctoral Fellowships program 2018/2019"], "url : https://www.opportunitiesforafricans.com/banting-postdoctoral-fellowships-program-2018-2019/"], [["UFS/AS Young African Scholar Award 2018/2019 for African Scholars (5,000 ZAR prize)", "date announced:August 26, 2018", "Application Deadline:  30 September 2018."], ["Application Deadline:  ", "30 September 2018", ".", "Scholarship in African Studies still faces the challenge of capacity building to enhance ownership by authors and institutions from and on the African continent. It also requires more coordinated efforts to provide the deserved space by African authors in the international domain. This award seeks to strengthen efforts to further promote internationally recognised African scholarship in African Studies.", "In 2014 ", "the Centre for Africa Studies (CAS)", " – as of 2018", " the Centre for Gender and Africa Studies (CGAS) – at the University of the Free State (UFS) in Bloemfontein", " became affiliated with the Africa Europe Group for Interdisciplinary Studies (AEGIS), of which the Institute of African Affairs at the ", "GIGA German Institute of Global and Area Studies in Hamburg", " is a core member. The GIGA publishes ", "Africa Spectrum", ", putting out three issues annually. It is listed in the Journal Citation Reports by Thomson Reuters, among other indexes. The journal is also linked to the German African Studies Association (Vereinigung für Afrikawissenschaften in Deutschland, VAD).", "Sharing a commitment to African capacity building in African Studies, in 2015 the partner institutions established the first annual.", "Requirements:", "Papers should follow the formal guidelines for research articles as specified and be submitted under the section UFS/AS; please register and log in at: ", "http://journals.giga-hamburg.de/index.php/afsp", ".", "By October, a review committee comprised of one representative from each partner institution will select the submissions for publication. The selected papers will then go through the journal’s standard double-blind peer-review process and finally also be screened by at least one more member of the journal’s editorial group who is not part of the review committee. If accepted, the paper will be published in the journal’s first issue of the following year, jointly with a call for papers pertinent to the next award.", "Award", "Scholars who have been published under the auspices of the Young African Scholar Award will be granted a three-year affiliation with the CGAS as a Research Fellow (without remuneration) in recognition of the achievement, along with prize money of ZAR 5,000 (five thousand South African rand), sponsored by the UFS.", "Submission Criteria", "Those eligible to submit are postgraduate students nearing completion of their PhD theses and postdoctoral scholars within five years of having been awarded their PhD at the time of the submission deadline. Authors should be from Africa or affiliated with African institutions. Scholars affiliated with the CGAS are ineligible.", "For More Information:", "Visit the Official Webpage of the UFS/AS Young African Scholar Award 2018/2019 "], "url : https://www.opportunitiesforafricans.com/ufs-as-young-african-scholar-award-2018-2019-for-african-scholars-5000-zar-prize/"], [["DST-CSIR Inter-Bursary support programme (IBS) grant scheme 2018 for postgraduate study in South Africa (Funded)", "date announced:August 16, 2018", "Application Deadline: September 28th 2018"], ["Application Deadline: September 28th 2018", "The Department of Science and Technology and the CSIR invite applications for a bursary under the ", "DST-CSIR Inter-Bursary support programme (IBS) grant scheme.", "The IBS postgraduate bursary is intended for full-time studies for Honours, Masters or PHD degrees at any South African public university. Students who intend to register for their fourth year in Engineering or BTech degrees will also be considered", "The IBS postgraduate bursary is intended for full-time studies for Honours,Masters or PhD degrees at any South African public university. Students who intend to register for their", "fourth year in Engineering or BTech degrees will also be considered.", "•Aerospace", "•Composites", "•Modelling and digital sciences", "•Microsystems technology", "•Titanium (manufacturing elements)", "•Photonics", "•Information and communications technology", "•Biotechnology:", "•Biopharming", "•Bioprocessing", "•Biocatalysis", "The focus areas for the bursary support are restricted to the following research areas:", "Preference will be given to those whose study areas are aligned with the", "above-mentioned priority research areas.", "Benefits:", "Honours R75 000 | Masters R100 000 | PhD R130 000", "How to Apply:", "The application forms and guidelines are attached to this call. Please complete the application forms and send the completed document (preferably pdf format) with any additional attachments by email to ", "[email protected]", " Applications must include endorsement and motivation by the nominated supervisor for masters and doctoral students.", "For More Information:", "Visit the Official Webpage of the DST-CSIR Inter-Bursary support programme (IBS) grant scheme 2018"], "url : https://www.opportunitiesforafricans.com/dst-csir-inter-bursary-support-programme-ibs-grant-scheme-2018/"], [["Finnish Government Scholarship Pool 2019/2020 for Doctoral level studies & research in Finland ( EUR 1500 monthly allowance)", "date announced:August 21, 2018", "Application Deadline: February 15th 2019"], ["Application Deadline: February 15th 2019", "The Finnish Government offers scholarships", " of 3-9 months for ", "Doctoral level studies and research", " at Finnish ", "universities", " or public research institutes.", "The Finnish Government Scholarship Pool programme is open to young researchers from all academic fields. The scholarship cannot be applied for Master’s level studies or post-Doctoral studies/research.", "Eligibility Requirements:", "In order to be an eligible applicant for this scholarship, you must first successfully apply for a study/research placement at a Finnish university/public research institute – in other words, you must be at least provisionally accepted either as a visiting Doctoral-level student/researcher, or as a full-time Doctoral degree student. Please see section ", "Doctoral Admissions", " for information on how to apply for a Doctoral-level study or research placement in Finland.", "The scholarships are based mainly on cultural agreements or similar arrangements between Finland and the following countries:", "Australia", "China", "Cuba", "Egypt", "Israel", "Japan", "Mexico", "Mongolia", "Namibia", "Peru", "Republic of Korea", "Republic of Turkey", "Ukraine", "Uruguay", "USA", " (please see the section Fulbright-EDUFI Fellowships on the ", "Fulbright Online website", ")", "Only the nationals of the above-mentioned countries can be considered eligible applicants in this scholarship programme.", "To be eligible, the applicant must:", "have established contact with the Finnish receiving institution before applying (see section ‘", "Doctoral Admissions", "‘)", "have a letter of invitation from the academic supervisor in Finland; the invitation should also explain the commitment of the host institution to the project", "have earned a Master’s-level degree before applying", "intend to pursue post-Master’s level studies as a visiting student, participate in a research project or teach at a university or public research institute in Finland; priority will be given to doctoral studies", "not have spent already more than one year at a Finnish higher education institution immediately before the intended scholarship period in Finland", "be able to give proof of sufficient skills in speaking and writing the language needed in study/research*", "be a national of one of the eligible countries listed above", "*) this means that the application must include some proof of the applicant’s language skills – The scholarship programme itself does not require you to take an IELTS or TOEFL test, but if you have such official proof of your English skills that can of course be enclosed in the application. Usually however it is enough if, for example, the letter of invitation from the hosting Finnish university states that your language skills have been deemed sufficient by the Finnish university.", "Benefits:", "The scholarship includes:", "a monthly allowance of EUR 1500. The allowance is sufficient for one person only.", "Expenses due to travel, international or in Finland, are not covered by the programme. Scholarship recipients are recommended to make arrangements for sufficient insurance coverage for their stay in Finland. Please see the section ‘", "Practical matters", "‘ for information on the practicalities of coming to Finland as an international student/researcher.", "Scholarship period", "The Finnish Government Scholarship Pool programme can be applied for a study/research period of 3-9 months, 9 months being the maximum time for an individual applicant.", "You may wish to keep in mind that the Finnish academic year starts in late August/early September and ends in late May (check the exact dates with the Finnish university you’re interested in). However, in your application you may also specify your scholarship period to start later than September – as long as your scholarship period begins within the academic year that you’ve applied the scholarship for.", "This scholarship programme can not be applied to cover a whole Doctoral degree programme – if you are granted this scholarship, after the initial scholarship period you will need to look for ", "other sources of funding", " for the remainder of your studies/research in Finland.", "How and when to apply", "Applications for the Finnish Government Scholarship Pool funding should be made to the appropriate authority in the applicant’s country. For information on the appropriate authority in your country, please see the listing of ", "countries and authorities to contact", ".", "the announcements for the opening of the annual application round are sent out from the Finnish National Agency for Education at the end of September annually.", "applicants may then contact the scholarship authorities in their home country for information on the national deadline for submitting the application documents. Make sure you meet the national deadline in your home country, as that is the deadline by which you should submit your application to the ", "national contact authoritie", "s.", "the annual deadline set by the Finnish National Agency for Education for the nomination of scholarship candidates by the national contact authorities is in mid-February (in 2018: 15th February)", "Application Documents:", "Documents required for an application:", "a completed and signed application form", "curriculum vitae", "copies of latest diplomas*", "two letters of recommendation", "study/research plan (2-5 pages, including a statement of motivation, goals, work plan, work method, expected results)", "invitation/expression of interest and motivation for cooperation from the hosting academic supervisor in Finland", "language certificate (Finnish, Swedish or English) or other indication of sufficient language skills – please see above, in the section ‘Eligibility criteria’", "For More Information:", "Visit the Official Webpage of the Finnish Government Scholarship Pool 2019/2020"], "url : https://www.opportunitiesforafricans.com/finnish-government-scholarship-pool-2019-2020/"], [["University of Lausanne (UNIL) Master’s Grants Scholarships 2018/2019 for Study in Switzerland (Funded)", "date announced:August 17, 2018", "Application Deadline: November 1st 2018"], ["Application Deadline: November 1st 2018", "The UNIL Masters scholarships", " are scholarships for excellence awarded exclusively to students who have graduated from a foreign university and whose academic results are of a very high level. UNIL grants around ten scholarships a year.", "The scholarship is granted for the minimum statutory period of the programme chosen by the student. It amounts to CHF 1,600 per month from 15 September to 15 July (or 10 months a year) for the complete duration of the masters (one and a half years or two years depending on the chosen masters), with the exception of cases of definitive failure after the first year.", "Students offered a scholarship will be exempt from the fixed registration fees for the courses, with the exception of the CHF 80.00 fees to be paid each semester.", "Requirements:", "To have obtained a foreign university degree considered equivalent to a bachelor at UNIL before the beginning of the masters programme at UNIL.", "To have distinguished yourself during your studies, especially through particularly brilliant academic results.", "To have a language level of at least B2 (according to the European Language Portfolio global scale) in French or English according to the language in which your chosen masters is taught.", "Not to have been registered with UNIL in the past.", "To have paid the CHF 200.00 administration fee (see document, “list of documents to attach to your application”).", "What are the programmes for which it is possible to apply for a Masters scholarship?", "First of all, it is not possible to apply for the following programmes:", "Master from the School of Medicine", "Master of education", "Master of Law from the Universities of Zurich and Lausanne", "Master of criminal Law, magistracy specialism", "All MASs (PhD programmes)", "The list of all Masters degrees at UNIL that it is possible to apply for with the exception of the one that are mentionned above, can be found at the followint address : ", "www.unil.ch/formations/en/home/menuinst/masters.html", "How to Apply:", "Candidates must send their completed application (refer to the document, “list of documents to attach to your application”), unbound, by post only to the following address:", "Université de Lausanne", "\nService des affaires sociales et de la mobilité étudiante (SASME)", "\nBâtiment Unicentre", "\nCH – 1015 Lausanne", "\nSwitzerland", "The application form must be completed on a computer and duly signed by the candidate.", "The application for the Masters scholarship also serves as an application for admission to your chosen masters (and therefore an application to register at UNIL).", "You must not make an application for admission to the masters degree via the Admissions Department (SII).", "The ", "deadline for applications is 1 November", " to begin a masters degree during the following academic year, in the autumn semester or the spring semester if the programme allows. The postmark will attest to the date sent.", "Incomplete applications, particularly those lacking certified copies of the academic documents requested, will not be considered.", "Calendar of the selection process", "1 November: application deadline", "November-December: Processing of applications by the Social Affairs and Student Mobility Office (SASME) and the Admissions department (SII)", "December-January: The SASME informs candidates whose application is incomplete or has not been accepted by the admissions department that their application for the scholarship has been unsuccessful.", "January-February: Complete applications are transferred to the faculties for consideration of their eligibility for the chosen masters degrees.", "February-March: The SASME informs candidates whose application has not been accepted by the faculty.", "March: The selection board for masters scholarships selects the candidates who will be offered a masters scholarship.", "Early April: candidates are informed of the selection board’s decision.", "Decisions may not be appealed", "For further information, please refer to the FAQs. For any further information, you can contact us by email at ", "[email protected]", " or by telephone on +41 21 692 2113.", "Please note: there will be no response to questions where the answers are available on our website, and in the FAQs in particular.", " ", "Application form Masters scholarship.pdf", "  (444 Ko)", " ", "FAQ Masters scholarship at UNIL.pdf", "  (210 Ko)", " ", "List of documents to attach to your application.pdf", "  (196 Ko)", "For More Information:", "Visit the Official Webpage of the University of Lausanne (UNIL) Master’s Grants Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/university-of-lausanne-unil-masters-grants-scholarships-2018-2019-for-study-in-switzerland/"], [["Chevening UK Government Scholarships Programme 2019/2020 for Study in the United Kingdom (Fully Funded)", "date announced:August 6, 2018", "Application Deadline: 6 November 2018"], ["Application Deadline: 6 November 2018", "Chevening", " is the ", "UK Government’s international awards scheme", " aimed at developing global leaders. Funded by the ", "Foreign and Commonwealth Office (FCO)", " and partner organisations, Chevening offers two types of award –", " Chevening Scholarships and Chevening Fellowships", " – the recipients of which are personally selected by British embassies and high commissions throughout the world.", "Chevening offers a unique opportunity for future leaders and influencers from all over the world to develop professionally and academically, network extensively, experience UK culture, and build lasting positive relationships with the UK.", "Eligibility Requirements", "To be eligible for a Chevening Award you must:", "Be a citizen of a Chevening-eligible country", "Return to your country of citizenship for a minimum of two years after your award has ended", "Have an undergraduate degree that will enable you to gain entry onto a postgraduate programme at a UK university. This is typically equivalent to an upper second-class 2:1 honours degree in the UK.", "Have at least two years’ work experience (this may be up to five years for fellowship programmes, so please refer to your country page for further details)", "Apply to three different eligible UK university courses and have received an unconditional offer from one of these choices by 11 July 2019", "Meet the Chevening English language requirement by 11 July 2019", "English Language Requirement:", "In order to receive a Chevening Award, all applicants must demonstrate that they have fulfilled the Chevening English language requirement by 11 July 2019. We advise all applicants to ensure they have fulfilled the English language requirement as early as possible by either:", "Taking an English language test", "Claiming an exemption based on the UKVI exempt categories", "If you fail to demonstrate that you have met the required English language level by 11 July 2019 or fail to prove that you qualify for an exemption, your application will not be successful.", "English language tests", "You are free to take tests more than once in order to meet the Chevening English language requirement. Please note that Chevening does not pay for costs associated with English language testing. You are responsible for booking and paying for costs associated with these tests.", "Chevening accepts English language tests from five providers:", "Academic IELTS", "Pearson PTE Academic", "TOEFL iBT", "C1 Advanced (formerly Cambridge English: Advanced [CAE])", "Trinity ISE II (B2)", "The English language test must have been taken from one of these providers on or after 1 October 2017. If you do not already have an existing eligible test certificate, it is your responsibility to ensure that you have booked a test date so that you can obtain the required results.", "Courses:", "Choose your three courses carefully. You will not be able to change your course choices after submitting your application, unless you are granted permission to do so at the interview stage. You will need to apply separately to your selected courses directly via the university. To be awarded a scholarship, you must get an unconditional offer for one of your course choices by 11 July 2019.", "Applicants will need to select three different master’s courses. These can be three different courses at the same institution, or three similar courses across up to three different universities.", "In order to be eligible, the courses you choose must be:", "Full-time", "Start in the autumn term (usually September/October)", "Taught master’s (i.e. not research-focused MRes programmes)", "Lead to a master’s degree qualification", "Based in the UK", "Courses cannot be:", "Distance learning", "Part-time", "Less than nine months in duration", "More than 12 months in duration", "PhD or DPhil are not permitted", "Taught with more than one month of study outside the UK", "Use the ", "course finder", " to browse eligible master’s degrees at every university across the UK.", "Scholarship Worth:", "university tuition fees", "a monthly stipend", "travel costs to and from the UK", "an arrival allowance", "a homeward departure allowance", "the cost of one visa application", "a travel grant to attend Chevening events in the UK", "Required documents", "Prior to starting your application for a Chevening Scholarship please ensure you have the following ready:", "Valid passport/national ID card", "University transcripts and degree certificates (undergraduate, postgraduate)", "Three different UK master’s course choices", "Names of two referees who know you in a professional or academic capacity", "Timeline: ", "Chevening Scholarships 2019/2020 timeline", "6 August 2018", "Applications open at 12:00 BST", "Apply via your country page at ", "www.chevening.org/apply", "6 November 2018", "Applications close at 12:00 GMT", "From 7 November 2018", "Sifting of applications against eligibility criteria", "Mid-November to December 2018", "Independent reading committees assess eligible applications", "January to early February 2019", "Applicants are shortlisted for interviews by the British Embassies/High Commissions in-country", "By mid-February 2019", "Applicants are notified that they have been selected for interview", "Read our ", "interview guidance", ".", "1 March 2019", "Deadline for applicants invited to interview to submit references and undergraduate certificates. Read about what we require from ", "your references", ".", "4 March to 1 May 2019", "Global interview period", "Early June 2019", "Announcement of interview results", "11 July 2019", "Deadline for UK university unconditional offers", "11 July 2019", "Deadline for meeting English language requirement", "Read about Chevening’s ", "English language requirement", ".", "September/October 2019", "2019/2020 Chevening Scholars commence their studies in the UK", " ", "For More Information:", "Visit the Official Webpage of the Chevening UK Government Scholarships Programme 2018/2019"], "url : https://www.opportunitiesforafricans.com/chevening-uk-government-scholarships-programme-2019-2020/"], [["OpenSocietySA25 Commemorative Scholarships 2018 for young South Africans", "date announced:August 7, 2018", "Application Deadline: August 31st 2018"], ["Application Deadline: August 31st 2018", "This year, the ", "Open Society Foundation for South Africa (OSF-SA)", " celebrates 25 years of grant making in South Africa. In the past 25 years we have and will continue to promote human rights and constitutionalism to support a democratic and open society in South Africa.", "In 1979 George Soros launched a ", "scholarship programme", " for black South African students to study at the University of Cape Town. In 2018, to Commemorate 25 years of grant making in South Africa, OSF-SA will be awarding ", "25 Commemorative Open Society Fellowships and Scholarships", " across three categories:", "#OpenSocietySA25 Commemorative Scholarships", "#OpenSocietySA25 Commemorative Fellowships", "#OpenSocietySA25 Investigative Journalism Fellowship Programme", "Up to 15 ", "#OpenSocietySA25 Commemorative Scholarships", " will be available for eligible candidates to pursue post-graduate studies in the social sciences and humanities. Each scholarship provides tuition fees at a registered South African tertiary institution and financial support to assist with the costs associated with full-time study. The selection panel will be chaired by former Constitutional Court judge, Justice Bess Nkabinde.", "Under the theme, “ADVANCING DEMOCRACY, PROMOTING CONSTITUTIONALISM, AND EMPOWERING VULNERABLE AND MARGINALISED GROUPS”, applicants can pursue further studies in the following areas: Law, Justice, and Governance; Sustainable Development and Natural Resource Management; Economic Rights, Justice and Empowerment of the Poor; Public Health and Inequality; Media Freedom and Expression; Land Policy; Education and Inequality; Human Rights Advancement; Social Movements/Building Civil Society; Constitutionalising Foreign Policy; and Political Economy.", "In order to be eligible for the #OpenSocietySA25 Commemorative Scholarships, applicants must:", "Be South African nationals/African permanent residents/African registered asylum seekers under the age of 35, and of colour", "Have a demonstrated commitment to human rights, social justice and advancing constitutionalism", "Be nominated and hosted (throughout the period of study) by a civil society organisation (host organisation) that is a current or former grantee of OSF-SA", "The Scholarship Award is conditional on proof of formal acceptance into the relevant tertiary institution for the 2019/2020 or the 2020/2021 academic year only and this must be confirmed in writing by the host organisation", "For More Information:", "Visit the Official Webpage of the OSF-SA scholarship programme 2018"], "url : https://www.opportunitiesforafricans.com/opensocietysa25-commemorative-scholarships-2018-for-young-south-africans/"], [["University of Adelaide Scholarships International (ASI) 2018/2019 for graduate study in Australia (Fully Funded)", "date announced:August 7, 2018", "Application Deadline: August 31st 2018"], ["Application Deadline: August 31st 2018", "The selection and ranking of applicants within the", " University of Adelaide", " is undertaken by the Graduate Scholarships Committee, using the criteria of academic merit and research potential.", "The ASI provides", "Course tuition fees for two years for a Masters degree by Research and three years for a Doctoral research degree (an extension is possible for doctoral programs only),", "An annual living allowance ($27,082 in 2018) for two years for a Masters degree by Research and three years for a Doctoral research degree (an extension is possible for doctoral programs only), and", "For Student Visa (Subclass 500) visa holders the award provides compulsory standard Overseas Student Health Cover (OSHC) Worldcare policy for the student and their spouse and dependents (if any) for the standard duration of the student visa.  It does not cover the additional 6 month extended student visa period post thesis submission. If the award holder does not hold a subclass 500 visa then he/she is responsible for the cost of health insurance.", "Eligibility Criteria", "In order to be eligible applicants are required to have successfully completed at least the equivalent of an Australian First Class Honours degree (this is a four year degree with a major research project in the final year). All qualifying programs of study must be successfully completed.", "Scholarships will be awarded on academic merit and research potential. Extra-curricular achievements are not considered.", "International applicants must not hold a research qualification regarded by the University of Adelaide to be equivalent to an Australian Research Doctorate degree or, if undertaking a Research Masters degree, not hold a research qualification regarded by the University of Adelaide to be equivalent to or higher than an Australian Research Masters degree.", "International applicants who have not provided evidence of their meeting the minimum English language proficiency requirements for direct entry by the scholarship closing date, or who have completed a Pre-Enrolment English Program to meet the entry requirements for the intended program of study, are not eligible.", "Citizens and Permanent Residents of Australia, and citizens of New Zealand are ineligible.", "Those undertaking research via remote candidature are ineligible.", "Candidates are required to enrol in the University of Adelaide as ‘international students’ and must maintain ‘international student’ status for the duration of their enrolment in the University.", "Candidates who have applied for Australian permanent resident status can apply for ASI scholarships.", "International applicants are not eligible if they have already commenced the degree for which they are seeking an award, unless they can establish that they were unable to apply in the previous round.", "Scholarships holders must commence study at the University of Adelaide in the semester the scholarship is offered.", "Applicants who applied and were eligible for consideration in an international scholarship round, and were unsuccessful, will automatically be reconsidered in the following international scholarship round, assuming they hold a valid offer of candidature for that intake. An applicant who has been considered in 2 rounds cannot be reconsidered in any future scholarship rounds.", "The offer of a scholarship is contingent upon a student not being offered another award by the Commonwealth of Australia, the University of Adelaide, or an overseas sponsor. The University reserves the right to withdraw an offer of a scholarship at any time prior to enrolment if it is advised that an awardee has been offered a scholarship equal to or in excess of the financial value of the award offered by the University.", "Generally applicants who succeed in winning an ASI scholarship have completed a Masters degree including a significant research component and have several publications and relevant work and research experience.", "Application", "International Application Rounds ", "To apply please submit a formal application for Admission and a Scholarship via our online application system. There is no application fee.", " Apply Now", "Note.", " The University of Adelaide is unable to provide an assessment of eligibility for candidature and/or a scholarship until a formal application is submitted and assessed. We strongly recommend that all applicants submit their application and all required documents well before the closing date.", "For More Information:", "Visit the Official Webpage of the University of Adelaide Scholarships International (ASI) 2018/2019"], "url : https://www.opportunitiesforafricans.com/university-of-adelaide-scholarships-2018-2019/"], [["British Academy Global Professorships 2018 Program for outstanding overseas scholars to work & collaborate in the UK (£750,000 per awardee)", "date announced:August 14, 2018", "Application Deadline: Wednesday 12 September 2018 (17.00 UK Time)"], ["Application Deadline: ", "Wednesday 12 September 2018 (17.00 UK Time)", "This new programme is supported under the", " UK Government’s National Productivity Investment Fund", ". It aims to demonstrate and further enhance the UK’s commitment to international research partnerships and collaboration as well as strengthen the UK’s research capacity and capability in the humanities and the social sciences.", "Up to 10 Global Professorships each year will be offered during the course of the programme (which will run for three years in the first instance). Each award will provide funding for four years to an outstanding international researcher, not currently working in the United Kingdom, to bring their research experience to the UK. The purpose of the Global Professorships is to enable world-class scholars to further their individual research goals while strengthening the UK research base and advancing the research goals and strategies of their UK host universities.", "Each four-year appointment is intended to be a complete project in itself and is expected to involve a specific research focus, although the British Academy does not have a preferred model for the balance of time to be spent between research and teaching (which may vary over the course of the award and will depend on the UK host institution’s needs).", "Eligibility Requirements", "Suitable candidates for the Global Professorships include internationally-recognised mid-career to senior researchers active in any field within the social sciences or the humanities who are currently employed outside the UK.", "The applicant must either be in a permanent (full-time or part-time) position at their home institution overseas or have a fixed-term position for the duration of the Global Professorship.", "Applicants must be available to take up a long-term secondment or employment at an eligible UK university or research institution.", "Benefits", "Awards are expected to run for four years each.", "The British Academy will provide up to £250,000 per annum for the first three years, making a total contribution of £750,000 per award.", "The costs of the fourth year will be expected to be committed in full by the UK host institution.", "Successful applicants to the 2018 competition will be required to start their awards between 1 December 2018 and 31 May 2019.", "Application Process", "Applications must be submitted online using the British Academy’s Grant Management System, ", "Flexi-Grant®", "Application Deadline: ", "Wednesday 12 September 2018 (17.00 UK Time)", "UK Host Institution Approval Deadline: ", "Thursday 13 September 2018 (17.00 UK Time)", "Contact Details", "Please contact ", "[email protected]", "  or call 020 7969 5220 for further information.", "For More Information:", "Visit the Official Webpage of the British Academy Global Professorships 2018"], "url : https://www.opportunitiesforafricans.com/british-academy-global-professorships-2018-program/"], [["NFP/MSP (MENA) Scholarship Programme 2019 for Study in the Netherlands (Fully Funded)", "date announced:August 23, 2018", "Application Deadline: October 18th 2018"], ["Application Deadline: October 18th 2018", "The MENA Scholarship Programme", " aims to contribute to the democratic transition in one of the ", "10 participating countries ", "in the Middle East and North Africa region. It also seeks to build capacity within organisations by enabling employees (", "45 years and younger", ") to participate in short courses in various fields of study.", "Nuffic ", "(The Netherlands Organisation for International Cooperation in Higher Education)", " ", "offers fellowships for training courses in The Netherlands. These fellowships seek to develop and strengthen the skills, instincts, and abilities of professionals to enable their organisations and communities to succeed in an ever-changing world.", " ", "The Nuffic programme is initiated and (almost) fully funded by the budget for development cooperation at the Dutch Ministry of Foreign Affairs. The Nuffic Fellowships (OKP, MSP, and StuNed) will cover the tuition fee, return flights from an international airport to Amsterdam, insurance, accommodation and a small Daily Subsistence Allowance (DSA).", "In order to qualify for a Nuffic Fellowship, you must first obtain academic admission at The Hague Academy. Once your application has been assessed and admitted, you will receive further instructions to complete fellowship application.", "The aim of the MSP", "The main aim of the MSP is to contribute to democratic transition in the selected countries.", "It also aims at building capacity within organisations in the region, by enabling employees to take part in short courses in the Netherlands. While the scholarship is awarded to individuals, the need for training must be demonstrated in the context of the organisation the applicant is employed by. The training must help the organisation develop its capacity.", "A candidate for the MSP, must therefore be nominated by an employer to participate in the programme.", "Requirements:", "Eligibility criteria", "To be eligible for an MSP scholarship:", "▪ one must be a professional and national of, and living and working in one of the countries on the MSP country list valid at the time of application;", "▪ one must have a current employer’s statement that complies with the formal Nuffic has", "provided. All information must be provided and all commitments that are included in the formal must be endorsed in the statement;", "▪ one must not be employed by an organisation that has its own means of staff-development. Organisations that are considered to have their own means of staff development are for example: multinational corporations (e.g. Shell, Unilever, Microsoft);", "large national and/or a large commercial organisation;", "bilateral donor organisations (e.g. USAID, DFID, Danida, Sida, Dutch ministry of Foreign affairs, FinAid, AusAid, ADC, SwissAid);", "multilateral donor organisations, (e.g. a UN organisation, the World Bank, the IMF, Asian Development Bank, African Development Bank, IADB);", "international NGO’s (e.g. Oxfam, Plan, Care).", "▪ one must have an official and valid passport ( valid at least 3 months after the candidate submission date);", "▪ one must have a government statement that meets the requirements of the country in which the employer is established (if applicable);", "the age of the MSP candidate must not exceed 45 years of age at the time of the grant submission.", "the candidate must not receive more than one MSP scholarship for courses that take place at the same time", "How to apply", "Application for the MSP takes place via Dutch institutions. Each deadline, these institutions provide a list of courses available for that deadline. The short courses on offer fall within several fields of study, and have a duration of 2 to 12 weeks", "Follow these steps to apply:", "1. Select a course on the MSP course list", "2. Contact the Dutch higher education institution that is offering the course for information on:", "▪ course content", "▪the application deadline (deadlines can differ per Dutch institution)", "▪ the application and selection procedures", "▪ the online application form and the supporting documents", "3. Prepare your application and the supporting documents", "4. Submit your online application via the Dutch institution offering the course", "The deadline for applications is the 18", "th", " October 2018 at 24h00. The following training courses will be eligible:", "Inclusive Service Delivery & the SDGs", " (18 – 29 March 2019)", "Citizen Participation and Inclusive Governance ", "(8 – 19 April 2019)", "Integrity and Anti-Corruption (", "17 – 28 June 2019)", "Information about the content of the training course can be found via the ", "following link", ". For Nuffic Scholarship application, ", "ONLY use the Nuffic application form at the bottom of this page", ".", "How to apply for OKP or MSP Scholarships", "The Hague Academy uses a two-step application procedure:", "Applicants must obtain an academic admission from THA via the step-by-step procedure explained on this page. The application will be assessed for eligibility and relevance.", "If you meet all the academic and eligibility criteria you will receive an invitation to proceed with the second step in the scholarship application procedure, registering for the scholarship in ATLAS ", "(the Nuffic online application system)", "Important information before starting your application:", "The deadline for applications is the ", "18", "th", " October 2018 at 24h00", ". The application form will no longer be available after this deadline.", "Please read the ", "Nuffic Obligations for OKP Fellowship Holders", " or the ", "Nuffic Obligation for MENA Scholarship Holders", " before starting your application.", "Follow the step-by-step instructions, and pay careful attention to the Quality Guidelines provided.", "Prepare all your documents in advance", ". (You cannot complete your application without all necessary documents)", "Supporting documents must be uploaded in PDF format and must not exceed 2 MB. The following instructions can assist you: ", "Converting documents to PDF", "Carefully check your application before you submit it. Once your application has been submitted, there will be no further opportunity to replace or revise the documents.", "Only applications with all the required documents in the correct formats will be considered.", "ONLY applicants who have been admitted to proceed into the next round will be notified. This decision is final and not subject to discussion and/or correspondence.", "For More Information:", "Visit the Official Webpage of theNFP/MSP (MENA) Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/nfp-msp-mena-scholarship-programme-2019-for-study-in-the-netherlands-fully-funded/"], [["1 in 7 Scholarship to attend the One Young World Summit 2018 in The Hague, Netherlands (Fully Funded)", "date announced:August 7, 2018", "Application Deadline: 8 August, 12pm BST"], ["Application Deadline: ", "8 August, 12pm BST", "There are over 1 billion people in the world living with some form of a disability – that’s 15% of the world’s population, or 1 in 7 of us. This group is chronically underrepresented at every level.", "One Young World is proud to announce The 1 in 7 Scholarship in partnership with Include Me TOO which will support 5 of the world’s most inspiring and impactful leaders in the disability space to participate in the ", "One Young World Summit 2018", " which takes place in The Hague, Netherlands from 17 – 20 October.", "Include Me TOO is a charity working locally nationally and internationally with disabled children young people and their families supporting their rights, inclusion, participation and representation from a diverse range of backgrounds.", "The charity supports and promotes social justice, equality and rights for all disabled children and young people. Include Me TOO provides a range of support services including peer support, befriending services, activities and holiday clubs for disabled children, outreach and information and advice. The charity advises on policy, disability equality, diversity, inclusion and rights, nationally and internationally.", "Include Me TOO are behind the National Charter Of Rights for Disabled Children & Young People which was signed and supported by several national charities, government departments, government ministers, the Prime Minister in 2008 including consecutive Prime Ministers.", "Requirements:", "In order to apply you must:", "Be aged 18 – 30", "Identify as having a disability", "Successful candidates will excel in the following areas:", "Evidenced commitment to supporting the equality and rights for disabled persons", "Leadership ability", "Concern for local or global issues", "Ability to generate and articulate impactful ideas", "Teamwork", "Scholarship Worth:", "Access to the One Young World Summit 2018 in The Hague, Netherlands", "Hotel accommodation on a shared basis between 17 October and 20 October", "Catering which includes breakfast, lunch and dinner.", "Transport between the Summit accommodation and the Summit venue.", "Summit hand-outs and support materials.", "The cost of travel to and from The Hague.", "For More Information:", "Visit the Official Webpage of the 1 in 7 Scholarship "], "url : https://www.opportunitiesforafricans.com/1-in-7-scholarship-to-attend-the-one-young-world-summit-2018/"], [["Queen Mary University of London Chevening Partner Awards 2018/2019 for Law (Fully Funded LLM in the United Kingdom)", "date announced:August 7, 2018", "Application Deadline: 6th November 2018"], ["Application Deadline: 6th November 2018", "Queen Mary works closely with the ", "Chevening", " – the UK government’s international scheme aimed at developing global leaders – to provide a large number of full scholarships for study on our one-year Masters courses.", "Every year we host a large cohort of the 1500 ", "Chevening Scholars", " who come to study at universities all over the UK. In addition the standard Chevening Awards, Queen Mary is a Chevening Partner and funds an additional awards for those who are selected by Chevening. ", "The School of Law (including Centre for Commercial Law Studies)", " is funding an additional 2 awards for 2019 entry.", "The Awards", "All Chevening awards cover full overseas tuition fees, as well as providing a stipend for living costs, air-fares, and a variety of other expenses. There is no difference in the value of Chevening and Chevening Partner Awards.", "Chevening Scholars also benefit from a year-long programme of events helping you experience the best of British culture and to make the most of your time in the UK.", "Level: ", "Masters", "Course: ", "Any full-time 1-yr Master’s course in the School of Law.", "Country: ", "Afghanistan, Albania, Algeria, Andorra, Angola, Anguilla, Antigua and Barbuda, Argentina, Armenia, Australia, Azerbaijan, Bahamas, Bahrain, Bangladesh, Barbados, Belarus, Belize, Benin, Bhutan, Bolivia, Bosnia and Herzegovina, Botswana, Brazil, British Virgin Islands, Brunei, Burkina Faso, Burma (Myanmar), Burundi, Cambodia, Cameroon, Canada, Cape Verde, Cayman Islands, Central African Republic, Chad, Chile, China, Colombia, Comoros, Congo, Dem. Rep. of, Congo, Rep. of, Costa Rica, Cote D’ivoire, Cuba, Djibouti, Dominica, East Timor, Ecuador, Egypt, El Salvador, Equatorial Guinea, Eritrea, Ethiopia, Fiji, Gabon, Gambia, Georgia, Ghana, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Iceland, India, Indonesia, Iran, Iraq, Israel, Jamaica, Japan, Jordan, Kazakhstan, Kenya, Kiribati, Korea, North, Korea, South, Kyrgyzstan, Laos, Lebanon, Lesotho, Liberia, Libya, Macedonia, Madagascar, Malawi, Malaysia, Maldives, Marshall Islands, Mauritania, Mauritius, Mexico, Micronesia, Moldova, Mongolia, Montenegro, Montserrat, Morocco, Mozambique, Namibia, Nauru, Nepal, New Zealand, Nicaragua, Nigeria, Norway, Oman, Pakistan, Palau, Palestine, State of, Panama, Papua New Guinea, Paraguay, Peru, Philippines, Portugal, Russia, Rwanda, Samoa, Saudi Arabia, Senegal, Serbia, Seychelles, Sierra Leone, Singapore, Solomon Islands, Somalia, South Africa, South Sudan, Sri Lanka, St Lucia, St. Kitts and Nevis, Sudan, Suriname, Swaziland, Syria, Taiwan, Tajikistan, Tanzania, Thailand, The Falkland Islands, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkey, Turkmenistan, Turks and Caicos Islands, Tuvalu, Uganda, Ukraine, Uzbekistan, Vanuatu, Venezuela, Vietnam, Yemen, Zambia, Zimbabwe", "Value: ", "Full tuition fees and living costs.", "No. of awards: ", "2 at Queen Mary", "Deadline: ", "6th November 2018", "How to Apply", "Applications for all scholarships must be made directly to the Chevening: full details on how to apply are available on the ", "Chevening’s webpages", ". ", "To be eligible for a Partner Award you must rank Queen Mary as your first choice university.", " All Law courses are eligible for these two additional awards.", "For More Information:", "Visit the Official Webpage of the Queen Mary University of London Chevening Partner Awards 2018/2019"], "url : https://www.opportunitiesforafricans.com/queen-mary-university-of-london-chevening-partner-awards-2018-2019/"], [["LEVENTIS FOUNDATION Undergraduate Scholarships 2019 in Sustainable Agriculture at the Earth University Costa Rica (Fully Funded)", "date announced:August 10, 2018", "Application Deadline: 30th November 2018."], ["Application Deadline: ", "30th November 2018.", "Now Accepting Applications for the ", "LEVENTIS FOUNDATION Undergraduate Scholarship in Sustainable Agriculture at the Earth University Costa Rica.", "The application is open to two (2) qualified candidates from your country to aspire for an undergraduate degree in agricultural science and sustainable natural resource management. We are interested in candidates who are leaders, possess vocation in agriculture, are committed to working with their communities, and have good grades in science subjects and mathematics at end of high school exams.", "Application requirements are:", "Complete the application form in its entirety and sign the form, together with a witness.", "Attach one (1) current passport size photograph on the first page of the application.", "Attach copies of your junior and senior high school certificate(s) or result slips/transcripts as officially recognized and issued by the examining body in your country. Also, enclose transcripts from any colleges/institutions you may have attended.", "Enclose three (3) letters of recommendation in the suggested EARTH format.", "Optional: Attach additional certificates or recognitions, out-of-format recommendation letters that you may consider as support for your quest for admission to EARTH University.", "Incomplete and late applications will not be considered for faculty review.", "We do not recommend sending physical documents by post mail, FedEx or DHL", "You can opt to submit your application documents by scanning ", "in PDF format", " and attaching them to our e-mail address; ", "[email protected]", "You may also fill out the application online: ", "https://www.earth.ac.cr/en/study-at-earth/how-to-apply/", " and attach documents, recommendation letters and academic transcripts ", "in PDF format.", "Remember that the application window opened from", " 1st of August 2018", " and will close on", "30th November 2018.", "Candidates will be applying for 2019 academic intake.", "For More Information:", "Visit the Official Webpage of the Leventis Foundation Undergraduate Scholarship in Sustainable Agriculture 2019"], "url : https://www.opportunitiesforafricans.com/leventis-foundation-undergraduate-scholarships-2019/"], [["Lester B. Pearson International Scholarship Program 2019/2020 for study at the University of Toronto, Canada (Fully Funded)", "date announced:August 10, 2018", "Application Deadline: November 30, 2018;"], ["Application Deadline: November 30, 2018;", "The Lester B. Pearson International Scholarship Program at the University of Toronto", " is intended to recognize international students who demonstrate exceptional academic achievement and creativity and who are recognized as leaders within their school. A special emphasis is placed on the impact the student has had on the life of their school and community, and their future potential to contribute positively to the global community.", "Awarded annually, these scholarships recognize outstanding students from around the world, including international students studying at Canadian high schools. This is U of T’s most prestigious and competitive scholarship for international students.  Each year approximately 37 students will be named ", "Lester B. Pearson Scholars.", "Eligibility Criteria:", "an international student (i.e. a non-Canadian requiring a study permit)", "an original and creative thinker", "committed to school and community", "a high achiever in academic and creative pursuits", "enthusiastic about learning and intellectual exploration", "have demonstrated strong leadership skills", "currently in their final year of secondary school or have graduated no earlier than June 2018", "intending to begin university in the upcoming academic year (students already attending post-secondary studies cannot be", "Benefits:", "The Lester B. Pearson International Scholarships will cover tuition, books, incidental fees, and full residence support for four years. The scholarship is tenable only at the University of Toronto.", "How to Apply:", "To apply, you’ll need to:", "Receive a nomination from your school.  (", "High schools not already contacted/verified are asked to submit an application to participate in our program which can be accessed within the main Lester B. Pearson International Scholarship webpage starting here.", ")", "Apply to study at the University of Toronto to begin your studies in 2019 and complete your application for admission by the appropriate deadlines.", "Once we’ve received a nomination and you’ve applied to the university, you can complete the online Lester B. Pearson Scholarship application.", "Selection Procedure: On the basis of application/eligibility criteria, approximately 37 Lester B. Pearson Scholars at the University of Toronto will be chosen annually. These scholarships are tenable only at the University of Toronto.", "Deadline:", "School nomination deadline: November 30, 2018; Student OUAC application deadline: December 17, 2018 (Please note this is the final date to submit an application to the OUAC; however, it is recommended you apply for admission through the OUAC before November 1, 2018 as spaces in programs fill-up quickly and popular programs may close early.); Student scholarship application deadline: January 15, 2019", "For More Information:", "Visit the Official Webpage of the Lester B. Pearson International Scholarship Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/lester-b-pearson-international-scholarship-program-2019-2020/"], [["The Alliance for Peacebuilding (AfP) 2018 scholarship fund for local peacebuilders (Fully Funded to Washington, D.C USA)", "date announced:August 9, 2018", "Application Deadline: August 24th 2018"], ["Application Deadline: August 24th 2018", "The Alliance for Peacebuilding (AfP) is seeking applicants for a scholarship fund for local peacebuilders to attend PeaceCon2018 October 24-26, 2018. While applications are currently open, all decisions are contingent upon external funding.", "Each year, the Alliance for Peacebuilding’s Annual Conference gathers together a diverse network of peacebuilders and provides them with the opportunity to share their achievements, insights, and, most importantly, visions for the future of peacebuilding. Over the course of three dynamic days, conference participants have the opportunity to constructively engage in an array of activities and workshops structured around cutting-edge developments in the field of peacebuilding, from neuroscience and psychosocial healing to storytelling and the media. With past participants from over 200 organizations and 30 countries around the world, PeaceCon 2018 will be a pivotal juncture for exploring the challenges facing the field of peacebuilding, as well as developing collaborative solutions for the future.", "Requirements:", " AfP will select a maximum of 10 applicants conducting peacebuilding work/research to travel and attend to PeaceCon 2018.", "Those eligible are individuals who, either working independently or with an organization, implement direct peacebuilding programming and/or conduct peacebuilding research in a country/region outside of the United States, Canada, Western Europe and the European Union, Australia, Japan, and New Zealand.", "The deadline to apply is ", "August 24th", ".  All awarded scholarships are contingent on the applicants’ ability to get a visa to the United States. Pending approved funding, decisions and notifications will be made by ", "August 31st", ". Scholarships will be awarded on the basis of merit and financial need.", "Scholarship Worth:", "Selected applicants will receive the following: ", "AfP will cover round-trip airfare; (AfP reserves the right to place limits on the cost of travel)", "Local travel to and from airports;", "Hotel accommodations for 4 nights stay in Washington, DC;", "Pre-determined per diem to help cover the cost of dinner during the conference and when in transit;", "Admission to PeaceCon 2018 and the Peacebuilding M&E Solutions Forum (The Solutions Forum is held on October 23 and those selected are welcome to participate if their travel and schedule permit it);", "AfP will handle the travel logistics and purchase the airfare and hotel accommodations. Selected applicants will be required to coordinate their own local travel and will receive per diem payments upon arrival. All participants will travel economy-class flights to and from Washington, DC. AfP reserves the right to place a limit on the cost of flights depending on the selected applicant’s residency and circumstances. ", "The scholarship fund is contingent upon approved funding.", "Application Procedure:", "Please carefully read the guidelines and instructions before submitting your application.", "All applications must be submitted through the ", "online form", ".", "For More Information:", "Visit the Official Webpage of the PeaceCon 2018 Scholarship"], "url : https://www.opportunitiesforafricans.com/the-alliance-for-peacebuilding-afp-2018-scholarship-fund-for-local-peacebuilders/"], [["Mo Ibrahim Foundation Governance for Development in Africa Initiative (GDAI) 2019 PhD Scholarships in the UK (Fully Funded)", "date announced:August 23, 2018", "Application Deadline: 31st March 2019."], ["Application Deadline: ", "31st March 2019.", "The Centre of African Studies", " offers 2 ", "PhD scholarships to African nationals", " as part of the ", "Governance for Development in Africa Initiative funded by the Mo Ibrahim Foundation.", "Applications are invited for PhD studentships focused on the area of state capacities, governance and bureaucracy for development. This may include projects designed to understand public sector governance capabilities, political settlements, state business relations, the governance of state owned enterprises, the governance of development policy design and implementation, and so on. But applications must focus on the public sector/state/civil service, on governance, and on development.", "Benefits:", "The scholarship provides for fees for three years and an annual bursary of £16.000 per year. The scholarship also covers visa costs, HIS and TB (if undertaken), provided receipts are submitted to the Centre of African Studies office.", "In order to be considered for funding, applicants must first secure an ", "UNCONDITIONAL OFFER ", "for the PhD by applying directly to the ", "SOAS Doctoral School", ".", "The eligible PhD are only those within the following departments:", "Development Studies", "Law", "Economics", "International Relations/Politics", "CISD (Centre for International Studies and Diplomacy)", "DEFIMS (Department for Financial and Management Studies )", "Distance Learning: ", "CEFIMS(Centre for Financial and Management Studies", "), ", "DEFIMS", "Once the place is secured, the applicants can apply for the scholarship. Candidates will be assessed on academic merit by a panel consisting of SOAS academic members. The assessment of your application will be based on the information in your scholarship application. Please provide the following documents by email to ", "[email protected]", ":", "complete application form (see pdf attached on the right side of this page)", "a copy of the unconditional offer received from SOAS admissions office", "CV (please include your email address)", "2 pages max statement outlining knowledge and interest in governance-related issues", "Your research proposal (as sent to the SOAS Admissions Office)", "Please note that CAS reserves the right not to award scholarships and will only award them where there are applicants judged to meet sufficiently high academic standards and with demonstrable interests in fields relevant to the objectives of the GDAI.", "The deadline for submission of application is 31st March 2019.", "Downloads:", "The ", "guidance notes", " and the ", "reference form ", "can be downloaded on the right hand side of this page.", "Contact", "Angelica Baschiera", "\nCoordinator", "\nMo Ibrahim Foundation Governance for Development in Africa Initiative", "\nSOAS", "For More Information:", "Visit the Official Webpage of the Governance for Development in Africa Initiative (GDAI) 2019 Masters & PhD Scholarships"], "url : https://www.opportunitiesforafricans.com/governance-for-development-in-africa-initiative-gdai-2019-phd-scholarships/"], [["TU Delft Sub-Saharan Africa Excellence Scholarships 2019/2020 for Young Africans – Netherlands (Funded)", "date announced:August 22, 2018", "Application Deadline: December 1st 2018"], ["Application Deadline: December 1st 2018", "The TU Delft Sub-Saharan Africa Excellence scholarships", " give talented, motivated and broadly interested students from Sub-Saharan Africa the opportunity to study at the Delft University of Technology. The Global Initiativeaims to support capacity building in the Global South and to advance future leadership focusing on sustainable global development. The UN Sustainable Development Goals are a guiding principle for the TU Delft.", "TU Delft | Global Initiative offers four Sub-Saharan Africa Excellence Scholarships every year. From the students we expect that they are willing to act as our ambassadors during their studies and after graduation.", "Eligibility Requirements:", "Admitted to one of TU Delft’s MSc programmes with an accumulative grade point average (GPA) of 80 percent or higher of the scale maximum in your bachelor’s degree;", "\nA degree from an accredited university in one of the above mentioned countries", "Scholarship Worth:", "Full tuition fees for a TU Delft MSc programme and  living expenses for 2 years. €25.000 per year for Sub-Saharan students.", "Membership to the Scholarship club giving access to personal development, workshops, seminars, etc..", "A MSc thesis topic which relates to the ", "Sustainable Development Goals", " and ", "TU Delft | Global Initiative", ".", "Be ", "TU Delf ambassador for Sub-Saharan Africa.", "Application Procedure:", "Check", " if you’re eligible for this scholarship.", "Complete", " your ", "application for a Non EU", ". Check the admission requirements.", "Complete", ", in addition to all the regular documents for a MSc programme application, ", "the Application Form for a Sub-Saharan Africa Scholarship", " (available per 1 October 2018).", "Upload", " your MSc application and the Application for Sub-Saharan Africa Excellence Scholarship before ", "1 February 2019. ", "Granting", "Only students who have been granted a scholarship will be informed by TU Delft via email by ", "begin-April 2019.", "Receiving the scholarship is conditional on the student fulfilling all admission criteria.", "For More Information:", "Visit the Official Webpage of the TU Delft Sub-Saharan Africa Excellence Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/tu-delft-sub-saharan-africa-excellence-scholarships-2019-2020-for-young-africans-netherlands-funded/"], [["Agbami Medical and Engineering Professionals Scholarship Award 2018 for young Nigerians", "date announced:August 16, 2018", "Application Deadline: August 28th 2018"], ["Application Deadline: August 28th 2018", "Star Deep Water Petroleum Limited, a Chevron company and operator of the", " Agbami Field,", " in its continuous support for capacity building in the health and engineering sectors as a strategic feed into the national manpower pool, is offering a number of University Scholarship Awards to qualified Nigerian students from ALL states of the Federation.", "The scholarship program, funded by Star and its Agbami co-venturers, is a major component of their Social Investment in the strategic development of health and education in Nigeria.", "Eligibility Requirements:", "E-Applications are invited from FULL-TIME, ", "100", " and ", "200", " level undergraduates from any state of the Federation, studying any of the under listed courses in universities within Nigeria:", "Medicine & Surgery", "Dentistry", "Pharmacy", "Engineering", "QUALIFICATION PROCESS", ": Interested applicants should click on the ", "“How To Apply”", " tab to proceed.", "Application closes Midnight ", "28th August, 2018", "Please note that applicants for the Agbami scholarship are ineligible to apply for any other scholarship program sponsored by “STAR” or any of its Parties.", "Selected students will be invited for computer-administered qualifying tests in selected examination centers nationwide. Short-listed candidates for the qualifying test will be invited by email and SMS text messages. All applicants are therefore advised to ensure that valid GSM telephone numbers and personal email addresses are properly entered into the e-forms on the web site.", "Application Procedure:", "Application is only open to full-time 100 or 200 level students admitted during 2017/2018 or 2016/2017 academic session respectively.", "1. Before you start this application, ensure you have clear scanned copies of the following documents", " ", "Passport photograph not more than 3 months old (450px by 450px not more than 200kb)", "School ID card", "Admission Letter", "O’ Level Result", "JAMB Result", "Local Government Area Letter of Identification", "2. Ensure the documents are named according to what they represent to avoid mixing up documents during upload", "3. Ensure you attach the appropriate documents when asked to upload", " ", "To apply, follow the steps below", ":", "1.    Click on “Register/Log in” to create an account or log in to your Scholastica account.", " ", "2.    Proceed to your email box to activate your account for newly registered applicants.", "3.    Click on", "www.scholastica.ng/schemes/agbami", " to return to Scholarship site", " ", "4.    Enter your registered email and password to upload your information.", " ", "5.    Enter your personal information, National Identification Number (if available), educational information, other information and upload required scanned documents.", " ", "6.    Ensure the name used in applications matches the names on all documentation in same order. Upload a sworn affidavit or certificate if otherwise.", " ", "7.    Ensure you view all documents after uploading, to eliminate errors during uploading.", " ", "8.    When asked to upload photo, upload a pass-port photograph with a white background.", " ", "9.  Recheck application information to avoid errors", "10.  Return to the Home page, Click on the scheme you wish to apply and Click “Apply Now” to submit information", " ", "11.  You will receive a notification displayed on the screen you have successfully applied. To confirm Check “My application” under “My account” section on your profile account.", "12.  Return to", "www.scholastica.ng", ", enter your Email and Password to download your verification profile and proceed to have your Head of Department sign the document.", " ", "13.  Upload a scanned copy of the signed verification profile, this would be used for verification.", " ", "14.", "If National Identification Number (NIN) number was not available in step 6", ", to obtain your National Identification Number (NIN)", " ", "Visit ", "http://ninenrol.gov.ng", " to register and learn more about the National Identity Number", "Click “Create Account” and fill in the required  fields", "Login with Email and Password to complete the form", "After completion, schedule a date for photo and finger print capture", "Visit any of the 37 capture centres ", "http://www.nimc.gov.ng/?q=nin-registration-centres", "  to complete the registration process and obtain your National Identity Number", "You can also do your total registration at the NIMC office", "15. Return to", "www.scholastica.ng/schemes/agbami", " and update application with National Identification Number (NIN) to ensure completion", "For More Information:", "Visit the Official Webpage of the Agbami Medical and Engineering Professionals Scholarship Award 2018 "], "url : https://www.opportunitiesforafricans.com/agbami-medical-and-engineering-professionals-scholarship-award-2018-for-young-nigerians/"], [["Ghana National Petroleum Corporation (GNPC) Local Undergraduate scholarship 2018/2019 for young Ghanaians", "date announced:August 16, 2018", "Application Deadline: 7th September, 2018."], ["Application Deadline: 7th September, 2018.", "The Ghana National Petroleum Corporation (GNPC) i", "s offering limited ", "Undergraduate scholarship", ", through the GNPC Foundation, to prospective Ghanaian students for the 2018/19 academic year. The scholarship is for degree courses and are tenable at accredited public tertiary Institutions in Ghana. The scholarship covers Tuition, Living Expenses, Book Allowance and Dissertation/Project Allowance.", "Eligibility Requirements:", "Be Ghanaian,", "Have obtained admission to undertake an Undergraduate Degree Program at a local public tertiary Institution at the time of application", "Must be below the age of 30 years as at time of application", "PREFERENCE", "Preference would be given to:", "Science, Technology, Engineering and Mathematics (STEM)", "Special Education", "Agricultural Science", "DOCUMENTS REQUIRED"], "url : https://www.opportunitiesforafricans.com/gnpc-local-undergraduate-scholarship-2018-2019-for-young-ghanaians/"], [["Coventry University Sports Scholarship 2018 for undergraduate study in the UK (Funded)", "date announced:August 7, 2018", "Application Deadline: 31 August 2018"], ["Application Deadline: 31 August 2018", "Coventry University", " will be making available", " sports scholarships", " in 2018 to all students which will be awarded competitively at either of two levels: £1,500 or £3,000 per year depending on the level of sporting performance. Applications will be judged against the particular selection criteria set out for this scholarship scheme.", "This scholarship is available to students who can demonstrate excellence in their chosen", "sporting activity at national or international level and will represent the University at a high", "level in that sport.", "The Sports Scholarship consists of 2 levels offering £1,500 or £3,000 per year depending on the level of performance. 50% will provide direct financial support and 50% will provide non-financial support in the form of a tailored programme of support services such as", "Physiotherapy, Strength and Conditioning and Sports Nutrition as well as enabling scholars to fund training and competition/travelling expenses.", "Application Procedure:", "Please return your completed application form to: ", "[email protected]", "The Student Funding Office will acknowledge receipt of application forms within four weeks. If you have not received an acknowledgment letter within that timescale please contact the", "Student Funding Office as shown below. Further information", "For up-to-date information or any changes on scholarships available, we recommend you check the Coventry University website regularly at www.coventry.ac.uk/scholarships under ", "Coventry University Scholarships. ", "Alternatively contact the Student Funding Office Telephone: 024 7765 2040 Email: ", "[email protected]", " Or the Sports Scholarship Officer, Tom Shakespeare", "Telephone: 02477 655979 Email:", "[email protected]", "To be considered for one of these scholarships you must be competing in a sport which is ", "recognised by Sport England", ", but you may be ", "an undergraduate or a postgraduate", ", from", " the UK, the EU or overseas", ", and studying ", "in any year of your course", ".", "For more information, contact Tom Shakespeare on ", "[email protected]", " or +44 (0)24 7679 5979.", "For More Information:"], "url : https://www.opportunitiesforafricans.com/coventry-university-sports-scholarship-2018-for-undergraduate-study-in-the-uk-funded/"], [["HPI-CS4A PhD Computer Science studentships 2018 for young Africans to study at the University of Cape Town, South Africa.", "date announced:August 14, 2018", "Application Deadline: 1st September 2018."], ["Application Deadline: ", "1st September 2018.", "The Hasso-Plattner-Institute in Computer Science for Africa (HPI in CS4A)", ", affiliated with", " the Department of Computer Science at the University of Cape Town,", " is offering PhD studentships in the field of Computer Science to students from the African continent. More specifically, we seek high quality applications centered on ideas that revolve around proposing solutions to problems of computing that emerge in the African context.", "Areas of research of potential supervisors include (with sub-field listed in brackets):", "• Computer Graphics [Augmented and Virtual Reality, Procedural Modelling]", "• Digital Libraries [Cultural Heritage Preservation, Architectures and Interoperability]", "• Educational Technology [Computer Science Education, Gamification, Teacher-focused Interventions]", "• Human Computer Interaction for Development (HCI4D) [Community-based Content Creation, Participatory Co-Design for/with Mothers and Communities, Participatory Video for Maternal Health Education]", "• Information Retrieval [IR for development, African/marginalized language IR]", "• Knowledge Engineering [ontologies, knowledge representation and reasoning, natural language generation, intelligent conceptual modelling]", "• Networks [Wireless Community Networks, Network Measurements, Dynamic Spectrum Access/TVWS, Network measurements and performance engineering, Software Defined Networks, Research and Education Networks, Cloudlets / Edge Computing]", "• Parallel/High Performance Computing  [GPGPU, Multithreading]", "• Visualization [Scientific visualisation, Tangible interfaces, Design]", "Eligibility Requirements:", "1. Hold a Masters Degree in Computer Science, supported by a good dissertation", "2. Be proficient in English as attested by a recent score (obtained within 3 – 5 years before application for admission) of at least 570 (paper-based test) or 230 (computer-based test) on the Test of English as a Foreign Language (TOEFL); or a recent overall band score of 7.0 (with no individual element of the test scoring below 6.0) on the International English Language Testing System (IELTS). If your medium of education was in English then you are exempt from this requirement.", "Application Guidelines ", "To apply, please submit the following:", "• A curriculum vitae ( 2-3 pages)", "• Academic Transcripts", "• TOEFL/IELTS Results", "• A brief research proposal (2-3 pages) with a potential supervisor at UCT identified", "Your proposal must outline your research question(s) and proposed methodology for conducting the research. We will only consider proposals that fall within the core areas of research listed.", "Please submit a single pdf file, comprising ALL the application materials, electronically at the following link – ", "https://easychair.org/conferences/?conf=hpics4a2018", " Under the title field you should submit a provisional title for your research and under keywords list the areas of specialization.  It is advisable to contact potential supervisors by e-mail beforehand to determine if your areas of research interest align with theirs. However, please do not indiscriminately contact all staff in the Computer Science Department at UCT. If you have more than one area of interest indicate this at the end of your research proposal.", "Shortlisted candidates will be expected to arrange for three reference letters to be submitted and be available for a Skype interview in mid September.", "Questions or requests for more information can be made using the contact details below:", "Contact Information ", "Professor James Gain", ", \u2028Coordinator, HPI PhD Research School in CS4A \u2028Department of Computer Science \u202818 University Ave., \u2028University of Cape Town Cape Town, \u2028South Africa, 7701\u2028  | Email: ", "jgain at cs.uct.ac.za ", "For More Information:", "Visit the Official Webpage of the HPI-CS4A PhD Computer Science studentships 2018"], "url : https://www.opportunitiesforafricans.com/hpi-cs4a-phd-computer-science-studentships-2018/"], [["University of Michigan African Presidential Scholars Program 2019/2020 for Study in USA (Fully Funded)", "date announced:August 22, 2018", "Application Deadline: October 15th 2018"], ["Application Deadline: October 15th 2018", "The ", "University of Michigan African Presidential Scholars (UMAPS) Program", " ", "brings early career faculty from African universities to Ann Arbor, Michigan for residencies that begin in late August, generally lasting up to six months. Scholars are paired with a faculty mentor during their stay and have full access to the University of Michigan’s resources to further their work on a research project, an academic degree, publications, grant proposal, or other relevant activity. The program supports the development of the next generation of African scholars by integrating them into international academic networks, and promotes U-M’s international commitment to research and teaching collaborations across diverse disciplines, from engineering to literature to economics.", "UMAPS accepts direct applications from faculty members of colleges or universities in Ethiopia, Ghana, Liberia, South Africa, and Uganda.", "Faculty members of colleges and universities in all other African countries cannot apply directly to the UMAPS program without first being nominated and invited to apply by a U-M faculty member with whom they already have a pre-existing relationship.", "Eligibility Requirement", "*Previous recipients of the UMAPS fellowship are not eligible to apply. Preference will be given to applicants without extensive international experience outside the continent. ", "All applicants must:", "\u0007Be an early career faculty member who has taught in the higher education system for less than ten years, presently teaching in a college or university in Africa", "Be able to demonstrate support from home institution with letter of recommendation from head of department, dean, or vice chancellor", "Be able to remain in residence from four to six months\n", "Applicants outside of Ethiopia, Ghana, Liberia, South Africa, or Uganda ", "must be nominated by a University of Michigan faculty member", " with whom the interested applicant already has a pre-existing/established relationship.", "Application Checklist and Timeline", "All applicants must:", "Complete the online application form »", " (This link can only be used by applicants from the following countries: Ethiopia, Ghana, Liberia, South Africa, or Uganda)", "Submit a curriculum vitae", "Submit a ", "scholarly program/research proposal", " (not to exceed five pages)", "\nApplications from a wide range of disciplines and schools are welcome; applications that align with the center’s initiatives", "—", "AHHI", ", ", "ASRI", ", and ", "STEM-Africa", "—are encouraged", "Provide complete name and contact information of the department head, dean, or vice chancellor at the applicant’s home institution who will be writing their ", "letter of support", "Award Details", "Those admitted to the UMAPS Program will receive:", "Four to six months residency at the University of Michigan in Ann Arbor, Michigan, paired with a faculty mentor with full access to the university’s resources", "Round-trip airfare from their home country to Ann Arbor, Michigan", "\u0007Free hhousing, medical insurance, a research allowance, and a modest stipend to cover living ", "(Important note: The UMAPS program is unable to accommodate spouses and/or dependents)", "Office/Laboratory space", "Opportunity to present research to the U-M community", "For More Information:", "Visit the Official Webpage of the University of Michigan African Presidential Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-michigan-african-presidential-scholars-program-2019-2020-for-study-in-usa/"], [["HIV Research Trust Scholarships 2019 for Health Professionals from Developing Nations (funded)", "date announced:August 21, 2018", "Application Deadline: 12 October 2018"], ["Application Deadline: 12 October 2018", "The HIV Research Trust", " is a charitable foundation that provides financial support to physicians, nurses, scientists and other health care professionals in early/mid-career who are located in resource-limited settings from low-income and lower-middle-income countries working in the field of HIV infection. All aspects of research related to HIV infection and its consequences are eligible including clinical care, basic and applied biology, epidemiology, psychological, ethical, economic, educational and societal aspects. The support is in the form of scholarships which are of ", "variable duration and cover course fees, travel, living expenses and consumables", ".", "Scholarships", " are awarded annually following a competitive peer-review process and are designed to enable the candidate to travel to another research unit to learn skills and techniques which should develop the candidate’s career and, on return to the home institution, add to the capacity of the department to carry out research related to treatment and prevention. Examples of skills and techniques that may be acquired are; clinical management, clinical trial experience and practice, data and trial management, statistical expertise, acquisition of laboratory techniques and analysis, cell and molecular biology.", "Requirements:", "The scholarships are provided to physicians, nurses, scientists and other health care professionals, in particular those who are in the early to mid-stage of their career (for example, undertaking a PhD; a first or second post doc position; or other professionals in an early phase of their research career), working in resource-poor settings from low-income and lower-middle income countries.", "The scholarship enables the individual to travel to other centres to acquire skills necessary to conduct their research more effectively when they return to their home institution", "Benefits:", "The scholarships provide support for travel, living expenses including accommodation, and may provide support for laboratory expenses at the institution to be visited. The preference is for applicants to receive training in recognised centres in other resource-poor countries but travel to other areas is not excluded. The usual period of support is 2-6 months.", "The maximum sum awarded is £8,000 or equivalent value. We expect the budget request to be clearly justified by the programme being presented. If the financial breakdown includes laboratory costs these must not exceed 40% of the total value of your scholarship application", "2018 Timeline", "Online application for 2019 scholarships opens 20 August 2018 and closes 12 October 2018", "2019 scholarships announced late December 2018", "For More Information:", "Visit the Official Webpage of the HIV Research Trust Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/hiv-research-trust-scholarships-2019-for-health-professionals-from-developing-nations-funded/"]]