[[["Federal Government Scholarship Awards 2020/2021 for Nigerians in Tertiary Institutions", "date announced:October 27, 2019", " The Honourable Minister of Education (HME), Mallam Adamu Adamu, hereby invites interested and qualified Nigerians to participate in the 2020/2021NominationComputer Based Test (CBT) for the Federal Government Scholarship Awards for "], [" The Honourable Minister of Education (HME), Mallam Adamu Adamu, hereby invites interested and qualified Nigerians to participate in the 2020/2021NominationComputer Based Test (CBT) for the Federal Government Scholarship Awards for ", " THE ELIGIBILITY CRITERIA FOR NIGERIAN AWARD IS AS FOLLOWS:", "Applicants for Postgraduate studies should possess a minimum of first degree with Second Class Honours Upper Division. Applicant must be registered Full-Time students of Federal or State Universities.", "All other applicants (UG, HND & NCE) must be registered full-time students in their second year or above in Federal or State Universities, Polytechnics, Monotechnics and Colleges of Education. ", "All undergraduate Scholarship applicants (Physically challenged inclusive) must have at least 4.0 Cumulative Grade Points Aggregate (CGPA) on a five (5) point scale or its equivalents or 5.0 on a 7 point scale. ", " IMPORTANT INFORMATION:", "The scholarship is tenable in Nigeria and takes effect from the beginning of the academic session.", "It shall not be held at the same time with another Award nor for part-time studies.Change of course or Institution is not allowed.", "The Scholarship award is to assist the scholar in the payment of:i.Institutional charges and fees and ", "ii.For Personal maintenance. ", " COURSES TO BE CONSIDERED FOR THE AWARD ARE AS FOLLOWS:", "A.Science and Technology", "B.Medicine and Para-medicals", "C.Education", "D.Agriculture", "E.Liberal Arts/Social/Management Sciences", "F.Entrepreneural Studies,", "G.ICT", "H.Environmental Sciences", "I.Law ", " METHOD OF APPLICATION", "Application forms are to be completed online as follows:", "Complete form online", "Submit and Print a copy", "Attach Photocopy of the following documents to the Printed Copy ", "i.Letter of Admission to the Institutionii.Current Course Registration Form", "iii.CGPA results of year1,2, 3, etc.", "iv.Current School’s Identity Card", "v.Letter of Identification from your State/Local Government ", "vi.Two (2) passport size photographs with your name written at the back and duly signed by you ", " GENERAL NOTICE: During the application,candidates are expected to indicate the following:", "i) Candidates are advised to choose Computer Based Test Centre (CBT) very close to them;", "ii) Choice of programme preferred in order of priority (i.e. Bilateral Education Agreement (BEA) and Nigerian Award;", "iii) The registration portal will be closed on Friday 6th December 2019 by 11:59PM OFFICIAL PHONE NUMBERS/E-MAIL:", " i.Bilateral Education Agreement (BEA): 08077884417/09094268637", "ii.Nigerian Award: 08077884418/08091155229", "[email protected]", "For furtherTechnical/Apps inquires please call: 08055581004", "Candidates are advised to choose a Centre very close to them", "TIME: 9.00 A.M DAILY", "PLEASE NOTE THAT THIS PARTICULAR APPLICATION DOES NOT ATTRACT ANY PROCESSING FEE. THEREFORE, BEWARE OF FRAUDSTERS!", "For More Information:", "Visit the Official Webpage of the Federal Government Scholarship Awards 2020/2021"], "url : https://www.opportunitiesforafricans.com/federal-government-scholarship-awards-2020-2021-for-nigerians-in-tertiary-institutions/"], [["Chalmers University of Technology IPOET Scholarships 2020 for Study in Sweden", "date announced:October 23, 2019", "Application Deadline: 15 January 2020 "], ["Application Deadline: 15 January 2020 ", "Chalmers will be offering around 50", " IPOET scholarships", " ", "in 2019, funded by the Swedish Council for Higher Education, to prospective fee-paying students. The scholarships are administered and awarded by Chalmers.", "Selection", "The selection\nis based on the applicants’ relative academic excellence, which\nprimarily includes weighted average grade but also home university’s\nstature (including position on global ranking lists) and priority order\nof the application for Chalmers Master’s programmes.", "Fields of Study", "Unrestricted – all of the current Master’s programmes at Chalmers.", "Available to", "1st year Master’s programme applicants", "Citizens from non-EU/EEA countries who are required to pay tuition fees for Swedish university studies", "Amount", "A 75% reduction of the tuition fees (4 semesters/2 year programme)", "Students who excel during their first year of studies may receive an\nincreased reduction, which covers 85% of the tuition fees during the\nsecond and final year of studies", "No funds are transferred to the scholarship laureates", "For More Information:", "Visit the Official Webpage of the Chalmers University of Technology IPOET Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/chalmers-university-of-technology-ipoet-scholarships-2020/"], [["Swedish Institute Scholarships for Global Professionals (SISGP) 2020/2021 for Master’s Level Studies in Sweden (Fully Funded)", "date announced:October 21, 2019", "Application Deadline: February 20th 2020"], ["Application Deadline: February 20th 2020", " Do you have ambition, leadership experience and a strong professional background? You could study for a master’s degree in Sweden on a ", "fully-funded Swedish Institute scholarship", "SI grant scholarships to a large number of master’s programmes starting\nin the autumn semester 2020. We will publish a list of master’s\nprogrammes that are eligible for SI scholarships for the academic year\n2020/2021 by 6 November 2019.", "To begin with, apply for a master’s programme at ", "universityadmissions.se", ", between 16 October 2019 – 15 January 2020.", "Apply for an SI scholarship between 10-20 February 2020, follow the instructions below.", "An estimated 300 scholarships will be available for full-time master’s degree studies in Sweden starting in the autumn semester 2020.", "Criteria", "Work experience ", "You must have minimum of 3,000 hours of demonstrated employment.", "Read more about the criteria for work experience", " ", "Leadership experience ", "You must have demonstrated leadership experience from your current or previous employment.", "Read more about the leadership experience criteria", " ", "Country of citizenship ", "You must be a citizen of a country that is eligible for the scholarship programme.", "Read more about country of citizenship", " ", "Master’s programmes ", "The master’s studies must be eligible for SI scholarships. ", "Read more about the eligible master’s programmes", " ", "University admissions ", "You must be liable to pay\ntuition fees to Swedish universities, have followed the steps of\nuniversity admission, and be admitted to one of the eligible master’s\nprogrammes by 3 April 2020.", "Benefits:", "The scholarship covers:", "Tuition fees: pay directly to the Swedish university by SI", "Living expenses of SEK 10,000/month", "Travel grant of SEK 15,000 *", "Insurance against illness and accident", "Membership of ", "the SI Network for Future Global Leaders", " (NFGL) – a platform to help you grow professionally and build your network while in Sweden", "Membership of ", "the SI Alumni Network", " after your scholarship period – a platform for continued networking and further professional development", "Required documents", "You should only submit the required documents listed below in your\nonline scholarship application. We will not consider any other documents\nthan the required ones. You must complete your application in English.\nUse our forms and templates provided below and complete them according\nto the instructions both below and in the forms, or else your\napplications will be disqualified. Kindly note the length limitation for\nyour answers and the documents.", "Information about required documents and the forms needed for the\ndocuments will be published here well in advance of the application\nperiod.", "You will also need to attach a copy of your passport in your application. Your personal data including name, citizenship and photograph must be shown clearly.", "How to apply", "\n1\nApply for a master’s programme at universityadmissions.se\nDate:\n16 Oct 2019 – 15 Jan 2020\n", "\n2\nApply for an SISGP scholarship\nDate:\n10 Feb 2020 – 20 Feb 2020\n", "\n3\nNotifications from University Admissions\nDate:\n3 Apr 2020\n", "\n4\nAnnouncement of 300 successful SI scholarship recipients\nDate:\n24 Apr 2020\n\n", "For More Information:", "Visit the Official Webpage of the Swedish Institute Scholarships for Global Professionals"], "url : https://www.opportunitiesforafricans.com/swedish-institute-scholarships-for-global-professionals-sisgp-2020-2021/"], [["Bilateral Education Agreement (BEA) Scholarship Award 2020/2021 for Nigerians to Study Abroad.", "date announced:October 26, 2019", " The Honourable Minister of Education (HME), Mallam Adamu Adamu, hereby invites interested and qualified Nigerians to participate in the 2020/2021 Nomination Computer Based Test (CBT) for the Federal Government Scholarship Awards for:"], [" The Honourable Minister of Education (HME), Mallam Adamu Adamu, hereby invites interested and qualified Nigerians to participate in the 2020/2021 Nomination Computer Based Test (CBT) for the Federal Government Scholarship Awards for:", "A. BILATERAL EDUCATION AGREEMENT (BEA)", "i) Undergraduate (UG) studies tenable inRussia, Morocco, Algeria, Serbia, Hungary, Egypt, Tunisia, Turkey, Cuba, Romania, Japan, Macedonia; and ii) Postgraduate (PG) studies tenable in Russia (for those whose first degrees were obtained from Russia), China, Hungary, Serbia, Turkey, Japan, Mexico, South Korea, e.t.c. ", "2.0 All qualified candidates are advised to: a. Visit Federal Ministry of Education’s website www.education.gov.ng and click on Federal Scholarship Board ICON on the Home Page:", "b. Read Guidelines and then Complete the Application Form onlinec. Print the Examination slip. ", " FIELDS OF STUDY", "a. Undergraduate level -Engineering, Geology, Agriculture, Sciences, Mathematics, Languages, Environmental Sciences, Sports, Law, Social Sciences, Biotechnology, Architecture, Medicine (very limited), etc.; andb. Postgraduate level (Masters Degree and PhD) in all fields.", "CRITERIA FOR ELIGIBILITY", "A.UNDERGRADUATE SCHOLARSHIPS: ", "All applicants for undergraduate degree courses must possess a minimum qualification of Five (5) Distinctions (As & Bs)in the Senior Secondary School Certificates, WASSCE/WAEC (May/June) only in the subjects relevant to their fields of study including English Language and Mathematics. ", "Certificates should not be more than two (2) years old (2018& 2019)for Non-African Countries andfor African countries the age of certificate is one year (2019) only.Age limit is from 18 to 20 years.", "B.POSTGRADUATE SCHOLARSHIPS: All applicants for Postgraduate degree courses must hold a First Degree with 1st Class or at least 2ndClass Upper Division. The applicants who are previous recipients of Foreign Awards must have acquired at least two(2) years post qualification experience or employment practice in Nigeria. ", " All applicants must have completed the N.Y.S.C. Programme and the age limit is 35 years for Masters and 40 years for Ph.D.", " i)N.Y.S.C discharge or exemption certificates only are accepted; and ", " ii) Evidence of readiness to be released by an employer.", "GENERAL NOTE FOR ALL APPLICANTS: ", "i)Since the BEA countries are non-English speaking, applicants should be prepared to undertake a mandatory one-year foreign Language course of the Country of choice which will be the standard medium of instruction;", "ii) Japan applicants must have a solid background in further mathematics;", "iii) The required certificate for candidates applying for Bachelor in Imam at, Quran Teaching Professor and Imam Preacher Training for Islamic Religious studies in Algeria is WASSCE/WAEC,and no other certificate is accepted;iv) All applicants for Hungarian Scholarship can apply for up to two fields of study in order of preference, and must visit the website:www.stipendiumhungaricum.hu which will hopefully be opened between October and November 2019,", "Complete the application form online,", "Print the completed form and bring to the interview venue in addition to 2.0above;", "v) All applicants for Russian Postgraduate Scholarship must have acquired their 1st Degree in Russia; ", "vi) All Applicants to upload their certificates online;", "viii) The duration for Serbian undergraduate scholarship is Eight (8) years general courses and Nine (9) years for Medicine and postgraduate studies, 3-4years for MSC and 5-6years for PhD. ", " NB: Candidates nominated by the Board will be required to submit to Federal Scholarship Board the following:", "i)Authenticated copies of academic certificates; ", "ii)Data page of the current International passport; ", "iii)Specified Medical Reports from Government hospitals;", "iv)National Identification Number (NIN)", "v)Police Clearance Certificate where necessary ", "For More Information:", "Visit the Official Webpage of the Bilateral Education Agreement (BEA) Scholarship Award 2020/2021"], "url : https://www.opportunitiesforafricans.com/bilateral-education-agreement-bea-scholarship-award-2020-2021-for-nigerians-to-study-abroad/"], [["University of Kwazulu Natal Health Economics and HIV/AIDS Research Division (HEARD) PhD Scholarships 2020 for young Africans", "date announced:October 22, 2019", "Application Deadline: 30 January 2020 "], ["Application Deadline: 30 January 2020 ", "The Health Economics and HIV/AIDS Research Division (HEARD)", " based at the University of KwaZulu-Natal is a regional and global leader for applied research and policy development on critical health and development challenges for the African continent. HEARD’s mission is to influence and support evidence-based policy and good practice to more effectively address Africa’s health and development issues and to contribute to achieving health and sustainable development across the continent.", " A critical component of achieving HEARD’s mission is investing in the development of African scholars to master quantitative and qualitative research methods for understanding policy problems and for devising, evaluating and/or implementing policy or programmatic solutions. The aim of our PhD programme is to produce expertly qualified graduates to advise or to be part of influential policy-making or programme implementing entities in Africa, and to pursue additional research priorities.", "Requirements:", " Applications are invited from citizens of all African countries. Female candidates and, in the case of South Africa, those from previously disadvantaged backgrounds, are especially encouraged to apply.", " APPLICANTS MUST:", " •Hold a Master’s Degree (first or upper secondclass pass or its equivalent).", "•Have demonstrable research experience.", "•Undertake to register for a PhD dissertation (fulltime) at the University of KwaZulu–Natal (UKZN).", "•Make a commitment to remain on the Africancontinent for at least TWO years after graduation. ", "Benefits:", "\nThe value of each scholarship is R540, 000. It will be paid in equal tranches over three years. Tranche payments will be paid dependent on a satisfactory progress report. Successful candidates are required to be based in Durban, South Africa, for the duration of the scholarship, with the exception of the time during which they may undertake field research elsewhere.\n", "How to Apply:", " APPLICATIONS MUST INCLUDE: ", "•A letter of motivation.", "•CV.•An eight to ten page concept note on one of the three above-mentioned three research questions.", "•Certified copies of both your academic qualifications and of your full academic records. In the case of qualifications obtained from non-English speaking countries and English translationmust be included.", "•A certified copy of your ID/passport.", "•Two letters of reference, at least one of which must be academic.", "The second can be from an individual of professional standing. ", "For More Information:", "Visit the Official Webpage of the HEARD PhD Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/university-of-kwazulu-natal-health-economics-and-hiv-aids-research-division-heard-phd-scholarships-2020/"], [["VLIR UOS /ICP Master of Transportation Sciences Scholarships 2019/2020- Road Safety in Low & Middle Income Countries", "date announced:October 31, 2019", "Application Deadline: February 1st 2020"], ["Application Deadline: February 1st 2020", "The ICP “Master of Transportation Sciences – Road Safety in Low & Middle Income Countrie", "s", "” offers a 2-year multidisciplinary master programme with a unique focus and approach to Road Safety in Developing Countries. The programme is supported by ", "VLIR UOS", " and has 12 scholarships available each year.", "Students are trained to identify transportation and road safety issues in order to create innovative solutions by using an integrative approach based on three pillars: the individual (dealing with the human behaviour in traffic and how to influence it e.g. intentional and unintentional riskful behaviour such as drunk driving or cognitive impairments), the environment (e.g. creating self-explaining roads and infrastructure that minimizes crash impact) and the society (e.g. societal norms and translation into policy and enforcement measures). Road safety in this programme is approached as a cross-border field, incorporating elements of psychology, economy, urban planning, environmental studies, engineering and more.  ", "Eligibility Requirements:", "Nationality and country of residence:", "Be a national and resident of one of the below 31 countries: ", "Africa: Benin, Burkina Faso, Burundi, DR Congo, Ethiopia, Guinea, Cameroon, Kenya, Madagascar, Mali, Morocco, Mozambique, Rwanda, Senegal, Tanzania, Uganda, Zimbabwe, South Africa, Niger", "Asia: Cambodia, Philippines, Indonesia, Palestinian Territories, Vietnam", "Latin America: Bolivia, Cuba, Ecuador, Guatemala, Haiti, Nicaragua, Peru ", "Age:", "The maximum age for a master programme scholarship is 35 (on 1st January 2019). ", "Benefits", "Monthly allowance: € 1150/month (for cost of meals, transport, personal expenses and accommodation)", "1- time payment for indirect travel costs: € 150", "1- time payment for logistical allowance: € 850", "Insurance, international travel and tuition fee", "Application Procedure:", "STEP 1. Fill in an ", "online application form", "Make sure all required fields have been filled in and all required documents have been uploaded.", "Important notes for the registration:", "page STUDY PROGRAMME: select “Master of Transportation Sciences – Traffic Safety”", "page LEARNING ACCOUNT: if you have not yet obtained a degree in Belgium, the balance of your learning account is 140", "page SUCCESS RATE: if you weren’t enrolled at Hasselt University in\nthe previous year, skip this page and proceed to the next page of the\napplication form", "If you are eligible to apply for the ICP scholarship, you will see\nthis on the page FINANCES of the online application. To apply for the\nscholarship, you have to select the option “YES” for “application for a\nVLIR-ICP scholarship”.", "STEP 2. VLIR UOS scholarship application form", "To apply for the ICP scholarship, you have to follow a specific procedure. You will find more information about this procedure on the VLIR-application form, which you can download at the top of the UP/DOWNLOAD page of your online application form.", "STEP 3. Send hard copies of your application by post", "printout of the VLIR-UOS scholarship application form", "hard copies of legalised* degree certificates and academic transcripts ", "hard copies of additional necessary documents (certified English\ntranslations of diplomas and degrees, proof of English proficiency, 2\nletters of recommendation, passport picture, …): see checklist", "For More Information:", "Visit the Official Webpage of the VLIR UOS /ICP Master of Transportation Sciences Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/vlir-uos-icp-master-of-transportation-sciences-scholarships-2019-2020/"], [["Commonwealth Shared Scholarships 2020 for Students from Developing Countries for study in the United Kingdom (Fully Funded)", "date announced:November 6, 2019", "Application Deadline: 16.00 (GMT) on 18 December 2019"], ["Application Deadline: ", "16.00 (GMT)", " on ", "18 December 2019", "Commonwealth Shared Scholarships", " are for candidates from least developed and lower middle income Commonwealth countries, for full-time Master’s study on selected courses, jointly supported by UK universities.", "Funded by the ", "UK Department for International Development (DFID)", ",\nCommonwealth Shared Scholarships enable talented and motivated\nindividuals to gain the knowledge and skills required for sustainable\ndevelopment, and are aimed at those who could not otherwise afford to\nstudy in the UK.", "These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2020", "By September 2020, hold a first degree of at least upper second class (2:1) standard, or a second class degree and a relevant postgraduate qualification (usually a Master’s degree). The CSC typically does not fund a second UK Master’s degree. If you are applying for a second UK Master’s degree, you will need to provide justification as to why you wish to undertake this study.", "Not have studied or worked for one (academic) year or more in a high income country", "Be unable to afford to study in the UK without this scholarship", "Eligible Commonwealth countries", "Bangladesh", " Cameroon", " Eswatini", " The Gambia", " Ghana", " India", " Kenya", " Kiribati", " Lesotho", " Malawi", " Mozambique", " Nigeria", " Pakistan", " Papua New Guinea", " Rwanda", " Samoa", " Sierra Leone", " Solomon Islands", " Sri Lanka", " Tanzania", " Tuvalu", " Uganda", " Vanuatu", " Zambia", "Scholarship Worth", " Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor usually the cost of journeys made before your award is finally confirmed) ", "– arranged by the university; funded by the CSC Approved tuition and examination fees– funded by the CSCStipend (living allowance) at the rate of £1,110per month,or£1,362 for those studying at universities in the London metropolitan area (rates quoted at 2019-2020 levels) paid and funded by the university", "– Warm clothing allowance, where applicable ", "– paid and funded by the university Study travel grant towards the costs of study", "-related travel within the UK or overseas– claimed from and paid by the university; funded by the CSC Excess baggage allowance, up to an annual approved limit, when returning home–claimed from and paid by the university; ", "unded by the CSC Reimbursement of the cost of a mandatory tuberculosis (TB) test, where required for a visa application (receipts must be supplied)– claimed from and paid by the university; funded by the CSC. Additional allowances for spouses or other dependants are not usually available ", "Selection process", "Each participating UK University will conduct its own recruitment\nprocess to select a specified number of candidates to be awarded\nCommonwealth Shared Scholarships. Universities must put forward their\nselected candidates to the CSC in March 2020. The CSC will then confirm\nthat these candidates meet the eligibility criteria for this scheme.\nUniversities will inform candidates of their results by July 2020.", "Applications will be considered according to the following selection criteria:", "Academic merit of the candidate", "Potential impact of the work on the development of the candidate’s home country", "How to apply", "You can apply to study one of the taught Master’s courses offered in\nthe Commonwealth Shared Scholarship scheme. These scholarships do not\ncover undergraduate courses, PhD study, or any pre-sessional English\nlanguage teaching, and are usually tenable for one year only. View a ", "full list of eligible courses", ".", "You must also secure admission to your course in addition to applying for a Shared Scholarship. ", "You\nmust check with your chosen university for their specific advice on\nwhen to apply, admission requirements, and rules for applying. ", "View a ", "full list of university contact details", ".", "You must make your application using the CSC’s online application\nsystem, in addition to any other application that you are required to\ncomplete by your chosen university. The CSC will not accept any\napplications that are not submitted via the online application system.", "For More Information:", "Visit the Official Webpage of the Commonwealth Shared Scholarships 2020 "], "url : https://www.opportunitiesforafricans.com/commonwealth-shared-scholarships-2020/"], [["Yale Young African Scholars Program 2020 for African secondary school Students (Fully Funded)", "date announced:November 3, 2019", "Application Deadline: 11:59pm EST on 12 February 2020. "], ["Application Deadline: 11:59pm EST on 12 February 2020. ", "Yale Young African Scholars (YYAS) ", "is an intensive academic and enrichment program designed for African secondary school students planning to pursue tertiary education and who wish to make meaningful impact as young leaders on the continent.", "Participants will enhance their academic skills, receive university admission and financial aid application guidance, and join a network of young leaders from across Africa. Following the eight-day program, students will be paired with mentors who will help advise them throughout the university application process. There are no tuition, meal, or lodging costs for students to participate in YYAS.", "Requirements:", "Age: ", "You must be at least 14 years old by application deadline (12 February 2020) in order to be considered. ", "Please note that a", " typical YYAS student is between the ages of 15 and 18", ". \n", "English: ", "You must be able to participate in a rigorous academic curriculum conducted in English.\n", "Citizenship: ", "You must be a citizen or permanent resident of an African country. ", "YYAS will also accept applications from refugees living in an African country", ".\n", "School location:", " You must currently attend school in an African country.\n", "Graduation date:", " If you attend school in the\nNorthern Hemisphere, you must be graduating secondary school by earliest\nMay/June 2021. If you attend school in the Southern Hemisphere, you\nmust be graduating secondary school by earliest November/December 2020. ", "Students who will graduate secondary school before August 2020 are NOT eligible to apply", ".", "How to Apply", "Get Started:", "Step 1", "Review the ", "YYAS eligibility criteria", ".", "Step 2", "Review the ", "YYAS application required components.", "Step 3", "Review a ", "PDF of a sample blank application", ", and start preparing to answer as many application questions as possible.", "Step 4", "You will need to submit contact information for\na parent/guardian, teacher, and/or official at your school. Reach out to\nthem as soon as possible to review the ", "PDF of a sample blank application", " with you, and be sure to collect the information you need.", "Complete the Application:", "Step 5", "Once our application opens by the end of October, then you will be able to click", " ", "APPLY NOW", "to start your YYAS application. Be sure to write down your email and password to access the application at a later time.", "Step 6", "Check the “Review” page of the application to\nsee if you are missing any required components, and re-visit any pages\nthat require further information.", "Step 7", "Once your application is complete, click on the\n“Review” page. Next click on the “Submit Application” button at the\nbottom of the page. ", "Step 8", "\nCheck your inbox for a YYAS confirmation receipt that indicates\nthe successful submission of your application. Confirmation emails\nusually arrive within 24-48 hours of submission, due to occasional\ndelays payment processing. ", "For More Information:", "Visit the Official Webpage of the Yale Young African Scholars Program 2020"], "url : https://www.opportunitiesforafricans.com/yale-young-african-scholars-program-2020/"], [["University of British Columbia Mastercard Foundation Scholars Program 2020/2021 for study in Canada (Fully Funded)", "date announced:October 29, 2019", "Application Deadline: December 13, 2019 "], ["Application Deadline: ", "December 13, 2019", " ", " The University of British Columbia", " is pleased to partner with ", "The Mastercard Foundation Scholars Program", " ", "to provide comprehensive scholarships to students from Sub-Saharan Africa. The Program provides access to education for academically talented, yet economically marginalized young people. Scholars in the Program have a demonstrated commitment to giving back to their communities and develop the leadership needed to contribute to social and economic transformation across the continent. ", "Eligibility and Selection Criteria", "To be eligible for consideration for the Mastercard Foundation Scholars Masters’ Degree Program at UBC, the applicant must:", "have completed a Bachelor’s degree;", "must not already have a graduate or PhD degree;", "be a citizen or a refugee of a Sub-Saharan African country;", "have lived a significant part of their life in a Sub-Saharan African country", "present economically disadvantaged financial circumstances, and be\nable to show lack of financial means from family or other sources to\npursue graduate education in their home country or elsewhere;", "have achieved academic excellence under difficult circumstances and show leadership qualities or potential;", "demonstrate an interest in and commitment to giving back to his/her\nhome community in ways that enhance the economic growth and social\ndevelopment of Africa, through engagement in activities in their current\nprofession, university or community;", "be applying for a Master’s degree in one of the following Faculties and programs at UBC’s Vancouver campus;\n", "Faculty of Arts\n", "Master of Public Policy and Global Affairs", "Faculty of Education\n", "Master of Educational Administration and Leadership (M.Ed)", "Master of Higher Education (M.Ed)", "Master of Education in Science Education (M.Ed)", "Faculty of Forestry\n", "Master of Science (MSc)", "Master of Applied Science (MASc)", "Master of Sustainable Forest Management (MSFM)", "Master of International Forestry (MIF)", "Master of Geomatics for Environmental Management (MGEM)", "Faculty of Land and Food Systems\n", "Master of Food and Resource Economics (MFRE)", "Master of Food Science (MFS)", "Master of Land and Water Systems (MLWS)", "Faculty of Medicine\n", "Master of Public Health (MPH)", "Faculty of Science\n", "Master of Data Science", "Sauder School of Business\n", "Full-Time MBA Program", "be a person who requires a Canadian study permit to study in Canada;", "commit to returning to Africa in order to apply their training and skills to the betterment of others.", "Please note that the Mastercard Foundation Scholars program only covers expenses of the admitted scholars.", "Please note that Canadian citizens or Permanent Residents are not eligible to apply for this award.", "Please note that funds from the Mastercard Foundation Scholars\nProgram at UBC cannot be applied to pursue programs at other academic\ninstitutions.", "DEADLINES", "Step 1: Admissibility Submission: ", "November 6, 2019", "Step 2: Mastercard Foundation Scholars Program Application ", "December 13, 2019 ", "Step 3: UBC Faculty Applications:", "Arts: ", "January 2, 2020", "Education:\n", "*Masters in Science Education (SCED) – ", "December 1, 2019*", "Masters of Educational Administration and Leadership (EDAL) – ", "January 2, 2020", "Masters of Higher Education (HIED) – ", "January 2, 2020", "*Forestry: ", "January 13, 2020*", "Land and Food Systems: ", "January 2, 2020", "Medicine: ", "January 2, 2020", "Science: January 2, 2020", "Sauder School of Business: ", "January 2, 2020", "These dates may vary from those posted on faculty websites. Please\nnote that if you are applying for the Mastercard Foundation Scholars\nProgram at UBC, you ", "must", " submit all your documents (including your reference letters) by the dates requested above. ", "*Applicants applying to these programs should consider the different deadlines. Late submissions will not be accepted.", "APPLICATIO", "NS", "Step One: Admissibility Submission", "Decide your Program(s) of Interest from the list.", "Consult the link/chart below identifying the Minimum Academic\nRequirements/International Credentials for Graduate Students, listed by\ncountry to determine your academic eligibility for the program and MCF.*", "Given\nthat the number of applicants exceeds the number of positions\navailable, a record that satisfies basic entrance requirements does not\nguarantee admission to graduate studies* ", "https://www.grad.ubc.ca/prospective-students/application-admission/minimum-academic-", "requirements-international-credentials", "Consult the program website to determine if you possess the appropriate background experience.", "If you meet the minimum academic requirements and have the appropriate background, ", "complete the eligibility verification form (at the bottom of this page)", " to verify your eligibility for the scholarship. We will accept and verify Admissibility Submissions ", "until", " November 6", "th", ",2019. ", "For applicants interested in the Full-time MBA program, please contact the Sauder MBA Admission office at ", "[email protected]", " to determine your eligibility.", "For More Information:", "Visit the Official Webpage of the University of British Columbia Mastercard Foundation Scholars Program 2020/2021 "], "url : https://www.opportunitiesforafricans.com/university-of-british-columbia-mastercard-foundation-scholars-program-2020-2021/"], [["A.S.Hornby Educational Trust Scholarships 2019/2020 for study in the UK (Fully Funded)", "date announced:November 13, 2019", "Application Deadline: 12.00 midday UK time on Saturday 30 November 2019. "], ["Application Deadline: ", "12.00 midday UK time on Saturday 30 November 2019", ". ", " The A.S.Hornby Educational Trust scholarships", " are awarded every year to English language teachers from round the world to study for Masters in TESOL in the UK. ", "he A.S.Hornby Educational Trust scholarships are awarded every year\nto English language teachers from outside the UK to study for Masters in\nTESOL at the University of Warwick. The Trust was set up by A.S.Hornby\nin 1961 to support English language teaching worldwide.", "A.S.Hornby had a distinguished career in English language teaching and developed the Oxford Advanced Learners’ Dictionary, now in its 8th edition. The Trust is a registered charity in the UK.", "Benefits", "The scholarships fund study on the one-year Masters in TESOL at the University of Warwick. The scholarships cover all the costs in the UK including a monthly stipend to cover accommodation and living expenses, tuition fees, and return air tickets, visa and approved language test costs.", "Requirements", "Eligible applicants for the scholarship award must have at least\nthree years’ full-time English language teaching experience and a full\nuniversity degree.", "Applicants also require the level of English proficiency stipulated\nby the university. This is assessed according to IELTS, TOEFL, or PTE.\nScholars require an overall score of 6.5 in IELTS, with no less than 6.0\nin any of the categories, and 6.5 for writing, In TOEFL an overall\nscore of 92 and 24 for writing. In PTE overall 62 and writing 62 is\nrequired.", "The Hornby Scholarships are intended to support experienced English language teachers who have the potential to make a significant future contribution to English language teaching and teachers in their countries. We welcome applications only from countries listed on the DAC list.", "English language Requirements", "Three language tests are accepted. The minimum test scores required in each of the three tests is as follows:", "IELTS", "Overall 6.5", "\nWriting 6.5", "\nReading, Listening & Speaking 6.0", "TOEFL", "\nOverall 92", "\nListening 21", "\nReading 22", "\nWriting 24", "\nSpeaking 23", "PTE", "\nOverall 62", "\nWriting 62", "\nNone below 51", "If you are interested in applying for a Hornby scholarship, please\ndownload the PDF document at the bottom of this page ‘Hornby Scholarship\nApplicant Information’, which also contains the link to the application\nform.  ", "Selection:", "\nApplicants who are long-listed on the basis of their application will be\ninvited to interview in their local British Council office. The\ninterviews will take place in the week of 9 – 13 December 2019. If\nsuccessful at interview, applicants will then be shortlisted, with the\nfinal selection being made by a panel of Hornby Trust trustees and\nBritish Council staff. If provisionally selected for a scholarship,\napplicants will then need to apply for a place on the MA course at\nWarwick University and demonstrate that they have the level of English\nproficiency* required by the university. The award of an A S Hornby\nEducational Trust scholarship can only be confirmed once the applicant\nhas been accepted on the course by the university.\n", "For More Information:", "Visit the Official Webpage of the A.S.Hornby Educational Trust Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/a-s-hornby-educational-trust-scholarships-2019-2020/"], [["DAAD 2019/2020 In-Country/ In-Region Scholarships for Postgraduates in Eastern Africa (Fully Funded)", "date announced:November 3, 2019", "Application Deadline: Ongoing"], ["Application Deadline: Ongoing", "The objective of this", " ", "DAAD Scholarship Programme", " is to promote the development of university teaching staff in universities and build capacity for staff in the public sector through postgraduate training in selected postgraduate study programmes at the institutions listed below.", "This programme strongly encourages mobility of East Africans within\nthe East Africa region. We therefore strongly recommend applicants to\napply to institutions outside their home countries.", "Applicants should apply to the institution of their choice for both\nthe admission and the DAAD scholarship, using the contacts and the\nprocedure prescribed at the institution’s website. The institutions have\nset their own deadlines that need to be followed. All applicants will\nbe notified about the outcome of their application. Only shortlisted\ncandidates will get access to the DAAD Online Portal to finalize the\nscholarship application.", "Value of Scholarship:", "University tuition fees", "research allowance", "monthly stipend", "travel allowance (where applicable)", "health insurance (where applicable)", "and the possibility of a study visit of up to 6 months to Germany within the period of the scholarship.", "Postgraduate Programmes eligible for In-Country/ In-Region Scholarships in Eastern Africa, 2019/ 2020", "Communication, Computer Science and IT", "Engineering, Technology, Urban Planning, Environmental and Resources Management", "Health Sciences, Medicine, Psychology, Veterinary Medicine", "Law", "Mathematics, Economics, Business, Management", "Natural Sciences (Biology, Chemistry, Physics, Agriculture, Horticulture, Forestry, Earth Sciences, Natural Resources, Food Science)", "Social Sciences, Governance, Development, Education", "General information on the In-Country/In-Region Programme", "www.daad.de/incountry-inregion", "Master’s Programme in German Studies at the University of Nairobi", "In light of the increasing demand for qualified university lecturers\nin Sub-Saharan Africa, the programme aims at training young African\ngraduates of German Studies to qualify for a career as teachers of\nGerman and preparing them for an academic career as well.", "A", "pplication requirements", "(i) A Bachelor’s degree in Germanistik or DaF (in the major or minor)", "\n(ii) Language proficiency (German language skills) at level B2", "What can be funded?", "Participation at the two-year Master’s Programme in German Studies at\nthe University of Nairobi incl. a research stay beginning of the second\nyear at one of the German partner universities (TU Dresden, U\nBielefeld, U Bayreuth or U Oldenburg)", "Duration of the funding", "24 months altogether, to start on 1st October every even year.", "\nIn the first instance, an award of 12 months is granted, a renewal of another 12 months can be applied for at a later date.", "Value", "     Monthly stipend of 240 Euros (for Kenyans) or", "     Monthly stipend of 380 Euros (for Non-Kenyans)", "     University fees", "     Annual research allowance", "     Insurance (only for Non-Kenyans)", "     Travel allowance (only for Non-Kenyans)", "Selection", "Only students who are admitted to the Master’s programme may apply\nfor a DAAD scholarship. Application for admission is done online: ", "https://application.uonbi.ac.ke/index.php/CourseApplication/viewdetailslogin?deg_code=C531", "An independent selection committee consisting of experts in the field will review applications. After a ", "preselection", " the best candidates will be invited to submit their application via the ", "DAAD portal", " An interview by DAAD Office Nairobi (if applicable via video or telephone conference) for final selection will follow.", "\nCriteria for selection are academic achievements, proficiency in German\nand a convincing explanation of professional and personal reasons for\nchoosing this study programme.", "Deadline: ", "tba", "Contact:", "German Academic Exchange Service, Regional Office for Africa", "\nMadison Insurance House, 3rd floor, Upper Hill Close", "\nP.O. Box 14050", "\n00800 Nairobi", "\nKenya", "\nE-Mail: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the DAAD 2019/2020 In-Country/ In-Region Scholarships for Postgraduates in Eastern Africa"], "url : https://www.opportunitiesforafricans.com/daad-2019-2020-in-country-in-region-scholarships-for-postgraduates-in-eastern-africa/"], [["Thomas Jefferson Tunisia Undergraduate Scholarship Program (UGRAD) 2020/2021 for young Tunisians to study in USA (Fully Funded)", "date announced:October 30, 2019", "Application Deadline: Monday, November 18, 2019at 5:00pm "], ["Application Deadline: Monday, November 18, 2019at 5:00pm ", " As part of the Thomas Jefferson Scholarship Program, ", "the ", "2020-2021 Tunisia Undergraduate Scholarship Program,", " a program of the Bureau of Educational and Cultural Affairs of the United States Department of State,", " provides opportunities for outstanding undergraduate students from Tunisia for one academic year of full-time, non-degree study in the United States. Students will attend four-year universities and colleges and will live in on-campus housing (dormitories). ", " Participants may submit U.S. transcripts to their home institution for review upon completion of the program to determine if the credits are transferrable. The program will provide participants with a deeper understanding of American culture and new globally-applicable skills and expertise to help them contribute to the growth and development of Tunisia.Participants may not choose their U.S. host university/college. A broad range of academic fields of study are eligible, including humanities, social sciences, applied sciences, natural and physical sciences, arts, and other standard university fields of study. ", "Please note that students studying at ISSAT (Institut Supérieur des Sciences Appliquées et de Technologie), ISETS, and IHETs are not eligible for Tunisia UGRAD but should apply for the ", "Tunisia Community College Scholarship Program (TCCSP).", " Students should identify their program field of study on their application. This fieldshould be drawn from the standard university/college curriculum within the United States. Please note that students may not enroll in clinical courseworkwhile on the Tunisia UGRAD Program. ", " TECHNICAL ELIGIBILITY REQUIREMENTS ", "The Thomas Jefferson Scholarship Program does not discriminate against applicants on the basis of race, color, religion, sex, age, national origin, disability, or any other protected characteristic as established by U.S. law.Competition for the Tunisia Undergraduate Scholarship Program is merit-based and open to anyone who:", " •Is a Tunisian citizen; ", "•Is currently enrolled as a first-or second-year full-time undergraduate (Licence) student in good academic standing at the time of application at a registered academic institution in Tunisia; o Architecture students are eligible in their first -, second-, third-, or fourth-year of study. ", "Engineering students are eligible in their first-, or second-year (preparatory classes), and third-and fourth-year of undergraduate study; o If you study at an ISSAT (Institut Supérieur des Sciences Appliquées et de Technologie), ISET, or IHET,please see the Tunisia Community College Scholarship Program application. •Is currently residing in Tunisia; ", "•Has a demonstrated record of academic excellence;•Is able to receive a U.S. J-1 visa; ", "•Is at least 18 years old by July 1, 2020;", "•Is committed to returning to Tunisia after completion of the program; and ", "•Is able to achieve a TOEFL score of 500 (PBT) ", "Benefits", " FINANCIAL PROVISIONS OF THE GRANT", " •J-1 visa support; ", "•Round-trip travel from participant’s home city to host institution in the United States; ", "•Accident and sickness medical coverage; ", "•Tuition and mandatory university fees; ", "•Room and board (housing and meals); ", "•Small incidentals allowance; ", "•Limited allowance for books; ", "Application Instructions", "The application must be completed online. Applicants must fill out all required sections of the application and provide contact information for ", "two references", ".\nReference 1 and Reference 2 must be completed by two different\nindividuals who can speak to your suitability as a potential scholarship\nrecipient.", "Complete copies of all application materials must be received together in one package as per the application instructions by ", "Monday", ", ", "November 18, 2019, at 5 p.m. Tunisia time", ".\nOnly complete applications, which include a complete application form\nwith two complete reference forms, will be forwarded to the selection\ncommittee.", "For More Information:", "Visit the Official Webpage of the Thomas Jefferson Tunisia Undergraduate Scholarship Program (UGRAD) 2020/2021"], "url : https://www.opportunitiesforafricans.com/thomas-jefferson-tunisia-undergraduate-scholarship-program-ugrad-2020-2021/"], [["Pulitzer Africa Data Journalism Scholarship 2019/2020 for study in Columbia University ( $150,000)", "date announced:November 18, 2019", "Application Deadline: December 15th 2019"], ["Application Deadline: December 15th 2019", " A generous scholarship of up to $150,000 for a student, who is a resident of a country in Africa admitted to either the M.S. in Data Journalism or the dual Master of Science program in Computer Science and Journalism. ", "The Journalism School is proud to offer several million dollars\nannually in fellowships and scholarships for both domestic and\ninternational students. (Learn more about ", "median scholarship awards", " by program.) Allocations of fellowships and scholarships are based on:", "Merit, as determined by the Admission Committee", "Financial need, as determined by the applicant’s current ", "Free Application for Federal Student Aid (FAFSA) (link is external)", " and the ", "Graduate School of Journalism Scholarship Aid Form (link is external)", "Guidelines specified by individual donors", "To apply for Journalism School scholarships and fellowships, applicants must submit the following forms by January 15:", "Graduate School of Journalism Scholarship Aid Form (link is external)", " Note: To access this form you must log in to our online application system.", "Application Deadlines:", "Master of Science: December 15", "Master of Science in Data Journalism: December 15", "Master of Arts: January 6", "Dual Degree in Master of Science in Computer Science and Journalism: January 15\n", "For More Information:", "Visit the Official Webpage of the Pulitzer Africa Data Journalism Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/pulitzer-africa-data-journalism-scholarship-2019-2020/"], [["Wageningen University & Research 2020 Africa Scholarship Programme (ASP) for young African Students (Fully Funded to Wageningen, The Netherlands)", "date announced:November 13, 2019", "Application Deadline: 1 February 2020: "], ["Application Deadline: ", "1 February 2020", ": ", "The Africa Scholarship Programme (ASP)", " has been initiated by Wageningen University & Research to give talented and motivated students from Africa the opportunity to study in Wageningen.", "With this programme, Wageningen wants to support capacity building in Africa by attracting excellent students for a 2-years master’s programme.", "N", "umber of scholarships:", " 7", "Citizenship", ": All African countries ", "Application deadline", ": 1 February 2020", "Start master’s programme", ": 1 September 2020", "Eligibility for the scholarship", ": Excellent students with a GPA of 80 percent or higher in a bachelor degree, and admitted to a Wageningen University MSc Programme. ", "Components of the scholarship:", "Travel to and from Wageningen ", "Living allowance for 2 years", "Tuition fee", "Visa costs and costs for health insurance ", "Budget to visit one seminar/conference in Europe", "Participation in the ‘Reach your full potential’ programme ", "Selection procedure", "Step 1: Check your eligibility for the Africa Scholarship Programme", "Step 2: Apply for an MSc programme before 1 February 2020", "Step 3: Selection for invitation to the Africa Scholarship Programme ", "Step 4: Result of the selection process", "Step 5: Updates/changes ", "Important dates for the ASP at a glance:", "1 February 2020", ": deadline to apply for an MSc admission", "16 March 2020", ": selection of candidates to take part in the further selection process  (approx. 60 candidates will be selected)", "30 March 2020", ": deadline additional assignment", "13 April 13 2020", ": Decision about skype interviews communicated (approx. 20 candidates will be interviewed)", "20 to 30 April 2020", ": Skype interviews", "14 May 2020", ": results of the selection process communicated", "For More Information:", "Visit the Official Webpage of the Wageningen University & Research 2020 Africa Scholarship Programme", " "], "url : https://www.opportunitiesforafricans.com/wageningen-university-research-2020-africa-scholarship-programme/"], [["FIG Foundation PhD Scholarships 2020 for Surveying/Geomatics PhD Candidates (4,000 euros grant)", "date announced:November 19, 2019", "Application Deadline:  1 February 2020. "], ["Application Deadline: ", " 1 February 2020.", " ", "The FIG Foundation ", "will be providing scholarships of up to 4,000 euros plus possible funding for conference travel to  PhD students.", "Applicants shall:", "be studying for a PhD degree and registered solely in a surveying/geomatics academic programme that teaches surveying", "[1]", " in a country listed by the World Bank as a low-income, lower-middle or upper-middle income economy", "[2]", ",", "have had a paper accepted by a ", "peer reviewed international  journal ", "based on their doctoral research project; applicants should be the lead author, and the paper should be co-authored with their supervisor,", "should not have submitted their final thesis at the application deadline", " Applications are to be sent to ", " ", "[email protected]", " with “FIG Foundation PhD Scholarship Application” shown in Subject Line.  Applicants are not to contact Foundation directors individually. Decisions are final. No correspondence will be entered into during or after the competition. ", "To apply, applicants should submit the documents listed below, as well as\ncomplete the submission checklist. Successful applicants will qualify for a\nfurther grant of up to 3,000 euros to attend and present a peer reviewed\npaper at a FIG conference. ", "Applications will be judged on the quality of the application and need. In the event that two excellent applications are judged to be of equal quality, applications from low-income and lower-middle income countries will be preferred. ", "DOCUMENTATION", "Applicants should submit the following set of documents in English as a\nsingle file in PDF format using. A4 size paper using 25 mm (1” margins).\nEach item should ", "begin on a new pag", "e. Ensure that you\nadhere to the requirements to avoid disqualification. ", "A completed check list – see the end of this document. Note that if\none item on the checklist is missing or disqualifies the candidate, the\napplication is unlikely to be considered. ", "A cover sheet showing the candidate’s personal details and those of\nhis/her institution.", "A brief description and argument as to how the applicant’s academic\nprogramme addresses the “teaches surveying and graduates surveyors”\ncomponent of Qualification Criterion 1 above. Provide web links to\nprogramme descriptions, course outlines and details of courses. ", "A 200 word abstract. This should be written in terms understandable\nto the lay person; similar to a press release and which the FIG\nFoundation could actually use as a press release in the event of a\nsuccessful application.", "A one page research proposal as per the template below on A4 size\npaper. Note that the ", "one page limit will be strictly enforced", "; material\nthat extends beyond one page will be deleted.", "A copy of the paper that has been re-submitted to the journal after\ncorrections have been completed.", "A letter from the editor of the journal indicating that the paper\nhas been accepted and that the necessary corrections have been completed\nsatisfactorily.", "The journal paper’s referees’ reports. ", "A list of peer reviewed journal publications over the last 6 years\nusing the International Journal of GIS reference list format. Use the\nfollowing headings: Peer Reviewed Journal Papers, Peer Reviewed\nConference Papers, Non- Peer Reviewed Conference Papers, Non- Peer\nReviewed Journal  Papers, Books, Book Chapters and so forth. See Notes\nfor Authors on the IJGIS website. ", "A list of research funding obtained over the past 5 years,\nindicating which grants are peer reviewed or not.", "A description of research compliance, the research account and\nactivity auditing structures and processes in their institution. For\nexample, if a scientist spends money inappropriately, are there\nstructures in place to refund the granting agency? Provide the names and\nweb addresses of the administration departments and official\norganisation descriptions dealing with research compliance. ", "A description of the structures and processes in their institution\nthat pertain to research ethics, in particular ethics relating to\nresearch involving human subjects, if that is relevant to the grant\napplication. Provide the names and web addresses of the administration\ndepartments and official organisation descriptions dealing with research\ncompliance. ", "A budget indicating how the funds will be spent and a one page\njustification of the budget. Note that as a general rule, equipment will\nnot be funded. Travel to FIG Conferences to present results and tuition\nfees may be included in the budget. Per diems for field work will not be\nfunded, but reasonable actual costs of field work are refundable. ", "A brief letter from the applicant’s PhD supervisor indicating that\nthey have read this document, that they confirm that the applicant has\nviewed the videos on How to Write Grant Proposals to the FIG Foundation,\nand that they have read the applicant’s proposal and recommend (or not)\nthat the FIG Foundation Board of Directors consider the proposal. ", "For transparency purposes, successful proposals, grantees’ final\nreports and progress reports on their activities and use funds will be\npublished on the Foundation web page, and perhaps elsewhere, where\nappropriate. Please indicate your consent or otherwise for your\nproposal(s) and reports to be published. Grantees should provide\ncompelling reasons for these documents not to be published. ", "\nIn a separate PDF document, provide a comprehensive\nacademic CV.\n", "For More Information:", "Visit the Official Webpage of the FIG Foundation PhD Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/fig-foundation-phd-scholarships-2020-for-surveying-geomatics-phd-candidates/"], [["AHRI/UCL MSc Scholarship 2020/2021 for study in University College London,UK (Fully Funded)", "date announced:November 7, 2019", "Application Deadline: 5pm Tuesday, 31 March 2020.  "], ["Application Deadline: ", "5pm Tuesday, 31 March 2020. ", " ", "The AHRI/UCL MSc Scholarship", " is a singular award for the UK academic year September 2020 to September 2021. The scholarship is administered via Africa Health Research Institute (AHRI) and is for applicants whose academic background and interests are aligned with the ", "programmes of research", " at AHRI.  ", "This opportunity is open to applicants who permanently reside in\nSouth Africa. Applicants must have a high-quality academic record to be\nconsidered for this opportunity. If selected, the successful applicant\nwill be invited to apply for a taught master’s degree within University\nCollege London’s Faculty of ", "Medical Sciences", " and/or ", "Population Health", ". ", "Candidates will go through a competitive round of selection at AHRI\nand the successful candidate will be nominated to go through to the UCL\nselection. Application for acceptance onto a MSc taught course is\nseparate, and the AHRI nominee will be guided through this process.", "Eligibility Criteria: ", "        The candidate: ", "Must be permanently based in South Africa at the time of application.", "Must hold a valid passport at the time of application.", "Must have an Honours degree ", "equivalent to a Bachelor (Honours) degree with Second Class Division 1 Honours", " or 70% in an appropriate subject.", "The successful applicant must be in London to start their chosen course in September 2020.", "Women\nare particularly encouraged to apply to the AHRI MSc Scholarship. ", "The Scholarship will cover:", "• Full UCL tuition fees for a one-year full-time taught master’s degree ", " • A round-trip economy air fare to and from the UK ", " • A monthly stipend to cover housing and living costs for 50 weeks ", " • National Health Service (NHS) surcharge and Tier 4 visa costs ", "AHRI/UCL\nMSc Scholarship Application Procedure:", "Please complete the online ", "AHRI/UCL Scholarship application form", " and provide a copy of your *academic transcript by ", "5pm Tuesday, 31 March 2020. ", "For More Information:", "Visit the Official Webpage of the AHRI/UCL MSc Scholarship 2020 "], "url : https://www.opportunitiesforafricans.com/ahri-ucl-msc-scholarship-2020-2021/"], [["Westerwelle Young Founders Programme Spring 2020 for Young Entrepreneurs (Fully Funded to Berlin,Germany)", "date announced:November 11, 2019", "Application Deadline: 3rd of December 2019, 11pm CEST"], ["Application Deadline: 3rd of December 2019, 11pm CEST", "The Westerwelle Young Founders Programme", " is a fully funded 6-month-long programme for outstanding young entrepreneurs from emerging and developing countries. The programme aims to connect young founders from all over the world with each other and with the Berlin startup scene, and support them in further developing their entrepreneurial skills and their international network. ", "The Westerwelle Young Founders Programme Spring 2020 will start with the Young Founders Conference from 10", "th", " to 14", "th", " of March, 2020 in Berlin. During this time, the 25 participants have the unique opportunity to meet and interact with successful entrepreneurs, investors and political decision makers. Throughout the programme, the Young Founders will have the chance to develop their businesses and discuss challenges with a personal mentor as well as with fellow Young Founders in a peer mentoring group. Moreover, Young Founders will receive further support through regular expert webinars that cater to their needs. ", "Requirements:", "You have recently (in the last 5 years) started a for-profit\ncompany with a scalable business model that has achieved Product-Market\nFit and has ideally secured first external funding (if you run a\nbusiness model that requires external investment);", "your company is based in a developing or emerging country or has a strong business focus on developing and emerging economies;", "you possess a good working knowledge of English;", "you\nare available to attend the Young Founders Conference in Berlin and can\nmake time to participate in monthly mentoring and peer mentoring calls\nfor the 6-month programme.", "Please note that foreign\napplicants must possess valid travel documents (including a visa, if\nnecessary) to enter Germany, and valid travel medical insurance.", "Benefits:", "The ", "Westerwelle Young Founders Conference", " – a week-long conference in Berlin to get to know fellow Young Founders, the German startup scene, and strengthen their entrepreneurial skills by attending workshops and meetings (travel and accommodation will be covered by the Westerwelle Foundation);", "A ", "personal mentor", " who is an experienced entrepreneur and will function as a sparring partner with whom you can discuss upcoming challenges and new opportunities;", "Monthly ", "peer mentoring", " calls with the other successful Young Founders of the cohort to share knowledge with and support each other;", "Expert sessions", " on relevant topics (e.g. OKRs, investor KPIs, marketing & sales);", "The Young Founders Network", " — a strong alumni network that functions as a platform for all Young Founders to connect with each other, exchange ideas and find support for existing challenges;", "Exposure", " to the Berlin startup scene and the public for you and your startup via our social media channels and our networks,", "Assistance", " beyond the programme as we remain a contact person for the Young Founders and will help you to find suitable experts for challenges, offer possibilities to share learnings with current cohorts or celebrate successes.", "The ", "buddy programme", " that connects alumni of the Westerwelle Young Founders Programme with new Young Founders that operate in the same business to potentially open doors and enhance mutual exchange. ", "Application process YFP Spring 2020 ", "Application deadline (3rd of December 2019, 11pm CEST)", "Skype interviews with shortlisted candidates (25th of November to 17th of December 2019)", "Jury decision and selection of participants (5th of January 2020)", "Notification of all applicants (7th of January 2020)", "For More Information:", "Visit the Official Webpage of the Westerwelle Young Founders Programme Spring 2020"], "url : https://www.opportunitiesforafricans.com/westerwelle-young-founders-programme-spring-2020/"], [["Open Society Foundation Disability Rights Scholarship Program 2020 for young Africans (Funded)", "date announced:October 24, 2019", "Application Deadline: January 6, 2020. "], ["Application Deadline: January 6, 2020. ", "The Disability Rights Scholarship Program", " provides yearlong awards for master’s degree study to disability rights advocates, lawyers, and educators to develop new legislation, jurisprudence, policy, research, and scholarship to harness the innovations and opportunities offered by the ", "United Nations Convention on the Rights of Persons with Disabilities (CRPD).", "With the knowledge and networks gained through the program, we expect that fellows will deepen their understanding of international law and education, with a focus on disability rights, and gain the tools necessary to engage in a range of CRPD implementation strategies, such as: challenging rights violations in their home countries by drafting enforceable legislation consistent with the CRPD; utilizing enforcement mechanisms set forth in the Convention; taking forward disability rights litigation requesting CRPD-compliant remedies; engaging in disability rights advocacy; and developing law, education, or other academic curricula informed by the CRPD.", " The Disability Rights Scholarship Program offers awards to individuals from ", "Ethiopia, Lesotho, Sudan, South Sudan,", " Czech Republic, Georgia, and Ukraine for law degrees. ", "Eligibility Criteria", "The program does not discriminate on the basis of age, race, color,\nsex, religion, sexual orientation, or disability. Candidates with\ndisabilities are particularly encouraged to apply. The competition is\nmerit-based and open to those meeting the following criteria:", "be a citizen and legal resident Ethiopia, Lesotho, Sudan, South Sudan; Czech Republic, Georgia, or Ukraine at the time of application", "have work experience in the legal profession or advocacy focusing on human/disability rights", "have an excellent academic record with a bachelor of laws (LLB; in exceptional circumstances, those without a LLB but with substantial relevant experience may be considered)—a degree must be awarded by the application deadline", "have demonstrated leadership in the field of disability rights", "be proficient in spoken and written English or French and able to meet university-designated minimum scores on standardized language tests", "be able to participate in an intensive academic writing program in July–August 2020", "be able to begin the graduate program in August or September 2020", "be able to receive and maintain visa or study permit required by host country", "demonstrate a clear commitment to return to home country to contribute to advancing the inclusion and full participation of persons with disabilities in their communities", " Participating Institutions", "Fellows will be clustered at select institutions that demonstrate cutting-edge capacity for legal education in international disability rights, and that are interested in forming a consortium of schools dedicated to developing this field and deepening their own capacity with an international perspective. ", "In nurturing such a network, the Program strives to encourage faculties to incorporate disability rights into existing human rights curricula and participate in collaboratively-designed workshops and research efforts in the field. ", "Participating schools include:", " •School of Law, National University of Ireland, Galway, Ireland", "•Faculty of Law, McGill University, Canada", "•School of Law, University of Leeds, UK", "•College of Law, Syracuse University, USA", "•Washington College of Law, American University, USA ", "Fellowship Worth", " tuition and mandatory university fees; ", "•monthly stipend for room, board, and other living expenses; ", "•program-related travel;", "•accident and health insurance during the program; ", "•funds for educational materials and professional development; ", "•all costs associated with pre-academic summer program and annual conference;", "•support for students with disabilities to obtain reasonable accommodations necessary for participating in the program of study.", "The fellowship does NOT provide funding for dependent family members. ", " How to Apply", "Applicants are encouraged to apply online. To apply online please click hereto register, and then follow the instructions.", " If you are unable to apply online, the full application form (available here:https://www.opensocietyfoundations.org/grants/disability-rights-scholarship-program, or from the regional coordonators listed below) and all supporting documents must be submitted via email by the deadline to the appropriate contact below.", " Reference letters should be on official letterhead and submitted by the recommender via e-mail directly to the regional coordinator (address below) by the deadline ", " Deadline", "Completed application forms and all necessary accompanying documents, along with a copy of your passport, must be submitted online or (if unable to access the application portal) to the appropriate Regional Coordinator by January 6, 2020. ", "For More Information:", "Visit the Official Webpage of the Open Society Foundation Disability Rights Scholarship Program 2020 "], "url : https://www.opportunitiesforafricans.com/open-society-foundation-disability-rights-scholarship-program-2020/"], [["Tunisia Community College Scholarship Program 2020/2021 for young Tunisians to study in USA (Fully Funded)", "date announced:October 30, 2019", "Application Deadline: Monday, November 18, 2019, at 5 p.m. Tunisia time. "], ["Application Deadline: ", "Monday", ", ", "November 18, 2019, at 5 p.m. Tunisia time", ". ", " As a part of the ", "Thomas Jefferson Scholarship Program,", " the 2020-2021 Tunisia Community College Scholarship Program, a program sponsored by the U.S. Department of State with funding provided by the U.S. Government and supported in its implementation by IREX, provides opportunities for young studentsfrom Tunisiastudying at ISETs (Institut Supérieur des Études Technologiques), IHET (Institut des Haute Études Touristiques), and ISSATs (Institut Supérieur des Sciences Appliquées et de Technologie) who wish to improve their vocational skills by spendingone academic year studying at accredited U.S. community colleges with the goal of earninga professional certificate in eligible fields of study from their U.S. institution. ", "Participants may submit U.S. transcripts to their home institutionfor review upon completion of the program to determine if the credits are transferrable.Participants will attend accredited community colleges and will live in on-campus housing (dormitories)or in off-campus housing. Participants may not choose their U.S. host institution. ", "For the 2020-2021Academic Year the following fields of study are eligible: ", "•Applied Engineering", "•Business Management and Administration", "•Information Technology", "•Tourism and Hospitality Management ", "Eligibility", "The Thomas Jefferson Scholarship Program does not discriminate\nagainst applicants on the basis of race, color, religion, sex, age,\nnational origin, disability, or any other protected characteristic as\nestablished by US law.", "Competition for the Tunisia Community College Scholarship Program is merit-based and open to anyone who:", "Is a citizen of Tunisia;", "Is currently residing in Tunisia;", "Is currently enrolled as a first- or second-year full-time undergraduate (Licence) student in good academic standing at the time of application at an ISET (Institut Supérieur des Etudes Technologiques), IHET (Institut Supérieur des Etudes Touristiques), or ISSAT (Institut Supérieur des Sciences Appliquées et de Technologie);", "Has a demonstrated record of academic excellence;", "Is able to receive and maintain a US J-1 visa;", "Is committed to returning to Tunisia after completion of the program;", "Is able to achieve a TOEFL score of 500 (PBT); and", "Is at least 18 years old by July 1, 2020.", "Benefits:", " FINANCIAL PROVISIONS OF THE GRANT", "•J-1 visa support;", "•Round-trip travel from participant’s home city to host institution in the United States;", "•Accident and sickness coverage;", "•Tuition and mandatory university fees;", "•Room and board (housing and meals);", "•Small incidentals allowance;", "•Limited allowance for books;", "•A wide variety of alumni networking and training opportunities. ", "Application Instructions", "The application must be completed online. Applicants must fill out\nall required sections of the application and provide contact information\nfor ", "two references", ". Reference 1 and Reference 2 must\nbe completed by two different individuals who can speak to your\nsuitability as a potential scholarship recipient.", "Complete copies of all application materials must be received together in one package as per the application instructions by ", "Monday", ", ", "November 18, 2019, at 5 p.m. Tunisia time", ".\nOnly complete applications, which include a complete application form\nwith two complete reference forms, will be forwarded to the selection\ncommittee.", "For More Information:", "Visit the Official Webpage of the Tunisia Community College Scholarship Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/tunisia-community-college-scholarship-program-2020-2021/"], [["Pierre Elliott Trudeau Foundation Doctoral Scholarships 2019/2020 for study in Ryerson University, Canada ($60,000 per scholar)", "date announced:November 15, 2019", "Application Deadline:January 22nd, 2020)."], ["Application Deadline:January 22", "nd", ", 2020).", "The Pierre Elliott Trudeau Foundation Scholarship Program", " will help shape researchers into engaged leaders who are conscious of the impact of their research, connected to the realities of the communities in which they work, and open to non-conventional forms of knowledge. The Foundation is seeking candidates who are audacious, original, and forward-thinking.", "The program will last for three years and will also provide generous\nsupport for Scholars’ doctoral work in the form of a stipend and a\nresearch and travel allowance.", "In the first year of their term, Scholars will receive mandatory\nleadership training from the Foundation’s Mentors, who are leaders from\nacross the public, private, and non-profit sectors, and Fellows, who are\nleaders in research and teaching, during Institutes of Engaged\nLeadership. The Institutes will take place in different provinces,\nterritories, and foreign countries.", "In the second year of their term, Scholars will work with Mentors and\nFellows to collaboratively plan and participate in a public conference\nwith a flexible format, to be created and led by the Scholars\nthemselves.", "The third and final year of the program will be dedicated to knowledge dissemination. Scholars will continue to work closely with Mentors and Fellows to share the lessons they have learned over their term with the Foundation. This activity could take many forms, from the publication of a book to a theatre production or a fundraising gala. It will be a chance to innovate and experiment in order to share knowledge and skills gained through the Pierre Elliott Trudeau Foundation experience with a public audience.", "Requirements:", "If you are chosen as a Pierre Elliott Trudeau Foundation Scholar, you will receive:", "Membership in a community of other Scholars, Mentors, and\nFellows, all of whom are leaders and change-makers in their respective\ndisciplines and sectors;", "Leadership training from Mentors and Fellows;", "$40,000 per year for three years to cover tuition and reasonable living expenses; and", "Up to $20,000 per year for three years, as a research and travel allowance;", "If you are chosen as a Pierre Elliott Trudeau Foundation Scholar, you must:", "Attend a community retreat and two Institutes of Engaged Leadership during the first year of your term;", "Collaboratively plan and participate in a conference event during the second year of your term;", "Work with other Scholars, Mentors, and Fellows on a creative\nknowledge sharing and dissemination project during the third year of\nyour term;", "Work towards fluency in English and French with support from the Foundation;", "Actively engage and collaborate with the Foundation’s community of Scholars, Mentors, and Fellows; and", "Submit one research progress report per year.", "For More Information:", "Visit the Official Webpage of the Pierre Elliott Trudeau Foundation Doctoral Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/pierre-elliott-trudeau-foundation-doctoral-scholarships-2019-2020/"], [["French Government Eiffel Excellence Scholarship Programme 2020 for Masters & PhD Study in France (Funded)", "date announced:October 23, 2019", "Application Deadline: January 9th 2020. "], ["Application Deadline: January 9th 2020. ", "The Eiffel Excellence Scholarship Program", " ", "was established by the French Ministry for Europe and Foreign Affairs to enable French higher education institutions to attract top foreign students to enroll in their masters and PhD programs.", "It gives opportunity to the future foreign decision-makers of the private and public sectors, in priority areas of study, and encourages applicants up to 30 years old from developing countries at master’s level, and applicants up to 35 years old from developing and industrialized countries at PhD level.", "Eiffel scholarships are available in three main fields:", "engineering science at master’s level,", "science in the broadest sense at PhD level (engineering science; exact sciences: mathematics, physics, chemistry and life sciences, nano- and biotechnology, earth sciences, sciences of the universe, environmental sciences, information and communication science and technology);", "economics and management;", "law and political sciences.", "Eligibility", "Only foreign nationals are eligible to apply for a scholarship from the French Government.", "In the case of dual nationality applicants, those with French nationality are ineligible.", "for master’s courses, candidates must be no older than 30 on the date of the selection committee meeting,March 2020; at PhD level, candidates must be no older than 35 on the date of the selection committee meeting, March 2020.", "only applications submitted by French educational establishments are accepted. These establishments undertake to enrol scholarship holders on the course for which they have been selected. Applications submitted by any other means shall not be considered. Furthermore, any candidate nominated by more than one establishment shall be disqualified.", "scholarships are for students wishing to enrol on a master’s course, including at an engineering school, and for PhD students. The Eiffel Programme does not apply to French-run master’s courses abroad, as non-PhD scholarship holders must complete at least 75% of their course in France. It does not apply to training under an apprenticeship contract or a professional training contract either.", "Educational establishments that shortlist non-French speaking applicants must ensure that their level of French is sufficient to enable them to integrate satisfactorily into the anticipated course", "Combination with other scholarships:", " foreign students who, at the time of application, have already been awarded a French government scholarship under another programme are not eligible, even if the scholarship in question does not include social security cover.", "Eiffel PhD scholarships:", " Establishments may nominate a candidate who was previously awarded an Eiffel scholarship at master’s level for a scholarship at PhD level. Candidates who have already been awarded an Eiffel scholarship once during their PhD cannot be awarded it for a second time. No application will be accepted for any student who applied previously but was rejected, even if the application is submitted by a different establishment or in another field of study.", "Eiffel master’s scholarships:", " no application will be accepted for any student who applied previously but was rejected, even if the application is submitted by a different establishment or in another field of study. Students who have already been awarded an Eiffel scholarship at master’s level are not eligible to re-apply at master’s level.", "Language skills:", " when pre-selecting non-French-speaking candidates, establishments must make sure that their language skills meet the requirements of the relevant course of study.", "Benefits:", "Master’s level:", "The Eiffel scholarship includes a monthly allowance of €1,181 (a maintenance allowance of €1,031 and a monthly stipend of €150).", "In addition, the following expenses are directly covered: – one\ninternational return journey; Page 3 of 6 – social security cover; –\ncultural activities. Scholarship holders may also receive an additional\nhousing allowance, under certain conditions.", "PhD level:", "The Eiffel scholarship includes a monthly allowance of €1,400.", "In addition, the following expenses are directly covered: – one\ninternational return journey (for students in law or political sciences\nwho may make several trips, only one return journey shall be covered); –\nsocial security cover; – cultural activities. Scholarship holders may\nalso receive an additional housing allowance, under certain conditions.", "Duration: ", "The scholarship is awarded for:", "a maximum of 12 months for entry at M2 level,", "a maximum of 24 months for entry at M1 level,", "a maximum of 36 months for an engineering degree.", "A 2-month preliminary intensive language training course. The total\nduration of the course undertaken (including compulsory work experience\nor internships in France or abroad) must be clearly indicated by the\neducational establishment in the application form. ", "Optional placements are not covered by the grant.", "2020 Campaign Timeline", "Opening of the call for applications: week of October 21th 2019", "Deadline for the reception of applications by Campus France:  January 9th 2020.", "Publication of results: week of March 23th 2020.", "For More Information:", "Visit the Official Webpage of the French Government Eiffel Excellence Scholarship Programme 2020"], "url : https://www.opportunitiesforafricans.com/french-government-eiffel-excellence-scholarship-programme-2020/"], [["Thomson Foundation Journalism Now Scholar competition 2020 (win all expenses paid trip to the 2020 Thomson Foundation summer course in London)", "date announced:November 6, 2019", "Application Deadline:Friday 13th December, 2019"], ["Application Deadline:Friday 13", "th December, 2019", "The Thomson Foundation Journalism Now Scholar programme", " is back! Hone your newsgathering, storytelling and multimedia journalism skills in our five-week programme with the help of internationally renowned journalist, ", "Ewen MacAskill", ".", "You will take seven of our CPD-accredited ", "online courses", "\nincluding Mobile Journalism, Social Media Newsgathering, Journalism\nAcross Multiple Platforms, and Data Journalism, and will work on one or\nmore stories that you will publish.", "The highest performer will be invited on an all-expenses-paid trip to London to attend the", " 2020 Thomson Foundation five-week summer course,", " which includes a mixture of masterclasses, workshops and practical training and a week’s placement at a leading UK media organisation. A small number of top performers will also be acknowledged on our website and social media.", "Know what good journalism looks like and why.", "Improve your newsgathering skills, including social media verification and the use of data journalism techniques.", "Use smartphones to produce multimedia storytelling.", "Engage your audience by making your content engaging and relevant.", "Understand how to optimise your content for your chosen platforms.", "Requirements:", "The competition is open to entrants aged 18 or over.", "The winner is responsible for ensuring they are able to accept\nthe prize as set out and in accordance with these terms and conditions.\nIn the event they are unable to do so, then Thomson Foundation reserves\nthe right to select another winner.", "Only one entry per person. Entries on behalf of another person will not be accepted and joint submissions are not allowed.", "Thomson Foundation accepts no responsibility for entries that\nare delayed or incomplete or cannot be delivered or entered for any\ntechnical or other reason.", "The prize is subject to a successful visa\napplication, is non-exchangeable, non-transferable and not redeemable\nfor cash or other prizes.", "Participants may be required to take part in promotional\nactivity related to the competition and shall participate in such\nactivity on Thomson Foundation’s reasonable request. The winner will\nconsent to the use by Thomson Foundation of the participants images,\nnames and voices for publicity purposes (in any medium, including still\nphotographs and videos, online, including the websites hosted by Thomson\nFoundation), and in marketing and promotional material.", "Thomson Foundation will take care of any personal information\nsupplied to it as described in its privacy policy, and in accordance\nwith data protection legislation. By entering the competition, you agree\nto the collection, retention, usage and distribution of your personal\ninformation in order to process and contact you about your competition\nentry, and for the purposes outlined in the above bullet point.", "Entrants into the competitions shall be deemed to have accepted these terms and conditions.", "How to enter: Journalism Now Scholar", "What you will need to do, in three steps:", "1. ", "Complete seven Thomson Foundation online courses (you don’t need to re-take a course if you have previously completed it).", "Building Trust and Reputation", " OR ", "Ethical Journalist’s Toolkit", "Social Media Newsgathering", "Data Journalism: Getting Started", "Mobile Journalism: Getting Started", "Online Media Production", "Growing and Engaging Your Audience", "Journalism Across Multiple Platforms", "2. ", "Attend or watch the replay of up to four webinars with Ewen MacAskill.", "3. ", "Work on and publish a multimedia story.", "For More Information:", "Visit the Official Webpage of the Thomson Foundation Journalism Now Scholar competition 2020"], "url : https://www.opportunitiesforafricans.com/thomson-foundation-journalism-now-scholar-competition-2020/"], [["Loughborough University Graduate School Development Trust Africa Scholarships 2020/2021 for Study in the UK (100% Tuition Funded)", "date announced:November 4, 2019", "Application Deadline: 30 April 2020  "], ["Application Deadline: ", "30 April 2020 ", " ", "The Loughborough Development Trust Africa Scholarship", " will cover 100% of the course fees for your chosen postgraduate taught course for one year (replacing any Departmental or Loughborough University scholarships or bursaries you may already have been awarded).", "The scholarships are being funded through a combination of generous\nexternal funding and University funds. The University will award a\nlimited number of scholarships, and the standards required are very\nhigh.", "Students will be expected to fund their travel and maintenance costs through other sources. Evidence of maintenance funds must be included in the scholarship application.", "Requirements:", "Applications will be initially shortlisted and the final decision on\nthe awards will be made by a selection panel of senior staff of the\nUniversity. The selection panel will use the following eligibility\ncriteria when assessing applications:", "Currently domiciled (permanently living) in Africa", "Evidence of exceptional academic achievement (normally a 1st Class Honours Degree)", "Commitment to return to their home country on completion of postgraduate programme", "Evidence of the ability and commitment to making a significant contribution to their home country on their return", "Full understanding of the costs involved in coming to study and live in the UK", "Evidence of strong motivation and initiative to secure funds to cover the remainder of the costs involved", "Applicants are advised to spend considerable effort ensuring that\nthis application reaches the selectors in a form that is clear, well\npresented and which reflects your abilities and motivation.", "The application form can be downloaded below, and should be returned (by post or email) to:", "International Office", "Marketing and Advancement", "Loughborough University", "LOUGHBOROUGH", "Leicestershire LE11 3TU", "UK", "For More Information:", "Visit the Official Webpage of the Loughborough University Graduate School Development Trust Africa Scholarships 2020/2021 "], "url : https://www.opportunitiesforafricans.com/loughborough-university-graduate-school-development-trust-africa-scholarships-2020-2021/"], [["World Citizen Talent Scholarship 2020/2021 for Bachelor’s & Master’s Degree Study in the Netherlands (EUR 5,000)", "date announced:November 4, 2019", "Application Deadline: March 31st 2020"], ["Application Deadline: March 31st 2020", "Each year, a maximum of three (one-time) scholarships each worth EUR\n5,000 are available to prospective master students. We are seeking\nintelligent, talented and ambitious people who view themselves as\ncitizens of the world. ", "You are eligible for a ", "World Citizen Talent Scholarship", " if you:", "Come from outside The Netherlands and don’t live in the Netherlands.", "Are enrolling for the first time at The Hague University of Applied Sciences.", "Have never applied for this scholarship before.", "Have been conditionally accepted as a student (also-called offer of student position) on or before 31 March for the upcoming academic year.\\", "Application Process", "Step 1\n", "Apply for the ", "Master programme", " of your choice by using the online application tool.", "Step 2\n", "Write an essay (in English, 950 to 1100\nwords ) explaining why and how you can contribute to the multinational,\nmulticultural beehive that is The Hague University of Applied Sciences\nand how you can contribute to the programme of your choice. Please read\nour essay guidelines and information on the assessment procedure below\nbefore you start writing. ", "Step 3\n", "Submit your essay by completing the ", "scholarship application form", " between 1 November – 31 March.", "Scholarship assessments and results", "We\nhave appointed a committee to judge all essays. The judges will select\nthe three students whose essays will have impressed them most to receive\nthe scholarship. The decision of the jury is binding and you will be\ninformed about it via email before 15 May.", "Please note that you\nwill only be awarded the scholarship after you have been conditionally\naccepted and have met all terms and conditions of enrolment. Once the\nscholarship has been definitively awarded, the relevant amount (€ 5000)\n will be waived from the tuition fee as being the last instalment. ", "By\nsubmitting your essay, you are giving us the right to publish it, if we\nwish to. Scholarship winners are also expected to participate actively\nin the programme and its evaluations, become an ambassador of the Master\nprogrammes, and contribute to the internationalisation of our\ninstitution. ", "If you have any questions before applying, please email us via ", "[email protected]", ".  ", "For More Information:", "Visit the Official Webpage of the World Citizen Talent Scholarship 2020/2021"], "url : https://www.opportunitiesforafricans.com/world-citizen-talent-scholarship-2020-2021/"]]