[[["VLIR UOS /ICP Master of Transportation Sciences Scholarships 2019- Road Safety in Low & Middle Income Countries", "date announced:October 19, 2018", "Application Deadline: February 1st 2019"], ["Application Deadline: February 1st 2019", "The ICP “Master of Transportation Sciences – Road Safety in Low & Middle Income Countries”", " offers a 2-year multidisciplinary master programme with a unique focus and approach to Road Safety in Developing Countries. The programme is supported by ", "VLIR UOS", " and has 12 scholarships available each year.", "Students are trained to identify transportation and road safety issues in order to create innovative solutions by using an integrative approach based on three pillars: the individual (dealing with the human behaviour in traffic and how to influence it e.g. intentional and unintentional riskful behaviour such as drunk driving or cognitive impairments), the environment (e.g. creating self-explaining roads and infrastructure that minimizes crash impact) and the society (e.g. societal norms and translation into policy and enforcement measures). Road safety in this programme is approached as a cross-border field, incorporating elements of psychology, economy, urban planning, environmental studies, engineering and more.", "Eligibility Criteria:", "You can only apply for a scholarship if you meet all VLIR-UOS scholarship criteria:", "\nFor example:", "Nationality and country of residence:", "\nBe a national and resident of one of the below 31 countries:"], "url : https://www.opportunitiesforafricans.com/vlir-uos-icp-master-of-transportation-sciences-scholarships-2019-2019-road-safety-in-low-middle-income-countries/"], [["UNICAF Scholarship to study an online degree from the University of South Wales or UNICAF University", "date announced:November 8, 2018", "Looking for an online degree with scholarship? UNICAF Scholarship Programme has got you covered: the UNICAF Scholarship Programme is one of the most generous programmes available in the world today. Over USD 75 million worth of scholarships have been awarded!\nYou can earn up to 60% UNICAF Scholarship to study an online degree from the University of South Wales or UNICAF University , at an affordable price that fits around your busy schedule."], ["Looking for an online degree with scholarship? UNICAF Scholarship Programme has got you covered: the UNICAF Scholarship Programme is one of the most generous programmes available in the world today. Over USD 75 million worth of scholarships have been awarded!", "\nYou can earn up to 60% ", "UNICAF Scholarship", " to", " study an online degree from the University of South Wales or UNICAF University", " , at an affordable price that fits around your busy schedule.", "Programmes on offer:", "\n● Bachelor’s in Computer Science, Accounting and Finance, Hospitality, etc.", "\n● Master’s in Education, Public Administration, etc.", "\n● MBA Finance, Health Management, Oil and Gas Management, etc.", "\n● LLM Master’s of Law", "\n● PhD programmes", "Scholarships are open to candidates from the following countries:", "\n● Bangladesh", "\n● Benin", "\n● Botswana", "\n● Brazil", "\n● Colombia", "\n● Ghana", "\n● Jamaica", "\n● Kenya", "\n● Malawi", "\n● Namibia", "\n● Nigeria", "\n● Philippines", "\n● Rwanda", "\n● Saudi Arabia", "\n● Sierra Leone", "\n● South Africa", "\n● Tanzania", "\n● Uganda", "\n● United Kingdom", "\n● Zambia", "\n● Zimbabwe", "The Scholarships will be awarded on a rolling basis, so don’t wait, APPLY NOW:", "\n○", " Sign up", " on Sqore.", "\n○ Take a 5-min fun quiz to learn more about the scholarship.", "\n○ Fill in your details.", "\n○ If you meet the school’s eligibility criteria, an admissions expert will be in touch to guide", "\nyou with your decision.", "For More Information:", "Visit the Official Webpage of the UNICAF Scholarships"], "url : https://www.opportunitiesforafricans.com/unicaf-scholarship-to-study-an-online-degree-from-the-university-of-south-wales-or-unicaf-university/"], [["Loughborough University Graduate School Development Trust Africa Scholarships 2019/2020 for Study in the UK (100% Tuition Funded)", "date announced:November 5, 2018", "Application Deadline: 30 April 2019 "], ["Application Deadline: ", "30 April 2019 ", "The Loughborough Doctoral College Development Trust Africa Scholarships", ",", " will cover 100% of the course fees for your chosen postgraduate taught course for one year (replacing any Departmental or Loughborough University scholarships or bursaries you may already have been awarded).", "The scholarships are being funded through a combination of generous external funding and University funds. The University will award a limited number of scholarships, and the standards required are very high.", "Students will be expected to fund their travel and maintenance costs through other sources. Evidence of maintenance funds must be included in the scholarship application.", "Eligibility Requirements:", "Applications will be initially shortlisted and the final decision on the awards will be made by a selection panel of senior staff of the University. The selection panel will use the following eligibility criteria when assessing applications:", "Currently domiciled (permanently living) in Africa", "Evidence of exceptional academic achievement (normally a 1st Class Honours Degree)", "Commitment to return to their home country on completion of postgraduate programme", "Evidence of the ability and commitment to making a significant contribution to their home country on their return", "Full understanding of the costs involved in coming to study and live in the UK", "Evidence of strong motivation and initiative to secure funds to cover the remainder of the costs involved", "Applicants are advised to spend considerable effort ensuring that this application reaches the selectors in a form that is clear, well presented and which reflects your abilities and motivation.", "The application form can be downloaded below, and should be returned (by post, fax or email) to:", "International Office", "Marketing and Advancement", "\nLoughborough University", "\nLeicestershire LE11 3TU", "\nUK", "Email: ", "[email protected]", "Please do not submit your scholarship application until you have received your offer letter. Applications will only be considered if all parts of the form are completed in full", "Africa Scholarship – Application form 2019/20 entry", "For More Information:", "Visit the Official Webpage of the Loughborough University Graduate School Development Trust Africa Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/loughborough-university-graduate-school-development-trust-africa-scholarships-2019-2020/"], [["World Youth Alliance (WYA) Africa Vanessa Cherese Scholarship 2019 (Fully Funded to New York, USA)", "date announced:October 29, 2018", "Application Deadline:November 3, 2018."], ["Application Deadline:November 3, 2018.", "World Youth Alliance (WYA) Africa", " opens the 2018 search for a passionate, committed, and dedicated World Youth Alliance member from Africa who will represent the region in the second or third batch of the ", "WYA Global Internship Program", " (May–July or September-December 2019) in New York City, USA. Successful completion of ", "WYA’s Certified Training Program", " and Regional Internship Program in the", " WYA Africa regional office", " are prerequisites to apply for the search.", "The chosen WYA member will receive the Vanessa Cherese Scholarship. This includes: ", "•", "  A 3-month project management and advocacy training at the WYA Headquarters in New York", "•", "  An opportunity to represent the WYA Africa region in the ", "International Summer Camp", " as a Counselor (if joining B2)", "•", "  Roundtrip economy class flight tickets from Nairobi, Kenya to New York, USA", "•", "  Shared room accommodations with facilities in New York (a value of approximately $4,500)", "•", "  Qualified to apply for an internship stipend (a value of approximately $200-$300)", "The chosen WYA member is responsible for the expenses related to the visa application and local transportation from his or her current location to Nairobi.", "Qualifications", ":", "Aged 30 years old and below", "University student or graduate", "Good command of the English language (writing and oral), French as a second language will be appreciated", "Strong skills in management, team work, public speaking, fundraising, and planning", "Requirements", ":", "Signed WYA Charter", "World Youth Alliance Regional Internship Alumna", "Completed International Internship Application Form and Scholarship Application Form** (this can be merged as one)", "Completed WYA’s Certified Training Program with a score of at least 85 and above", "Resume or Curriculum Vitae (maximum of 3 pages)", "Cover Letter addressed to the WYA Africa Regional Director", "3 recommendation letters, 1 of which must certify financial need for the support under the scholarship", "Commitment to serve the region as a member of the National Committee of their country after their return from the International Internship.", "Application Process ", "Completion of the Application Process", "Submission of the required essay question", "Complete application sent to ", "[email protected]", "Applicants should submit their completed application requirements to ", "[email protected]", "with the subject ", "2019WYAAVCSF_LastName ", "on or before November 3, 2018.", "For More Information:", "Visit the Official Webpage of the World Youth Alliance (WYA) Africa Vanessa Cherese Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/world-youth-alliance-wya-africa-vanessa-cherese-scholarship-2019/"], [["US-MEPI/AMIDEAST Tomorrow’s Leaders Scholarship Program 2018/2019 for Students from Middle East and North Africa.", "date announced:November 1, 2018", "Application Deadline: December 1st 2018"], ["Application Deadline: December 1st 2018", "The U.S. Department of State’s Middle East Partnership Initiative (MEPI)", " ", "and AMIDEAST are pleased to announce this year’s recruitment for the Tomorrow’s Leaders Scholarship Program.", " The Tomorrow’s Leaders Scholarship Program", " is a MEPI initiative for capable and highly motivated high school seniors in the Middle East and North Africa who are from underserved backgrounds. The program will provide four-year university scholarships and internship opportunities at select institutions of higher learning in the Middle East to students who have the potential to become leaders.", "Eligible students include men and women who represent the region’s cultural, religious, and geographic diversity and are from socio-economically disadvantaged backgrounds, who could otherwise gain admission to, but would be unable to afford, four years of college at an American university in the Middle East.  ", "Tomorrow’s Leaders scholarship", " recipients should be prepared to begin the program in the Fall 2019 term.", "The primary objective of MEPI’s Tomorrow’s Leaders scholarship program is to build a cadre of university-age leaders who are civic-minded, intellectually able, and professionally skilled, who will become the community, business, and national leaders of the future. The program intends to nurture leadership skills and the spirit of civic engagement and volunteerism among outstanding university-age students at the American University of Beirut and the Lebanese American University.  ", "Selected students will join the 447 Tomorrow’s Leaders already studying or who have graduated from these universities.", "Scholarship recipients may pursue an undergraduate degree in a selected field at one of the two host institutions..  In addition to their studies, recipients will be expected to maintain at least a 3.0 GPA, engage in community service activities and participate in internships. Limited English- language training will be provided for some participants. Students may also have an opportunity for a study abroad semester in the U.S.", "American University of Beirut – Offered Majors to MEPI-TL applicants who will enroll in Fall 2019", "Faculty of Agriculture and Food Sciences FAFS", "\n• Agribusiness (BS)", "\n• Agriculture (BS)", "\n• Food Science and Management (BS)", "\n• Landscape Architecture (BLA)", "\n• Nutrition and Dietetics (BS)", "\nFaculty of Arts and Sciences (FAS)", "\n• Arabic Language and Literature (BA)", "\n• Archaeology (BA)", "\n• Art History (BA)", "\n• Biology (BS)", "\n• Chemistry (BS)", "\n• Computer Science (BS)", "\n• Economics (BA)", "\n• Education/Elementary (BA)", "\n• English Language (BA)", "\n• English Literature (BA)", "\n• Geology (BS)", "\n• History (BA)", "\n• Mathematics (BA, BS)", "\n• Media and Communication (BA)", "\n• Petroleum Studies (BS)", "\n• Philosophy (BA)", "\n• Physics (BS)", "\n• Political Studies (BA)", "\n• Psychology (BA)", "\n• Public Administration (BA)", "\n• Sociology-Anthropology (BA)", "\n• Special Education (DIPLM)", "\n• Statistics (BA)", "\n• Studio Arts (BA)", "\n• Teaching Diploma (TD) (Teaching of Arabic, Health Education, Elementary Education, Informatics Education, Mathematics Education, Science Education, Teaching of Social Studies, Teaching of English as a foreign language)", "Faculty of Health Sciences (FHS)", "\n• Environmental Health (BS)", "Rafic Hariri School of Nursing (HSON)", "\n• Nursing", "\nOlayan School of Business (OSB)", "\n• Business Administration (BBA)", "Benefits:", "Participation in the program includes: travel, academic fees for four years of university at AUB or LAU, a study abroad experience in the U.S., accident and sickness insurance, housing, and a monthly allowance during the school year.", "For More Information:", "Visit the Official Webpage of the US-MEPI/AMIDEAST Tomorrow’s Leaders Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/us-mepi-amideast-tomorrows-leaders-scholarship-program-2018-2019/"], [["Leventis Foundation (Nigeria) One-Year Training Programme 2018/2019 in Modern and Sustainable Agriculture (Fully Funded)", "date announced:October 31, 2018", "Application Deadline: November 30th 2018"], ["Application Deadline: November 30th 2018", "The Leventis Foundation (Nigeria)", " is a charitable company dedicated to the training of farmers in modern and sustainable agricultural practices and rational use of natural resources.", "The Foundation has been running agricultural training for youths and farmers since 1987 and currently has six schools in the different agro-ecological zones in Nigeria. The schools are located in the FCT, Osun, Kaduna, Kano and Gombe States are co-financed by Leventis Foundation and the respective State Governments. All the schools offer training to young people (male and female) desirous of making a good career in farming. The comprehensive one-year training exposes the participants to several areas of agriculture and other farm businesses.", "Benefits:", "Tuition and boarding (including feeding) is provided ", "free of charge ", "for successful candidates throughout the duration of the course.", "The objective of the training, which is ", "FREE OF ALL COSTS", ", is to create in Nigeria, generations of committed young practical farmers who will act as catalysts for agricultural revolution in their communities.", "Admission is open to both male and female candidates.", "Admission Requirement", "Applicants should fulfill the following conditions among others;", "(a) Be physically fit", "(b) Ability to read and write in English (evidence of minimum of junior secondary school may be required)", "(c) Age between 18 and 40 years.", "(d) Pass both written and oral test prior to final selection", "(e) Should demonstrate perceivable interest in agriculture", "(f) Proof of farming background is an advantage.", "Timeline:", "Application deadline:", " 30th November, 2018", "Screening/Examination:", " ", "Saturday 1st December, 2018", "For further enquiries, please contact:", "Mrs Janet Egbe-Owoicho", ", Leventis Foundation (Nigeria) Ltd/Gte", "Email:", " ", "[email protected]", ",", " Tel: 0708 552 4233", "Method of Application", "Application in applicant’s own hand writing including concrete information in respect of each of the above requirements together with a letter signed by the Chairman or Secretary of the candidate’s Local Government of Origin, or an attestation letter from a Justice of Peace (JP), two (2) recent passport size photographs, three (3) references and photocopies of academic qualification(s) or relevant documents should be forwarded to any of the addresses below, preferably, to the school of choice.", "(1) Leventis Foundation/ Osun State", "Agricultural Training School", "Imo, P.M.B. 5074 Ilesa", "Osun State", "(2) Leventis Foundation/ Kaduna State", "Agricultural Training School", "Dogon Dawa, Birini Gwari LG,", "P.M.B 1047, Zaria Kaduna State.", "(3) Leventis Foundation/ Kano State", "Agricultural Training School", "Panda, Albasu Local Government", "P.M.B. 3555, Kano State", "(4) Leventis Foundation/Gombe State", "Agricultural Training School", "Tumu, Akko Local Government", "Gombe State.", "(5) Leventis Foundation /FCT", "Agricultural Training School", "Yaba, Abaji Area Council", "P.M.B. 001, Abaji,", "Abuja.", "6) ", "The General Manager (Technical and Training)", "Leventis Foundation (Nigeria) Ltd/Gte", "2, Leventis Close, Central Business District", "P.O.Box 20351, Garki Abuja, FCT.", "In addition to the regular one-year training, all Leventis (Nigeria) schools offer a variety of vocational targeted short courses in several aspects of farming e.g. poultry production, vegetable production, bee-keeping, honey production, fish farming, mushroom production e.t.c.", " ", "For More Information:", "Visit the Official Webpage of the Leventis Foundation (Nigeria) One-Year Training Programme 2018/2019"], "url : https://www.opportunitiesforafricans.com/leventis-foundation-nigeria-one-year-training-programme-2018-2019/"], [["Erasmus Mundus Masters Program in Public Policy – Mundus MAPP (MUNMAPP) 2019/2020 for developing countries", "date announced:October 18, 2018", "Application Deadline:April 8, 2019"], ["Application Deadline:", "April 8, 2019", "Mundus MAPP/MUNMAPP is a two-year-long international joint Masters program in Public Policy, offered by  four ", "top-ranked", " European institutions: ", "Central European University", ", Budapest (Hungary), ", "International Institute of Social Studies of Erasmus University Rotterdam", " (the Netherlands), ", "Institut Barcelona d’Estudis Internacionals", " (Spain) and the ", "University of York", " (UK). Established in 2007, the program operates as an ", "Erasmus Mundus Joint Master Degree", " Program funded by the European Commission.", "Mundus MAPP directly responds to the educational needs created by the rapidly changing global environment and new public policy challenges. The program equips graduates with the conceptual knowledge and hard skills that are necessary for understanding and decisively intervening in contemporary transnational policy problems, from climate change to international terrorism or financial regulatory failure. It provides a detailed and systematic understanding of how political institutions, processes and public policies operate and interact from the global political economy through to national and local levels with a direct focus on European engagements at these levels of governance. Inter-disciplinarity and practical application of conceptual knowledge are hallmarks of Mundus MAPP.", "Admission Requirements:", "Mundus MAPP is open to both European and third country national students. Scholarships are provided for the best eligible applicants by the European Union’s Erasmus+ Programme, as well as by the Consortium institutions.", "Minimum requirements are:", "1)    Educational background", "For all tracks of the program", ", candidates need to have a Bachelors degree comprising at least three years of studies at a recognized university or institute of higher education. Applicants must have obtained at least class 2.2 (Lower Second), B or equivalent but preferably class 2.1 (Upper Second), B+ or equivalent. Normally applicants with a preliminary degree in any of the social sciences or equivalent are given preference. Candidates with a Bachelors degree in Natural Science or Engineering are not eligible to apply.", "Further, ", "for CEU tracks", " (CEU-York and CEU-IBEI) only Bachelors degrees in the Social Sciences and some disciplines in the Arts and Humanities are eligible. Specifically:", "Applicants with Bachelors degrees in the following fields are eligible to apply: International Studies (incl. International Relations), Political Science, Sociology, Social Studies; Administration Management, International Administration; Applied Economics, Economic Analysis, Public Service.", "Applicants with Bachelors degrees in the following fields are eligible to apply only if the candidate has at least half a year’s professional or research experience, in the following fields: any other field of the Social Sciences; Legal and Administration Sciences; Economics; National Defense and Military field and Security studies.", "Other Bachelors degrees in the Arts and Humanities may be eligible on a case-by-case basis, if the Consortium’s admissions evaluators can verify from the submitted transcripts that the applicant has followed courses and/or has done research in the fields listed above.", "The fields above are defined broadly, national equivalent degrees or specialized degrees of the above fields (e.g. political economy or international political economy, regional and environmental economics, social policy etc.) are eligible. If you have questions about the eligibility of your degree please contact the consortium.", "For ", "IBEI tracks", " (CEU-IBEI, ISS-IBEI), according to the regulations of the Spanish Ministry of Education, applicants need to have successfully completed an undergraduate degree from a fully accredited institution of higher education (within or outside the European Higher Education Area), provided that this undergraduate degree grants access to master’s level studies in the country in which the undergraduate degree diploma was issued.", "2)    High motivation and interest in European and international public policy", "3)    Work experience", "\nApplicants with relevant work experience (internships, jobs) will be ranked higher.", "4)    Fluency in English", "\nMundus MAPP does not require a language certificate from applicants from the following countries, provided that they have received a Bachelor’s or Master’s degree taught exclusively in English:", "\nAustralia, Botswana, Canada, Gambia, Ghana, Ireland, Jamaica, Kenya, Liberia,", "\nMalawi, Namibia, New Zealand, Nigeria, Philippines, Rwanda (English-speaking region), South Africa, Tanzania, Trinidad and Tobago, Uganda, UK, USA and Zambia", "Applicants from countries other than these may request a waiver from the English language admissions requirement if they completed a Bachelor’s or Master’s degree taught exclusively in English in Australia, Canada, New Zealand, USA, the European Union, Iceland, Liechtenstein, Norway or Switzerland.", "All other applicants will need to provide evidence of their English language skills with any one of the following test scores:", "TOEFL (Paper version; taken on/after January 3, 2017) 580 or above;", "TOEFL (Internet version; taken on/after January 3, 2017) 92 or above;", "IELTS – Academic (taken on/after January 3, 2017) 6.5 or above;", "Cambridge Proficiency Examination (taken on/after January 3, 2014) C or above;", "Cambridge Advanced English Test (taken on/after January 3, 2014) B or above.", "5)    Other", "\nAlthough Spanish is no longer a requirement for mobility tracks involving IBEI, basic knowledge of Spanish is recommended as some electives will only be available in Spanish.", "Financial Aid", "Partner Country scholarships: ", "for selected applicants from all other countries (countries not listed above under ", "Programme Country scholarships", "), provided that they are not residents nor have carried out their main activity (studies, training, work, living) for more than a total of 12 months over the last five years in any of the Programme Countries listed above.", "Partner Country scholarships consist of the following contributions:", "a)    Contribution to participation costs (tuition fees): 9,000 EUR/academic year (18,000 EUR in total for two academic years)", "b)    Contribution to travel and installation costs: up to 7,000 EUR in total for two academic years", "c)    Contribution to subsistence costs (stipend): 1,000 EUR/month (24,000 EUR for two academic years)", "d)    The remaining tuition fees (4,000 EUR in total for two academic years) will be waived by the consortium institutions.", "A part of Partner Country scholarships are earmarked for applicants coming from the following specific geographical regions:", "ENI – EAST:", "\nArmenia, Azerbaijan, Belarus, Georgia, Moldova, Ukraine", "ASIA – Least Developed Countries:", "\nAfghanistan, Bangladesh, Bhutan, Cambodia, Laos, Myanmar, Nepal", "CENTRAL ASIA – Lower or Lower Middle Income Countries:", "\nKyrgyzstan, Tajikistan, Uzbekistan", "ACP COUNTRIES:", "\nAngola, Antigua and Barbuda, Bahamas, Barbados, Belize, Benin, Botswana, Burkina Faso, Burundi, Cameroon, Cape Verde, Central African Republic, Chad, Comoros, Congo, Democratic Republic of the Congo, Cook Islands, Djibouti, Dominica, Dominican Republic, Equatorial Guinea, Eritrea, Ethiopia, Fiji, Gabon, Gambia, Ghana, Grenada, Guinea, Guinea-Bissau, Guyana, Haiti, Republic of Côte d’Ivoire, Jamaica, Kenya, Kiribati, Lesotho, Liberia, Madagascar, Malawi, Mali, Marshall Islands, Mauritania, Mauritius, Federated States of Micronesia, Mozambique, Namibia, Nauru, Niger, Nigeria, Niue, Palau, Papua New Guinea, Rwanda, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and The Grenadines, Samoa, Sao Tome and Principe, Senegal, Seychelles, Sierra Leone, Solomon Islands, Somalia, South Sudan, Sudan, Suriname, Swaziland, Democratic Republic of Timor Leste, Tanzania, Togo, Tonga, Trinidad and Tobago, Tuvalu, Uganda, Vanuatu, Zambia, Zimbabwe", "How to Apply:", "Admissions to Mundus MAPP are centrally administered by Central European University in Budapest. Qualitative assessment of the candidates is performed jointly by the four consortium universities. Please note that only applications submitted to CEU in the way detailed below will be considered. It is not possible to apply to Mundus MAPP universities other than CEU.", "Before starting the process please read our Guidelines for the Admissions Process.", "Candidates are required to fill in an ", "on-line application form", ". You may only apply to one of the following mobility tracks:", "CEU-IBEI track – ", "Global Public Policy ", "specialization", "CEU-York track – ", "European Public Policy ", "specialization", "ISS-IBEI track – ", "Political Economy and Development ", "specialization ", "ISS-York track – ", "Governance and Development ", "specialization", "Besides submitting the on-line application form candidates will be required to upload supporting documentation which are listed ", "here", ".", "Further information on formal requirements regarding the official documents is available on ", "CEU’s admission’s pages", ", with the applicable requirements as outlined here.", "For queries please write to ", "mundusmapp [at] ceu [dot] edu", ". Please note that the consortium receives a high number of queries to this email address and therefore it may take some time to receive an answer – please be patient.", "For More Information:", "Visit the Official Webpage of the Erasmus Mundus Masters Program in Public Policy – Mundus MAPP (MUNMAPP)"], "url : https://www.opportunitiesforafricans.com/erasmus-mundus-masters-program-in-public-policy-mundus-mapp-munmapp-2019-2020/"], [["U.S. Department of State Global Undergraduate Exchange Program 2019/2020 (Global UGRAD) for Study in the United States (Fully Funded)", "date announced:November 2, 2018", "Application Deadline:December 31st, 2018 5:00 pm EST."], ["Application Deadline:", "December 31st, 2018 5:00 pm EST.", "The Global Undergraduate Exchange Program (Global UGRAD)", " ", "is sponsored by the U.S. Department of State’s Bureau of Educational and Cultural Affairs. It is a fully-funded scholarship for one semester of non-degree academic study at an assigned U.S. college or university. Participants are emerging leaders committed to their home communities. During the Program, Global UGRAD participants challenge themselves to explore U.S. society, culture, and academic learning. They also participate in community service and enhance their professional skills.", "All participants will be enrolled in full-time, non-degree, undergraduate course work chosen from their host institution’s existing curriculum. Participants will be required to take one, 3-credit U.S. studies course to enhance their understanding of the United States. Participants will live in campus housing facilities with American peers, and will be required to participate in twenty hours of community service. There will also be a virtual arrival orientation and an in-person end-of-program workshop. Undergraduate students from all fields of study are encouraged to apply.", "Program Goals", "To promote mutual understanding between people of the United States and other countries.", "Provide a fulfilling exchange experience to drive academic, cross-cultural, and leadership competencies for students from Global UGRAD countries.", "Enhance students’ academic knowledge and professional skills needed to pursue long-term academic and career goals.", "Cultivate students’ comprehensive and nuanced understanding of the U.S.", "Facilitate opportunities for students to establish social networks with U.S. host institutions and local communities.", "Empower students to engage constructively in the civic life of their local and global communities.", "Eligibility for the Global UGRAD Program:", "Applicants must be a citizen of the country in which they apply for the Global UGRAD Program.", "Applicants must be studying in the country in which they apply for the Global UGRAD Program.", "Scholarships will be granted to students who currently are enrolled in full-time undergraduate programs only, having completed a minimum of their first semester of study. Participants must have at least one semester or an equivalent term to complete at their home institutions upon completion of the Global UGRAD Program.", "Applicants should demonstrate leadership potential through academic work, community involvement, and extracurricular activities.", "Applicants must achieve minimum TOEFL score of 45ibt.", "Preference will be given to those who have had little or NO experience in the U.S. or outside of their home countries.", "Applicants are required to return directly to their home country after the completion of the program.", "Applicants are over 18 years of age", "Eligible Countries:", "Are you an aspiring leader with citizenship in one of the following countries:", "Algeria,", " Albania, Armenia, Azerbaijan, Bahrain, Bangladesh, Belarus, Bosnia-Herzegovina, Burma (Myanmar), Cambodia, China, Costa Rica, Dominican Republic, ", "Egypt,", " El Salvador, ", "Ethiopia,", " Georgia, Guatemala, Haiti, Honduras, India, Indonesia, Israel, Jordan, Kazakhstan,", " Kenya,", " Kosovo, Kuwait, Kyrgyzstan, Laos, Lebanon, Macedonia, ", "Malawi,", " Malaysia, Maldives, ", "Mauritania,", " Moldova, Mongolia, Montenegro,", " Morocco, Mozambique,", " Nepal, Nicaragua,", " Niger,", " Oman, Palestinian Territories, Panama, Paraguay, Philippines, Russia, Saudi Arabia, Serbia, South Korea, Sri Lanka, Tajikistan, Thailand, Turkmenistan, Ukraine, Uzbekistan, Venezuela, Vietnam, and", " Zimbabwe.", "\nFor More Information:", "Visit the Official Webpage of the U.S. Department of State Global Undergraduate Exchange Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/u-s-department-of-state-global-undergraduate-exchange-program-2019-2020/"], [["Thomas Jefferson Tunisia Undergraduate Scholarship Program (UGRAD) 2019/2020 for young Tunisians to study in USA (Fully Funded)", "date announced:October 29, 2018", "Application Deadline: Monday, November 26, 2018 at 5:00pm Tunisia time."], ["Application Deadline: Monday, November 26, 2018 at 5:00pm Tunisia time.", "As part of the ", "Thomas Jefferson Scholarship Program,", " ", "the 2019-2020 Tunisia Undergraduate Scholarship Program,", " a program of ", "the Bureau of Educational and Cultural Affairs of the United States Department of State,", " provides opportunities for outstanding undergraduate students from Tunisia for one year of full-time, non-degree study in the United States. Students will attend four year universities and colleges and will live in on-campus housing (dormitories).", "Participants may submit U.S. transcripts to their home institution for review upon completion of the program to determine if the credits are transferrable. The program will provide participants with a deeper understanding of American culture and new globally-applicable skills and expertise to help them contribute to the growth and development of Tunisia.", "A broad range of academic fields of study are eligible, including humanities, social sciences, applied sciences, natural and physical sciences, arts, and other standard university fields of study. Please note that students studying at ISSAT (Institut Supérieur des Sciences Appliquées et de Technologie) are not eligible for Tunisia UGRAD but should apply for the Tunisia Community College Scholarship Program (TCCSP).", "Students should identify their program field of study on their application. This", "\nfield should be drawn from the standard university/college curriculum within the United States. Please note that students may not enroll in clinical coursework while on the Tunisia UGRAD Program.", "EXPERIENTIAL COMPONENTS", "\nTo support students in the development of the skills, knowledge, and attitudes needed to build strong foundations for professional leadership success contributing to Tunisia’s development, participants engage in experiential learning components in addition to their academic programs:", "Cultural Engagement: To develop students’ interpersonal and cross-cultural skills, participants will be required to give a minimum of one country presentation during their program; complete cross-cultural activities each semester; and develop a virtual cultural exchange activity.", "Community Service: To expose students to the principles of community service and social responsibility in the United States, participants will be required to perform a minimum of 20 hours of community service with local organizations during their first semester and participate in a leadership development mid-program workshop.", "Part-Time Internship: Internships provide an essential opportunity for participants to develop key personal soft skills and gain professional experience and skills that can be applied in their future careers in Tunisia. Program participants will be required to intern a total of 80 hours during their second semester; each participant’s internship must be related to their program field of study.", "Eligibility Requirements:", "The Thomas Jefferson Scholarship Program does not discriminate against applicants on the basis of race, color, religion, sex, age, national origin, disability, or any other protected characteristic as established by U.S. law. Competition for the", " Tunisia Undergraduate Scholarship Program", " is merit-based and open to anyone who:", "\n• Is a Tunisian citizen;", "\n• Is currently enrolled as a first- or second-year full-time undergraduate (Licence) student in good academic standing at the time of application at a registered academic institution in Tunisia;", "\no Architecture students are eligible in their first-, second-, third-, or fourth-year of study. Engineering students are eligible in their first-, or second-year (preparatory classes), and third- and fourth-year of undergraduate study;", "\no If you study at an ISSAT (Institut Supérieur des Sciences Appliquées et de Technologie) please see the Tunisia Community College Scholarship Program application.", "\n• Is currently residing in Tunisia;", "\n• Is able to receive a U.S. J-1 visa;", "\n• Is at least 18 years old by July 1, 2019", "\n• Is committed to returning to Tunisia after completion of the program; and", "\n• Is able to achieve a TOEFL score of 500 (PBT)", "Benefits:", "FINANCIAL PROVISIONS OF THE GRANT", "\n• J-1 visa support;", "\n• Round-trip travel from participant’s home city to host institution in the United States;", "\n• Accident and sickness medical coverage;", "\n• Tuition and mandatory university fees;", "\n• Room and board (housing and meals);", "\n• Small incidentals allowance;", "\n• Limited allowance for books;", "\n• A wide variety of alumni networking and training opportunities", "GENERAL APPLICATION INSTRUCTIONS", "\n• Please answer ALL questions on the application in English (except where specified).", "\n• Include your full, legal name – family name (surname) and first name – as spelled on your international passport (if available) or national identity card. Do not translate name spellings.", "\n• Include complete contact information (including postal codes for all addresses and city/country codes for all phone and fax numbers). Do not translate street or city names into English. Instead, please write the names using the English alphabet.", "\n• Do NOT leave a space blank. If a question does not apply to you, enter N/A (not applicable).", "\n• Applicants are encouraged to complete the application online at www.irex.org.", "\n• If submitting a paper application:", "\no All forms and supporting materials should be typewritten (if possible) and submitted with the completed application. Handwritten applications must be neatly printed in black ink.", "\no Write your full name and home city in the top right corner of each page.", "A completed application includes:", "\n• Additional Application Questions: Applicants must provide information about how they heard about the Tunisia Undergraduate Scholarship Program, plans to apply for other sponsored educational exchange programs and their permanent home governorate.", "\n• Short Answers 1-5: Applicants must answer each question and use no more than 250 words per response. Answers must be the applicant’s own work.", "\n• Essay 1: Applicants must completely answer the question including all sub-questions associated with Essay 1. This answer should be no more than 800 words and in essay format. Answers must be the applicant’s own work.", "\n• Essay 2: Applicants must completely answer the question including all sub-questions associated with Essay 2. This answer should be no more than 800 words and in essay format. Answers must be the applicant’s own work.", "SUBMISSION GUIDELINES", "\nThe deadline for applications for Tunisia UGRAD is Monday, November 26, 2018 at 5:00pm Tunisia time. Applications may be submitted to IREX in one of two ways: Online or by paper.", "\nOnline Applications:", "\nApplicants are encouraged to complete the application online.", "\n1. Online Application can be found on the IREX website at: http://www.irex.org/project/tunisia-ugrad", "\n2. Please read the instructions and Frequently Asked Questions (FAQ) carefully prior to beginning the application.", "\nPaper Applications:", "\nPaper applications may be submitted to the following address:", "\nIREX/Tunisia c/o Startup Haus Tunis 71 Avenue Jean Jaurès", "For More Information:", "Visit  the Official Webpage of the Thomas Jefferson Tunisia Undergraduate Scholarship Program (UGRAD) 2019/2020"], "url : https://www.opportunitiesforafricans.com/thomas-jefferson-tunisia-undergraduate-scholarship-program-ugrad-2019-2020/"], [["French Government Eiffel Excellence Scholarship Programme 2019 for Masters & PhD Study in France (Funded)", "date announced:October 23, 2018", "Application Deadline:January 11th 2019."], ["Application Deadline:", "January 11th 2019.", "The Eiffel Excellence Scholarship Program", " was established by the French Ministry for Europe and Foreign Affairs to enable French higher education institutions to attract top foreign students to enroll in their masters and PhD programs.", "It gives opportunity to the future foreign decision-makers of the private and public sectors, in priority areas of study, and encourages applicants up to 30 years old from developing countries at master’s level, and applicants up to 35 years old from developing and industrialized countries at PhD level.", "The Eiffel Excellence Scholarship Program is awarded to two types of studies:", "Masters level, for a duration between 12 and 36 months;", "Doctorate or PhD level, for research periods in France of up to 12 months, as part of a cotutelle or joint doctoral thesis supervision (preferably in 2nd year of PhD)", "Fields of study", "\nEiffel scholarships are available in four main fields:", "Law studies;", "Economics and management;", "Engineering sciences at master’s level, Science in a broad sense at PhD level (engineering sciences; exact sciences: mathematics, physics, chemistry and life sciences, nano and biotechnology, earth sciences, sciences of the universe, environmental sciences, information and communication science and technology);", "Political sciences.", "Levels of Study", "French higher education institutions nominating candidates for the Eiffel Program commit to enrol them:", "in a master’s degree program;", "in an engineering program;", "or in a PhD program in a cotutelle or joint doctoral thesis supervision, in partnership with a foreign higher education institution.", "Eligibility", "Nationality: this program is reserved for non-French nationals. Candidates with two nationalities, one of which is French, are not eligible.", "Age: for master’s level, candidates must be no older than 30 on the date of the 2019 Campaign, that is, students born after March 1988. At PhD level, candidates must be no older than 35 on the date of the 2019 Campaign, that is, students born after March 1983.", "Origin of applications: only applications submitted by French educational institutions are accepted. These institutions commit to enrolling scholarship holders on the academic program for which they have been selected. Applications submitted by any other means shall not be considered. Furthermore, any candidate nominated by more than one institution shall be disqualified.", "Levels of study: scholarships are granted to candidates wishing to enrol on a master’s program, including at an engineering school, and for PhD students. The Eiffel Program does not apply to French-run master’s programs abroad.", "\nThe Eiffel scholarship does not apply to training under an apprenticeship contract or a professional training contract.", "Scholarship incompatibilities: foreign students who, at the time of application, have already been awarded a French government scholarship from another Program, are not eligible, even if the scholarship only covers health insurance.", "Eiffel master’s scholarship", ": no application will be accepted for any student already rejected at an earlier application campaign, even if the application is submitted by a different institution or in another field of study. Students who have already been awarded an Eiffel scholarship at master’s level are not eligible to re-apply at master’s level.", "Eiffel PhD scholarship", ": Institutions may nominate a candidate who was previously awarded an Eiffel scholarship at master’s level for a scholarship at PhD level. Candidates who have already been awarded an Eiffel scholarship during their PhD cannot be awarded a scholarship for a second time. No application will be accepted for any student already rejected at an earlier application campaign, even if the application is submitted by a different institution or in another field of study.", "Language skills: when pre-selecting non-French-speaking candidates, institutions must make sure that their language skills meet the requirements of its academic program.", "Students studying at an academic program abroad have priority over those already living in France.", "Benefits of the scholarship", "\nMaster’s level", "The Eiffel scholarship consist of a monthly allowance of €1,181 (a maintenance allowance of €1,031 and a monthly stipend of €150). In addition, the following benefits are covered:", "International transport2: a round-trip international ticket Country of origin – France;", "National transport: a train ticket to the first study location; a train ticket from the last study location to the airport for the return to the country of origin;", "Local transport: reimbursement of up to a maximum of €50 of the trip between the airport or train station and the first study location (taxi or public transport);", "Health insurance by Campus France, for the time needed to register to French Social Security, for students from outside of the European Economic Area (EEA);", "Mutual health insurance (mutuelle);", "Cultural activities.", "PhD level", "\nThe Eiffel scholarship includes a monthly allowance of €1,400. In addition, the following benefits are covered:", " International transport: a round-trip international ticket Country of origin – France;", "National transport: a train ticket to the first study location; a train ticket from the last study location to the airport for the return to the country of origin;", "Local transport: reimbursement of up to a maximum of €50 of the trip between the airport or train station and the first study location (taxi or public transport);", "Health insurance by Campus France, for the time needed to register to French Social Security, for students from outside of the European Economic Area (EEA);", "Mutual health insurance (mutuelle);", "Cultural activities.", "\nSubject to certain conditions, students may also benefit from a housing allowance, within the 3 months following signature of the housing contract.", "For both master’s and PhD levels", "In order to receive the first instalment of the monthly allowance, students must have started their academic program at the host institution in France. An interruption of the scholarship implies an interruption of all benefits.", "\nTuition fees are not covered by the Eiffel Program.", "The French Ministry for Europe and Foreign Affairs", " expects the educational institutions, whose international influence is enhanced by this program, make sure students receive the best financial support.", "\nStudents admitted to public educational institutions are, as French government scholarship holders, exempted from enrolment fees.", "Timeline", "Opening of the call for applications: week of October 15th 2019", "Deadline for the reception of applications by Campus France:  January 11th 2019.", "Publication of results: week of March 25th 2019", "For More Information:", "Visit the Official Webpage of the French Government Eiffel Excellence Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/french-government-eiffel-excellence-scholarship-programme-2019/"], [["2019/2020 Jacobs Foundation Scholarships in youth and child development for study at the University of Oxford (Funded)", "date announced:October 30, 2018", "Application Deadline: 11 January 2019"], ["Application Deadline: 11 January 2019", "New to ", "Saïd Business School,", " the inaugural Jacobs Foundation scholars start their studies in September 2018.", "The Jacobs Foundation scholarship", " was introduced in 2018 and is open to candidates with a strong interest in the field of youth and child development. Jacobs Foundation scholars have an entrepreneurial vision, are dedicated to social issues, and usually have a minimum of three years’ work experience. The Jacobs Foundation Scholars will also be committed to the goals of the Jacobs Foundation.", "Eligibility Requirements:", "Candidates must have an interest in the following areas (in order of priority):", "Childhood development, learning education (ed-tech, early-ed, parenting, brain development);", "Agricultural development in Africa (food security, microfinance, supply-chain);", "Impact investment, with a preference for education.", "Candidates who have industry experience from the NGO, education or government sector are welcome to apply.", "Additionally, candidates must be ordinarily resident in one of the following countries:", "Andorra, Austria, Belgium, Benin, Bulgaria, Burkina Faso, Croatia, Czechia, Denmark, Estonia, Faroe Islands, Finland, France, Gambia, Germany, Ghana, Greece, Guinea, Guinea-Bissau, Holy See, Hungary, Iceland, Ireland, Italy, Ivory Coast, Latvia, Liberia, Liechtenstein, Lithuania, Luxembourg, Mali, Malta, Mauritania, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Senegal, Sierra Leone, Slovakia, Slovenia, Spain, Sweden, Switzerland, Togo, United Kingdom, United States.  (With a preference for: Senegal, Guinea, Ivory Coast, Burkina Faso, Benin, Ghana, United Kingdom, Switzerland, Germany and Romania.)", "Scholarship Worth:", "£26,500 per scholarship", "As a Jacobs Foundation scholar, you will also benefit from interaction with the Jacobs Foundation directly.", "How to Apply:", "You must submit an additional Jacobs Foundation scholarship essay in the funding section of your programme application form. This essay should cover how you meet the eligibility criteria for the scholarship and should be a maximum of 500 words.", "Deadline:", "11 January 2019", "If both scholarships are not awarded to candidates who apply by this date, candidates applying to the final MBA application deadline of 05 April 2019 will also be considered.", "For More Information:", "Visit the Official Webpage of the 2019/2020 Jacobs Foundation Scholarships "], "url : https://www.opportunitiesforafricans.com/2019-2020-jacobs-foundation-scholarships-in-youth-and-child-development/"], [["The Jim Ovia Scholarship Program 2019 for young Nigerian students", "date announced:November 7, 2018", "Application Deadline: December 26th 2018"], ["Application Deadline: December 26th 2018", "The Jim Ovia Scholarship", " was founded and funded by Mr. Jim Ovia since 1998, to provide financial aid to outstanding Nigeria youths. The scholarship was previoustly known as the MUSTE scholarship. The awardees are given funding for undergraduate study for the duration of the undergraduate program. The award includes tuition and maintenance allowance. The scheme offers an average of 100 opportunities every year. The Financial records show that as at October 2010, Mr. Ovia has invested 100 Million Naira in the program on 1500 beneficiaries.", "In establishing the Jim Ovia Scholarship, Mr. Ovia hoped to create a network of future leaders within Nigeria who can compete globally with their peers, bring new ideas, creativity and are committed to improving the lives and circumstances of people in their respective communities. Scholarships are awarded on the basis of personal intellectual ability, leadership capability and a desire to use their knowledge to contribute to society throughout Nigeria by providing service to their community and applying their talent and knowledge to improve the lives of others. Over time it is expected that the Jim Ovia Scholarship beneficiaries will become leaders in helping to address challenges related to health, technology, and finance, all areas in which the foundation is deeply engaged.", "Goals", "To promote access to tertiary education", "To invest in the future leaders of Nigeria", "To provide a platform that encourages competitiveness  and  promotes equal opportunities in workplace", "To bridge the knowledge gap among Nigerian Youth", "Eligibility and Criteria", "The scholarship is open to all undergraduate University students of Nigerian citizenship. One hundred (100) awardees are selected each year from a pool of eligible applicants. Scholarships are awarded on the basis of personal intellectual ability, leadership capability and a desire to contribute to society at large to improve the lives of others.", "For More Information:", "Visit the Official Webpage of the Jim Ovia Scholarship Program 2019 "], "url : https://www.opportunitiesforafricans.com/the-jim-ovia-scholarship-program-2019-for-young-nigerian-students/"], [["Danish Government Long-Term Scholarships 2019/2020 for Master’s & PhD Study in Denmark.", "date announced:October 16, 2018", "Application Deadline:March 1, 2019 at 23:59 (CET)"], ["Application Deadline:", "March 1, 2019 at 23:59 (CET)", "The Danish Government Scholarships", " ", "under the Cultural Agreements are aimed at highly qualified exchange students wishing to immerse themselves in studies of the Danish language and culture or other fields of study related to Denmark.", "Long-term scholarships of 5-12 months are offered to exchange students from higher education institutions in the following countries:", "Brazil", "China", "Egypt", "Japan", "Republic of Korea", "Russia", "Scholarships are only available to master’s and ph.d.-level students. However, bachelor’s degree students wishing to study Danish language and literature can also apply if they have studied the Danish language for two years.", "Please note that scholarships are only offered to students enrolled in full-degree studies at higher education institutions in the countries listed above.", "Ph.d. students must likewise be employed at, or affiliated with, higher education institutions in the above-mentioned countries.", "Applications from candidates affiliated with higher education institutions in countries other than those listed will not be taken into consideration.", "Scholarship period", "Scholarships are tenable during the academic year. The autumn term begins on September 1st, the spring term on February 1st.", "With respect to residence permits and/or visa, we recommend that accepted applicants contact the Danish diplomatic representation in their home country well in advance of their entry into Denmark.", "Scholarship amount", "Scholarships include free tuition and a monthly stipend of DKK 6,500.", "Some Danish higher education institutions may choose to charge a fee in conjunction with ph.d. courses.", "Danish Government Scholarships can be used to cover travel, visa, accommodation, food, and other living expenses. The scholarships are for one person only. Additional amounts for accompanying family members are not available.", "For More Information:", "Visit the Official Webpage of the Danish Government Long-Term Scholarships 2019/2020 "], "url : https://www.opportunitiesforafricans.com/danish-government-long-term-scholarships-2019-2020/"], [["Open Society Foundation master’s and doctoral scholarships 2019/2020 at Central European University (CEU). at Central European University", "date announced:October 26, 2018", "Application Deadline: January 31st 2019"], ["Application Deadline: January 31st 2019", "Applications are now being accepted for ", "master’s and doctoral scholarships at Central European University (CEU). ", "CEU brings together students and faculty from some 100 countries to exchange ideas in an open and dynamic community in the heart of Europe. Listed among the top 100 universities worldwide by Quacquarelli Symonds in a variety of subjects, CEU offers world-class master’s and doctoral programs in English to address the key issues of the 21st century. Besides interdisciplinary courses taught by an outstanding faculty, the university boasts a highly research-intensive learning environment and a remarkable student/faculty ratio of eight-to-one.", "CEU is accredited in the United States and Hungary, and is supported by the Open Society Foundations.", "Eligibility Criteria", "The University provides a variety of scholarships and research grants for which applicants from any country are eligible to apply.", "Academic areas and programs include the following:", "cognitive science", "economics and business", "environmental sciences and policy", "gender studies", "history", "international relations", "legal studies", "mathematics and its applications", "medieval studies", "nationalism studies", "network and data science", "philosophy", "political science", "public policy", "sociology and social anthropology", "Timeline:", "January 31, 2019 for master’s and PhD studies with financial aid", "May 1, 2019 for self-financing master’s candidates who require a study visa", "August 30, 2019 for self-financing master’s candidates who do not require", "\na study visa", "For more information about available financial aid, funding options, and research grants, ", "visit the CEU website", ".", "Applications are due January 31, 2019, to join CEU in 2019/2020 to study with a scholarship.", "For More Information:", "Visit the Official Webpage of the Open Society Foundation master’s and doctoral scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/open-society-foundation-masters-and-doctoral-scholarships-2019-2020-at-central-european-university-ceu-at-central-european-university/"], [["The Hague University of Aplied Sciences World Citizen Talent Scholarships 2018/2019 for Bachelor’s & Master’s Degree Study in the Netherlands (EUR 5,000)", "date announced:November 5, 2018", "Application Deadline: March 31st 2019"], ["Application Deadline: March 31st 2019", "Do you consider yourself a", " global citizen", "?", "Each year, a maximum of three (one-time) scholarships each worth EUR 5,000 are available to prospective master students. We are seeking intelligent, talented and ambitious people who view themselves as citizens of the world.", "You are eligible for a ", "World Citizen Talent Scholarship", " if you:", "Come from outside The Netherlands and don’t live in the Netherlands.", "Are enrolling for the first time at The Hague University of Applied Sciences.", "Have never applied for this scholarship before.", "Have been conditionally accepted as a student (also-called offer of student position) on or before 31 March for the upcoming academic year.", "Application Process", "Step 1", "Apply for the ", "Master programme", " of your choice by using the online application tool.", "Step 2", "Write an essay (in English, 950 to 1100 words ) explaining why and how you can contribute to the multinational, multicultural beehive that is The Hague University of Applied Sciences and how you can contribute to the programme of your choice. Please read our essay guidelines and information on the assessment procedure below before you start writing.", "Step 3", "Submit your essay by completing the ", "scholarship application form", " between 1 November – 31 March.", "Scholarship assessments and results", "We have appointed a committee to judge all essays. The judges will select the three students whose essays will have impressed them most to receive the scholarship. The decision of the jury is binding and you will be informed about it via email before 15 May.", "Please note that you will only be awarded the scholarship after you have been conditionally accepted and have met all terms and conditions of enrolment. Once the scholarship has been definitively awarded, the relevant amount (€ 5000)  will be waived from the tuition fee as being the last instalment.", "By submitting your essay, you are giving us the right to publish it, if we wish to. Scholarship winners are also expected to participate actively in the programme and its evaluations, become an ambassador of the Master programmes, and contribute to the internationalisation of our institution.", "If you have any questions before applying, please email us via ", "[email protected]", ".", "Please make sure you read the ‘", "Regulations for Financial Aid Master Programmes", ". It contains detailed information regarding this scholarship programme.", "For More Information:", "Visit the Official Webpage of the World Citizen Talent Scholarship 2018/2019"], "url : https://www.opportunitiesforafricans.com/world-citizen-talent-scholarship-2018-2019/"], [["The Open Society Initiative for Southern Africa (OSISA) Scholarships 2019 for African women media leaders at Rhodes University – South Africa (Fully Funded)", "date announced:November 1, 2018", "Application Deadline:  23 November  2018."], ["Application Deadline: ", " 23 November  2018.", "The Open Society Initiative for Southern Africa (OSISA)", ",", " an African institution committed to the creation of open societies through support for democracy, human rights and good governance,  invites applications for eight postgraduate scholarships from Southern African women media leaders who wish to study media management at Rhodes University’s Sol Plaatje Institute (SPI) for Media Leadership in 2019.", "Applicants should be from Angola, Mozambique, Namibia, Zambia, the DRC, Botswana, Lesotho, Malawi, Swaziland, and Zimbabwe.  Candidates from Angola, Mozambique, Namibia, the DRC and Lesotho will get priority in the selection of scholars for 2019.", "Successful applicants will register for the SPI’s intensive, one-year fulltime Postgraduate Diploma in Media Management (PDMM), the only formal media management qualification in Africa and the developing world. Candidates must already possess an undergraduate degree from a recognised university in order to pursue postgraduate study. The OSISA scholarships cover:", "The full cost of tuition", "Accommodation and meals in one of Rhodes University’s residences", "All learning materials", "A modest monthly subsistence allowance", "Medical aid", "Mid-year media management internship costs.", "Application details and procedures", ":", "Only women candidates who are already working in the media industry in the 10 Southern African countries of OSISA listed above are eligible to apply for these scholarships. Candidates should already have an undergraduate degree from a recognised university.", "The application deadline for these scholarships is 23 November 2018.", "Students wishing to apply for these scholarships need to:", "• Complete Rhodes University’s standard External Honours Application form, which is available at ", "https://www.ru.ac.za/media/rhodesuniversity/content/registrar/documents/forms/2015%20External%20Hons%20Applications.pdf", "), which ", "must", " be submitted directly to the Registrar’s Division at Rhodes University and a copy emailed to Sibonise Mbengashe (", "[email protected]", ") at the Sol Plaatje Institute for Media Leadership. They must also complete the application form for the PDMM, which is available at ", "https://www.ru.ac.za/spi/studying/", " and send it to both the Registrar’s Division and the SPI’s Sibonise Mbengashe (", "[email protected]", ").", "• Submit a detailed CV, including email and phone contact details. This is sent to the SPI only.", "• Submit certified academic transcripts of ALL tertiary qualifications. These are sent to both the SPI and Registrar’s Division at Rhodes University; and", "• Submit to the SPI, through Sibonise, a 1,000-word letter of motivation, which explains why the student is interested in doing the PDMM, how the PDMM will assist the student’s career and why the student believes she qualifies for the OSISA scholarship.", "Only short-listed candidates will be contacted after the applications close at noon on 23 November  2018.", " ", "For More Information:", "Visit the Official Webpage of the OSISA Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/osisa-scholarships-2019-for-african-women-media-leaders/"], [["Sciences Po Emile-Boutmy (Undergraduate & Postgraduate) Scholarships 2019/2020 for Study in France (Funded)", "date announced:October 24, 2018", "Application Deadline: April 8, 2019"], ["Application Deadline: ", "April 8, 2019", "Sciences Po created the ", "Emile-Boutmy scholarship", ", named after the founder of Sciences Po (1871), in order to welcome the very best international students from outside the European Union. The Emile Boutmy Scholarship is awarded to top students whose profiles match the admissions priorities of Sciences Po and individual course requirements.", "Eligibility requirements", "To be eligible for the scholarship, students must be, ", "first time applicants", ", from a ", "non-European Union state, whose household does not file taxes within the European Union,", " and who have been admitted to the Undergraduate or Master’s programme.", "Students who are not eligible are:", "Swiss and Norwegian applicants, since they may be entitled to CROUS scholarships", "Candidates who have dual citizenship, including an EU citizenship", "Candidates from Quebec for master’s degree (since they may take advantage of sliding scale fees same as European applicants). Candidates from Quebec for a bachelor’s degree are eligible", "Master’s level dual-degree candidates. Only applicants for the following dual degrees are eligible:\n", "the dual degree in Journalism Sciences Po/Columbia University", "the dual degree Sciences Po/Fudan University with the concentration Europe-Asia in Global Affairs (only applicants with Chinese nationality)", "the dual degree Sciences Po/Peking University (only applicants with Chinese nationality)", "Ph.D. programme students (thesis)", "Candidates for the 1 year Master’s programmes", "Exchange students", "The Emile-Boutmy scholarship", " may not be combined with other scholarship (Eiffel scholarship, AEFE scholarship, BGF…).", "This scholarship is awarded based on ", "merit and according to the type of profile sought for this programme", ". Social criteria are also taken into account.", "Bachelor’s degree programme: Amount and length of the scholarship for the 2019-2020 Academic year", "The Emile-Boutmy scholarship is ", "awarded to students arriving at Sciences Po for their first year of studies.", "\nThe Emile-Boutmy programme can take several ", "different forms", ":", "A tuition grant of €7,300 per year for the three years of the undergraduate programme, in addition to a grant to cover part of the cost of living of €5000 per year.", "A tuition grant of €7,300 per year for the three years of the undergraduate programme.", "A tuition grant of €5,000 per year for the three years of the undergraduate programme.", "A tuition grant of €3,000 per year for the three years of the undergraduate programme.", "On an exceptional basis, a scholarship of 19,000€ may be granted to cover the three years of College. Scholarship amounts are decided during the different admission juries.", "\nIf you do not validate your academic year, your scholarship will be lost.", "\nIf you have been granted for a scholarship and decide to defer your admission, your scholarship will be lost.", "During the year abroad (third year of the undergraduate programme):", " scholarship recipients will retain their tuition fee grant and additional cost of living grant (if applicable).", "Masters level: Amount and length of the scholarship for the 2019-2020 Academic year", "The Emile-Boutmy scholarship is ", "awarded to students arriving at Sciences Po for their first year of study.", "The Emile-Boutmy programme can take two ", "different forms", ":", "A grant of €10,000 per year to cover tuition fees for the two years of the Masters", "A tuition grant of €5,000 per year for the two years of the Masters.", "If you do not validate your academic year, your scholarship will be lost.", "If you have been granted for a scholarship and you decide to defer your admission, your scholarship will be lost.", "Deadlines", "Deadline for undergraduate programme: ", "April 8, 2019", "Deadline for master programme: ", "January 3, 2019", "For More Information:", "Visit the Official Webpage of the Sciences Po Emile-Boutmy (Undergraduate & Postgraduate) Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/sciences-po-emile-boutmy-undergraduate-postgraduate-scholarship-2019-2020/"], [["2019/2020 Tunisia Community College Scholarship Program for young Tunisians to study in USA (Fully Funded)", "date announced:October 29, 2018", "Application Deadline: Monday, November 26, 2018, at 5 p.m. Tunisia time."], ["Application Deadline: Monday, November 26, 2018, at 5 p.m. Tunisia time.", "As a part of the Thomas Jefferson Scholarship Program, th", "e", " 2019-2020 Tunisia Community College Scholarship Program", ",", " a program sponsored by ", "the Bureau of Educational and Cultural Affairs of the United States Department of State,", " supported by the people of the United States, and implemented by IREX, provides opportunities for young students from Tunisia studying at ISETs (Institut Supérieur des Études Technologiques), IHET (Institut des Haute Études Touristiques), and ISSATs (Institut Supérieur des Sciences Appliquées et de Technologie) who wish to improve their vocational skills by spending one academic year studying at accredited U.S. community colleges with the goal of earning a professional certificate in eligible fields of study from their U.S. institution.", "Participants may submit U.S. transcripts to their home institution for review upon completion of the program to determine if the credits are transferrable. Participants will attend accredited community colleges and will live in on-campus housing (dormitories) or in off-campus housing. Participants may not choose their U.S. host institution.", "\nFor the 2019-2020 Academic Year the following fields of study are eligible:", "\n• Applied Engineering", "\n• Business Management and Administration", "\n• Information Technology", "\n• Tourism and Hospitality Management", "Eligibility Requirements:", "Competition for the ", "Tunisia Community College Scholarship Program", " is merit-based and open to anyone who:", "\n• Is a citizen of Tunisia;", "\n• Is currently residing in Tunisia;", "\n• Is currently enrolled as a first- or second-year full-time undergraduate (Licence) student in good academic standing at the time of application at an ISET (Institut Supérieur des Etudes Technologiques), IHET (Institut Supérieur des Etudes Touristiques), or ISSAT (Institut Supérieur des Sciences Appliquées et de Technologie);", "\n• Is able to receive and maintain a U.S. J-1 visa;", "\n• Is committed to returning to Tunisia after completion of the program;", "\n• Is able to achieve a TOEFL score of 440 (PBT) or likely to achieve this score after short-term pre-academic English training in the United States prior to the start of the academic year; and", "\n• Is at least 18 years old by July 1, 2019.", "Benefits:", "FINANCIAL PROVISIONS OF THE GRANT", "\n• J-1 visa support;", "\n• Round-trip travel from participant’s home city to host institution in the United States;", "\n• Accident and sickness coverage;", "\n• Tuition and mandatory university fees;", "\n• Room and board (housing and meals);", "\n• Small incidentals allowance;", "\n• Limited allowance for books;", "\n• A wide variety of alumni networking and training opportunities", "SELECTION PROCESS AND CRITERIA", "\nTCCSP is conducted as an open, merit-based competition. After the deadline, all eligible applications will be reviewed by a panel of academic specialists. Chosen semi-finalists will be interviewed in Tunisia by a committee of U.S. Embassy representatives, USG exchange program alumni, and/or U.S. specialists, and must take the Test of English as a Foreign Language (TOEFL) in early 2019. All applicants will be notified of their status by spring 2019.", "\nSelection panels will use the following criteria to evaluate applications (not in order of importance):", "\n• Demonstrated academic and/or technical interest in one of the identified fields of study;", "\n• Quality of academic marks and academic standing;", "\n• Cross-cultural interest;", "\n• Flexibility and adaptability as an exchange student;", "\n• Demonstrated leadership potential and commitment to community engagement;", "\n• Proficiency in written and spoken English;", "\n• Expressed commitment to contribute to Tunisia’s development;", "\n• Preference will be given to students who represent disadvantaged and underrepresented communities.", "\nWomen, minorities, persons with disabilities and applicants from all governorates in Tunisia are strongly encouraged to apply.", "Application Procedure:", "A completed application includes:", "\n• Application Questions: Applicants must provide complete information for all questions.", "\n• Short Answers (1–7): Applicants must answer each question and use no more than 250 words per response. Answers must be the applicant’s own work.", "\n• IREX Privacy Statement and Application Certification: Applicants must read and sign this form in order to verify that they understand IREX’s privacy policy and that they have completed their applications truthfully.", "\n• Two Recommendation Forms: Applicants must have a recommendation completed by two different people for a total of two recommendations. If the recommendation form is completed in a language other than English, there must be an accurate translation, which may be done by the applicant.", "\n• Course Listings Form. This space is provided for the applicants to detail all higher education course history. Applicants must list the academic year the course was taken, the course title, and the grade received for the course in order for the form to be completed. If there was no grade for a course, please indicate either “pass” or “fail.” Participants must list courses from your most recently completed year of study, either secondary school or higher education in order for the form to be completed.", "For More Information:", "Visit the Official Webpage of the 2019/2020 Tunisia Community College Scholarship Program"], "url : https://www.opportunitiesforafricans.com/2019-2020-tunisia-community-college-scholarship-program-for-young-tunisians/"], [["The Global South Climate Scholarships for Youth (Fully Funded to the UNFCCC’s 24rd Conference of Parties (COP 24) & the 14th Conference of Youth (COY 14) in Katowice, Poland)", "date announced:October 22, 2018", "Application Deadline:October 27, 2018"], ["Application Deadline:", "October 27, 2018", "The Global South Climate Scholarships for Youth", " shall cover all costs of travel (to and from international tickets), accommodation, visa, travel insurance fee, food, local transport and other costs for the selected applicants to participate both in t", "he UNFCCC’s 24rd Conference of Parties (COP 24)", " and ", "the 14th Conference of Youth (COY 14) in Katowice, Poland", " in December 2018, also providing the selected applicants with online Capacity Building Training sessions about the process, prior to their travel to Katowice.", "Benefits:", "Have all your expenses covered for participating at the 24th UNFCCC Conference of Parties (COP24) and the 14th Conference of Youth 14 (COY14)", "\nThe funding benefits cover the following:", "Costs for all international and domestic flight tickets", "Costs incurred during the visa application process", "Costs of accommodation for about 18 days (from 28 November 2018 to 15 December 2018 – the duration comprising COY14 and COP24) in Katowice, Poland", "Costs of food for the entire duration, travel insurance, local transport and any other reasonable expenditure dur the the stay in Poland.", "Eligibility Requirements:", "To be eligible for ", "Global South Climate Scholarships for youth,", " you, as an applicant, must ensure that:", " You are under 35 years of age on 31 October 2018", "If selected, you will be available to join the 14th Conference of Youth (COY14) and the 24th Conference of Parties of UNFCCC (COP24) in Katowice, Poland for the ", "full duration (from about 27 November 2018 to 15 December 2018)", " and shall also engage proactively in the preparation phase leading to activities in Katowice.", " ", "– Able to secure a formal registration (known as “accreditation”) from the UNFCCC in order to attend both weeks of COP24. Accreditation can only be provided by “admitted observer organizations” (https://unfccc.int/process/parties-non-party-stakeholders/non-party-stakeholders/admitted-ngos/list-of-admitted-ngos) or governments. Without accreditation, it is not possible for you to attend COP24 and thus be able to participate in the GSCSY. If you are affiliated with an NGO or government that can provide you with accreditation, please indicate this at the requested point in your application.", " If you are not able to provide your own source of accreditation, then you are still welcome to apply for the GSCSY, but your eligibility will be contingent upon the GSCSY Team being able to find a source of accreditation on your behalf. Please know that all accreditations are strictly controlled by the UNFCCC, and as such, the GSCSY team CANNOT guarantee being able to find you accreditation for COP24 (and if we cannot find it, then any applications without it will unfortunately be ineligible). Thank you for your understanding.", "\n– And you ensure us that, you will be available to travel to Poland for the full duration of COY14 and COP24 – from 26 November 2018 until 16 December 2018 and shall also be able to get engaged in the preparatory phase online!", " ", "Your application can be counted as invalid if:", "\n– your details are incorrect/incomplete and/ or the application has obvious mistakes,", "\n– responses exceed the word limits,", "\n– false statements are given, ", " ", " ", "For More Information:", "Visit the Official Webpage of the Global South Climate Scholarships for Youth"], "url : https://www.opportunitiesforafricans.com/the-global-south-climate-scholarships/"], [["The Department of Environmental Affairs’ (DEA) Undergraduate & Postgraduate bursaries 2019 for young South Africans", "date announced:October 23, 2018", "Application Deadline:  09 November 2018."], ["Application Deadline: ", " 09 November 2018", ".", "The department offers bursaries to previously disadvantage South African citizens; the purpose of the programme is to establish an effective system for continuous development of qualified candidates for future appointments and mobility in both the public and private sector.", "Objectives", "The Department of Environmental Affairs’ (DEA) programme", " seeks to achieve the following objectives:", "Enhance youth development", "Develop a culture of high quality lifelong learning within Department of Environmental Affairs", "Application Procedure:", "Consideration will be given to previously disadvantaged and people with disability who are South African citizens and have successfully completed their first year of undergraduate study or those who are currently registered for postgraduate studies. However, strongly motivated applications from first-year students within the above mentioned fields of study will also be considered. The maximum amount of the bursary is R40 000.00", "All applications should be accompanied by the following documents:", "Motivation as to why the bursary should be awarded to you.", "Certified copies of qualifications and recent academic records", "Certified copies of Identity Document (Applicant and the both parents or guardian)", "Acceptance letter from first year students", "Proof of registration (if already enrolled with the institution of higher learning)", "Proof of parents or guardian’s income", "Must be a South African citizen", "Proof if parents are deceased", "Affidavit if parents are not working", "Fields of Study:", "Biodiversity and Conservation (Ref: BC/01/2019)", "BSc / B-Tech / MTech / Honours / Masters / Postgraduate / PhD Biological Sciences; Microbiology; Plant Pathology; Molecular Biology and Genetics)", "BSc / B-Tech /M-Tech / Honours / Masters / Postgraduate / PhD (Environmental Management; Geography; Biological Sciences and Climatology)", "ND / Bachelor’sdegree / BTech / MTech / Honours  /Masters / Postgraduate / PhD Environmental Science / Management, Geography, Town and Regional Planning, Development Studies, Soil Sciences, or Natural Sciences; Aquatic health", "Bachelor of Science / B-Tech / M-Tech / Honours / Masters / Post-graduate /PhD (Natural Sciences, Biological Sciences, Environmental Management, Environmental Planning)", "Bachelor of Science / BTech / MTech / Honours / Masters / Postgraduate / PhD (Natural Sciences, Biological Sciences, Botany, Zoology Conservation management and Biodiversity conservation)", "Bachelor’s degree / National Diploma / BTech / MTech / Honours / Masters / Postgraduate / PhD in Environmental Science/Management, Geography, Town and Regional Planning, Development Studies, Soil Sciences, or Natural Sciences", "National Diploma, B-Tech/Bcom, Honours, Masters/MBA Resource Economics (Ecology, CBNRM, business management & administration)", "Diploma, BA social sciences, Honours, Masters Social sciences (community)", "National Diploma, B-Tech, Honours, Masters Zoology / Ecology / Environmental Conservation", "National Diploma, B-Tech, Honours, Masters BHCS Heritage and Cultural Studies", "National Diploma, B-Tech, Honours, Masters Cultural and Natural Resource Management", "National Diploma, Degree, Honours, Masters BSc Nature Conservation", "Chemicals and Waste Management (Ref: CWM/01/2019) ", "ND / B Degree / Hons / MSc / MTech Environmental Science", "B Degree / Honours / MSc / MTech Environmental Management", "B Degree / Hons/ MSc / MTech Chemical Engineering / Chemistry", "B Degree / Hons/ MSc / MTech Biochemistry or Microbiology", "B Degree / Honours / MSc / MTech Waste Management", "B Degree / Hons/ MSc / MTech Environmental Health", "B Degree / Hons/ M Sc/ MA Geography", "B Degree / ND / Hons / M Sc Environmental Economics", "MSc Natural Sciences (Biology / Zoology /Botany/ Ecology / Physiology / Applied Chemistry / Biochemistry / Microbiology / Endocrinology / Entomology)", "Chief Operating Officer (Ref: COO/01/2019)", "ND/ BSc / Honours / Masters Environmental Science / Environmental Management", "Bachelor s degree / Honours / Masters/ PhD Environmental Monitoring, Compliance, Enforcement and Control", "Degree, honours, masters Climate change and sustainability management", "Honours, masters, PhD Environmental research and development", "Degree, Honours, Masters, PhD Environmental Engineering", "Degree, honours, masters Environmental Health", "Degree Risk Management", "ND/ Degree Internal Audit", "Degree Information Management/ Information Systems", "Post-graduate Public Administration/ Public Management / Governance", "Climate Change and Air Quality Management and Sustainbaility Management (Ref: CCAQ /01/2019)", "BSc / ND Environmental Science", "BSc / ND Environmental Management", "ND / B Degree Earth Science", "ND / B Degree Natural Science", "ND / B Degree Conservation", "B Sc Chemistry", "ND / B Degree Hydrology", "Environmental Programmes (Ref: EP/01/2019) ", "BSc (Botany / Zoology / Molecular Biology / Genetics / Microbiology / Biochemistry/ Environmental Science)", "ND / Degree Forensic Science", "ND / Degree Industrial and Applied Biotechnology", "ND / Degree Crop and Horticulture Science", "B Sc: ConsEcol", "B Sc: Environmental Science (Biological Resources / Water Resources / People and the Environment / Environmental Economics / Environmental Law", "ND / BTech: Forestry", "ND / BTech Nature Conservation", "BSc Biological Sciences", "LLM : Law of contracts / Procedural Law", "Legal Authorisations and Enforcement (Ref: LACE/01/2019)", "LLB (Major courses Administrative law, legislative drafting)", "LLM", "B.A Law", "A Diploma or Degree in Paralegal", "Bachelor of Environmental Management (majoring in Animal and wildlife management)", "BSc in Chemistry", "BSc majoring in Geography", "Bachelor of Environmental Management majoring in Environmental Impact Assessment", "BSc Chemistry, Botany", "Oceans and Coast (Ref: OC/01/2019)", "ND/B Tech/ B Sc Hons/ M Sc/ PhD: Marine Science", "B Sc Zoology", "B Sc Environmental Economics", "B-Tech / M Tech: Oceanography", "B Sc Environmental Science / Management", "PhD: Taxonomy (Zooplankton / Phytoplankton)", "B Sc /  B Sc Hons / M Sc /  PhD: Marine Remote Sensing", "B Degree Coastal Management", "B Degree Town and Regional planning", "B Degree Social Development Studies", "Application form and advert:", "» ", "Download the advert", " [PDF]", "» ", "Download the application form", " [PDF]", "For More Information:", "Visit the Official Webpage of the DEA Undergraduate & Postgraduate bursaries 2019 "], "url : https://www.opportunitiesforafricans.com/the-department-of-environmental-affairs-dea-undergraduate-postgraduate-bursaries-2019/"], [["Nordic Africa Institute Claude Ake Visiting Chair Scholarships 2019 for Researchers in African Countries (Funded to Sweden)", "date announced:October 19, 2018", "Application Deadline: 1 December 2018"], ["Application Deadline: ", "1 December 2018", "The Claude Ake Visiting Chair", " is a co-financed collaboration between the Department of Peace and Conflict Research, Uppsala University, and the ", "Nordic Africa Institute.", " The purpose of the scholarship programme is to honor the memory of Professor Claude Ake, prominent African scholar, philosopher and humanist, and to invite applications from internationally recognized senior scholars with professorial competence in their respective fields of expertise.", "The Claude Ake Visiting Chair was set up in 2003 at the ", "Department of Peace and Conflict Research", ", Uppsala University (DPCR), in collaboration with the Nordic Africa Institute (NAI) and with funding from the Swedish Government and Uppsala University. The Chair honours the memory of  ", "Professor Claude Ake", ", a distinguished scholar, philosopher, teacher and humanist, who died tragically in 1996. The Chair is intended for scholars who, like Claude Ake, combine a profound commitment to scholarship with a strong advocacy for social justice.", "The Chair is open to social scientists working at African universities with problems related to war, peace, conflict resolution, human rights, democracy and development on the African continent.The visiting chair holder is offered a conducive environment to pursue his or her own research, while there is also opportunity for lecturing, holding seminars and contributing to ongoing research activities at the Department of Peace and Conflict Research and the Nordic Africa Institute.", "Application and Appointment", "The Department of Peace and Conflict Research and the Nordic Africa Institute currently invite applications to the Claude Ake Visiting Chair for 2019. Applicants should be internationally recognized senior scholars with professorial competence in their respective fields of expertise. Normally, this translates to Professor, Associate Professor, or their equivalence. The Chair holder is expected to spend three (3) months in Uppsala in the time-span mid-August to mid December 2019. Applications from female candidates are encouraged.", "The application must contain:", "A complete and updated curriculum vitae (CV), including relevant information regarding academic title, current and previous positions, research and teaching activities, and a list of publications. It should also include all relevant contact information.", "A short abstract of the research project to be carried out as visiting chair holder.", "A research proposal outlining the main features of the research project to be carried out during the visit including the expected results. The preferred time period for the visit during 2019 should also be stated. Please note that arrival in Uppsala should be avoided during the academic recess period of mid-June to mid- August. The length of the proposal should be a minimum of 3 and a maximum of 5 pages.", "Two of the applicant’s publications. These should normally be the two most important articles related to the research project to be pursued during the visit.", "A signed letter of nomination from a senior scholar in the same field. Nominations may come from individual scholars/colleagues, including former Claude Ake Visiting Chairs, and must include a motivation for the nomination.", "A signed letter from the applicant’s Head of Department or Dean (or equivalent) which confirms that the application is supported by the institution with which the nominee is affiliated.", "Terms", "The awardee is entitled to a tax-free stipend/scholarship of 25 000 SEK/month.", "If the awardee is absent from Uppsala for reasons not associated with the program, deductions will be made to the stipend/scholarship.", "In addition, travel costs and accommodation for the holder of the position, and, if relevant, his/her accompanying spouse/significant other, are covered by the grant.", "The Chair holder is provided office space at the DPCR and NAI, and basic office equipment.", "Deadline for applications: 1 December 2018", "Please note that incomplete applications or applications received after this date will not be considered. Applications should be sent either via regular mail or e-mail. Also note that the Claude Ake Visiting Chair is dependent on external funding. In the extraordinary event that the program does not receive full funding – and the awarded position is withdrawn or the size of the scholarship reduced – the awardee or applicants will be informed immediately.", "\nAddresses for the submission of applications: E-mail: ", "[email protected]", "\nOR", "\nThe Nordic Africa Institute Att: The Claude Ake Visiting Chair Box 1703 751 47 Uppsala SWEDEN", "For More Information:", "Visit the Official Webpage of the Nordic Africa Institute Claude Ake Visiting Chair Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/nordic-africa-institute-claude-ake-visiting-chair-scholarships-2019/"], [["2019 DAAD Re-invitation Programme for Former Scholarship Holders (Funded)", "date announced:October 18, 2018", "Application Deadline: April 1st, 2019"], ["Application Deadline: April 1st, 2019", "DAAD grants", " offer students and academics and scientists the opportunity to carry out research and continue their education in Germany. There are funding programmes for various qualification phases and stages in a career.", "2019 DAAD Re-invitation Programme for Former Scholarship Holders", "The aim of this programme is to enable former scholarship holders to carry out research and working projects in Germany and to maintain contacts as part of", " DAAD’s global alumni network.", "Eligibility Requirements:", "Former holders of DAAD research grants or study scholarships, who were funded for a period of over six months", "Former East German scholarship holders who studied for at least one year in Germany", "Funding:", "Research and working projects at state or state-recognised institutions of higher education or non-university research institutes in Germany", "Working stays at an institution in business, administration, culture or media for former scholarship holders who work outside the science sector.", "A research or working visit can also take place at several host institutions.", "Funding may only be claimed once within three years.", "Duration of the funding", "One to three months; the length of the grant is decided by a selection committee and depends on the project in question and the applicant’s work schedule.", "The grant is non-renewable.", "Value", "Monthly payments of", "\n2,000 euros for assistant teachers, assistant professors and lecturers", "\n2,150 euros for professors", "Monthly payments for former scholarship holders who work outside the science sector will be calculated based upon their qualifications accordingly.", "Travel allowance, unless these expenses are covered by the home country or another source of funding.", "Other payments cannot be made.", "Selection", "An independent selection committee reviews applications.", "The most important selection criteria are:", "Academic achievements and, if applicable, publications, which must be documented in the curriculum vitae and a list of publications", "A convincing and well-planned research or work project", "In the case of working stays outside the science sector, particular attention is paid to the following questions:", "\n– Will the stay in Germany have a sustainable effect on your professional activity?", "\n– Can you expect it to have multiplier effects, for example, in the form of planned publications?", "\n– Will your stay in Germany promote existing cooperations?", "Application Requirements:", "Applicants must have returned to their home country at least three years previously.", "The research or working project must be coordinated with a cooperation partner in Germany.", "Application Procedure:", "The application procedure occurs online through the DAAD portal. The access to the DAAD portal opens about 6 weeks before the application deadline.", "Application documents", "Documents to be uploaded to the DAAD portal", "Online application form", "Full curriculum vitae in tabular form (max. 3 pages)", "If necessary, list of academic publications", "Comprehensive statement about research or working project (max. 10 pages)", "Time schedule and itinerary (host institutions / cooperation partners) of planned research or working visit", "Letter from host institution confirming academic cooperation, which refers to the applicant’s proposal and guarantees that the project will be supervised and a workplace provided", "Application deadline", "October 31, 2018 for research stays starting from April 2019", "\nApril 1, 2019 for Research stays starting from August 2019", "Please note", "Your application is only valid if you submit all the required documents to the DAAD portal on time.", "(If documents are to be submitted by post, please send them as soon as possible.)", "The DAAD portal closes at 24.00 hrs. Central European Time (CET) on the last application day.", "Late or incomplete applications cannot be considered. Applicants are responsible for ensuring that their applications are complete.", "The application documents remain with the DAAD. Data relating to applicants is saved by the DAAD in accordance with the Federal Data Protection Act and with the EU Data Protection Regulation insofar as this data is needed to process the application.", "For More Information:", "Visit the Official Webpage of the DAAD Re-invitation Programme for Former Scholarship Holders "], "url : https://www.opportunitiesforafricans.com/2019-daad-re-invitation-programme-for-former-scholarship-holders/"], [["The Mandela Institute for Development Studies (MINDS) Pan-African Scholarship 2019 for Leadership Development Program (Fully Funded)", "date announced:October 26, 2018", "Application Deadline: Ongoing"], ["Application Deadline: Ongoing", "The ", "MINDS Scholarship Programme for Leadership Development", " in Africa was successfully launched in 2017, bringing to realisation our vision of developing young leaders who have a continent-wide development mindset and leaders who can facilitate greater cooperation between African countries.", "The MINDS Scholarship Programme", " enables African students to study in an African country other than their home country and in this way immerse themselves in richness and diversity that the country and its communities has to offer. By broadening access to education, we see the expansion of openness to ideas and the creation of a network of like-minded leaders who will help promote the performance and tangible progress of our continent. There is no doubt that a more integrated African economy of global scale will accelerate growth, generate positive outcomes and benefit all its communities.", "Eligibility Criteria", "MINDS Scholarships are awarded to meritorious applicants following a rigorous selection process.  To be considered for a MINDS Scholarship, you must:", "Be a national of an African country, residing in any African country", "Have been formally accepted by one or more MINDS preferred institution/s outside of your country of citizenship and/ or residency", "Have been formally accepted by one or more MINDS preferred institution/s to pursue postgraduate studies within the following year", "Have obtained at least 70% in each subject/ course in the last two completed years of study", "Produce evidence of demonstrated leadership abilities or potential guided by the questions/ requirements set out in the application form", "Submit a complete online application form (see below) with the required supporting documentation.", "List of Preferred Institutions:", "To be eligible to receive a MINDS Scholarship, an applicant must have been accepted to study at one of the following institutions:", "EAST AFRICA", "African Leadership University, Rwanda", "Carnegie Mellon University in Rwanda, Rwanda", "Makerere University, Uganda", "Strathmore University, Kenya", "SOUTHERN AFRICA", "African Leadership University, Mauritius", "University of Cape Town, South Africa", "University of Mauritius, Mauritius", "University of Witwatersrand, South Africa", "NORTH AFRICA", "Al Akhawayn University, Morocco", "Université Cadi Ayyad, Morocco", "Université Mohammed V, Morocco", "WEST AFRICA", "Kwame Nkrumah University of Science & Technology, Ghana", "Pan-Atlantic University (Lagos Business School), Nigeria", "University of Development Studies, Ghana", "MINDS’ offers scholarships to Africans who wish to pursue post-graduate studies within Africa, outside of their own countries. Through tailored leadership development activities, the ", "MINDS", " ", "Scholarship Programme", " aims to nurture leaders who have a continental development mindset; leaders who will facilitate greater cohesion and cooperation between African countries.", "MINDS Scholarships are applicable to full-time studies of a one or two-year Honors or Master’s degree at one of the MINDS preferred institutions (listed below). MINDS does not prescribe the course to be studied.", "The Scholarship will cover some or all of the expenses below, depending on whether a partial or full scholarship is awarded:", "Tuition", "Accommodation and meals", "One return ticket per duration of studies", "A fixed stipend.", "Individuals with a Pan-African outlook, demonstrated leadership ability and an excellent academic record who wish to study on the African continent, outside their home country are invited to apply for the scholarships.", "SPECIAL SCHOLARSHIPS:", " ", "Besides the general scholarships, MINDS is also offering the following specific ones with special criteria determined by our funding partners:", "Nedbank", "The scholarships are only for South African students to study at any of the MINDS preferred universities outside South Africa. The scholarships are not specific to a field of study.", "Old Mutual ", "The scholarships are for students from any African country to study actuarial sciences, business sciences and accounting, IT and developmental finance in South African, Kenyan and Nigerian institutions on the MINDS preferred universities list.", "Diamond Empowerment Fund", "The scholarships will fund African post-graduate study at the University of Witwatersrand in a highly skilled discipline of study e.g. engineering, biotechnology, aerospace, nanotechnology, neuroscience, artificial intelligence, ICT law, mining taxation. Candidates must be from an African diamond mining country.", "Government of Rwanda", "The scholarships are for students from Rwanda to study at any of the universities on the MINDS preferred list but outside Rwanda. The scholarships are not specific to a field of study.", "Application Procedure", "Applications will be processed in the order they are received.", "If you meet the eligibility criteria above, you can submit your application by clicking on the link below. Please have the following documents scanned, saved and ready for uploading. All documents uploaded must be in PDF format. Each attachment should ", "not exceed", " 2MB in size.", "A copy of the data/ bio page of your passport.", "A certified academic transcript/ results slip of the last two years of study.", "A copy of the official acceptance letter from the university. The letter must:\n", "Be addressed to the applicant.", "State the degree which the applicant has been accepted to study.", "State the academic year at which the degree will commence.", "State the duration of the course (e.g. one year).", "A copy of a valid study permit or visa OR proof of application. (Optional)", "A detailed CV/ Resume of not more than four (4) single sided pages.", "Two reference letters (of not more than 3 pages each) addressing the applicant’s demonstration of integrity, their competency and/or potential as a leader and their commitment to the development of the African continent.", "For More Information:", "Visit the Official Webpage of the The Mandela Institute for Development Studies (MINDS) Pan-African Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/minds-pan-african-scholarship-2019-for-leadership-development-program/"], [["Canon Collins Trust Master of Laws (LLM) Scholarships 2019 for study at the University of London.", "date announced:October 22, 2018", "Application Deadline: 17:00 BST on Fri, 11 January 2019. "], ["Application Deadline: ", "17:00 BST on Fri, 11 January 2019. ", "The Canon Collins Trust Master of Laws (LLM) Scholarships", " allow individuals to study for the ", "Postgraduate Certificate, Postgraduate Diploma and/or the Master of Laws", " (LLM) by distance learning, at the University of London. Applicants can start at any level, and do not need to complete the whole programme. For example, applicants can start at Postgraduate Certificate level and work their way through to the LLM, or can stop after completing the PG Certificate. Applicants who have completed an undergraduate degree may start at LLM level, skipping the PG Certificate and Diploma.", "Requirements:", "Applicants for this scholarship must be:", "a national of, or have refugee status in, one of the following countries: Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia, Zimbabwe", "normally resident in one of these countries", "in possession of the necessary qualifications required for admission to the programme;", "currently employed in full or part-time work;", "able to commit a minimum of 10 hours to study per week.", "Benefits:", "These scholarships are made possible by the generosity of the ", "University of London", ", who will waiver full tuition and examination entry fees for four scholarship recipients.", "Local examination fees are not included. Scholarship recipients have between 1 to 5 years to complete the programmes, and continued registration on the course is dependent upon satisfactory progress and academic reports. For more information on the course please view the ", "prospectus", ".", "The University of London and Canon Collins Trust will jointly select the recipients of this award.", "For More Information:", "Visit the Official Webpage of the Canon Collins Trust Master of Laws (LLM) Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/canon-collins-trust-master-of-laws-llm-scholarships-2019/"]]