[[["Ghana National Petroleum Corporation (GNPC) Local Undergraduate & Postgraduate Scholarships 2019/2020 for young Ghanaians", "date announced:August 24, 2019", "Application Deadline: September 13th 2019"], ["Application Deadline: September 13th 2019", " The Ghana National Petroleum Corporation (GNPC)", " is offering limited Undergraduate and Postgraduate scholarship, through the GNPC Foundation, to prospective Ghanaian students for the 2019/2020 academic year. The scholarship is for degree courses and are tenable at accredited ", "Public Tertiary Institutions", " in Ghana. The scholarship covers Tuition, Living Expenses, Book Allowance and Dissertation/Project Allowance. ", "GENERAL ELIGIBILITY", "\nApplicant must: ", "\nI.\tBe Ghanaian, ", "\nII.\tHave obtained admission to undertake an Undergraduate or Postgraduate Degree Program at a ", "local public tertiary Institution", " at the time of application.\n", "PREFERENCE", "\nPreference would be given to: ", "\n1.\tScience, Technology, Engineering and Mathematics (STEM) ", "\n2.\tSpecial Needs Education and B. Ed Programs ", "\n3.\tFirst Year Students ", "\n4.\tPhysically challenged\n", "DOCUMENTS REQUIRED", "Undergraduate ", "\n•\tAdmission letter", "\n•\tWASSCE results ", "\n•\tTestimonial ", "\n•\tBirth certificate ", "\n•\tPassport picture\n", "Postgraduate ", "\n•\tAdmission letter ", "\n•\tPublication (if any) ", "\n•\tPassport picture", "\n•\tRecommendation letters (academic and occupational)", "\n•\tCertificates\n", "MODE OF APPLICATION", "\nA.\tComplete and Submit Application online via ", "THIS LINK", " (With relevant documentations uploaded)\n", "APPLICATION PROCESS", "\n1)\tNew (fresh) applicants should click on online application to begin a new application (i.e. access the application form page)", "\n2)\tApplicants should provide necessary details with correct and active e-mail.", "\n3)\tPin will be generated and sent to your e-mail. Do note that pin may be sent to spam/junk e-mail in some cases", "\n4) Applicants should reassess the application page with the correct telephone number and pin provided.\n", "NB: For any enquiries contact GNPC Foundation on 0302975847", "DEADLINES", "\nPostgraduate – 30th August 2019 ", "\nUndergraduate – 13th September 2019\n", "For More Information:", "Visit the Official Webpage of the GNPC Local Undergraduate & Postgraduate Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/ghana-national-petroleum-corporation-gnpc-local-undergraduate-postgraduate-scholarships-2019-2020/"], [["Doug Banks Renewable Energy Vision Postgraduate Scholarships 2019/2020 in Renewable Energy, South Africa", "date announced:August 22, 2019", "Application Deadline: September 30th 2019"], ["Application Deadline: September 30th 2019", "The DBREV Trustees", " ", "are pleased to offer a scholarship towards a two year full time postgraduate degree in the field of Renewable Energy in Africa, to be taken up at a South African University starting in 2020. The aim of the DBREV Trust is to identify, support and mentor bright young people who have a desire to help solve the Energy Poverty challenges of Africa.", "Students\nin the disciplines of engineering, built environment, technology,\nscience, or law are invited to apply for the 2020 DBREV Scholarship.", "The\ncentral expectation of the Scholarship is that each Scholar’s work\ncontributes toward their knowledge and understanding of issues and\ntechnologies related to the provision of Renewable Energy solutions to\ncommunities that otherwise have limited or no access to energy\nresources, in an African context. Applicants will be considered provided\nthat the focus of their proposed course of study will be to advance\nthis key expectation.", "The\nScholarship is to be used towards tuition fees and a living allowance.\nSome additional support for equipment, field trips or conferences may be\nawarded at the discretion of the Trustees. A special feature of this\nscholarship is the additional opportunity of mentorship by experts in\nthe field, many of whom were colleagues of Dr Doug Banks.", "Selection will be made on the basis of evident passion and commitment to the use of renewable energy in Africa especially in relieving Energy Poverty, together with academic merit.\nThe successful candidate will be expected to help carry forward the\nvision of the DBREV Trust, and be willing to act as mentor to future\nDBREV Scholarship recipients.", "The\naward of the Scholarship will be subject to the successful candidate\nbeing accepted by, and registered for, the programme of their choice.", "For More Information:", "Visit the Official Webpage of the Doug Banks Renewable Energy Vision Postgraduate Scholarships "], "url : https://www.opportunitiesforafricans.com/doug-banks-renewable-energy-vision-postgraduate-scholarships-2019-2020/"], [["Ashinaga Africa Initiative 2020 Scholarship program for young African orphans (Fully Funded to study abroad)", "date announced:August 13, 2019", "Application Deadline: December 16th 2019"], ["Application Deadline: December 16th 2019", " The Ashinaga Africa Initiative", " began in 2014. Its mission is to contribute to Sub-Saharan Africa’s expanding role in global development through increasing access to higher education abroad. We support orphaned students who are committed to returning home and initiating change, by providing access to full financial support to study at a university abroad (equivalent to an undergraduate degree). Ashinaga support covers tuition, accommodation, travel costs, and other necessary fees. ", "Requirements", "Applicants must:", "Have lost one or both parents;", "Have\ncompleted secondary school and passed national secondary school\nexamination (technical and vocational degrees not accepted) within the\nlast two years (any date after 1st September 2018, including all of 2018\nand 2019) or will have completed secondary school and received final\nexam results before February 28th, 2020. ", "Were born after 1st September, 1998;", "Have an outstanding academic performance at high school and were amongst the top students in their class;", "Be\ncommitted to returning home, or to Sub-Saharan Africa, and contribute\nto society in Sub-Saharan Africa after graduating from university.", "(See the full list of requirements here)", "For More Information:", "Visit the Official Webpage of the Ashinaga Africa Initiative 2020 Scholarship program"], "url : https://www.opportunitiesforafricans.com/ashinaga-africa-initiative-2020-scholarship-program-for-young-african-orphans/"], [["King Baudouin Foundation Grants 2019 for students from developing countries studying in Belgium", "date announced:August 15, 2019", "Application Deadline: October 22nd 2019"], ["Application Deadline: October 22nd 2019", "The Elisabeth & Amelie Fund", " supports sustainable water management in developing countries, among others by financing on-the-spot internships for students from developing countries who are studying in Belgium. ", "The Elisabeth & Amelie Fund\ntakes into consideration an integrated approach to water management that\nincludes technical and/or sociological aspects. ", "The internship will take place in a developing country (the student’s country of origin or another country). It will be tied to a master’s thesis or an equivalent, and under the responsibility of the Belgian academic institution where the student is studying.", "Requirements:", "\nStudents from developing countries who are pursuing a master’s\nlevel degree (master’s, specialisation master’s or a second bachelor’s\ndegree) that is linked to water management.\n", "Grant:", "The grant will cover the expenses inherent to the internship, up to a maximum of € 5,000. ", "The internship, which should last 1 to 2 months, must take place between December 2019 and the end of August 2020. Ten grants shall be awarded. ", "Selection criteria", "Objective. The internship is linked to the access to water or its management in developing countries and must be clearly part of the subject of the candidate’s end of year project.", "Pertinence. The work undertaken by the candidate at local level and the results that emanate from this, deal with important local issues.", "Capabilities. The budget requested must match the candidate’s needs. He/She must have sufficient resources to complete the internship under the required conditions.", "Originality. The approach chosen by the candidate for his internship or the framework within which he is going to work have an innovative side. They are, in a certain way, different from the usual approaches or frameworks.", "Impact. What will be realized during the internship brings real added value to the scientific approach that supports the end of year thesis. .", "How to submit your application", "Begin by registering in order to submit your application", " How to submit an application form online? View ", "video", " ", " Download the annex(es) that have to be completed for your application form ", " ", "Detailed budget", " ", " ", " If you are not very familiar with computers: 02-500 4 555 or ", "[email protected]", ". ", " The King Baudouin Foundation of course complies with ", "privacy legislation", " in this area. ", "For More Information:", "Visit the Official Webpage of the King Baudouin Foundation Grants 2019"], "url : https://www.opportunitiesforafricans.com/king-baudouin-foundation-grants-2019/"], [["Swiss Government Excellence Scholarships 2020/2021 for Foreign Scholars & Artists to study in Switzerland (Fully Funded)", "date announced:August 16, 2019", "Application Deadline: Varying by Country"], ["Application Deadline: Varying by Country", "Each year the S", "wiss Confederation awards Government Excellence Scholarships ", "to promote international exchange and research cooperation between Switzerland and over 180 other countries. Recipients are selected by the awarding body, the Federal Commission for Scholarships for Foreign Students (FCS).", "The Swiss Government Excellence Scholarships are aimed at young researchers from abroad who have completed a master’s degree or PhD and at foreign artists holding a bachelor’s degree.", "Types of scholarship", "The ", "research scholarship", " is available to post-graduate\nresearchers in any discipline (who hold a master’s degree as a minimum)\nwho are planning to come to Switzerland to pursue research or further\nstudies at doctoral or post-doctoral level.", "\nResearch scholarships are awarded for research or study at all Swiss\ncantonal universities, universities of applied sciences and the two\nfederal institutes of technology. Only candidates nominated by an\nacademic mentor at one of these higher education institutions will be\nconsidered.", "Art scholarships", " are open to art students wishing to pursue an initial master’s degree in Switzerland.", "\nArt scholarships are awarded for study at any Swiss conservatory or\nuniversity of the arts. This scholarship is available to students from a\nlimited number of countries only.", "Selection criteria", "The FCS assesses scholarship applications according to three criteria:", "a) Candidate profile", "\nb) Quality of the research project or artistic work", "\nc) Synergies and potential for future research cooperation", "Interested?", "Select your country of origin according to your passport", ":", "Countries A – L", " / ", "Countries M – Z", "Check the application deadline and the different types of scholarship on offer. These vary according to country. You will also find details of what to do next and where to get more information.", "Selection", "Applications are subject to ", "preliminary selection", " by the relevant national authorities and/or the Swiss diplomatic representation. The ", "short-listed applications", " are then assessed by the Federal Commission for Scholarships for Foreign Students (FCS), which takes the final decision.", "The FCS is composed of professors from all Swiss public universities.\nScholarship awards are decided on the basis of academic and scientific\nexcellence.", "Awards", "The FCS will announce its decisions regarding the new scholarship awards by the end of May at the latest.", "Outlook", "The FCS will select scholarship holders for the 2020-21 academic year by the end of May 2020. Scholarships for the 2021-22 academic year will be advertised online from August 2020.", "FAQs for scholarship applicants & academic supervisors (PDF, 148 kB, 25.09.2017)", "«Stipendien, die das Leben verändern» (PDF, 1 MB, 03.04.2019)", "Online Befragung von ESKAS Bundesstipendiat/innen der Jahrgänge 1996-2015 (German, summary in English)\n", "For More Information:", "Visit the Official Webpage of the Swiss Government Excellence Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/swiss-government-excellence-scholarships-2020-2021-for-foreign-scholars-artists-to-study-in-switzerland-fully-funded/"], [["Tiso Foundation Tertiary Bursary Programme 2020 for Young South Africans", "date announced:August 21, 2019", "Application Deadline:  30th of September 2019. "], ["Application Deadline: ", " 30th of September 2019. ", "The Tiso Foundation", " through its Undergraduate Bursary Programme", " in partnership with various South African Universities seeks to identify deserving previously disadvantaged candidates who have demonstrated talent and determination in their previous academic lives. The Foundation nurtures and empowers participants to achieve their academic potential, and go on to a meaningful career that will have a lasting impact on their careers, communities and the country. Scholarships are awarded to under privileged youth from marginalized communities who meet the selection criteria.", "Selection criteria include; good to excellent matric results or\nacademic performance (if already registered at University), a dedication\nto their studies and a willingness to meaningfully participate in\nupliftment programmes existing in the communities from which they\nemanate. A highly competitive selection process ensures these bursaries\nare accessed and utilised by students with the greatest promise.", "Throughout the programme, beneficiaries are offered life skills\ntraining and academic support. Upon completion the Foundation is\navailable to assist the best students to access career opportunities\nthrough its network of corporate and institutional relationships.", "\nThe programme aims:", "\n• To promote equity in the workplace by supporting strong black\nstudents to acquire the necessary academic qualifications", "\n• To help address the skills shortage in the economy", "\n• To address challenges of poverty through the avenue of human capital development.", "Since inception, the Foundation has funded more than 90 students pursuing degrees and national diplomas in accredited institutions of higher learning. Going forward,the Foundation targets to support 65 students per year through partnerships with various stakeholders.", " Candidates must meet these selection criteria:", " • Must be between the ages of 18 and 34", " • Students must be South African citizens", " • You must be from the previously disadvantaged groups as outlined by the South African government (Black, Coloured or Indian)", " • Must be in possession of excellent matric results with a minimum average of 70%.", " • Must produce excellent results if already registered as a full time student a minimum of 65% average.", " • Must be financially needy and unemployed.", " • Must portray and excellent positive attitude.", " • Must be dedicated to their studies.", "\nMust provide references.", "\n•\tMust be willing to give back to the community.\n", "For More Information:", "Visit the Official Webpage of the Tiso Foundation Tertiary Bursary Programme 2019"], "url : https://www.opportunitiesforafricans.com/tiso-foundation-tertiary-bursary-programme-2020-for-young-south-africans/"], [["Gates Cambridge Scholarship Programme 2020 for Study at the University of Cambridge, UK (Fully Funded)", "date announced:September 2, 2019", "Application Deadline:  7 January 2020 "], ["Application Deadline: ", " 7 January 2020", " ", "The Gates Cambridge Scholarship programme", " ", "was established in October 2000 by a donation of US$210m from the Bill and Melinda Gates Foundation to the University of Cambridge; this is the largest ever single donation to a UK university.", "For 2020 entry, Gates Cambridge will offer 80 full-cost scholarships\nto outstanding applicants from countries outside the UK to pursue a\nfull-time postgraduate degree in any subject available at the University\nof Cambridge. Approximately two-thirds of these awards will be offered\nto PhD students, with approximately 25 awards available in the US round\nand 55 available in the International round.", "The selection criteria are:", "outstanding intellectual ability", "reasons for choice of course", "a commitment to improving the lives of others", "leadership potential", "Eligibility", " Check if you are eligible to apply. ", "You can apply for a Gates Cambridge Scholarship if you are:", "a citizen of any country outside the United Kingdom", "applying to pursue one of the following full-time residential courses of study at the University of Cambridge:\n", "PhD", "MSc/MLitt", "One year postgraduate course (with some exceptions – see below)", "The courses not eligible for a Gates Cambridge Scholarship are listed at the bottom of this page.", "You can use the form below to quickly check if you are eligible to apply for a Gates Cambridge Scholarship and, if so, in which of the two application rounds you must apply. ", "Value", " A Gates Cambridge Scholarship covers the full cost of studying at Cambridge. It also provides additional, discretionary funding. ", "The Gates Cambridge Scholarship is one of the most generous international scholarships available. It covers the following costs:", "Core components", "the ", "University Composition Fee", " at the appropriate rate*", "a maintenance allowance for a single student (£17,500 for 12 months\nat the 2020-21 rate; pro rata for courses shorter than 12 months) – for\nPhD scholars the award is for up to 4 years", "one economy single airfare at both the beginning and end of the course", "inbound visa costs & the cost of the ", "Immigration Health Surcharge", "Discretionary components", "The Trust also considers applications for several types of additional funding on a discretionary basis:", "Academic development funding – from up to £500 to up to £2,000,\ndependent on the length of your course, to attend conferences and\ncourses.", "Family allowance – up to £10,120 for a first child and up to £4,320\nfor a second child (2020-21 rate). No funding is provided for a partner.", "Fieldwork – you may apply to keep up to your normal maintenance\nallowance while on fieldwork as part of your PhD (the Trust does not\nfund other fieldwork costs as these should be funded by the University\nComposition Fee).", "Maternity/Paternity funding – should you require it, you may apply\nto intermit your studies for up to 6 months and continue to receive your\nmaintenance allowance during this time", "Hardship funding – for unforeseen difficulties", "alue", "\nA Gates Cambridge Scholarship covers the full cost of studying at Cambridge. It also provides additional, discretionary funding.\n", "The Gates Cambridge Scholarship is one of the most generous international scholarships available. It covers the following costs:", "Core components", "the ", "University Composition Fee", " at the appropriate rate*", "a maintenance allowance for a single student (£17,500 for 12 months\nat the 2020-21 rate; pro rata for courses shorter than 12 months) – for\nPhD scholars the award is for up to 4 years", "one economy single airfare at both the beginning and end of the course", "inbound visa costs & the cost of the ", "Immigration Health Surcharge", "Discretionary components", "The Trust also considers applications for several types of additional funding on a discretionary basis:", "Academic development funding – from up to £500 to up to £2,000,\ndependent on the length of your course, to attend conferences and\ncourses.", "Family allowance – up to £10,120 for a first child and up to £4,320\nfor a second child (2020-21 rate). No funding is provided for a partner.", "Fieldwork – you may apply to keep up to your normal maintenance\nallowance while on fieldwork as part of your PhD (the Trust does not\nfund other fieldwork costs as these should be funded by the University\nComposition Fee).", "Maternity/Paternity funding – should you require it, you may apply\nto intermit your studies for up to 6 months and continue to receive your\nmaintenance allowance during this time", "Hardship funding – for unforeseen difficulties", "How to apply", " ​Apply for admission to a postgraduate degree, a College place and various sources of funding (including Gates Cambridge) via the University’s Graduate Applicant Portal. ", "For the majority of courses you can apply for admission and multiple funding opportunities (including Gates Cambridge) at ", "www.graduate.study.cam.ac.uk", ".", "For More Information:", "Visit the Official Webpage of the Gates Cambridge Scholarships Programme 2020 "], "url : https://www.opportunitiesforafricans.com/gates-cambridge-scholarship-programme-2020/"], [["Echidna Global Scholars Program 2019/2020 at Brookings Institution, Washington D.C USA ( USD $5,000/Month Stipend & Fully Funded)", "date announced:August 27, 2019", "Application Deadline: October 1st 2019"], ["Application Deadline: October 1st 2019", "The Echidna Global Scholars Program", " is a visiting fellowship hosted by the Center for Universal Education (CUE), within the Global Economy and Development program, at the Brookings Institution. ", "The Echidna Global Scholars Program (", "the Program) aims to build the research, analytical, and leadership skills of NGO leaders and academics who have substantial experience with and ties to developing countries, whose work has a specific focus on improving learning opportunities and outcomes for girls in the developing world. This position would be ideal for a candidate with 10-15 years of professional experience in a related field. Echidna Global Scholars spend four to six months at Brookings Institution in Washington D.C. The structure of the Program is divided into two main components to assist the scholars in having impact when returning to their home countries: research on global education issues, and leadership training. ", "The research component of the Program will include a data-collection phase at home and a writing and analysis phase during a residency at Brookings. It aims to equip global girls’ education leaders with the skills and support necessary to create a written policy research product to affect change for girls in their home countries. ", "Benefits:", " Please note that this position is a short-term full-time resident fellowship at Brookings (it is not an employee position). ", "Applicants  selected for the fellowship will receive a living stipend of USD $5,000 a month while in D.C. (subject to U.S. tax withholding and reporting), paid single-occupancy housing for the four-and-a-half-month term, round-trip travel expenses, and a limited health insurance plan.  ", "\nResponsibilities\n", "Once\nselected by CUE to participate in the Program and while still in their\nhome countries, Echidna Global Scholars will be expected to dedicate\ntime to collecting data for their research in preparation for their\nperiod of residency at Brookings in Washington, DC.  During their\nresidency from early June to mid-October 2020, Echidna Global Scholars\nwill work with CUE staff to develop their specific research project and a\nstrategy for policy impact.  They will also participate in professional\ndevelopment training and networking opportunities.  Echidna Global\nScholars will draw on the resources of other Brookings’ scholars, as\nwell as the extended public policy community in Washington, D.C. by\nparticipating in additional meetings and conferences, and networking\nwith the broader development community.  The Program expects the Echidna\nGlobal Scholars to have the ability to interact with other Brookings\nscholars and the wider policy community; to conduct professional,\nin-depth research and deliver spoken presentations in English; and to\nwork on an extensive, cutting-edge written research product during their\nresidency, as well as a post-residency project proposal with the intent\nto implement their research in their home country upon completion of\nthe program. ", "\nQualifications\n", "Education /Experience Requirements", ":", "The\nProgram selects professionals with substantial experience in and ties\nto developing countries, a demonstrated intent to return to a developing\ncountry after completing the period of residency at Brookings, and a\npassion and demonstrated commitment to girls’ education. Applicants\nshould have a background in education, development, economics, or a\nrelated area, with a minimum of 10 years of professional experience in\neither research/academia; non-government and civil society; government;\nor business.  Master’s degree required; Ph.D. or research background\nstrongly preferred. ", "Knowledge/Skills Requirements:", "Strong\nanalytical and writing skills. Successful applicants will have an\nintimate understanding of education development issues and gender.  ", "Additional Information ", "Applicants\nwho have not worked explicitly on girls’ education previously are\nwelcome to apply but should include an explanation of how this focus on\ngirls’ education can be integrated successfully into their current and\nfuture work.  ", "Echidna Global Scholars’ research topics must be focused on education priorities for girls, as they are relevant in their specific contexts. This can include “second generation” priorities, like:", " 1) ensuring that girls can attend and complete primary and secondary school; ", "2) making schools safer and more secure; ", "3) improving the quality of learning for girls; ", "4) supporting girls’ transition to higher education and employment; and ", "5) cultivating local country leaders to champion this work at the grassroots level. ", "Topics may also include the intergenerational effects of girls’ education, innovations in early childhood that are relevant for girls’ education, girls’ education in conflict settings, or quality education for indigenous and/or minority girls. Echidna Global Scholars are also encouraged to include areas of research focused on girls’ skills development. Other girls’ education issues lacking evidence are also welcome. ", "Program Requirements and Expectations:", " ", "Echidna Global Scholars must be available for a full-time, on-site affiliation with the Brookings Institution for the entire duration of the residency and must be able to complete the pre-arrival data collection phase of research. Soon after selection, Echidna Global Scholars are required to conduct research on a topic approved by CUE staff.  ", "Scholars will present their research papers at a day-long symposium hosted by Brookings at the end of the residency.  Each Scholar is expected to be an active participant in Brookings and CUE activities, including, but not limited to, regularly-scheduled organizational staff meetings, informal discussions, seminars, presentations, and other CUE and Brookings events. ", "Term of Program: ", "The research project must take place within a 7-8-month timeframe of pre-residency and residency work. Data collection must be completed by the scholar at home prior to the start of the residency at Brookings in Washington, D.C. Analysis and writing must be completed during the residency. The residency will begin on or around June 2020 and end in mid-October 2020. Scholars must also participate in the leadership development component throughout the program, including pre-residency components. Scholars may be invited to apply for seed funding to implement their research findings in a pilot program after the residency. Please note that the timeframe of this Program will not be changed, and that stipends are only paid while scholars are in residence in Washington, D.C. ", "How to Apply:  ", "Submit\na cover letter that explains your goals and intent for the program,\nalong with your curriculum vitae or resume which will include a list of\nyour publications, and fellowships, honors, awards, funded research, or\nfoundation support that you have received. Please attach curriculum\nvitae or resume and cover letter as one document when you apply, as\ninstructed.", "When prompted, attach answers to Questionnaire. Click ", "here", " to access document", "When prompted, attach Research Project Proposal. Click ", "here", " to access document", "Documents\nmust be saved with a format of Last Name, First Name and document name\n(for example: Doe_Jane_CV). Note that letters of recommendation, writing\nsamples, and transcripts are NOT required. Please upload Questionnaire\nand Research Project Proposal in the Writing Sample section.", "Only\napplicants selected for interviews will be contacted. Candidates\nselected for interviews may be asked to submit additional materials.", "\nIncomplete applications, and any applications received after the\ndeadline will not be considered. If you require visa sponsorship to\nparticipate in this fellowship program, your English proficiency will be\nverified via an objective assessment as required by the U.S. Department\nof State.", "Timing and Application Deadlines:", "Application deadline: October 1, 2019", "Tentative Residency Term: June 2020- October 2020", "For More Information:", "Visit the Official Webpage of the Echidna Global Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/echidna-global-scholars-program-2019-2020/"], [["Finnish Government Scholarship Pool 2020/2021 for Doctoral level studies & research in Finland ( EUR 1500 monthly allowance)", "date announced:September 2, 2019", "Application Deadline: 15 February 2020"], ["Application Deadline: 15 February 2020", "The Finnish Government Scholarship Pool grants", " ", " are intended for doctoral level post-graduate studies and research in Finnish universities and public research centres. ", "The scholarship in a nutshell", "Applicant: ", "must have a Master’s degree", "Nationality: ", "restricted, please see Who can apply? (below)", "Field: ", "all disciplines", "Purpose:", " work on a doctoral thesis or a research visit in Finland", "Application deadline:", " once a year, different dates for different countries", "Application submitted to:", " authorities in the applicant’s country of residence", "Grant:", " 1,500 euros/month, payable to the applicant in full", "Scholarship duration:", " 3–9 months", " These scholarships are based on bilateral agreements between Finland and other countries. To apply for these, you need to be a national of one of the below countries: ", "Egypt", "Ministry of Higher Education", " Cultural Affairs and Missions Sector", " Director of the General Missions Dept., Ministry of Higher Education, Mr. Hisham Mohamed Mostafa ", " Email: mohemission(at)gmail.com", " General Missions Dept tel. 27949107", " Mohamed Afify mob. 01112686700", " Fax Number: 02 – 27942327", " Address: Tahrir Complex Building, 7th floor, Tahrir, Cairo", " www.mohe-casm.edu.eg/English/index.jsp", "Namibia", "Namibia Students Financial Assistance Fund (NSFAF)", " P.O.Box 23053", " Windhoek", " Namibia", " Tel. 264 61 420636", " Fax: 264 61 233940", " Enquiries: Mr. Clint Simasiku", " E-mail: clint_simasiku(at)yahoo.com", "To apply for the scholarship, you also need to meet the following criteria:", "You have been pre-approved to carry out research relating to a doctoral level thesis or been invited as a doctoral student in a Finnish university or a public research centre.", "You have a letter of invitation from a supervisor in a Finnish university or a research centre, stating that this host is committed to working with you.", "You have not already studied or worked in a Finnish university for more than a year immediately before the planned start of the scholarship period.", "You can demonstrate your proficiency in English with an official language test (IELTS, TOEFL) and can attach a certificate for this in your application form. Alternatively, it is confirmed in the invitation letter from the university that they regard your language skills sufficient for research and studies in a university in Finland", "Size of the grant and duration", "The scholarship grant can be awarded for 3 to 9 months. It is 1,500\neuros/month and is paid to the applicant in full. It is enough to cover\nthe living costs of only one person in Finland.", "The scholarship period cannot be extended, so any additional funding needed must be acquired from other sources.", "Travel expenses to Finland and within Finland will not be covered.\nThe scholarship holder must also pay for the insurance and visa costs\nthemselves.", "The scholarship of the Finnish National Agency for Education (EDUFI)\nis tax-free because the amount does not exceed the tax-free grant\namounts allowed in Finland. If you have been awarded other grants or\nhave other income at the same time, this may exceed the tax-free limit.", "Further information about taxation: vero.fi", "  ", "Application form", "The academic year in\nFinnish universities starts in late August or at the beginning of\nSeptember and finishes at the end of May. Please check the dates when\nyou are contacting universities.", "You can present a later start date than September for your\nscholarship period in your application form, as long as the period\nstarts during the academic year that you are applying a grant for.", "The application form comes with instructions on how to fill it and a list of required annexes.", "US citizens: you can find the application form and instructions on\nthe “Fulbright-EDUFI Fellowship” page on the Fulbright Online website. ", "Other nationals of the participating countries: More information available soon.", "Please submit your application to the national scholarship authority in your country: Countries and authorities.\nAttachments\n", "Application form", " (doc, 76.5 KB)\n", "For More Information:", "Visit the Official Webpage of the Finnish Government Scholarship Pool 2020 "], "url : https://www.opportunitiesforafricans.com/finnish-government-scholarship-pool-2020-2021/"], [["Standard Bank Group 150 Bursary Programme 2020 for undergraduate studies in South Africa", "date announced:August 19, 2019", "Application Deadline: 30 September 2019 "], ["Application Deadline: 30 September 2019 ", "In honour of our 150th anniversary in 2012,", " ", "Standard Bank Group launched its 150 bursary and scholarship fund", ",", " designed to promote academic excellence (in various disciplines within commerce, science, engineering and technology) and to target a range of recipients.", " To apply for this bursary you must be a well- rounded, undergraduate student with strong academic results and entering your second or third year of study in commerce, science, engineering, mathematics and technology.", "You can apply using one of the following options:", "Please note:", " 2020 applications open from 1 August to 30 September 2019", " ", " Mail:", " Write a letter containing your name, surname and a valid postal address and postal code to: Standard Bank Bursary Programme, Studietrust, Private Bag X16, Braamfontein 2017", " Email:", " Send an email explicitly requesting a Standard Bank bursary application form, and containing your name, surname and a valid postal address and postal code to: ", "[email protected]", " ", "SMS: ", "Sms the word STANDARD, your name, surname, postal address and postal code to 31022.", "Website application:", " Fill in an online application form on: ", "www.studietrust.co.za", " ", "Enquiries can be directed to Susan Dube at ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Standard Bank Group 150 Bursary Programme 2020"], "url : https://www.opportunitiesforafricans.com/standard-bank-group-150-bursary-programme-2020/"], [["Cambridge Trust Undergraduate & Graduate Scholarship Program 2020/2021 for International Students", "date announced:August 10, 2019", "Application Deadline: 15 October 2019, 6.00 pm (UK time).  "], ["Application Deadline: ", "15 October 2019, 6.00 pm (UK time)", ".  ", " The Cambridge Trust awards", " ", "approximately 500 scholarships annually, and supports between 1,100 and 1,400 students in residence each year from 85 countries across the world.  During its history of over 30 years of offering scholarships at the University of Cambridge, the Trust has awarded a total of nearly 19,000 scholarships to international students. ", "Applications", "All scholarships are available ", "only for study at the University of Cambridge", ",\nand require that you apply to the University via the normal online\napplication form, and most scholarships require that you apply by the\nrelevant deadline.", "There are different procedures for applying for ", "undergraduate study", " (BA and similar) and for ", "postgraduate study", " (Masters, PhD and similar).", "Deadlines", "Undergraduate study", "The application deadline for the 2020 entry is ", "15 October 2019, 6.00 pm (UK time)", ". ", "However, there are some exceptions.  If you are applying for\nundergraduate study and wish to be interviewed in China, Malaysia or\nSingapore, the deadline is ", "20 September 2019", ".", "Graduate study", "If you are applying for graduate study, please check and apply by the\nspecific course deadline.  There will be two general course deadlines\nof ", "3 December 2019", " and ", "7 January 2020", ". ", "Please apply by the relevant deadline set for entry to your particular course and complete the ‘Funding’ section in the online ", "Applicant Portal", " in order to be considered for funding.", "There will be no differential of deadlines for application between UK or EU or International graduate applicants.", "Requirements:", "Eligibility", "These are guidelines on eligibility for scholarships that are\navailable from the Cambridge Commonwealth, European and International\nTrust:", "Nationality", "All students, irrespective of nationality, are eligible to be considered for funding by the Trust.", "Status", "The Trust does not accept applications from students who are part-way\nthrough a course at Cambridge, unless they are applying for funding\ntowards a higher degree course following graduation.", "To find out more about your fee status, see information on the University’s web pages for ", "undergraduates", " and for ", "postgraduates", ".", "Degree level", "Applicants must be intending to start a course at the level of\nundergraduate (excluding UK/EU applicants), Masters (such as MPhil,\nMASt, LLM), or research postgraduate (such as PhD).", "Please note that the Trust does not offer many scholarships to\nstudents on undergraduate courses, and has many more scholarship\nprogrammes available to postgraduate students.  Approximately 85% of the\nscholarships awarded each year are to students taking Masters or PhD\ndegrees.", "For More Information:", "Visit the Official Webpage of the Cambridge Trust Undergraduate & Graduate Scholarship Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/cambridge-trust-undergraduate-graduate-scholarship-program-2020-2021/"], [["Commonwealth PhD Scholarships 2020 (for least developed countries and fragile states) to Study in the UK (Fully Funded)", "date announced:August 29, 2019", "Application Deadline: 16:00 (GMT) on 30 October 2019 at the latest. "], ["Application Deadline: ", "16:00 (GMT) ", "on ", "30 October 2019", " at the latest. ", "Commonwealth PhD Scholarships", " ", "are for candidates from least developed countries and fragile states in the Commonwealth, for full-time doctoral study at a UK university.", "Funded by the ", "UK Department for International Development (DFID)", ",\nCommonwealth PhD Scholarships enable talented and motivated individuals\nto gain the knowledge and skills required for sustainable development,\nand are aimed at those who could not otherwise afford to study in the\nUK. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2020", "By September 2020, hold a first degree of at least upper second class (2:1) honours standard, or a second class degree (2:2) and a relevant postgraduate qualification (a Master’s degree)", "NOT be registered for a PhD, or an MPhil leading to a PhD, at a UK university before September/October 2020", "NOT have commenced and be currently registered for a PhD, or an MPhil leading to a PhD, in your home country or elsewhere", "Have the support of a potential supervisor from at least one UK university listed in your application form", "Have provided all supporting documentation in the required format", "Be unable to afford to study in the UK without this scholarship", "Scholarship Worth:", "Each scholarship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor the cost of journeys made before your award is confirmed)", "Approved tuition fees Stipend (living allowance) at the rate of £1,110 per month, or £1,362 per month for those at universities in the London metropolitan area (rates quoted at 2019-2020 levels )", "Warm clothing allowance, where applicable Study travel grant towards the cost of study-related travel within the UK or overseas", "Provision towards the cost of fieldwork undertaken overseas (usually the cost of one economy class return airfare to your fieldwork location), where approved Paid mid-term visit (airfare) to your home country (unless you have claimed (or intend to claim) spouse and/or child allowances during your scholarship, or have received a return airfare to your home country for fieldwork)", "Family allowances, as follows (rates quoted at 2019-2020 levels):", " If you are accompanied by your spouse but no children: spouse allowance of £239 per month for a maximum period of nine months, if you and your spouse are living together at the same address in the UK (unless your spouse is also in receipt of a scholarship; other conditions also apply)", "If you are accompanied by your spouse and children: spouse allowance of £239 per month and child allowance of £239 per month for the first child, and £117 per month for the second and third child under the age of 16, if your spouse and children are living with you at the same address in the UK (unless your spouse is also in receipt of a scholarship; other conditions also apply)", " If you are accompanied by your children but no spouse: child allowance of £476 per month for the first child, and £117 per month for the second and third child under the age of 16, if your children are living with you at the same address in the UK", "Eligible Commonwealth countries", "Bangladesh", " Cameroon", " The Gambia", " Kenya", " Kiribati", " ", "Lesotho", " Malawi", " Mozambique", " Nigeria", " Pakistan", " ", "Rwanda", " Sierra Leone", " Solomon Islands", " ", "Tanzania", " Tuvalu", " ", "Uganda", " Vanuatu", " Zambia", "How to apply", "You must apply to one of the following nominating bodies in the first instance – ", "the CSC does not accept direct applications for these scholarships", ":", "National nominating agencies", " – this is the main route of application", "Selected universities/university bodies", ", which can nominate their own academic staff", "Selected non-governmental organisations and charitable bodies", "All applications ", "must", " be made through one of these\nnominating bodies. Each nominating body is responsible for its own\nselection process and may have additional eligibility criteria. ", "You\nmust check with your nominating body for their specific advice and\nrules for applying, their own eligibility criteria, and their own\nclosing date for applications.", "You must make your application using the CSC’s online application\nsystem, in addition to any other application that you are required to\ncomplete by your nominating body. ", "The CSC will not accept any applications that are not submitted via the online application system", ".", "All applications must be submitted by ", "16:00 (GMT) ", "on ", "30 October 2019", " at the latest.", "You are advised to complete and submit your application as soon as\npossible, as the online application system will be very busy in the days\nleading up to the application deadline.", "Your application must include the following supporting documentation, by ", "16:00 (GMT)", " on ", "20 November 2019", " in order for your application to be eligible for consideration:", "Proof of citizenship or refugee status – uploaded to the online application system", "Full transcripts detailing ", "all", " your higher\neducation qualifications including to-date transcripts for any\nqualifications you are currently studying (with certified translations\nif not in English) – uploaded to the online application system", "References from at least two individuals – ", "submitted directly by the referees to the online application system", " (referees will be sent an email request)", "Supporting statement from a proposed supervisor in the UK from at\nleast one of the institutions named on your application form -– ", "submitted directly by your proposed supervisor to the online application system", " (supervisors will be sent an email request).", "It is your responsibility to ensure that your referees and\nproposed supervisor(s) are able to complete the references and\nsupporting statements by the deadline and that they receive the\nreference and statement requests.", "The CSC will not accept supporting documentation submitted by nominating agencies or outside the online application system.", "You can ", "access the online application system", " now", "Supporting documentation uploaded to the online application system\nmust be uploaded as files which are no more than 5 MB in size and must\nbe in one of the following formats: PDF, .doc, .docx, .odt, .jpg, .jpeg .\nFiles submitted in any other format (including Zip files and PDF\nPortfolios) will NOT be accepted.", "Please note that the CSC does not charge candidates to apply for any\nof its scholarships or fellowships through its online application system\nand it does not charge organisations to nominate candidates.", "Choosing a university/course", "You may find the following resources useful when researching your choices of institution and course of study in the UK:", "Study UK", " – British Council website, with guidance for international students and a course and institution search", "Postgrad.com", " – information for postgraduate students, with a course search", "Prospects", " – information on postgraduate study in the UK", "Research Excellent Framework 2014 results", " – results of a system for assessing the quality of research in UK higher education institutions", "UCAS Postgraduate", " – guidance on how to find and apply for a postgraduate course", "Unistats", " – the official website for comparing UK higher education course data", "UKCISA", " (UK Council for International Student Affairs) – advice for international students on choosing a course of study", "The CSC is not responsible for the content of external sites.", "For More Information:", "Visit the Official Webpage of the Commonwealth PhD Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/commonwealth-phd-scholarships-2020/"], [["2020/2021 Skoll MBA Scholarship in Social Entrepreneurship at the University of oxford’s Saïd Business School (Fully Funded)", "date announced:August 15, 2019", "Application Deadline: January 10th 2020"], ["Application Deadline: January 10th 2020", " The Skoll Scholarship", " provides full funding plus a living stipend to complete a MBA at the University of Oxford’s Saïd Business School. ", "Receive exclusive opportunities to meet with world-renowned entrepreneurs, thought-leaders, and investors", "Take your social impact to the next level", "Gain professional leadership and business skills", "Become part of the Skoll Scholar community, a group of leaders who are positively impacting the world through innovation and systems change", "Eligibility Requirements:", "Are you eligible for the Skoll Scholarship?", "1. Entrepreneurial action", "You have identified opportunities and taken action in order to make positive social impact", "You have spent preferably at least 3 years driving change through entrepreneurial approaches. For example, you could have:\n", "Started or grown a social venture", "OR created and led the expansion of a social impact initiative within an organisation", "OR been tackling a specific social/environmental issue, through a core thread that unites your work", "2. Creating impact with a focus on systems change", "You can demonstrate the outcomes and impact of your entrepreneurial action", "Your impact addresses unjust systems and practise in your area of work", "3. Personal qualities of a social entrepreneur", "You are a force for positive change", "You are single-minded and persistent, with a willingness to fail and start again", "You have bias toward action", "You have a tendency to explore your environment for opportunities and resources", "You have a willingness to take personal, and sometimes financial, risks", "You develop networks and leverage members to pursue mutual goals", "You have apprenticed with the problem* or experienced the problem you are trying to solve", "4. The Oxford MBA is critical to your career trajectory", "You can demonstrate why business education is essential in helping to develop your work/impact at this stage", "5. Financial need", "You are in a position where the cost of the programme is a significant financial burden", "You can demonstrate the need for the Scholarship (for example, due to previous work experiences or personal circumstances)", "*“Apprenticing with a Problem”, a term we borrowed from Jessamyn\nShams-Lau at the Peery Foundation, refers to someone developing a deep\nunderstanding of a problem they did not live through themselves, e.g. by\nworking in the field, working at a related organisation, conducting\nresearch, etc. A simple example of someone apprenticing with a problem\nis a teacher who has gone on to start an education focused non-profit.", "Diversity and Inclusion", ": We value and encourage diversity within the Skoll Scholarship Community. In order to successfully tackle world scale problems, we must bring together individuals from different cultures, religions, sectors, genders, backgrounds, and ideologies to create collaborative solutions. Belonging to a diverse community enriches our Scholars’ learning experience, teaches them to challenge ideas and be challenged in a respectful manner, and fosters a global perspective necessary in today’s world. Therefore we encourage all candidates to apply for the Scholarship, especially women, members of historically underrepresented groups, and those from the global south.", " How to apply", "• Apply to the MBA programme at Saïd Business School, University of Oxford which includes your Skoll Scholarship essays.", "• You must apply during specific MBA application stages to be considered for the Scholarship. Consult the Skoll Scholarship website for more information, www.skollscholarship.org.", "• Complete the online application to the Skoll Scholarship, which will be sent to you once you are accepted onto the MBA programme.", "• Participate in the interview process (note: not all candidates will be offered an interview", "For More Information:", "Visit the Official Webpage of the 2020/2021 Skoll MBA Scholarship in Social Entrepreneurship"], "url : https://www.opportunitiesforafricans.com/2020-2021-skoll-mba-scholarship-in-social-entrepreneurship-at-the-university-of-oxfords-said-business-school/"], [["University of Gondar Mastercard Foundation Undergraduate Scholars Program (MCFSP) 2020/2021 for young Ethiopians (Fully Funded)", "date announced:August 10, 2019", "Application Deadline: August 27 2019. "], ["Application Deadline: August 27 2019. ", "The University of Gondar Mastercard Foundation Undergraduate Scholars Program ", "is open only for Ethiopian applicants that sat or will sit for the Ethiopian Higher Education Entrance Examination (EHEECE) in 2010 EC and 2011EC in Ethiopia who intend to be a full-time undergraduate student at the UoG. ", "Any applicant who wishes to pursue his/her undergraduate study on a fulltime basis and in the selected disciplines (ENVIRONMENTAL HEALTH AND OCCUPATIONAL SAFETY, MEDICAL LABORATORY, LAW, MEDICINE, NURSING, PHARMACY, PHYSIOTHERAPY, PSYCHIATRY, PSYCHOLOGY, SOCIAL WORK, SOCIOLOGY, SPECIAL NEEDS AND INCLUSIVE EDUCATION, HEALTH OFFICER, OPTOMETRY, BIOMEDICAL ENGINEERING, CIVIL ENGINEERING, MECHANICAL ENGINEERING AND ARCHITECTURE) can apply for the scholarship.", "Scholarships will be awarded on the basis of demonstrated academic ability, financial need, and disability status as well as community giveback and leadership potential using tailored checklists. The scholarship is full and covers the costs of tuition, accommodation/boarding, stipend and additional expenses as well as provides academic, financial and social support to make awardees develop as capable and transformative leaders in their communities. The scholarship adopts the approach of experiential learning and facilitates organizational attachments, summer-camps for scholarship holders.", "APPLICATION PROCEDURE AND CONDITIONS.", "This application form", " –\ncompleted and signed – along with required documents should reach the\nProgram Office no later than August 27 2019. Applications submitted to\nother organizations or after the deadline will not be considered for the\nscholarship award.", "Only applicants that sat for the EHEECE in 2010EC and 2011EC are eligible for the 2012EC scholarship.", "ONLY", " applicants with (1)\nvisual, hearing or mobility impairment, (2) scores on the EHEECE for\nentry to higher educational institutions in REGULAR or EXTENSION\nProgram, and (3) proved financial difficulty will be eligible for award\nconsideration.", "Only applicants without a first degree (BA or BSc) or currently not in study can apply for this Scholarship", "For More Information:", "Visit the Official Webpage of the University of Gondar Mastercard Foundation Undergraduate Scholars Program (MCFSP) 2020/2021"], "url : https://www.opportunitiesforafricans.com/university-of-gondar-mastercard-foundation-undergraduate-scholars-program-2020-2021/"], [["University of Cape Town Institute for Creative Arts (ICA) Masters Scholarships 2020/2021 for young Africans", "date announced:August 14, 2019", "Application Deadline: 4pm, Friday 30 August 2019. "], ["Application Deadline: ", "4pm, Friday 30 August 2019", ". ", " The ", "Institute for Creative Arts(ICA) ", "at the", " University of Cape Town", " invites applications for ", "MA Study in Live Art, Interdisciplinary and Public Art ", "from ", "2020-2021. ", "Choreographers, visual artists, performers, directors, composers, curators as well as creative and performing arts researchers are all invited to apply. ", "The ICA is an interdisciplinary institute in the University of Cape\nTown’s Humanities Faculty that facilitates new collaborative research\nprojects, particularly in the Creative and Performing Arts.\nInterdisciplinarity, Live Art and Public Spheres are key themes of the\nInstitute, and projects are imbued with innovation, collaboration and a\ndialogue with urbanism and community. ", "Research Focus:", "Interdisciplinary conversations, inclusive of such hybrid forms as\nsite-specific performance, mixed-media performance, post-dramatic\ntheatre, contemporary dance, live art (or performance art), performance\ncuration.", "Interdisciplinary study in relation to cultural and socio-political contexts.", "Sites for study include:", "Interdisciplinary Collaboration", "Performance Art / Live Art", "Live Art in South Africa and other parts of the African continent", "Decolonial imaginaries, the decolonial body and the body as text and site of contestation", "Spectatorship and relationships with viewing, audience involvement", "Site specificity and the creative and performing arts", "The creation of Public Spheres: open access spaces for the creation\nand reception of creative and performing arts events and discourse.", "Structure:", "\nAll students will be required to attend a regular Seminar Programme\nthroughout the year as well as a Studio Programme for the first semester\nof their degree. Students may elect to do the degree by Written Thesis\nor a Practice-Based Programme involving Practical Outcomes\n(Performances/Installations/Exhibitions for example) and Written\nExplication. Students will be based at the ICA, at UCT’s Hiddingh\nCampus, Gardens, Cape Town with co-ordination by ", "Professors Jay Pather and Mark Fleishman.", "\n ", "Scholarships:", "\nThe ICA also announces provision for scholarships valued at R100 000 per annum. ", "\nScholarships are for a two-year period: 2020-2021. The MA degree must be completed at the end of 2021.", "\nThere are four scholarships available.", "\n ", "Application process:", "\nGo to ", "http://www.ica.uct.ac.za/ica/webform/MAApplications", " where you will be required to submit an Expression of Interest comprised of the following:", "Name, Surname, Nationality, Address, Contact Numbers, Passport/ID number and Email", "CV", "Proposed Research Area and Thesis (max 300 words)", "Indicate whether you wish to pursue the study even if your application for a full scholarship is unsuccessful", "Once the selection committee has reviewed the Expressions of\nInterest, the ICA will approach a shortlist of candidates to submit a\nformal application with a full proposal.", "All candidates are encouraged to apply, and in particular black South African women.", "Deadline:", "\nApplications will be accepted via the webform above until ", "4pm, Friday 30 August 2019", ".", "\nThe ICA will not accept applications via email.", "\n ", "Queries", ": ", "[email protected]", " with the subject line ", "MA Proposal Query", ".", "For More Information:", "Visit the Official Webpage of the ICA Masters Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/university-of-cape-town-institute-for-creative-arts-ica-masters-scholarships-2020-2021-for-young-africans/"], [["Adobe Research Women-in-Technology Scholarship 2020 for Undergraduate Females Studying Computer Science ($USD10,000 Award)", "date announced:August 12, 2019", "Application Deadline: September 27th, 2019 at 5pm Pacific Time "], ["Application Deadline: September 27th, 2019 at 5pm Pacific Time ", "Here at ", "Adobe Research", " we create innovative technologies for our software products to better serve consumers, creative professionals, developers, and enterprises. We bring together the smartest, most driven people we can find, and we give them the freedom to nurture their intellectual curiosity, while providing them the necessary resources and support to shape their ideas into tangible results.", "One part of creating the best products is bringing a diverse group of people together. To bring more gender diversity to the technology industry, we are pleased to invite applications to the ", "Adobe Research Women-in-Technology Scholarship.", " The Adobe Research Women-in-Technology Scholarship recognizes outstanding undergraduate and masters female students anywhere in the world who are studying computer science.", "Eligibility Criteria", "In order to be eligible for the 2020 Adobe Research\nWomen-in-Technology Scholarship, applicants must meet all of the\nfollowing criteria:", "Be a female student currently enrolled as an undergraduate (2nd year\nor above) or masters student at a university for the 2019-2020 academic\nyear.  First year undergraduate students are not eligible.  Students\nmust have completed at least one year of university education.", "Intend to be enrolled as a full-time undergraduate or masters student at a university for the 2020-2021 academic year.", "Be majoring in computer science, computer engineering, or a closely related technical field.", "Maintain a strong academic record", "Not have a close relative working for Adobe Research.", "Applications must include:", "A resume", "Academic transcripts from your current and/or past institution", "Three references (our online application system will request letters from your references via email)", "Answers to up to four essay questions, which will be available when we start accepting applications", "An optional 60-second video or multimedia submission describing your dream career.", "If you have questions, please email ", "[email protected]", ".", "Scholarship Details", "The Adobe Research Women-in-Technology Scholarship includes:", "A $10,000 award paid once.", "A Creative Cloud subscription membership for one year.", "An Adobe Research mentor.", "An opportunity to interview for an internship at Adobe.", "The deadline for submitting a completed Women-in-Technology application is September 27th, 2019 at 5pm Pacific Time. A\ncommittee of Adobe researchers will review all applicants and select\nthe winners at their discretion. Recipients are selected based on their\nacademic record, a personal statement, and three letters of reference.\nStudents may be invited for phone interviews following the initial\nreview.", "Scholarship recipients will be announced by November 20, 2019.", "For More Information:", "Visit the Official Webpage of the Adobe Research Women-in-Technology Scholarship 2020"], "url : https://www.opportunitiesforafricans.com/adobe-research-women-in-technology-scholarship-2020/"], [["Sasol Foundation Undergraduate Bursary Programme 2020 for young South Africans (Fully Funded)", "date announced:August 11, 2019", "Application Deadline: August 31st 2019"], ["Application Deadline: August 31st 2019", " The Sasol Foundation", " ", "is offering all-inclusive bursaries to talented individuals who are planning to study full-time towards an Undergraduate Degree  to pursue  Science, Technology, Engineering and Mathematics (STEM) for applicants Nationally. To be considered, you must be a South African citizen and have acceptance or provisional acceptance for studies at a South African ", "public", " University or University of Technology for 2020.", "The Sasol Foundation is also offering STEM and Non-STEM  bursaries ", "exclusively", "\nfor qualifying children of Sasol employees, Sasol Khanyisa/Inzalo\nshareholders as well as applicants from Sasol fenceline communities. To\nbe considered, you must be a South African citizen and have acceptance\nor provisional acceptance for studies at a South African ", "public", "\nUniversity or University of Technology for 2020. In addition you must\neither be a child of a South African permanent Sasol employee, have a\nKhanyisa/Inzalo share certificate or have proof of residence in our\nfenceline communities.", "Sasol Foundation reserves the right to select qualifying individuals\nbased on academic perfomance, household income, acceptance to\nUniversity/University of Technology as well South African Citizenship. ", "Please note that applicants  who are pursuing Grade 12 in 2019 must submit their", " final Grade 11 results", ". All other applicants may submit end of year results for 2018 or for whichever year they have completed Grade 12. Applicants who are enrolled at a Higher Learning Insititution may use the end of 2018 results to apply.", "Requirements:", "To be considered for the Sasol Foundation bursary, the applicant must meet the following minimum criteria: ", "Be a South African Citizen.", "Must have acceptance or provisional acceptance for studies at a South African University or University of Technology  for 2020.", "Combined Household Income must be less than 600 000 per annum", "Must have obtained a minimum of 50% in all subjects.", "Non-STEM", " bursaries are reserved only for ", "qualifying ", "Children of Sasol Employees, Khanyisa/Inzalo Shareholders or Candidates from Sasol Fenceline communities.", "NB", ":", "The final selection will prioritise financially needy and academically competitive candidates.", "Selected individuals must be willing to go through and Interviews as well as psychometric assessments", "Please note that applicants who are in Grade 12 in 2019 must submit the ", "Grade 11 final ", "results. All other applicants may submit end of year results for 2018 or whichever year they have completed Grade 12. Applicants who were enrolled at a Higher Learning Insititution may use the end of year results to apply ", "Benefits:", "The Sasol Foundation bursary", " is a comprehensive bursary which includes the following:", "100% of the prescribed university tuition fees, registration fees and exam fees.", "An amount equal to the average rate for accommodation in a\nstandard single room at a university residence, at the university at\nwhich the Sasol bursar is studying. This rate is determined by Sasol\nFoundation in conjunction with the university.", "An amount for meals based on three meals per day, as determined by the university.", "An amount for book and pocket money", "For More Information:", "Visit the Official Webpage of the Sasol Foundation Bursary Programme 2020"], "url : https://www.opportunitiesforafricans.com/sasol-foundation-undergraduate-bursary-programme-2020/"], [["Queen Mary University of London Chevening Partner Awards 2019/2020 for Law (Fully Funded LLM in the United Kingdom)", "date announced:August 11, 2019", "Application Deadline: 6th November 2019"], ["Application Deadline: 6th November 2019", "Queen Mary", " works closely with the Chevening – the UK government’s international scheme aimed at developing global leaders – to provide a large number of full scholarships for study on our one-year Masters courses.", "Every year we host a large cohort of the 1500 Chevening Scholars who come to study at universities all over the UK. In addition the standard Chevening Awards, Queen Mary is a Chevening Partner and funds an additional awards for those who are selected by Chevening. The School of Economics and Finance is funding an additional scholarship for 2019 entry for a candidate who has an offer for MSc Economics.", "The Awards", "All Chevening awards cover full overseas tuition fees, as well as\nproviding a stipend for living costs, air-fares, and a variety of other\nexpenses.", "Chevening Scholars also benefit from a year-long programme of events helping you experience the best of British culture and to make the most of your time in the UK.", "How to Apply", "Applications for all scholarships must be made directly to the Chevening: full details on how to apply are available on the ", "Chevening’s webpages", ". ", "To be eligible for a Partner Award you must rank Queen Mary as your first choice university. ", "Applications for 2019 entry opened on 6th August and will close on 6th November.", "Candidates should also apply for their chosen Masters programme at Queen Mary through our ", "online portal", " in the normal way.", "For More Information:", "Visit the Official Webpage of the Queen Mary University of London Chevening Partner Awards 2019/2020 "], "url : https://www.opportunitiesforafricans.com/queen-mary-university-of-london-chevening-partner-awards-2019-2020/"], [["Fondazione Edu Scholarship 2019/2020 for African Undergraduate Students.", "date announced:August 21, 2019", "Application Deadline: THURSDAY OCTOBER 17TH, 2019 at 2:00pm "], ["Application Deadline: ", "THURSDAY OCTOBER 17", "TH", ", 2019 ", "at 2", ":00pm", " ", "Fondazione Edu ", "is a family foundation specializing in higher education in Africa. It was founded in 2005, to realize the desire of the founders to promote young people’s access to higher education in developing countries namely Africa.", "Its focus is on the\ndisciplines of technical-scientific and agronomic. They offer African\nstudents the opportunity to access higher education in their country of\norigin. They not only support individual growth paths, but also the\ncreation of professionalism that can, in the long run, contribute to\nsustainable socio-economic development.", "The activities of the\nFondazione Edu are designed to foster capacity building in Africa and\nresult in the provision of scholarships for university studies that\ncover the entire cost of training and the costs associated with it", "The Students Financial Aid Office (SFAO) is accepting 2019/20 applications for the award of the Fondazione Edu scholarship scheme for ", "Level 100 students from areas of need", ".", "The Scholarship will cover tuition, books, as well as room and board,\nand will be awarded for four years as long as excellent academic\nstandards of at least a", " B average of 3.00 CGPA ", "continue to be met and ", "need is demonstrated.", "You are eligible to apply if in addition to UG-SFAO eligibility requirements you:", "1. Are a Level 100 student.", "2. Obtained an aggregate of 14 or better at the WASSCE.", "3. Are able to demonstrate limited family income and/or insufficient funds to cover most or all educational related expenses.", "4. Have the will to succeed (determination, perseverance and success in other pursuits).", "5. Continuing science student with CGPA 3.75 and above (very limited slots)", "Download and Submit a completed", " FE- SFAO FORM AF SCHOLARSHIP APPLICATION", " and\nthe required essays, a copy of your academic records (WASSCE grades)\nletters of recommendation and supporting need documents.", "For enquiries call the Students Financial Aid Office on", " 020-518-6904/0302- 945-312", " or", "email:   ", "[email protected]", "The STUDENTS FINANCIAL AID OFFICE is located at ", "House No. 11 East Legon – Main Campus ", "behind the College Basic  and opposite CEGENSA.", "NOTE: SCIENCE STUDENTS ARE ENCOURAGED TO APPLY", "SUPPORTING DOCUMENTS", "The following are examples of documents that can be used to support this application:", "For need:", "Official pay slip or payroll record of parents/guardians or the applicant.", "Recent school receipts/ bills of siblings of school going age.", "Tax return receipts– IRS, VAT, tabletop hawking receipts, etc.", "Birth Certificates (of siblings).", "Death Certificate or Burial permit (in case of death of a parent).", "Pension letter for retired parents/guardians.", "Bank Statements / Ghana Cocoa Board Farmers Association Passbook.", "SSNIT contribution statements.", "Money transfer receipts.", "National Health Insurance receipts (showing premium paid).", "Evidence of other dependents of parents/guardians.", "Any other supporting documents that you believe will assist in the processing, of your application.", "For Academic", "High School Transcripts (Terminal Reports)", "West African Senior School Certificate Exam Results (WASSCE)", "University Acceptance Letter", "Records\nregarding achievement tests, academic awards, honors, and substantive\nassessments by teachers, including letters of recommendation.", "Confirm that you are not currently receiving support through any other scholarship program", "For More Information:", "Visit the Official Webpage of the Fondazione Edu Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/fondazione-edu-scholarship-2019-2020/"], [["Mo Ibrahim Foundation Governance for Development in Africa Initiative (GDAI) 2020 PhD Scholarships in the UK (Fully Funded)", "date announced:August 29, 2019", "Application Deadline: 31st March 2020. "], ["Application Deadline: ", "31st March 2020.", " ", "The Centre of African Studies offers 2 PhD scholarships ", "to African nationals as part of the Governance for Development in Africa Initiative funded by the Mo Ibrahim Foundation.", "Applications are invited for PhD studentships focused on the area of\nstate capacities, governance and bureaucracy for development. This may\ninclude projects designed to understand public sector governance\ncapabilities, political settlements, state business relations, the\ngovernance of state owned enterprises, the governance of development\npolicy design and implementation, and so on. But applications must focus\non the public sector/state/civil service, on governance, and on\ndevelopment. ", "In order to be considered for funding, applicants must first secure an ", "UNCONDITIONAL OFFER ", "for the PhD by applying directly to the ", "SOAS Doctoral School", ".", "The eligible PhD are only those within the following departments:", "Development Studies", "Law", "Economics", "International Relations/Politics", "CISD (Centre for International Studies and Diplomacy)", "DEFIMS (Department for Financial and Management Studies )", "Distance Learning: ", "CEFIMS(Centre for Financial and Management Studies", "), ", "DEFIMS", "Once the place is secured, the applicants can apply for the\nscholarship. Candidates will be assessed on academic merit by a panel\nconsisting of SOAS academic members. The assessment of your application\nwill be based on the information in your scholarship application. Please\nprovide the following documents:", "a copy of the unconditional offer received from SOAS admissions office", "CV (please include your email address)", "2 pages max statement outlining knowledge and interest in governance-related issues", "Your research proposal (as sent to the SOAS Admissions Office)", "one academic reference (to be sent directly by referee to ", "[email protected]", ")", "Please note that CAS reserves the right not to award scholarships and will only award them where there are applicants judged to meet sufficiently high academic standards and with demonstrable interests in fields relevant to the objectives of the GDAI.", "Contact", "Angelica Baschiera", "Coordinator", "Mo Ibrahim Foundation Governance for Development in Africa Initiative", "SOAS", "Email:", " ", "[email protected]", "For More Information:", "Visit the Official Webpage of the GDAI 2020 PhD Scholarships"], "url : https://www.opportunitiesforafricans.com/mo-ibrahim-foundation-governance-for-development-in-africa-initiative-gdai-2020-phd-scholarships/"], [["University of Michigan African Presidential Scholars Program 2020/2021 for Study in USA (Fully Funded)", "date announced:August 15, 2019", "Application Deadline: October 15 2019"], ["Application Deadline: ", "October 15", " 2019", "Starting in 2020, the", " UMAPS program", " will host two cohorts per year (August through December, and January through May). Applicants will have the opportunity to indicate their preference for a particular cohort during the application process.", "UMAPS accepts direct applications from faculty members of\ncolleges or universities in Ethiopia, Ghana, Liberia, South Africa, and\nUganda.", "Faculty members of colleges and universities in all other African\ncountries can only  apply to the UMAPS program upon nomination by a U-M\nfaculty member with whom they have a pre-existing relationship.", "Eligibility Requirement", " ", "*Previous recipients of the\nUMAPS fellowship are not eligible to apply. Preference will be given to\napplicants without extensive international experience outside the\ncontinent.", "All applicants must:", "Be an early career faculty member who has taught in the higher\neducation system for less than ten years, presently teaching in a\ncollege or university in Africa", "Be able to demonstrate support from home institution with letter of\nrecommendation from head of department, dean, or vice chancellor", "Be able to remain in residence for five months", "Applicants outside of Ethiopia, Ghana, Liberia, South Africa, or Uganda ", "must be nominated by a University of Michigan faculty member", " with whom the interested applicant already has a pre-existing/established relationship.", "The nominating faculty must:", "Complete the online nomination form (for University of Michigan faculty only; access requires U-M login)", "\u0007Submit /upload a letter of endorsement that indicates their\nwillingness to serve as a mentor during the length of the residency,\ncommit to meet regularly, and provide an office space for the\nprospective participant", "Note: Upon receipt of the U-M faculty’s nomination form, ASC will send the invitation to apply to the potential candidate.", "\nApplication Checklist and Timeline\n", "All applicants must:", "Complete the online application form » (This link can only be used\nby applicants from the following countries: Ethiopia, Ghana, Liberia,\nSouth Africa, or Uganda)", "Upload a curriculum vitae using the online application", "Upload a ", "scholarly program/research proposal", " (not to exceed five pages)", " Applications from a wide range of disciplines and schools are welcome; applications that align with the center’s initiatives—", "AHHI", ", ", "ASRI", ", and ", "STEM-Africa", "—are encouraged ", " ", "Provide complete name and contact information of the department\nhead, dean, or vice chancellor at the applicant’s home institution who\nwill be writing their ", "letter of support", "Applications will be reviewed after the ", "closing date on October 15", ". Incomplete applications will not be processed. ", "Only applications submitted through the online system will be considered. ", "For More Information:", "Visit the Official Webpage of the University of Michigan African Presidential Scholars Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/university-of-michigan-african-presidential-scholars-program-2020-2021/"], [["Clements Worldwide Expat Youth Scholarship (EYS) 2019 (US$USD 10,000 Prize)", "date announced:August 16, 2019", "Application Deadline: 30-September 2019 23:59 EDT "], ["Application Deadline: 30-September 2019 23:59 EDT ", " The Expat Youth Scholarship (EYS) program", " is a yearly scholarship for students aged 13 to 21 experiencing life outside their home country. Clements has awarded over $100,000 USD in scholarships over the last ten years. Join today at ", "expatyouthscholarship.com", " for an opportunity to win a scholarship.     ", "With each year, the ", "Expat Youth Scholarship", " has grown drastically in the number and creativity of submissions from expat youth around the world. After 10 years of Scholarship contributions, we have decided to celebrate this year with a Special Edition! ", "The Challenge ", "What is an experience that you as an expat can appreciate that a tourist couldn’t? ", "Expats can fully immerse themselves in their local communities and\ncultures in ways that short-term tourists are not be able to. “Ike”—the\nClements mascot—is a tourist visiting you. Show him something you get to\ndo that a visitor probably wouldn’t. Include him in a photo, drawing,\npainting, or some other visual media. You can take a photo with him,\ninclude him in a scene, photograph him at a location, or paint him.\nThese are just a few examples—be creative! ", "Entries can be submitted at ", "expatyouthscholarship.com", ".\nEligible contestants should complete the submission form, and wait for\nyour entry to be reviewed. Once it is approved, it will be displayed in\nthe contest gallery. Having trouble? Email us at ", "[email protected]", ". ", "Eligibility ", "Students aged 13-21 of any nationality who were expatriates for at\nleast 1 year are eligible. See the rulebook for specific eligibility\nrequirements. ", "Timeline ", "Contest Entries Open 15-Aug 23:59 EDT ", "Contest Entries Close 30-Sep 23:59 EDT ", "Winners Announced 25-Oct ", "    ", "For More Information:", "Visit the Official Webpage of the Clements Worldwide 8th Annual Expat Youth Scholarship (EYS) Contest 2019"], "url : https://www.opportunitiesforafricans.com/clements-worldwide-expat-youth-scholarship-eys-2019/"], [["Commonwealth Master’s Scholarships 2020 for full-time Master’s study at a UK university (Fully Funded)", "date announced:August 29, 2019", "Application Deadline: 16:00 (GMT) on 30 October 2019  "], ["Application Deadline: ", "16:00 (GMT) ", "on ", "30 October 2019 ", " ", "Commonwealth Master’s Scholarships", " ", "are for candidates from low and middle income Commonwealth countries, to undertake full-time taught Master’s study at a UK university.", "Funded by the ", "UK Department for International Development (DFID)", ",\nCommonwealth Master’s Scholarships enable talented and motivated\nindividuals to gain the knowledge and skills required for sustainable\ndevelopment, and are aimed at those who could not otherwise afford to\nstudy in the UK. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2020", "By September 2020, hold a first degree of at least upper second class (2:1) honours standard, or a second class degree (2:2) and a relevant postgraduate qualification (usually a Master’s degree). The CSC would not normally fund a second UK Master’s degree. If you are applying for a second UK Master’s degree, you will need to provide justification as to why you wish to undertake this study", "Be unable to afford to study in the UK without this scholarship", "Have provided all supporting documentation in the required format", "Scholarship Worth:", "Each scholarship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor the cost of journeys made before your award is confirmed)", "Approved tuition fees Stipend (living allowance) at the rate o £1,110 per month, or £1,362 per month for those at universities in the London metropolitan area (rates quoted at 2019-2020 levels)", "Warm clothing allowance, where applicable Thesis grant towards the cost of preparing a thesis or dissertation, where applicable", "Study travel grant towards the cost of study-related travel within the UK or overseas If you are widowed, divorced, or a single parent, child allowance of £476 per month for the first child, and £117 per month for the second and third child under the age of 16, if you are accompanied by your children and they are living with you at the same address in the UK (rates quoted at 2019-2020 levels)", "Eligible Commonwealth countries", "Antigua and Barbuda", " Bangladesh", " Belize", " Botswana", " Cameroon", " Dominica", " Eswatini", " Fiji", " The Gambia", " Ghana", " Grenada", " Guyana", " India", " Jamaica", " Kenya", " Kiribati", " Lesotho", " Malawi", " Malaysia", " Mauritius", " Montserrat", " Mozambique", " Namibia", " Nauru", " Nigeria", " Pakistan", " Papua New Guinea", " Rwanda", " Samoa", " Sierra Leone", " Solomon Islands", " South Africa", " Sri Lanka", " St Helena", " St Lucia", " St Vincent and the Grenadines", " Tanzania", " Tonga", " Tuvalu", " Uganda", " Vanuatu", " Zambia", "Selection process", "Each year, the CSC invites selected nominating bodies to submit a\nspecific number of nominations. The deadline for nominating bodies to\nsubmit nominations to the CSC is 18 December 2019", "The CSC invites around three times more nominations than scholarships\navailable – therefore, nominated candidates are not guaranteed to be\nawarded a scholarship. There are no quotas for scholarships for any\nindividual country. Candidates nominated by national nominating agencies\nare in competition with those nominated by other nominating bodies, and\nthe same standards will be applied to applications made through either\nchannel.", "Applications will be considered according to the following selection criteria:", "Academic merit of the candidate", "Quality of the plan of study", "Potential impact on the development of the candidate’s home country", "How to apply", "You must apply to one of the following nominating bodies in the first instance – ", "the CSC does not accept direct applications for these scholarships", ":", "National nominating agencies", " – this is the main route of application", "Selected non-governmental organisations and charitable bodies", "All applications ", "must", " be made through one of these\nnominating bodies. Each nominating body is responsible for its own\nselection process and may have additional eligibility criteria. ", "You\nmust check with your nominating body for their specific advice and\nrules for applying, their own eligibility criteria, and their own\nclosing date for applications.", "You must make your application using the CSC’s online application\nsystem, in addition to any other application that you are required to\ncomplete by your nominating body. ", "The CSC will not accept any applications that are not submitted via the online application system. ", "All applications must be submitted by ", "16:00 (GMT) ", "on ", "30 October 2019 ", "at the latest.", "You can ", "access the online application system", " now", "Please note that the CSC does not charge candidates to apply for any\nof its scholarships or fellowships through its online application\nsystem, and it does not charge organisations to nominate candidates.", "Choosing a university/course", "You may find the following resources useful when researching your choices of institution and course of study in the UK:", "Study UK", " – British Council website, with guidance for international students and a course and institution search", "Steps to Postgraduate Study", " – a guide to asking the right questions about taught postgraduate study in the UK", "Postgrad.com", " – information for postgraduate students, with a course search", "Prospects", " – information on postgraduate study in the UK", "Research Excellent Framework 2014 results", " – results of a system for assessing the quality of research in UK higher education institutions", "UCAS Postgraduate", " – guidance on how to find and apply for a postgraduate course", "Unistats", " – the official website for comparing UK higher education course data", "UKCISA", " (UK Council for International Student Affairs) – advice for international students on choosing a course of study", "The CSC is not responsible for the content of external sites.", "For More Information:", "Visit the Official Webpage of the Commonwealth Master’s Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/commonwealth-masters-scholarships-2020/"], [["The Government of Japan Exchange and Teaching Programme 2020 for young South Africans (Fully Funded to Japan)", "date announced:August 20, 2019", "Application Deadline: NOVEMBER 8, 2019  "], ["Application Deadline: ", "NOVEMBER 8, 2019 ", " ", " ", "The Japan Exchange and Teaching Programme", " seeks to enhance internationalisation in Japan by promoting mutual understanding between the people of Japan and those of other nations. The Programme aims to enhance foreign language education and promote international exchange at the local level through the fostering of ties between Japanese youth and foreign youth alike.", "The objectives of the Programme are\nbeing achieved by offering JET Programme participants (hereinafter,\nparticipants) the opportunity to serve in local authorities as well as\npublic and private elementary, junior high and senior high schools in\nJapan.", "The Programme is implemented by local authorities and\nother organisations (hereinafter, contracting organisations) of Japan in\ncooperation with the Ministry of Internal Affairs and Communications,\nthe Ministry of Foreign Affairs, the Ministry of Education, Culture,\nSports, Science and Technology, and the Council of Local Authorities for\nInternational Relations (hereinafter, CLAIR).", "The JET Programme\nstarted in 1987 with cooperation from governments of participating\ncountries. In 2019, there were 5,761 participants on the Programme from\n57 countries.", "As the Programme has achieved an excellent\nreputation over the last 33 years, it is of great importance that this\nreputation be maintained. Participants are invited to Japan as\nrepresentatives of their countries. As such, they are expected to be\nresponsible in all their activities, especially those concerning the\npromotion of mutual understanding between nations. It is therefore\ndesirable that participants be adaptable, mentally and physically\ncapable of performing the job duties and have a deep interest in Japan.", "Generally, participants are appointed by a contracting organisation for a one-year period. The cost of transportation from the participant’s origin to Japan, as well as remuneration, will be funded by the tax payers of Japan via the contracting organisation where the participant is appointed. Because participants serve as civil servants of their contracting organisations, they are required to uphold behaviour befitting civil servants. ", " ELIGIBILITY CRITERIA", "1) As part of the general criteria, applicants must: ", "(1) Be interested in Japan and be willing to deepen their knowledge and appreciation of Japan after their arrival; be motivated to participate in and initiate international exchange activities in the local community; make effort to study or continue studying the Japanese language prior to and after arriving in Japan.", "(2) Be both mentally and physically healthy. ", "Position and duties", " Participants engaged in language instruction. ALTs are placed mainly in local boards of education or publicly run elementary, junior high and senior high schools.", " Participants who are mainly assigned to local boards of education or elementary, junior high or senior high schools are to carry out their duties as ALTs under the guidance of language teachers’ consultants or Japanese teachers of the foreign language as specified by the supervisor and/or principal of the board of education and/or school. The following is a general outline of duties, though they may vary from one contracting organisation to another.", " 1)Assistance in foreign language classes, etc. taught in junior and senior high schools.", " 2)Assistance in foreign language activities, etc. in elementary schools.", " 3)Assistance in preparation of materials for teaching a foreign language.", " 4)Assistance in language training of teachers of a foreign language, etc.", " 5)Assistance in extracurricular activities and club activities.", " 6)Provision of information on language and other related subjects for people such as teachers’ consultants and foreign language teachers (e.g. word usage, pronunciation, etc.).", " 7)Assistance in foreign language speech contests.", " 8)Engagement in local international exchange activities.", " 9)Other duties as specified by the contracting organisation. ", "The Government of Japan is calling for applications from young\nSouth Africans who would like to spend at least one year in Japan as\nAssistant Language Instructors (ALTs) under a highly successful\ninternational exchange programme for university graduates.", "\nPLEASE COURIER (WITH A TRACKING NUMBER) OR HAND DELIVER YOUR COMPLETE APPLICATION PACKAGE TO: ", "\nEMBASSY OF JAPAN", "\nJET PROGRAMME", "\n259 BAINES STREET", "\nGROENKLOOF", "\nPRETORIA", "\n0181", "\nDEADLINE:  ", "NOVEMBER 8, 2019 (APPLICATIONS MUST ARRIVE AT THE EMBASSY OF JAPAN BY THIS DATE)", "\nRESULTS: Successful and Unsuccessful Applicants will be contacted by e-mail – Please DO NOT contact the Embassy of Japan to enquire about the outcome of your application.\n", "For More Information:", "Visit the Official Webpage of the Government of Japan Exchange and Teaching Programme 2020"], "url : https://www.opportunitiesforafricans.com/the-government-of-japan-exchange-and-teaching-programme-2020/"]]