[[["UNICAF 2018 Scholarships to study online at University of South Wales", "date announced:May 8, 2018", "Application Deadline: October 22, 2018"], ["Application Deadline: ", "October 22, 2018", "The University of South Wales is a major player in UK higher education. The University is renowned for its partnerships with major employers all over the world. The university has partnered with UNICAF to offer you scholarships for a variety of courses.", "You can ", "take the Sqore challenge", " and win a scholarship of up to 50% to study one of the online Bachelors or Masters programmes at Unicaf University:", "MA Education (Innovation in Learning and Teaching)", "MSc in Psychology", "LLM (Master of Laws)", "Take the Sqore challenge now for a chance to win a scholarship.", " All you need to do is: take a short quiz and fill in your details!", " ", "For More Information:", "Visit the Official Webpage of the UNICAF Scholarship Programme Online studies at University of South Wales"], "url : https://www.opportunitiesforafricans.com/2018-scholarships-to-study-online-at-university-of-south-wales/"], [["Wits School of Law and International Institute of Social Studies (ISS) (Erasmus University Rotterdam) PhD programme 2018 – Tuition Fee Waiver.", "date announced:May 9, 2018", "Application Deadline: 8 June 2018."], ["Application Deadline: 8 June 2018.", "The ", "Wits School of Law and International Institute of Social Studies (ISS) (Erasmus University Rotterdam)", " invites applications from prospective PhD applicants on a range of topics in international law, society and development such as:", "Critical, development-oriented aspects of trade and investment", "Socio-economic deprivation", "Human rights and humanitarian law", "Gender", "Health and the environment", "The ISS-Wits joint programme forms part of the ISS research group on Governance, Globalisation and Social Justice (GGSJ). Research performed by members of the group explores how and to what extent particular governance arrangements help or hinder the achievement of goals of social justice.", "Applicants must be at entry-level for a PhD with an average of at least 70% in a Master’s degree within a relevant area. Applicants must have a legal background and must have obtained an LLB degree.", "Fee Waivers and Costs", "Applicants who are successfully admitted to the programme will be ", "waived of", " ", "tuition fees", " from both ISS and Wits. A limited, 6-month scholarship is available, but candidates are responsible for covering their own living and research costs.", "Application", "Interested applicants may apply for entry into the ISS-Wits Joint PhD Programme by submitting the following:", "An expression of interest, with a working title, that outlines the gist of the PhD study that you wish to undertake (approximately five pages in length excluding your preliminary bibliography);", "Academic transcript; and", "Curriculum Vitae.", "Applications should be emailed to ", "[email protected]", " by 8 June 2018.  If you have not heard back within one month please consider your application unsuccessful.", "For more details visit: ", "www.iss.nl/jointwitsphd", "General enquiries i.e. degree structure, admissions, timelines, and fees: ", "[email protected]", "Academic Related enquiries: (Wits) ", "[email protected]", ", ", "(ISS) ", "[email protected]", " ", "Official Call for Application", "For More Information:", "Visit the Official Webpage of the Wits-ISS PhD programme"], "url : https://www.opportunitiesforafricans.com/wits-iss-phd-programme-2018/"], [["African Palliative Care Association (MSc & PhD) 2018 scholarships for Africa-based healthcare professionals", "date announced:May 1, 2018", "Application Deadline: Friday 14th September 2018."], ["Application Deadline: ", "Friday 14th September 2018.", "These scholarships, one MSc and one PhD, will enable students who for financial reasons would otherwise be unable to do so, to attend these highly acclaimed courses.", "The MSc and PhD in Palliative Care", " have made a global impact on the volume of high quality research used to inform clinical care and palliative care policy. The MSc has a total 741 outputs from its alumni so far, which includes research in scientific journals and academic textbooks such as the British Medical Journal and the Oxford Textbook of Palliative Medicine.", "The scholarships for these courses will allow students to gain essential qualifications, skills and experience that can be applied to local healthcare settings and to meet palliative care needs in Africa. The Cicely Saunders Institute is committed to working with funders to provide training for health care professionals in under-resourced countries and is pleased to welcome applications from African citizens who currently reside in Africa.", "Requirements:", "The MSc in Palliative Care is open to doctors, nurses, and health and social care professionals, working with patients with advanced disease, or relevant health or social scientists who have an upper second honours degree or equivalent. To apply for the schorship, you must fulfil all the criteria below:", "1. You must have a degree in medicine, nursing or denistry, or a 2.1 degree or equivalent in life sciences or social sciences awarded by a UK or recognised overseas university", "2. You must be able to demonstrate experience of working in palliative care or palliative medicine clinical or social care, or palliative care research.", "3. You must have an interest in conducting research in Advanced Care Planning and be willing to conduct your research project in this area, which you will be supported in publishing.", "How to apply:", "Please send the following documents:", "Your CV (maximum 2 pages)", "A letter of support from your current employer.", "Personal statement (maximum 800 words) in support of your application, explaining your reasons for applying, what you hope to gain from the MSc, your ability to complete the programme of study, and your interest in Advanced Care planning", "2 references", "MSc candidates must also apply online here: ", "https://myapplication.kcl.ac.uk/", "(If you do not apply online, your application for the scholarship will be rejected).", "Please send these documents by email to:", "Mark Willis", "MSc Administrator", "Tel: +44 207 848 5435", "Email: ", "[email protected]", "The deadline for receipt of applications is Friday 14th September 2018.", "If you are shortlisted, you will be invited to an interview which will take place in October 2018.", "For More Information:", "Visit the Official Webpage of the African Palliative Care Association (MSc & PhD) 2018 scholarships "], "url : https://www.opportunitiesforafricans.com/african-palliative-care-association-msc-phd-2018-scholarships-for-africa-based-healthcare-professionals/"], [["Jim Ovia Foundation Leaders Scholarship 2018/2019 for Undergraduate study at the Ashesi University in Ghana and Covenant University in Nigeria.", "date announced:April 20, 2018", "The Jim Ovia Foundation Leaders Scholarship is a partnership between the Jim Ovia Foundation and the Africa-America Institute, to educate young Africans to lead the continent. Through our University partners, the Jim Ovia Foundation Leaders Scholarship will provide comprehensive scholarships to select high achieving students, from under resourced backgrounds, a full education that will provide them with the necessary skills for a dynamic and innovation-driven career."], ["The ", "Jim Ovia Foundation Leaders Scholarship", " is a partnership between the ", "Jim Ovia Foundation", " and the Africa-America Institute, to educate young Africans to lead the continent. Through our University partners, the Jim Ovia Foundation Leaders Scholarship will provide comprehensive scholarships to select high achieving students, from under resourced backgrounds, a full education that will provide them with the necessary skills for a dynamic and innovation-driven career.", "This scholarship is made possible through the generous philanthropy of the Jim Ovia Foundation and is currently offered through", " Ashesi University in Ghana and Covenant University in Nigeria.  ", "The Jim Ovia Foundation Leaders Scholarship will provide the following benefits:", "Comprehensive Scholarships:", "the Jim Ovia Foundation Leaders Scholarship will provide tuition, room and board for undergraduate study.", "Career Support and Opportunities: ", "Scholarship recipients will receive career counseling and support while still students and also after graduation.", "AAI Global Alumni Network: ", "Recipients of the Jim Ovia Foundation Leaders Scholarship will graduate into one of the most prestigious alumni networks. AAI Alumni include prominent leaders in many sectors around Africa and the Globe and includes two sitting Presidents. Scholarship recipients will be connected to this network for potential opportunities, mentorship and the ability to collectively continue towards developing the continent.", "   Students must also meet the following requirements:", "Must be a citizen of an African country, residing in Africa", "Exhibit strong academic record and penchant for high-achievement", "Demonstrate a Financial Need", "Present an active record of youth leadership within his/her community", "Application Procedure”", "To be considered for the ", "Jim Ovia Foundation Leaders Scholarship at Ashesi University,", " students must complete the application process, including submission of a ", "General Scholarship Form", ", as detailed on ", "http://www.ashesi.edu.gh/admissions/how-to-apply.html", "To be considered for the", " Jim Ovia Foundation Leaders Scholarship at Covenant University,", " students must complete the application process for admission at the following link: ", "http://covenantuniversity.edu.ng/", " ", "For More Information:", "Visit the Official Webpage of the Jim Ovia Foundation Leaders Scholarship 2018/2019"], "url : https://www.opportunitiesforafricans.com/jim-ovia-foundation-leaders-scholarship-2018/"], [["UNESCO Institute for Lifelong Learning (UIL) CONFINTEA Research Scholarships 2018", "date announced:April 18, 2018", "Application Deadline: 31st May 2018"], ["Application Deadline: ", "31st May 2018", "In September 2018, ", "the UNESCO Institute for Lifelong Learning (UIL)", " ", "will offer at least three ", "CONFINTEA Research Scholarships", " for a period of one month each to researchers from UNESCO Member States and/or Associate Member States.", "Prospective scholars will be able to benefit from using UIL’s knowledge base and resources for their research in the area of ", "lifelong learning", " with a focus on ", "adult and continuing education", ", ", "literacy, and non-formal basic education", ".", "Since the ", "UIL Research Scholarship Programme", " was launched in 2012, 48 scholars have taken part. Participants are selected based on their potential to produce articles, research papers, programme tools or policies that can be shared with decision-makers and that will have an impact on the education sector in their home countries. UIL particularly welcomes applicants from the Global South.", "Requirements:", "Researchers and education professionals from UNESCO Member States who work in the area of lifelong learning with a focus on adult education and continuing education, literacy and non-formal basic education.", "Participants are selected on the basis of their potential to produce:", "policy proposals;", "programme tools;", "articles; and", "research papers", "that can be shared with decision-makers in their home countries.", "Benefits:", "UIL will provide each scholar with a workstation and access to the considerable resources of its ", "unique library", ". In addition, scholars will have a chance to exchange knowledge with other scholars, UIL staff and its external partners. They will work under the supervision of a UIL specialist, but they should also be prepared to work on their own initiative.", "UIL will arrange and pay for health insurance, accommodation close to the Institute, and a return economy ticket to Hamburg, Germany, where the Institute is based. Additionally, scholars will receive a lump sum of €500 contributing to other costs incurred before, during and after their research stay at UIL (such as visa costs, transport, and daily subsistence).", "How to Apply:", "In order to apply, please submit the following:", "Interested candidates are asked to submit their application by ", "31 May 2018", " to UIL Research Scholarship Coordinator Ms Lisa Krolak, at ", "[email protected]", "A covering letter", "A brief research proposal", "An up-to-date CV", "For More Information:", "Visit the Official Webpage of the CONFINTEA Research Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/unesco-institute-for-lifelong-learning-uil-confintea-research-scholarships-2018/"], [["Japanese Government (Monbukagakusho) MEXT Scholarships 2019 for Study in Japan (Fully Funded)", "date announced:April 19, 2018", "Application Deadline: Varying by Country"], ["Application Deadline: Varying by Country", "The Ministry of Education, Culture, Sports, Science and Technology (MEXT)", " offers scholarships to international students who wish to study at Japanese universities as undergraduate students under the ", "J", "apanese Government (MEXT) Scholarship Program for 2019", " as follows.", "Types of Japanese Government (Monbukagakusho) Scholarships", "There are six types of ", "Japanese Government (Monbukagakusho) Scholarships.", " Each type has its own eligibility requirements, so please apply for the type that best fits your personal criteria.", "Research students", "You must be under 35 years of age and a college graduate (includes prospective graduates). Or you must have completed 16 years of schooling.", "Teacher training students", "You must be under 35 years of age and a graduate of a college or teacher training college. You must have at least five years of active experience as a teacher in a primary, secondary or teacher training college in your country. (Please note that college and university teachers currently in active service are not considered for this scholarship).", "Undergraduate university students", "You must be at least 17 and under 22 years of age and have completed 12 years of school education or have completed courses in a school comparable to a high school (includes prospective graduates).", "Japanese studies students", "Applicants must be from 18 to 30 years old. Applicants must be enrolled as undergraduate students in faculties or schools which major in Japanese language or Japanese culture in a university outside Japan at the time when they come to Japan and must be enrolled in the home institution at the time when they return to their home countries.", "College of technology students", "You must be at least 17 and under 22 years of age and have completed school education comparable to a high school (a minimum of 11 years beginning in primary school) education (includes prospective graduates).", "Special training college students", "You must be at least 17 and under 22 years of age and have completed 12 years of schooling or have completed school education comparable to a Japanese high school (includes prospective graduates).", " ", "Eligibility Requirements:", "Research student", "Teacher training student", "Undergraduate student", "Japanese studies student", "College of technology student", "Special training college student", "Level of studies", "Graduate school level", "Undergraduate level", "Eligibility requirement", "University or college graduate", "University, college graduate or equivalent", "Secondary school graduate or equivalent", "University student (undergraduate level)", "Graduates of secondary schools or equivalent", "Age limit (at time of granting)", "Under 35", "At least 17 and under 22", "At least 18 and under 30", "At least 17 and under 22", "Duration", "Maximum 2 years including Japanese-language training", "Maximum 1 year 6 months including Japanese-language training", "5 years including Japanese-language training (7 years for medicine, dentistry, pharmacy and veterinary science)", "One academic year", "4 years including Japanese-language training(4 and a half years for merchant marines studies)", "3 years including Japanese-language training", "Preliminary Japanese-language training", "6 months (54 universities such as Hokkaido University)", "\nThose with sufficient Japanese proficiency are not required to go through preliminary Japanese- language training.", "1 year", "\n(Tokyo University of Foreign Studies and Osaka University)", "None", "1 year", "\n(Independent Administrative Institution: Japan Student Services Organization, Tokyo Japanese Lanugage Education Center)", "1 year", "\n(Bunka Institute of Language, Independent Administrative Institution: Japan Student Services Organization, Osaka Japanese Lanugage Education Center)", "Fields of study", "Major in field of specialty at a graduate school", "Special training at a teacher training department", "Undergraduate education", "Japanese language or special training related to Japan", "Third year college of technology courses", "Post secondary courses", "Designated countries", "Worldwide (168 countries and regions)", "Developing countries, etc. (64 countries and regions)", "Worldwide (100 countries and regions)", "Worldwide (74 countries and regions)", "Developing countries (40 countries and regions)", "Developing countries, etc. (49 countries and regions)", "Planned number of new scholarship recipients", "4,042 people", "89 people", "460 people", "190 people", "86 people", "90 people", "Scholarship stipend", "¥143,000～148,000 per month", "¥117,000～120,000 per month", "Tuition", "Tuition for national universities and Institute of National College of Technology waived; tuition for public and private universities paid for by the Ministry of Education, Culture, Sports, Science and Technology", "Travel allowance", "Roundtrip fare (air ticket) provided", "Embassy recommendation", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "University recommendation (overseas application)", "Yes", "No", "No", "Yes", "No", "No", "University recommendation (local acceptance)", "Yes", "No", "Yes (For the final only)", "No", "No", "No", " Eligibility", "\ni) Applicants must have the nationality of a country that has diplomatic relations with Japan. An applicant who has Japanese nationality at the time of application is not eligible. However, persons with dual nationality who hold Japanese nationality and whose place of residence at the time of application is outside of Japan are eligible to apply as long as they choose the nationality of the foreign country and give up their Japanese nationality by the date of their arrival in Japan. Applicant screening will be conducted at the Japanese diplomatic mission in the country of applicant’s nationality.", "\nii) Applicants must be willing to learn Japanese. Applicants must be interested in Japan and be willing to deepen their understanding of Japan after arriving in Japan. In addition, in principle, applicants must be willing to carry out their academic studies in Japan in Japanese.", "\niii) Applicants must be free from any mental or physical disabilities that would impede the pursuit of study at Japanese universities.", "\niv) Military personnel or military civilian employees at the time of arriving in Japan are ", "not", " eligible.", "\nv) Availability on arriving in Japan by April/ October 2019", "\nvi) ", "Applicants generally must have been born on or after April 2, 1984", "\nvii) Undergraduate Degree holders from universities and/or colleges with a total mark of ", "GPA3.2/ Second Class Upper Division or higher", ". Applicants for this program must submit a complete research proposal at the time of applying", "SCHOLARSHIP BENEFITS", "Allowance: 117,000 yen per month. The scholarship is cancelled in principle if the recipient is absent from the university or preparatory Japanese-teaching institution for an extended period. In case that the recipient research in a designated region, 2,000 or 3,000 yen per month will be added. The monetary amount each year may be subject to change due to budgetary reasons.", "The scholarship will be also cancelled in principle in the following situations. If the recipient has been receiving the scholarship despite his/her falling under any of the following situations, the recipient will be ordered to return the amount of scholarship that he/she received during the period wherein he/she was involved with any of the following situations", "The recipient is determined to have made a false statement on his/her application", "The recipient violates any article of his/her pledge to MEXT;", "The recipient violates any Japanese laws and is sentenced to imprisonment with or without work for life or for a period of exceeding 1 year;", "The recipient is subject to disciplinary action by the university, including expulsion (The scholarship payment may be stopped during the period up until punishment is decided by the university, etc.)", "It has been determined that it will be impossible for the recipient to complete the course within the standard course period because of poor academic grades or suspension or leave of absence;", "The recipient’s residence status has changed to one other than “College Student”;", "The recipient has received a scholarship from another institution (excluding those specified for research expenditures)", "The recipient has proceeded to a higher level of education without receiving approval for an extension of the period of the scholarship", "Tuition and Other Fees: Fees for the entrance examination, matriculation, and tuition at universities will be paid by MEXT.", "Traveling Costs", "Transportation to Japan: In principle, MEXT stipulates the travel schedule and route, and provides an economy-class airline ticket for the flight from the international airport closest to", "the recipient’s residence (in principle, the country of nationality) to Narita International", "Airport or to any other international airport on the normal route to the accepting university.", "Application Process:", "Japanese Government Scholarship students are recruited and selected in three ways:", "For those outside of Japan", "Embassy Recommendation", "\nUniversity recommendation", "For those already in Japan", "Domestic Selection", "Embassy recommendation", "\nIn this type of scholarship, scholarship recipients are recruited and initially screened by a Japanese embassy (or consulate general, depending on the country). \u2028As the application process differs according to the country in which the Japanese embassy is located, please inquire at the Japanese embassy or consulate general in your country for details.", "\nList of Websites of Japanese Embassies, Consulates and Permanent Missions", "University recommendation", "\n(1) Research students and Japanese studies students who will be studying in Japan as an exchange student based on inter-university student exchange agreements can be screened through the national, public or private Japanese university involved as a candidate for a Japanese Government Scholarship. The university directly recommends the selected candidates to the Japanese Ministry of Education, Culture, Sports, Science and Technology (MEXT).", "(2) Research students recommended by a university for study in Japan as government-sponsored scholarship recipients basically arrive in Japan in October.", "Japanese studies students basically arrive in Japan in October according to the university program. Universities recommend candidates to the Ministry of Education, Culture, Sports, Science and Technology (MEXT) by mid-April.", "\n３．Domestic Selection", "\n(1) Privately financed, full-time postgraduate foreign students, prospective postgraduate students, and full-time, prospective fourth-year undergraduate university students (prospective sixth-year students in the case of medical schools, etc.) are granted domestic selection scholarships that begin in April. Recruitment is conducted through national, public and private universities with the exception of junior colleges.", "(2) Universities carefully screen academically and individually excellent students and recommend them by mid-December as government-sponsored scholarship candidates to the Ministry of Education, Culture, Sports, Science and Technology (MEXT).", "More detailed information on this scholarship program is available at the Japanese diplomatic missions in the applicant’s country", "List of Japanese Diplomatic Missions Across Africa", " Ministry of Education, Culture, Sports, Science and Technology (MEXT)", " Website", "For More Information:", "Visit the Official Webpage of the Japanese Government (Monbukagakusho) MEXT Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/japanese-government-monbukagakusho-mext-scholarships-2019/"], [["Audi Environmental Foundation Scholarship 2018 to attend the One Young World Summit 2018 in The Hague, Netherlands (Fully Funded)", "date announced:April 19, 2018", "Application Deadline: 17 May 2018"], ["Application Deadline: ", "17 May 2018", "Founded by AUDI AG in 2009, The", " Audi Environmental Foundation", " works to promote sustainable behavior and technologies that benefit both the environment and society.", "Scarce resources, environmental destruction, climate change and population growth – these are just a few aspects that influence society, politics and business. The Foundation recognises that developing sound solutions to these challenges calls for collaboration with a broad network of partners, especially young people and the leaders among them.", "Audi and its Environmental Foundation are therefore collaborating with One Young World to offer scholarships to 15 inspiring young leaders to attend this year’s One Young World Summit in The Hague, Netherlands.", "Are you eager to join an international discussion of issues like sustainability and the environment? Would you like to build an international network and gain insight into how other people think? Then apply now as an ", "Audi Scholar for the One Young World Summit 2018!", "Requirements:", "If you are aged between 18 and 30 years, work for or are involved with a non-governmental social enterprise, community based organisation, or you are an individual making an impact on environmental topics, then this scholarship is for you.", "Benefits:", "Access to the ", "One Young World Summit 2018 in The Hague, Netherlands.", "The cost of travel to and from The Hague (economy flight).", "Hotel accommodation The Hague from 16th to 20th October.", "Participation at the pre-event by Audi and the Audi Environmental Foundation on 16th October", "Catering which includes breakfast, lunch and dinner", "Transport between the pre-event by Audi, Summit accommodation and the Summit venue.", "Summit hand-outs and support materials.", "Selection Criteria", "Candidates must be aged between 18 and 30 at the time of 2018 Summit.", "Candidates must demonstrate:\n", "A passion for environment issues", "Impact and capacity for innovation in this field", "Leadership", "For More Information:", "Visit the Official Webpage of the Audi Environmental Foundation Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/audi-environmental-foundation-scholarship-2018-to-attend-the-one-young-world-summit-2018/"], [["Government of Turkey (Türkiye Burslari) Undergraduate & Postgraduate 3rd round Scholarships 2018/2019 for study in Turkey (Fully Funded)", "date announced:April 20, 2018", "Application Deadline: May 14th 2018"], ["Application Deadline: May 14th 2018", "Türkiye Scholarships", " include both scholarship and university placement at the same time. Applicants will be placed in a university and programme among their preferences specified in the online application form. Candidates can apply only one scholarship programme in accordance with their educational background and academic goals.", "Eligibility:", " ", "To be eligible for Turkiye scholarship, applicants must;", "be a citizen of a country other than Turkey (Anyone holding or ever held Turkish citizenship before cannot apply)", "Candidates must not be older than 21 years of age for undergraduate degree", "not be a registered student in Turkish universities at the level of study they are applying.", "be a bachelor’s or master’s degree holder by 30th of July 2017 at the latest", "There is also age condition candidates are required to meet:• For applicants applying to Undergraduate Degree: Those who were born no earlier than 01.01.1997,", "\n• For applicants applying to Master’s Degree: Those who were born no earlier than 01.01.1988,", "\n• For applicants applying to Ph.D Degree: Those who were born no earlier than 01.01.1983,", "\n• For applicants applying to Research Program: Those who were born no earlier than 01.01.1973,", "\n• Applicants shouldn’t have any health problems barrier to education.", "have at least 75 % cumulative grade point average or diploma grade over their maximum graduation grade or have at least 75 % success in any accepted national or international graduate admissions test.", "be in good health", "The list of countries open for ", "undergraduate ", "applications in the third round are as follows:", "Andora, Antigua and Barbuda, Bahrain, Bangladesh, Barbados, Belize, Benin, Belarus, United Arab Emirates, Bolivia, Bosnia and Herzegovina, Brunei, Bulgaria, Burkina Faso, Cape Verde, Algeria, Djibouti, Chad, China, Democratic Republic of Congo Ethiopia, Morocco, Ivory Coast, Palestine, Finland, French Guiana, Gabon, Gambia, Ghana, Guinea, Guinea Bissau, Grenada, Guyana, Georgia, East Timor, Dominican Republic, Dominica, Equatorial Guinea, Eritrea, Estonia, , Haiti, Croatia, Iraq, Iran, Israel, Jamaica, Cambodia, Cameroon, Montenegro, Qatar, Kazakhstan, Comoros Islands, Congo Republic, Kosovo, Kuwait, Turkish Republic of Northern Cyprus, North Korea, Cuba, Laos, Latvia, Liberia, Libya Mauritania, Mauritania, Niger, Nigeria, Central African Republic, Uzbekistan, Palau, Panama, Poland Romania, Russia, Saint Kitts and Nevis, Malawi, Mali, Mali, Marshall Islands, Lithuania, Lebanon, Hungary, Madagascar, Macedonia, Saint Lucia, St. Vincent and the Grenadines Sao Tome and Principe, Senegal, Serbia, Sierra Leone, Slovakia, Slovenia, Somalia, Sudan, Surinam, Syria, Saudi Arabia, Taiwan, Togo, Trinidad and Tobago, Tunisia, Oman, Jordan, Venezuela, Yemen, Greece.", "Scholarship Benefits:", "The Scholarship Covers:", "Monthly stipend (600 TL for undergraduate, 850 TL for master and 1.200 TL for PhD )", "Full tuition fee", "1-year Turkish language course", "Free accommodation", "Round-trip air ticket", "Health insurance", "Required Documents", "Online application", "A copy of a bachelor or master’s diploma or document indicating that the candidate is bachelor or master’s senior student", "A certified bachelor and/or master’s transcript (indicating courses taken and relevant grades of the candidate)", "A copy of a valid ID card (passport, national ID, birth certificate etc.)", "Passport photo", "For More Information:", "Visit the Official Webpage of the Government of Turkey (Türkiye Burslari) Undergraduate & Postgraduate"], "url : https://www.opportunitiesforafricans.com/government-of-turkey-turkiye-burslari-undergraduate-postgraduate-3rd-round-scholarships-2018-2019/"], [["ACT/DALRO/Nedbank Scholarships Programme 2018 for young South Africans", "date announced:May 7, 2018", "Application Deadline: 31st May 2018."], ["Application Deadline: 31st May 2018.", "The Arts and Culture Trust (ACT), the Dramatic, Artistic and Literary Rights Organisation (DALRO) and Nedbank are proud to announce the opening of applications for the 2018 ACT | DALRO | Nedbank Scholarships Programme. Past winners include Arlin Bantam, Tankiso Mamabolo and Zola Myeza, among many other talented performers who are making a name for themselves in the South African entertainment industry.", "Country-wide auditions will be held from 26 June – 10 July, 2018. Three finalists in each category of dance, singing, acting and musical theatre will be selected to travel to Johannesburg for a week of intensive training and rehearsal.", "The week culminates in a final showcase that will be held at the historic Market Theatre, in front of friends, family and an independent panel of judges. “As an institution committed to promoting artistic excellence and to broadening access for both audiences and artists, the Market Theatre Foundation is pleased to once again support the Scholarships Programme”, said ", "Zama Buthelezi, the Market Theatre Foundation’s  Brand & Communications Manager.", "The panel, made up of industry professionals, will award the scholarship based on the evening’s performance as well as interviews conducted earlier in the day. ‘We are looking for dedicated scholars with drive and ambition. Sometimes it’s the commitment they show during the week that tips the balance. I don’t envy the judges, it’s always a tough decision,’ says ACT CEO Marcus Desando", "Funded by Nedbank and", " the Dramatic Arts and Literary Rights Organisation (DALRO)", " and supported by The Market Theatre, the Scholarships Programme strives to nurture young talent and provide tertiary education opportunities to young people who have their sights set on pursuing performing arts training in 2019. “DALRO is once again proud to partner with the Arts and Culture Trust in ensuring the future of our arts industry. Access to education should not be a hindrance to anyone wishing to pursue a career in the arts which is why we are glad to continue our long-standing support of the ACT Scholarship Programme,” said Elroy Bell, Supervisor: Theatricals and General Licensing, DALRO.", "Requirements:", "Scholarship applications are open to young people intending on studying towards a performing arts degree in 2019.", "Applicants may audition in the categories of singing, dance, acting and musical theatre and are open to learners currently in grade 12 and individuals under the age of 30 who have successfully completed grade 12 and are not currently registered for study towards an undergraduate degree.", "For More Information:", "Visit the Official Webpage of the ACT/DALRO/Nedbank Scholarships Programme 2018 "], "url : https://www.opportunitiesforafricans.com/act-dalro-nedbank-scholarships-programme-2018-for-young-south-africans/"], [["AMIDEAST Fulbright Foreign Student Program 2019/2020 for Middle East & North Africans Students to study in USA (Fully Funded)", "date announced:May 2, 2018", "Application Deadline: May 30th 2018"], ["Application Deadline: May 30th 2018", "You are invited to apply for a ", "Fulbright Graduate Scholarship", " sponsored by the U.S. Department of State and administered by AMIDEAST for the ", "2019-2020 ", "academic year.", "The scholarship is a merit-based grant that provides up to two-years of funding for graduate-level study at a U.S. university.  For over four decades AMIDEAST has been placing students from across the MENA region into universities throughout the United States. It has been integral to the success of the Fulbright Program, serving as a convener of academic and cultural exchange and dialogue. AMIDEAST continues today to support countless Fulbrighters to experience the opportunity of exchange and successfully complete their grants in the United States", "The J. William Fulbright Foreign Scholarship Board (FSB)", " regulations prohibit medical degrees, and this has been interpreted as degrees for medical doctors, dentists, nursing, and specializations in the medical and dental fields. Per the Fulbright regulations, doctors and nurses can pursue academic degrees, such as a Masters of Public Health, and nurses can pursue degrees in Nursing Administration or Nursing Education.", "This is not a program exclusive for students. This program is for students who are about to graduate, recent graduates and professionals from diverse social, economic, academic and professional backgrounds. A competitive applicant should have an excellent academic record, strong English language skills, and the commitment to return to Tunisia upon completion of the program. Preference will be given to applicants who have not previously studied in the United States.", "All recipients of a Fulbright scholarship must return to their home country for at least two years upon completion or termination of the scholarship. They will be ineligible for an U.S.-immigrant visa until the two-year home residency requirement has been fulfilled.", "Benefits:", "The scholarships cover expenses incurred for travel to and from the United States, tuition, books, health insurance, and room and board. Funding is NOT available to meet expenses related to Fulbright grantees dependents (husbands, wives, children, parents, etc).", "Applicant Requirements:", "Applicants interested in pursuing a Master’s degree must:", "Have the Tunisian nationality and must be a resident in Tunisia at the time of application;*", "Have the equivalent of a U.S. Bachelor’s degree (four years of post-secondary study);", "Must be proficient in English and/or able to attend a Long Term English (LTE) program prior to the start of study program;", "Relevant academic credentials in their fields.  See above;", " If interested in an MBA, applicants must have a minimum of 2 years work experience.", "PhD students interested in applying for the one year doctoral research must:", "Have the Tunisian nationality and must be a resident in Tunisia at the time of application;*", "Must be enrolled in  PhD program in Tunisia and have started working on their dissertations;", "Must be proficient in English and/or able to attend a Long Term English (LTE) program prior to the start of study program;", "Relevant academic credentials in their fields.  See above;", "*U.S. citizen or legal permanent resident (green card holder) cannot apply;", "Application Guidelines:", "Complete the application online at: ", "https://iie.embark.com/apply/ffsp", "Please make sure to choose 2019-2020 Cycle and answer all questions accurately and completely.", "Carefully write the essays, which are key components of the application. Each essay must be a minimum of 250 to a maximum of 600 words. The selection committee will review these essays closely.", "Deliver hard copies of the following supporting documents to the AMIDEAST office by May 30, 2018 at 4:00 p.m.:", "1.     Confirmation receipt of submission of the online application;", "2.     A signed ", "Signature form", ";", "3.     TOEFL iBT, ITP, or IELTS score report;", "4.     A certified true copy of each original post-secondary transcript and diploma starting from and INCLUDING the Baccalaureate;", "5.     An updated Curriculum vitae or résumé;", "6.     Copy of the biodata information page from the applicant’s passport (if available);", "7.     Three recent passport-sized photos with applicant’s name written on the back.", "Note: If you have extra recommendation letters in addition to the letters submitted online, you may bring them as part of your dossier.", "Thank you for your interest. Short-listed candidates will be contacted for an in-person interview in July, 2018", "Click here to watch a demo on how to fill out the online application.", "Additional documents:", "If available, ", "GRE ", "and ", "GMAT ", "exam results can be submitted.", "For More Information:", "Visit the Official Webpage of the AMIDEAST Fulbright Foreign Student Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/amideast-fulbright-foreign-student-program-for-middle-east-north-africans-students/"], [["AstraZeneca Young Health Programme Scholarship 2018 to attend the One Young World Summit 2018 in The Hague, Netherlands (Fully Funded)", "date announced:April 19, 2018", "Application Deadline: May 19th 2018"], ["Application Deadline: May 19th 2018", "Wherever we work in the world, we aim to make a positive impact in our local communities and collaborate to address the health issues that most affect people at a local, national and global level.", " The Young Health Programme (YHP)", " ", "embodies this belief. Through YHP we work to address the growing burden of non-communicable disease (NCDs) – conditions like type 2 diabetes, cancer, heart and respiratory disease. We do it with a unique focus on youth and primary prevention.", "Evidence shows that many NCDs are linked to behaviours that begin during adolescence: tobacco use, the harmful use of alcohol, physical inactivity and unhealthy diets. Once behaviours are formed, they are difficult to break. Through YHP, we aim to engage and empower young people with information so that they can make healthy choices today that will lead to better health later in life.", "But YHP is not just about health education and promotion. We work with NCD Child, Rise Up Together and Plan International UK to put adolescent health on the healthcare agenda. We invest in research to generate new evidence that fills the gaps in our knowledge about adolescent health and risk behavior activity.  And most importantly, we work to provide youth with a voice. Youth are at the core of everything we do. Young people have a powerful voice in identifying their own health needs as well as planning and delivering solutions. As Alyssa Frampton, YHP Youth Ambassador and One Young World Ambassador says, health cannot be “about us, without us.”", "AstraZeneca is proud to provide charitable support to One Young World to engage more youth in our efforts to address the issue of adolescent health and disease prevention.  We are collaborating with One Young World to offer ten scholarships to inspiring young leaders to attend the ", "One Young World Summit 2018 in The Hague, Netherlands.", "Requirements:", "AstraZeneca are looking for young people who work for or are involved with a non-governmental organisation, social enterprise, community based organization, or who are individuals making an impact through advocacy activities or direct programming related to adolescent health.", "The successful scholars will join ten other YHP delegates who are already involved with the programme, as peer educators, advocates, NGO partners or community youth leaders.", "In addition to attending the Summit, YHP scholars will participate in a pre-Summit workshop to meet the delegation, share information about their background and get prepared for what will be an incredible experience in The Hague.", "​Criteria", "Aged 18 – 30", "An evidenced commitment to addressing health and wellbeing in a local, national or global community, with a specific focus on child and adolescent health and/or disease prevention and health promotion and/or social determinants of health.", "A leadership ability in their chosen cause or issue", "A capacity for innovation and values-driven problem solving", "A concern for local and global issues", "An ability to generate and articulate impactful ideas", "An ability to work towards a shared goal through teamwork and collaboration", "Benefits:", "Access to the One Young World Summit 2018 in The Hague, Netherlands​", "Hotel accommodation on a shared basis between 17 and 20 (inclusive) October, 2017​​", "Provisions may be made for delegates to avail of an additional night’s accommodation on 16 October, should their travel itinerary require.", "The cost of travel to and from The Hague (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Access to Young Health Programme pre-Summit workshop", "Discretionary funds to provide for reasonable out of pocket expenses related to travel to and from The Hague.", "For More Information:", "Visit the Official Webpage of the AstraZeneca Young Health Programme Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/astrazeneca-young-health-programme-scholarship-2018-to-attend-the-one-young-world-summit-2018/"], [["Chinese Government/African Union Commission Master’s & Doctoral Scholarships 2018/2019 for young Africans to study in China (Fully Funded)", "date announced:May 8, 2018", "Application Deadline: June 29th 2018"], ["Application Deadline: June 29th 2018", "The", " Government of The People’s Republic of China", " has made scholarship offers to the ", "African Union Commission", ", through the Department of Human Resources, Science and Technology, to enable African students study in China in the 2018/2019 Academic Year. The scholarships are intended for studies leading to the award of ", "Master’s and Doctoral", " Degrees.", "The scholarships are open to all qualified African Nationals who meet the admission requirements set forth below. The Language of Instruction will be in English. Candidates with potential, motivation and desire to play transformative leadership roles in Africa are particularly encouraged to apply.", "Admission Requirements", "Candidates applying must satisfy the following requirements:", "i. Undergraduate degree from a recognized university, with at least a second class upper division or its equivalent, in a relevant field.", "For Doctoral Candidates (Master’s degree in a relevant field is required)", "ii. Maximum age of 35 years", "iii. Fluency in the English language, as it is the teaching language", "Candidates may be required for a written or oral examination after pre-selection", "Application Procedure", "Applications must be submitted with a cover letter stating motivation for applying and how", "the qualification will enable you to serve the continent. Applications must also be accompanied with the following:", "1) Curriculum Vitae including education, work experience and publications if any;", "2) Certified copies of relevant certificates, transcripts, and personal details page of national passport (at least six month validity)", "3) Clear colored passport size photograph (3*4)", "4) Recommendations from two academic referees", "5) Health Certificate.", "\nNote:", "Interested applicants can access the requirement through the link ", "www.au.int", "All applicants must apply directly through the respective University website and send copies by email to Caseley Olabode Stephens ", "[email protected]", "The Closing date for the submission of applications with all supporting documents is: 29TH June 2018.", "Applications received after this deadline will NOT be considered.", "For More Information:", "Visit the Official Webpage of the African Union Commission Master’s & Doctoral Scholarships 2018/2019 "], "url : https://www.opportunitiesforafricans.com/african-union-commission-scholarships-2018-2019/"], [["Commonwealth Medical Fellowships 2018 for Mid-Career Medical Professionals to Study in the United Kingdom (Fully Funded)", "date announced:April 24, 2018", "Application Deadline: 23.59 (BST) on 21 May 2018"], ["Application Deadline: ", "23.59 (BST)", " on ", "21 May 2018", "Commonwealth Medical Fellowships", " are for mid-career medical staff from low and middle income countries, to enhance their clinical skills.", "Funded by the ", "UK Department for International Development (DFID)", ", Commonwealth Medical Fellowships enable talented and motivated individuals to gain the knowledge and skills required for sustainable development. These fellowships are offered under the second of the CSC’s six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these fellowships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be employed by a hospital affiliated to a university", "Be available to start your fellowship in the UK in January 2019", "Have qualified as a doctor between 1 October 2008 and 30 September 2011, or before 1 October 2003", "Have qualified at a medical school recognised by the ", "World Directory of Medical Schools", "Have met the English language requirements of the ", "General Medical Council (GMC)", " by 31 August 2018", "Eligible Commonwealth countries", "Bangladesh", "Cameroon", " The Gambia", " Ghana", "\nIndia", "Kenya", " Malawi", " Mozambique", " Nigeria", "\nPakistan", "\nPapua New Guinea", "Rwanda", "\nSamoa", "Sierra Leone", " South Africa", "\nSri Lanka", "Tanzania", " Uganda", "\nVanuatu", " Zambia", "Fellowship Worth", "Each fellowship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor usually the cost of journeys made before your award is finally confirmed)", "Research support grant, payable to your host university hospital", "Stipend (living allowance) at the rate of £1,627 per month, or £2,019 per month for those at university hospitals in the London metropolitan area (rates quoted at 2017-2018 levels)", "Reimbursement of the fee for a single English language test and the fee for General Medical Council (GMC) registration", "Warm clothing allowance", "Study travel grant towards the costs of approved travel within the UK", "If you are widowed, divorced, or a single parent, child allowance of £457 per month for the first child, and £112 per month for the second and third child under the age of 16, if you are accompanied by your children and they are living with you at the same address in the UK", "How to apply", "You must apply to one of the following nominating body in the first instance – ", "the CSC does not accept direct applications for these fellowships", ":", "Selected universities/medical colleges", "In Bangladesh, India, and Sri Lanka, the national University Grants Commission", "In Pakistan, the Higher Education Commission", "All applications ", "must", " be made through a nominating body in your home country. Each nominating body is responsible for its own selection process. ", "You must check with your nominating body for their specific advice and rules for applying, and for their own closing date for applications.", "You must make your application using the CSC’s application system. Your application must be submitted to and endorsed by one of the eligible nominating bodies listed above. The CSC will not accept any applications that are not submitted via the CSC’s application system to a nominating body in your home country.", "All applications must be submitted by ", "23.59 (BST)", " on ", "21 May 2018", " at the latest.", "You must provide the following supporting documentation, which must be received by the CSC by ", "23.59 (BST)", " on ", "28 May 2018", " in order for your application to be eligible for consideration:", "Academic references from at least two individuals", "For More Information:", "Visit the Official Webpage of the Commonwealth Medical Fellowships 2018"], "url : https://www.opportunitiesforafricans.com/commonwealth-medical-fellowships-2018-2019-enhancing-clinical-skills-for-mid-career-medical-professionals/"], [["South African-German Centre for Development Research (SA-GER CDR) Master & PhD scholarships 2018/2019 (Funded)", "date announced:April 24, 2018", "Application Deadline: July 31st 2018"], ["Application Deadline: July 31st 2018", "Within the framework of cooperating in ", "Masters and PhD programmes,", " the aim of the African Excellence Centre at UWC in Cape Town is to prepare the next generation of leaders to meet the typical economic, social and political challenges arising from the development process. The research-oriented training programmes already established at the Ruhr-University of Bochum and the University of the Western Cape have been run in close cooperation for several years now. The course offerings are sourced from the disciplines of economics and social sciences (particularly macroeconomics and political science) and the administrative sciences.", "For applicants from Sub-Saharan African countries with an excellent academic record the DRD offers a limited number of DAAD merit scholarships per year.", "Scholarships are available for ", "full-time", " students of", "the ", "MA in Development Studies", " (next deadline 31 July 2018, ", "online application is available in the “How to apply” section of the Programme!", ")", "the ", "Master in Public Administration", " (next deadline 31 July 2018, ", "online application is available in the “How to apply” section of the Programme!", ")", "the ", "MA in Development Management", " (Bochum Programme, next deadline 30 November 2017)", "(separate online application platform, access and guidelines via “", "How to apply", "” section of the Bochum programme or via the ", "course homepage", ")", "the different PhD options at the centre (", "PhD UWC)", " (next deadline 31 July 2018, ", "online application is available in the “How to apply” section of the Programme!", ")", "Requirements:", "Scholarship applicants are adviced to carefully read about the specific entry requirements and course application procedure of the programme of their choice. The information is available from the respective ", "programmes sections", ". In addition to programme requirements, all applicants have to meet the following requirements:", "Applicants should be from Sub-Sahara Africa", "Applicants should have an outstanding academic record – at least 70% for your last degree", "Applicants should apply within 6 years of having completed their previous degree", "The study must have been completed at an internationally recognised university", "The previous degree (Baccalaureus or Master) should have been an academic discipline which is related to Development Studies or Public Administration", "South African students are required to have an honours degree in order to be admitted to a Masters degree course. Other students need the equivalent of a 4 year undergraduate degree", "Applicants must provide evidence of proficiency in English, both written and spoken. This can be TOEFL test or a similar standard test or a letter from an academic institution", "Work and/or voluntary experience in your field of interest would be a recommendation", "Women are encouraged to apply", "South African students are encouraged to apply", "Applicants must be able to study fulltime at the UWC for the required period.", "Benefits:", "Scholarships include monthly allowances of 650 Euro plus travel allowances for Master candidates and 900 Euro plus travel allowances for PhD candidates. Tuition and registration fees are covered by the Scholarship Programme.", "Scholarship application procedure for", "MA in Development Studies", "Master in Public Administration", "PhD options at the CDR", "For the MADM please refer to the “", "How to apply", "” section of the Bochum programme or the ", "course homepage", ".", "You will have to fill in an ", "electronic application form (ONLY AVAILABLE FROM mid APRIL to 31st July)", "! Applications not using this e-form can´t be considered! As the e-form can only be submitted once, please make sure that your application is complete before submitting it!", "Documents that have to be uploaded when using the e-form are:", "a letter of application", "a CV: Please use the europass CV form available at ", "https://europass.cedefop.europa.eu/en/home", "an academic transcript from your last university", "certified copies of all academic certificates", "MA applicants will have to write a one page paper about 1 of 3 different topics, available in the “How to apply” section of each Master Programme1", "PhD applicants don´t write an essay, but are asked to submit a 5 page proposal on the research they would want to undertake for the thesis. This should include their research question, the research methodology and a (provisional) theoretical framework. A list of topics is given in the ", "PhD section", ".", "Additional one signed reference (academic) (and one professional if applicable) have to be uploaded to the e-form. Only if referees don´t want you to submit the reference yourself, the reference can be send by the referee directly to ", "[email protected]", ", indicating the applicant’s name!", "Candidates for the Masters Programme in Public Administration (MPA), the MA in Development Studies as well as PhD candidates in the fields of Governance, Public Policy, Public Management or Development Studies can submit their scholarship application without needing to apply for admission at UWC. If they are awarded a scholarship, or if they intend to finance themselves, they may apply for admission through the online application procedure (", "www.uwc.ac.za", ").", "For additional information on the courses or on registration please write to:", "[email protected]", " for the MA and M Econ or PhD in Development Studies and to", "[email protected]", " on the MPA course or an PhD in Public Administration or Governance.", "Britta Niklas", " for the Master of Arts in Development Management (Bochum Programme)", "For More Information:", "Visit the Official Webpage of the SA-GER CDR Master & PhD scholarships "], "url : https://www.opportunitiesforafricans.com/south-african-german-centre-for-development-research-sa-ger-cdr-master-phd-scholarships-2018/"], [["Nigerian Agip Oil Company Tertiary Scholarship Scheme 2017/2018 for young Nigerian Undergraduates.", "date announced:April 18, 2018", "Application Deadline: 30th April, 2018."], ["Application Deadline: 30th April, 2018.", "The Nigerian Agip Oil Company Limited (NAOC)", " Joint Venture in pursuance of its Corporate Social Responsibility invites suitably qualified applicants for its 2017/2018 Session Tertiary Scholarship Scheme, effective from 17th to 30th April, 2018.", "Category of Awards", "Host Communities Merit Award", " – For applicants strictly from NAOC Host Communities", "National Merit Award", " – For applicants from Non-Host communities", "Requirements:", "To qualify for consideration, applicants ", "MUST", " be:", "Registered Full TIME undergraduates in Nigerian Tertiary Institutions", "Certified 100 level students at the time of application (Only students admitted in 2017/2018 academic session)", "NOTE:", " The following categories of students ", "should not apply", ":", "200 level students and above", "Current beneficiaries of similar Awards from other Companies and Agencies", "Dependants of ", "NAOC/NAE/AENR/NACPFA", "Only Indigenes of", " NAOC ", "Host Communities in ", "Rivers, Bayelsa, Delta", " and ", "Imo", " States ", "SHOULD", " apply for the ", "Host Communities Merit Award.", "Only applicants studying Engineering, Geology, Geosciences and Agricultural Science are eligible for the ", "National Merit Award.", "Deadline", ": ", "Closing date for receipt of e-application is strictly Midnight 30th, April 2018.", " ", "NOTE:", " The aptitude test will take place at designated centers to be communicated to applicants on a later date and applicants are to fully bear the cost of transportation to and from Aptitude test centres.", "How to Apply:", "Application is open to 100 level students only.", "1. Before you start this application, ensure you have clearly scanned copies of the following documents", "Passport photograph with white background not more than 3 months old (450px by 450px not more than 200kb)", "School ID Card", "O’level Certificate", "Admission Letter", "Birth Certificate", "Proof of Local Government Area of Origin", "Letter from Community Paramount Ruler (", "Only Applicants for Host Communities Merit Award)", "Letter from CDC Chairman (Only Applicants for Host Communities Merit Award).", "JAMB Result", "2. Ensure the documents are named according to what they represent to avoid mixing up documents during upload", "\n3. Ensure you attach the appropriate documents when asked to upload", "\n4. Ensure to provide valid Email and Phone Contact for effective communication", "To apply, follow the steps below", ":", "\n1.    Click on “Apply Now” tab.", "\n2.    Click on “Register Now” to create an account.", "\n3.    Proceed to your email box to activate your account", "\n4.    Click on ", "www.scholastica.ng/schemes/naocscholarships", " to return to Scholarship site", "\n5.    Enter your registered email and password to upload your information.", "\n6.    Enter your personal information, National Identification Number (if available), educational information, other information and upload required scanned documents.", "\n7.    Ensure the name used in application matches the names on all documentation in same order. Upload a sworn affidavit or certificate if otherwise.", "\n8.    Ensure you view all documents after uploading, to eliminate errors during uploading.", "\n9.    When asked to upload photo, a passport photograph with a white background is preferable.", "\n10.  Recheck application information to avoid errors", "\n11.  Click “Apply Now” to submit information", "\n12.  You will receive an email and a sms that confirms your application was successful.", "\n13.  Return to ", "www.scholastica.ng", ", enter your Email and Password to download your profile and proceed to have your Head of Department sign the document.", "\n14.  Upload a scanned copy of the signed profile, this would be used for verification.", "\n15.  ", "If National Identification Number (NIN) number was not available in step 6", ", to obtain your National Identification Number (NIN)", "Visit ", "http://ninenrol.gov.ng", " to register and learn more about the National Identity Number", "Click “Create Account” and fill in the required  fields", "Login with Email and Password to complete the form", "After completion, schedule a date for photo and finger print capture", "Visit any of the capture centres ", "https://www.nimc.gov.ng/?q=nin-registration-centres", "  to complete the registration process and obtain your National Identity Number", "You can also do your total registration at the NIMC office", "16. Return to ", "www.scholastica.ng/schemes/naocscholarships", " and update application with National Identification Number (NIN) to ensure completion", "Note:", "\nMultiple applications attract a disqualification penalty from the Scholarship board", "\nObtaining NIN is not compulsory in order to complete your application", "For More Information:", "Visit the Official Webpage of the Nigerian Agip Oil Company Tertiary Scholarship Scheme 2017/2018 "], "url : https://www.opportunitiesforafricans.com/nigerian-agip-oil-company-tertiary-scholarship-scheme-2017-2018/"], [["Nedbank Undergraduate Bursary Programme 2018/2019 for Young South Africans.", "date announced:May 7, 2018", "Application Deadline: May 17th 2018"], ["Application Deadline: May 17th 2018", "Each year, ", "Nedbank offer bursaries", " to students in need of financial assistance toward their studies. So, if you are thinking of studying towards a university degree but don’t have the financial means, the Nedbank Bursary Fund may be the solution you’re looking for.", "The following are some of the questions we’ll ask when considering your application for a bursary:", "Are you a South African citizen?", "Do you contribute to Nedbank’s transformation targets?", "Have you achieved enough academically? Specifically, have you earned at least a 65% average pass mark, while also meeting all of the registration criteria of a South African public university or university of technology?", "Where do you score on a financial means test?", "Does the degree you are applying for meet a scarce skill that we’ve identified at Nedbank or for the greater good of South Africa?", "Application Requirements", "Be in grade 12 or have completed grade 12 within the past two years.", "Pass or have passed matric with an average of 65%.", "Meet the entry requirements for the university you want to go to.", "Complete this application form.", "Application forms that are incomplete or incorrect will not be considered.", "Closing date 17 May", " in the year before you want to go to university.", "Not be a direct dependant of a Nedbank employee", "For More Information:", "Visit the Official Webpage of the Nedbank Undergraduate Bursary Programme 2018/2019"], "url : https://www.opportunitiesforafricans.com/nedbank-undergraduate-bursary-programme-2018-2019-for-young-south-africans/"], [["Japan Africa Dream Scholarship (JADS) Program 2018 for young Africans to study in Japan (Fully Funded)", "date announced:April 20, 2018", "Application Deadline: Varying by Institutions"], ["Application Deadline: Varying by Institutions", "The Japan Africa Scholarship (JADS) Program", " – capacity building in energy sector through skills development for sustainable development– is a joint initiative by the AfDB and Japan that aims at providing two-year scholarship awards to highly achieving African graduate students to enable them to undergo post-graduate studies (i.e. a two-year Master’s degree program) in priority development areas on the continent and abroad (including in Japan). This JADS program is funded by the Government of Japan.", "The overarching goal that the AfDB and the Government of Japan seeks to attain is to enhance skills and human resources development in Africa in a number of priority areas pertaining to science and technology with a special focus on the energy sector. JADS’s objectives are aligned with the Bank’s High 5 agenda (i.e. Light up and power Africa, Feed Africa, Industrialize Africa, Integrate Africa and Improve the quality of life for the people of Africa) and key Japanese development assistance initiatives to Africa and th", "e 6", "th", " Tokyo International Conference for African Development (TICAD VI) outcomes.", "Eligibility Requirements:", "Broadly speaking, nationals of African countries must:", "Be a national of a AfDB member country;", "Be in good health;", "Hold a Bachelor (or equivalent) degree in the energy area (or related field) earned at least 1 years prior to the application deadline date;", "Have 1 years or more of recent development-related experience after earning a Bachelor (or equivalent) degree;", "Be accepted unconditionally to enroll in the upcoming academic year in at least one of the JADS partner universities for a Master’s degree;", "Applicants living or working in a country other than his or her home country are not eligible for scholarships.", "JADS does not support applicants who are already enrolled in graduate degree programs.", "Not be an Executive Director, his/her alternate, and/or staff of all types of appointments of the African Development Bank Group or a close relative of the aforementioned by blood or adoption with the term “close relative” defined as: Mother, Father, Sister, Half-sister, Brother, Half-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew.", "Benefits:", "The JADS Scholarship provides the recipient with the following benefits:", "Economy class air travel between your home country and the host university at the start of the study program and immediately following the end of the scholarship period.", "Tuition for a graduate program and the cost of basic medical insurance usually obtained through the university.", "A monthly subsistence allowance to cover living expenses, including books.", "For scholars engaged in research, a special grant may be available for research and thesis preparation. In special circumstances, computer literacy, preparatory language and other similar courses may be covered under the scholarship. Please note all JADS scholarships cover the duration of the graduate program or two years, whichever is less.", "The JADS Scholarship does not cover:", "VISA application(s) costs", "Expenses to bring and/or support scholar’s family members;", "Extra-curricular courses or training;", "Language training not provided by the graduate program;", "Additional travel during the course of the study program;", "Expenses related to supplementary educational materials, field trips, participation in workshops/seminars, or internships; or", "Educational equipment such as computers.", "Application Procedure:", "1.  Applicant requests for application information from any African partner university.", "2.  Applicant receives application forms of their preferred Japanese partner institution.", "3.  Applicant completes required documents for application including JADS information sheet.", "4.  Applicant sends documents to the selected Japanese partner university.", "5.  University sends shortlist of candidates to AfDB.", "6.  AfDB review submission from universities.", "7.  AfDB recommends awardees based on its selection criteria to the Japanese. Executive Director for approval", "8.  AfDB contacts selected awardees, and informs partner universities.", "9.  AfDB organizes a seminar of all scholars at the AfDB headquarters in Abidjan, Cote d’Ivoire", "How to Apply:", "Applicants must, in parallel, apply for admissions to one or more of the partner universities and apply for a JADS scholarship through an open call typically announced within the 2", "nd", " quarter of a calendar year.", "When the scholarship application opens, the finalized list of selected programs, the application guidelines, and a finalized list of eligibility criteria will be available on this site. The scholarship application must be completed through the university of choice and include two professional references. Note that if the applicant is admitted to several master degree programs, he/she must choose the one they should be considered for JADS funding.", "Japanese JADS partner universities will send shortlisted applicants to AfDB for review and selection. JADS awardees will be invited for a seminar at AfDB Headquarters prior to their travel to Japan.", "For More Information:", "Visit the Official Webpage of the Japan Africa Dream Scholarship (JADS) Program 2018"], "url : https://www.opportunitiesforafricans.com/japan-africa-dream-scholarship-jads-program-2018-for-young-africans/"], [["Ignacy Łukasiewicz Scholarship Programme 2018/2019 for study in Poland (Fully Funded)", "date announced:April 19, 2018", "Application Deadline: 11 May 2018, 3:00 p.m. (Polish time),"], ["Application Deadline: 11 May 2018, 3:00 p.m. (Polish time),", "The Ignacy Łukasiewicz Scholarship Programme,", " implemented as part of the “Polish Aid” programme, is addressed to the nationals of the following developing countries: Angola, Chile, Colombia, Ethiopia, India, Indonesia, Kenya, Mexico, Myanmar, Nigeria, Palestine, Peru, The Republic of South Africa, The Philippines, Senegal, Tanzania, and Vietnam. The aim of the Programme is to support the socio-economic development of the above-mentioned countries.", "The Ignacy Łukasiewicz Scholarship Programme enables free education as part of a second cycle programme of studies at a higher education institution supervised by the Ministry of Science and Higher Education ", "(Polish: ", "Ministerstwo Nauki i Szkolnictwa Wyższego – MNiSW) ", "in the following areas of study: sciences, natural sciences, technical sciences, agricultural, forestry and veterinary sciences.", "Students from 17 developing countries (Angola,", " Chile, ", "Ethiopia,", " the Philippines, India, Indonesia, ", "Kenya,", " Colombia, Mexico, Myanmar, ", "Nigeria,", " Palestine, Peru, ", "South Africa, Senegal, Tanzania,", " and Vietnam", ") can now apply to the Ignacy Łukasiewicz Scholarship Programme.", "Eligibility Requirements:", "Eligible to apply are citizens of the countries listed above who:", "are graduates of first-cycle programmes (completed not earlier than in 2014) or last-year students of first-cycle programmes in the 2017/2018 academic year in such fields as exact sciences, natural sciences, technology, agriculture, forestry and veterinary medicine;", "do not have a Master’s or engineer’s degree;", "have at least a B2-level certificate in English;", "are not graduates of Polish universities.", "Candidates choose the university and academic programme they want to enrol on from among those offered by Polish higher education institutions. The studies are preceded by a one-year course that will prepare students for their stay in Poland (also subject to scholarship conditions).", "Benefits:", "The Programme offers tuition-free education at second-cycle programmes in Poland, and a monthly bursary of PLN 1,500 to cover living expenses to be disbursed by the Polish National Agency for Student Exchange.", "Application Procedure:", "Candidates are selected on the basis of a competitive procedure, based on the quality assessment of applications carried out by reviewers of the Polish National Agency for Academic Exchange who are academics working in higher education institutions.", "Candidates independently choose a higher education institution and degree programme from among the educational offers of Polish public higher education institutions. The list of public HEIs supervised by the Minister competent for higher education is available via the link: ", "http://www.go-poland.pl/higher-education-institutions", ".", "Terms and Conditions of the Ignacy Łukasiewicz Scholarship Programme692.38 KB", "Model Agreement525.04 KB", "For More Information:", "Visit the Official Webpage of the 2018/2019 Ignacy Łukasiewicz Scholarship Programme"], "url : https://www.opportunitiesforafricans.com/ignacy-lukasiewicz-scholarship-programme-2018-2019/"], [["Women for Africa Foundation Learn Africa Scholarship Program 2018/2019 for African women undergraduate and graduate student (Fully Funded to Spain)", "date announced:April 18, 2018", "Application Deadline: May 6th 2018"], ["Application Deadline: May 6th 2018", "This program, promoted by the", " ", "Women for Africa Foundation,", " aims to promote the transfer of knowledge, exchange and training of African women undergraduate and graduate students through scholarships in Spanish universities that collaborate in this initiative. Thanks to these scholarships, the selected students can complement their university education in our country, and then invest what has been learned to benefit their communities, thus contributing to the progress of African societies.", "The scholarships are funded by the universities participating in the program – all of them, members of the Conference of Rectors of Spanish Universities (CRUE) – and cover round trips, tuition and fees, accommodation, maintenance and medical insurance.", "Scholarships duration ", "The scholarships included in this call have a variable duration depending on the modality agreed with each of the host universities and the training program offered, comprising periods ranging from six months, in the case of some research staying to four years for those aiming to Master and Doctorate.", "All the scholarships of this call will take place during the academic year 2018-2019.", "Requirements:", "In general, any person who meets the following requirements:", "Be a woman and have the nationality of an African country.", "Be enrolled in an African university or have a university degree issued in an African country. For Postgraduate Scholarships, the Degree title is required. The required degree can vary depending on the requested scholarship (See details of each scholarship).", "Meet the specific requirements of each type of scholarship.", "Only one application per person", "Benefits:", "The scholarship includes one return ticket to-from the student’s country of origin, university fees, health insurance, accommodation and food.", "Commitment:", "Once the scholarship has been completed, they are committed to returning to their place of residence and to providing a report on their personal and academic experience – on the basis provided by the Women for Africa Foundation – so that an evaluation of the outcomes can be carried out and, if necessary, make changes in the scholarship program as appropriate.", "Likewise, The Foundation and the Spanish universities of destination may make full or partial use, on their website or in some of their publications, regarding the content of the report prepared by the scholarship holders after their stay in Spain. In this case, the Women for Africa Foundation may mention the author (s) of said content.", "Contact:", "For further information, please contact the Foundation at:", "[email protected]", "For More Information:", "Visit the Official Webpage of the Learn Africa Scholarship Program 2018/2019"], "url : https://www.opportunitiesforafricans.com/women-for-africa-foundation-learn-africa-scholarship-program-2018-2019/"], [["World Bank ACE II Masters Scholarship Program 2018 for young African Female students (Fully Funded)", "date announced:May 8, 2018", "Application Deadline: June 4th 2018"], ["Application Deadline: June 4th 2018", "The ", "World Bank", " is partnering with eight Governments in Eastern and Southern Africa in an innovative project with the aim of improving the quality of training and research in higher education, and reducing the skill gaps in key development priority areas. The ", "Eastern and Southern Africa Higher Education Centers of Excellence (ACE II)", " Project supports the governments of Ethiopia, Kenya, Malawi, Mozambique, Rwanda, Tanzania, Uganda, and Zambia in strengthening selected African Centers of Excellence (ACEs) to deliver quality post-graduate education and build collaborative research capacity in the following priority areas: (i) Industry, (ii) Agriculture, (iii) Health, (iv) Education, and (v) Applied Statistics.", "The ACE II Project implements three components, namely (i) strengthening the 24 higher", "\neducation institutions into regional ACEs in Eastern and Southern Africa in a set of defined regional priority areas (US$ 140 million); (ii) providing capacity building support to these ACEs through regional activities (US$3 million); and (iii) supporting coordination and management of the implementation of components (i) and (ii) (US$5 million).", "To encourage the participation of young African female students at postgraduate level, IUCEA wishes to implement a Fellowships Program aimed at providing competitive ", "Masters Scholarships", " to academically deserving future talents to promote regional female student mobility. Eligible female applicants who can demonstrate interest and ability in the priority areas are encouraged to apply for the 30 Fellowships available for the 2018/2019 academic year.", "Eligibility Requirements:", "In order to be eligible for this Fellowship, the applicant must:", "i) be a female national of one of ACE II participating countries ( Ethiopia, Kenya, Malawi,", "Mozambique, Rwanda, Tanzania, Uganda and Zambia) or Burundi", "ii) be under the age of thirty five (35) years", "iii) be a holder of a Bachelor’s Degree from a reputable university in the relevant field, at the level of Upper Second Class Honours", "iv) have been admitted in any of the 24 ACEs to study full-time in any of the priority disciplines", "of the ACE II Project:", "(i) STEM (Science, Technology, Engineering and Mathematics) or Industry,", "\n(ii) Agriculture,", "\n(iii) Health,", "\n(iv) Education, and (v) Applied Statistics;", "v) have demonstrated outstanding academic achievement as evidenced by academic transcripts, and academic awards,if any.", "The Fellowship Award", "The provided financial support for each Fellowship Program will cover:", "i) University tuition fees: Approximately USD 3,000 per year (payable directly to the Host University according to an official invoice)", "ii) Stipend: USD 800 per month to support living expenses such as housing, food, utilities, local", "transportation, medication and settlement expenses", "iii) Research: USD 4,800 to support student research, payable upon approval of research proposal", "iv) Allowance: USD 2,000 one-off allowance to cover visa, laptop andbooks", "v) Air ticket: A round-trip economy fare for the most direct route between the beneficiary’s home country and the study destination of Host University", "Note: Candidates must complete all academic work within the specified period of the programme as the scholarship cannot be extended beyond a maximum of 24 months", "Application Process and Procedures", "To apply for this Fellowship, interested candidates are advised to fill in the application form found at www.iucea.org or ace2.iucea.org attach all requested documents, and send by e-mail to ", "[email protected]", " with a copy to ", "[email protected]", "All applications must be received not later than 5.00 PM East African Time on June4 2018.", "For proof of eligibility, an applicant should ensure that the following are provided:", "i) Completed application form", "ii) Recent passport-size photograph", "iii) Summarized CV with names and contacts of two referees", "iv) Certified copies of academic certificates and transcripts", "v) Certified copies of passport or national identity card indicating citizenship", "vi) Copy of admission letter from one of the host universities (please refer to the attached table on Countries, ACEs and Universities)", "For More Information:", "Visit the Official Webpage of the World Bank ACE II Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/world-bank-ace-ii-masters-scholarship-program-2018-for-young-female-scientists/"], [["CECIL Renaud Overseas Scholarship 2019 for young South Africans study in the United Kingdom", "date announced:May 7, 2018", "Application Deadline: October 31st 2018"], ["Application Deadline: October 31st 2018", "Dr Cecil Renaud, a well-known Durban Philanthropist, established The Cecil Renaud Educational and Charitable Trust in 1988. Dr Renaud passed away on 3 June 1993 and bequeathed the residue of his estate to the Trust. Shortly after the Trust became active, the trustees established the Overseas Scholarship.", "The Overseas Scholarship, granted annually to one or two students, is awarded for a maximum of two years for post-graduate study (Masters degree (or equivalent) or PhD) in the United Kingdom at a university of the student’s choice.", "Since 1994, we have awarded 26 scholarships to the best and brightest young South Africans. In past years students who have been awarded the Scholarship have attended, inter alia, the University of Cambridge, the University of Oxford and the University of London across a wide range of disciplines. This Scholarship is available only to students who completed their secondary schooling at any school in KwaZulu-Natal, and you must  be in your final year of a postgraduate honours degree, or four year undergraduate degree.", " ", "Eligibility Requirements:", "The scholarship is open to postgraduate students who have completed or are currently studying towards an Honours degree; or a four year undergraduate degree.", "Applicants must have completed a major part of their secondary schooling in KwaZulu-Natal, and be under the age of 27 at the time of applying for the scholarship.", "How to Apply:", "Applications for the 2019 Cecil Renaud Overseas Scholarship close on the 31st of October, 2018.", "Application forms can be downloaded ", "here.", "If you have any questions about the scholarship or application process, feel free to ", "contact us.", "For More Information:", "Visit the Official Webpage of the CECIL Renaud Overseas Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/cecil-renaud-overseas-scholarship-2019/"], [["DSM: Brighter Living Scholarship 2018 for young Zambians & Ethiopians (Fully Funded to attend the 2018 One Young World Summit in The Hague, The Netherlands)", "date announced:May 10, 2018", "Application Deadline: June 3rd 2018"], ["Application Deadline: June 3rd 2018", "As a longstanding partner of ", "One Young World", ", DSM is proud to support the Brighter Living Scholarship in light of the 2018 Summit in The Hague. Our purpose is to create brighter lives for people today and generations to come. We connect our unique competencies in Life Sciences and Material Sciences to create solutions that nourish, protect and improve performance.", "With the ", "Brighter Living Scholarship DSM", " will offer 4 scholarships to young leaders from Zambia and Ethiopia, who are working in the field of nutrition, towards eradicating malnutrition and tackling the issue of food security.", "The scholarship builds on the ", "Africa Improved Foods", " (AIF) partnership, which is an innovative public-private partnership making nutritious fortified foods locally in Africa for Africa with the objective of ending malnutrition. AIF is a partnership between DSM, IFC, CDC, FMO, Government of Rwanda and the World Food Programme.", "Requirements:", "In line with the expansion objectives of DSM/AIF to more African countries, this scholarship seeks to support young leaders ", "(aged 18 – 30) from Zambia and Ethiopia", " who are delivering nutritional solutions for their communities. Specifically, the scholarship seeks candidates who are ", "making a positive impact on reducing malnutrition and improving the food value chain", " in one of the following ways:", "Shaping opinions:", " raising awareness of the importance of a balanced and nutritional diet.", "Building brands:", " developing responsible and nutritious brands which are attractive and affordable for the communities who need them most (especially those with low income, at base of pyramid (BoP).", "Producing locally:", " sustainably producing local produce or nutritional products to serve local communities.", "Improving small holder farmers value chain:", " developing/implementing programs to eliminate post-harvest losses for small holder farmers and improve quality of their produce (especially elimination of aflatoxin in maize)", "Benefits:", "Scholars will receive:", "Access to the One Young World Summit 2018 in The Hague, Netherlands\n", "Hotel accommodation on a shared basis during the Summit, 14 to 20 (inclusive) October, 2018", "Provisions may be made for delegates to avail of an additional night’s accommodation on 13 October and/or 21 October, should their travel itinerary require.", "The cost of travel to and from The Hague (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Discretionary funds to provide for emergency out of pocket expenses whilst in The Hague.", "Participation in DSM’s One Young World Program\n", "​Participation in DSM’s onboarding workshops before the OYW Summit", "Individual coaching with leaders from Africa Improved Foods and/or DSM", "Buddying with 2018 DSM delegates prior, during and post Summit​", "Participation in webinars and conference calls throughout the duration of the program", "For More Information:", "Visit the Official Webpage of the DSM: Brighter Living Scholarship 2018 "], "url : https://www.opportunitiesforafricans.com/dsm-brighter-living-scholarship-2018/"], [["Government of Colombia Spanish as a Foreign Language (ELE) Program 2018/2019 for African Students & Tourists (Fully Funded to Colombia)", "date announced:May 7, 2018", "Application Deadline: 18th May 2018 (at midnight Bogotá time)"], ["Application Deadline: 18th May 2018 (at midnight Bogotá time)", "The strategy of ", "Spanish as a Foreign Language (ELE)", ", per its acronym in Spanish, led by the Government of Colombia seeks to form tour guides and undergraduate and graduate students from Asia and Africa in different Colombian learning institutions recognized by the quality of their Spanish programs. In 2018, this strategy will include the following initiatives: 6th version of ELEFocalae, 2nd version of ELE Asia + and the first versions of ELEAsia Central and ELE África.", "ELE África aims at fostering the mutual understanding, trust, political dialogue and friendly cooperation between Colombia and the African countries through the teaching of Spanish in order to promote the linguistic, cultural and touristic values of Colombia.", "Training activities", "The course will be offered for one academic semester (approximately 17 weeks) and will be held at Colombian universities recognized for the high quality of their Spanish as a Foreign Language Programs. During their studies, the beneficiaries must carry out the following types of activities:", "Academic activities: They are related to the main component of the initiative, which is the learning of Spanish. They include both the classroom classes and the extracurricular tasks and activities programmed by host universities to guide the beneficiaries through the process of formation. The courses have a minimum intensity of 15 hours per week and each university has the autonomy to set a higher weekly intensity.", "Volunteering activities: This component is part of the learning process. Its objective is to generate a greater approximation of the beneficiaries to the Colombian reality; contribute to the development of activities of interest to the universities; support socially oriented projects; and generate greater exchange and socialization with the academic community.", "Beneficiaries must complete a minimum of 10 hours of on-site volunteering per week. The activities are assigned by each university with the guidance and follow-up of the Government of Colombia.", "Spanish certification exam", "\nThe exam “Servicio Internacional de Evaluación de la Lengua Española” (SIELE) will be applied at the end of the course and will provide the beneficiaries with an internationally recognized certification of their language sufficiency.", " Target group", "\n• Tourist guides duly certified by the National Tourism Authority or Competent Authorities of their countries.", "\n• Undergraduate students currently in their last two (2) academic semesters in any area, and postgraduate students. The Government of Colombia will prioritize candidates who are studying courses related to Languages, Latin-American Studies, International Business, International Relations, International Trade, Business, Management and Foreign Languages.", "Requirements:", "PROFILE", "\n• Be a national of an African country.", "\n• Be tourist guides duly certified or students who have outstanding academic results and are enrolled in the last academic year of their undergraduate course or in a postgraduate course.", "\n• Have a good knowledge of English (certified B1 level minimum).", "\n• Have been born between January 1, 1978 and December 31, 1998.", "\n• Accept and carry out the rules of this 2018 initiative, submitted as ", "Annex I", " of this document.", "\n• Have good physical and mental health.", "\n• Have the necessary resources to cover the costs of the first month of their stay in Colombia. It is suggested a minimum amount of US$600 (six hundred US Dollars).", "\n• Have the necessary resources to cover for the costs of the Colombian Alien ID, approximately US$70 (seventy US Dollars.)", "\n• Not to have participated in the previous versions of ELE initiatives offered by the Colombian Government, developed since 2013.", "Note", ": Knowledge of basic Spanish (level A1) will be positively valued.", "\nPossession of a valid USA or Schengen Visa will be positively valued.", "Benefits:", "• Round trip, air ticket in economy class from the capital of the home country to the Colombian city where the course will take place. The Colombian Government will be responsible for assigning the placement city.", "\n• Monthly stipend of one million six hundred (1.600.000) Colombian pesos for the beneficiary to cover basic living expenses, such as accommodation, local transport, and the cost of meals in Colombia. The monthly stipend will be proportional to the number of days of the beneficiaries’ stay in Colombia, and will be paid once per month in arrears subject to the assistance to the Spanish lessons by the beneficiary. Attendance will be checked through report, which will be submitted by the university to the Colombian authorities.", "\n• Tuition scholarship for the Spanish course.", "\n• International Health Insurance.", "\n• Courtesy Colombian Visa.", "\n• SIELE exam to obtain the Spanish as a foreign language certification.", "Note:", " The cost of any additional visas of third countries that may be necessary to travel to Colombia, as well as of any extracurricular activities that the beneficiaries wish to undertake at the Colombian host universities, will not be financed by the Government of Colombia.", " REQUIRED DOCUMENTS", "\n• ", "Application form completed", ", available on the webpage of the Colombian Embassies in the African countries. Point 9 below has the list of Colombian Diplomatic Missions with their contact details.", "\n• A recent passport size photo (3.5 x 4 cms).", "\n• Copy of the principal passport page, containing biographical information. The passport must have a minimum validity of six months after the start of the program.", "\n• Medical certificate in English, signed by a doctor, certifying that the candidate is in good physical and mental health to take the course in Colombia, submitted as ", "Annex II", " of this document.", "\n• Yellow Fever vaccination certificate, if you have it.", "\n• Documents evidencing the candidate has a proficient knowledge of English, equal or greater than B1, per the Common European Framework of Reference for Languages.", "\n• ", "For tourist guides only", ": Acceptance letter or authorization of enrollment issued by the National Tourism Authority or Competent Authorities of their countries.", "\n• ", "For undergraduate and graduate students", ": Confirmation of enrollment letter issued by the university of origin that includes the Grade Point Average (GPA) of the candidate.", "\n• ", "For graduate students only", ": Copy of Undergraduate diploma.", "Note", ": Only applicants that comply with the required profile and documents will be considered.", "\nScholarship Beneficiaries will be asked to submit the Letter of acceptance, available as ", "Annex III", " in this document, on a later date upon selection.", "TERMINATION OF THE SCHOLARSHIP", "\nThe Government of Colombia reserves the right to terminate the scholarship and withdraw its support any time, if any of the following situations occur:", "\n• Non-compliance of the stipulated regulations of the initiative submitted in ", "Annex I", ".", "\n• Inaccuracy of the data provided by the fellow in the selection process.", "\n• Being expelled from the Colombian university per the rules of the institution.", "\n• For reasons of serious illness or mental disability.", "\n• For confirmed use of drugs.", "\n• Violation of Colombian laws.", "TIMELINE OF THE PROGRAM", "Dates in Colombia", "Activity", "April 18, 2018", "Launching of the call: the applicant must fill out the application form in the link available on the pages of the Colombian embassies, enclosing in PDF format the documents required in the bases of the call. Only applicants that comply with the required profile and documents will be considered.", "May 18, 2018", "Submission deadline.", "May 21 to May 24, 2018", "Application form and submitted documents evaluation and notification of pre-selected candidates.", "June 4 to June 12, 2018", "Online Interviews to pre-selected candidates: In order to come up with the list of the final 16 beneficiaries, 70 pre-selected candidates will be interviewed online following the order of submission of the application form.", "June 14, 2018", "The Colombian Embassies will publish the results of the selection process on their webpages and will introduce the logistical coordinator of the initiative.", "June 15, 2018", "Online Spanish level assessment to the selected candidates.", "June 17, 2018", "Deadline for acceptance of the scholarship.", "June 18 to July 8, 2018", "Preparation for the trip (remission of information package, air tickets, medical insurance and visa application guide to the beneficiaries)", "July 22 to 31, 2018", "Arrival of beneficiaries to Colombia, training activities and welcome event.", "August 1st to November 18, 2018", "Spanish courses.", "November 19 to 25, 2018", "Closing activities (Spanish certification exam, closing event and return to home countries)", "For More Information:", "Visit the Official Webapage of the Government of Colombia Spanish as a Foreign Language (ELE) Program 2018/2019"], "url : https://www.opportunitiesforafricans.com/government-of-colombia-spanish-as-a-foreign-language-ele-program-2018-2019/"], [["University of Essex Africa Scholarship Programme 2018/2019 for Young Africans to study in the United Kingdom", "date announced:May 10, 2018", "Application Deadline: 30 September 2018"], ["Application Deadline: 30 September 2018", "If you’re an international student from an African nation and are self-funding your postgraduate studies, you could be eligible for a ", "scholarship", " of £4,000, paid as a discount on your tuition fee. If you are from any of the following countries, please check the academic requirements below to see if you could be eligible.", "Ghana", "CGPA 3.0/4.0 or above", "Nigeria", "CGPA 3/5 or above", "Other member states of the African Union", "2:1 or above (or equivalent as defined by our Postgraduate Admissions selection criteria)", "Degree qualification", "You will also be considered for this award if you are a national of an African nation and you have a degree:", "from a recognised UK university, other than Essex, with a 2:1 or above, or", "from a recognised university with a 2:1 or above (or equivalent as defined by our Postgraduate Admissions selection criteria) or from any of the following countries:\n", "Bangladesh", "Canada", "China", "Hong Kong", "India", "Indonesia", "Japan", "Jordan", "Kazakhstan", "Malaysia", "Norway", "Pakistan", "Russia", "Taiwan", "Thailand", "Turkey", "USA", "Vietnam", "Eligibility", "You must meet ", "all", " of the following conditions.", "be classified as an international student for fee purposes", "be a national of an African nation (defined as a member state of the African Union) and ordinarily resident in an African nation (see the full terms and conditions for definition of “ordinary residence”)", "be entirely self-funding your studies", "be a graduate of any African country, or any of the countries specified above", "be applying for a full-time Masters course starting in 2018-19 (excluding MBA)", "meet the academic criteria in the table above", "How to apply", "If you meet all the eligibility criteria and firmly accept the offer of your place by 30 September 2018 then you will automatically be awarded this scholarship. All our relevant course applications, received by the given deadline, will automatically be considered for this scholarship and a fee discount applied to all who meet our grade requirements.", "You’ll be notified of your award at the point when your place at Essex is confirmed, and by the end of October 2018. You don’t need to complete an application form.", "For More Information:", "Visit the Official Webpage of the University of Essex Africa Scholarship Programme 2018/2019"], "url : https://www.opportunitiesforafricans.com/university-of-essex-africa-scholarship-programme-2018-2019/"]]