[[["2020/2021 Maastricht University High Potential scholarships for International Students to study in the Netherlands", "date announced:October 15, 2019", "Application Deadline: midnight on 1 February 2020 (Central European Time). "], ["Application Deadline: ", "midnight on 1 February 2020 ", "(Central European Time). ", "The Maastricht University (UM) Holland-High Potential Scholarship Programme", " offers 24 full scholarships of €29.000 (including tuition fee waiver and monthly stipend) each academic year for highly talented students from outside the European Union (EU) who have been admitted to a Master’s programme at UM. ", "The Scholarship programme consists of both the High Potential Scholarship (funded by the Maastricht University Scholarship Fund), and the Holland Scholarship, which is financed by the Dutch Ministry of Education, Culture and Science in conjunction with Dutch universities and universities of applied sciences. It is aimed at international students from outside the EU/EEA who wish to follow a full degree programme in the Netherlands.", "Duration of the UM Holland-High Potential scholarship", "13 months for a one-year Master’s programme", "25 months for a two-year Master’s programme", "Amount of the UM Holland-High Potential scholarship programme 2020-2021", "\nLiving expenses\n", "\n€ 12,350* (13 months) or € 23,750* (25 months)\n", "\nPaid to students by the UM International Services Desk\n", "\nHealth & liability insurance\n", "\n€ 700*\n", "\nArranged for and paid by the UM International Services Desk\n", "\nVisa application costs\n", "\n€ 171*\n", "\nArranged for and paid by the UM International Services Desk\n", "\nTuition fees\n", "\n€ 13,800;  € 15,500 or € 16,800 depending on the tuition of your study programme\n", "\nArranged for and paid by the UM International Services Desk\n", "\nPre-Academic Training costs\n", "\n€ 695* \n", "\nArranged for and paid by the UM International Services Desk\n", "*These amounts are subject to change for academic year 2020-2021", "Application procedure", "Step 1", ":Register for ", "one of the participating Master’s programmes", " at Maastricht University. For further details on how to register for a Master’s programme at UM, please see your prospective ", "programme’s webpage", ". Once\nyou have submitted your application via Studielink, you will receive a\nstudent ID number for Maastricht University. You will need a student\nnumber in order to complete and submit the Scholarship Application Form\n(see Step 2 below).", "Please note: only the Master’s programmes in the list above are eligible for a UM Holland-High Potential scholarship.", "Please note: you can apply for the Master’s programme at UM and the\nscholarship simoultaneously. However, you must be conditionally approved\nfor admission to your Master’s programme in order to be awarded a\nscholarship.", "Please note: if your study programme requires the payment of a\nhandling fee as part of your programme’s admissions procedure, UM\nInternational Services Desk does not cover handling fees. You are\nresponsible for paying any handling fee your programme may require by 1\nFebruary 2020. To check whether your programme requires the payment of a\nhandling fee, please check your programme’s webpage under the menu tab\n‘Admission requirements’.", "Step 2: ", "Please fill in the ", "application form", " (log\nin with your UM account), upload the following documents in .doc,\n.docx, or PDF format, and submit your application. Please note that you\nwill only be able to submit your application once, so please ensure that\nall of your documents and referee contact details are up-to-date. If\nyou have applied for multiple UM study programmes, the UM International\nServices Desk will ensure that your complete scholarship application is\nconsidered for all eligible programmes for which you have a\nconditionally approved or approved admissions status.", "Curriculum vitae", ". Your CV should be up-to-date, contain\nrelevant information about your education and (job) experience, and\nshould not be longer 2 A4 pages.", "Letter of motivation", ". Your letter of motivation should\nbe up-to-date and specifically tailored to this scholarship programme.\nGeneric letters of admission that do not directly address your\nmotivation for UM Holland-High Potential scholarship selection will be\nrejected. Your letter of motivation should be no longer than 1 A4 page.\nBe sure to argue why this scholarship is important to you, why you\nshould be selected, and what your role as an ambassador of Maastricht\nUniversity would be during your scholarship period, and during the\nupcoming years after you finish your studies at UM.", "Proof of academic excellence", ". You may upload one of the\nfollowing documents in order to prove your academic excellence: 1. Your\nUniversity transcript that explicitly states your grade point average\nor class ranking (i.e. first class honours) for your entire study\nprogramme; or, 2. A letter signed by your institution’s Head of\nDepartment or Registrar stating that you are one of the top 20 students\nin the graduating year of your study programme. Please ensure that the\nletter contains the contact details of your Head of Department or\nRegistrar.", "The contact details of one referee", ". Please note that we\ncheck the authenticity of your referee by contacting your referee.\nTherefore, ensure that you take the following steps when choosing a\nreferee and submitting their details.", "–", " Relationship\nto applicant: indicate your referee’s connection to you; is this your\nprofessor, thesis supervisor, employer? Please remember that family\nmembers may not function as referees.", "–", " Work telephone number of your referee: Be sure to include the applicable country calling code.", "–", " Work or institutional email address of your referee. Letters referencing only a personal email address will be rejected.", "Please note that you will only be able to submit your application\nonce, so please ensure that all of your documents and referee contact\ndetails are up-to-date.", "Step 3", ": You will have to contact the referee you\nprovided in your application form and ask them to submit their reference\nletter per email to ", "[email protected]", " ", "by midnight on 1 February 2020 ", "(Central European Time).", "\nWe have prepared ", "scholarship reference letter guidelines", ";\nplease print these out or forward them to your referee, as they will\nhelp your referee to write a good reference letter on your behalf.\nPlease note that referees must be (former) professors, lecturers, or\nemployers, and not family members. Recommendation letters should be\ndated and written no earlier than February 2019. Please also note that\nit is your responsibility to liaise with your referee and ensure that\nthey submit their letters before the deadline. Applications for which we\nhave not received reference letters are unfortunately incomplete, so\nplease communicate on time with your referee about this important step\nin the scholarship application process.", "For More Information:", "Visit the Official Webpage of the 2019/2020 Maastricht University High Potential scholarships"], "url : https://www.opportunitiesforafricans.com/2020-2021-maastricht-university-high-potential-scholarships/"], [["University of British Columbia Karen McKellin International Leader of Tomorrow Award 2020/2021 (Funded Study in Canada)", "date announced:October 2, 2019", "Application Deadline: December 1st 2019"], ["Application Deadline: ", "December 1", "st 2019", "This need-and-merit-based award recognizes international\nundergraduate students who demonstrate superior academic achievement,\nleadership skills, involvement in student affairs and community service,\nand recognized achievement in other key areas.", "The value of your ", "Karen ", "McKellin International Leader of Tomorrow Award ", "is ", "proportional to your financial need. Financial need is determined by totalling tuition, fees, and living costs, and subtracting the financial contribution you and your family can make each year. A standard needs assessment is based on the financial information provided by you and your family.", "Your award may be renewed for up to three additional years of\nundergraduate study or to degree completion – whichever comes first\n– provided you achieve satisfactory academic standing in your faculty,\ncontinue to demonstrate financial need, and maintain your Canadian study\npermit (student visa).", "Eligibility", "To be considered for the Karen McKellin International Leader of Tomorrow Award:", "You must be an international student who will be studying in Canada on a Canadian study permit.", "You must be entering UBC from a recognized secondary school, college, or other university.", "You must be applying for your first undergraduate degree.", "You must meet UBC’s ", "admission requirements", ", including general and degree-specific requirements and the English Language Admission Standard.", "You must demonstrate superior academic achievement (achieve all As or equivalent standard).", "You must demonstrate a level of financial need that would otherwise prevent you from pursuing a UBC degree.", "Please note:", " If you are nominated for a Karen\nMcKellin International Leader of Tomorrow Award, you will not be\nconsidered for merit-based awards, including International Major\nEntrance Scholarships and Outstanding International Student Awards.", "Nominations", "Award nominations are now open for the 2020/21 winter session and are open until ", "December 1", ".", "Please fill out one of the forms below to be considered for the\naward. The Okanagan campus and the Vancouver campus have separate forms.", "2020/21 Karen McKellin International Leader of Tomorrow Award (Okanagan campus)", " ", "2020/21 Karen McKellin International Leader of Tomorrow Award (Vancouver campus)", "For More Information:", "Visit the Official Webpage of the University of British Columbia Karen McKellin International Leader of Tomorrow Award 2020/2021"], "url : https://www.opportunitiesforafricans.com/university-of-british-columbia-karen-mckellin-international-leader-of-tomorrow-award-2020-2021/"], [["DAAD Study Scholarships 2019/2020 – Postgraduate Studies in the Field of Music", "date announced:September 26, 2019", "Application Deadline: October 15th 2019"], ["Application Deadline: October 15th 2019", " DAAD scholarships", " ", "offer graduates the opportunity to continue their education in Germany with a postgraduate or continuing course of study. The scholarships also promote the exchange of experience and networking amongst colleagues. ", "Requirements:", " Foreign applicants who have gained a first university degree in the field of Music at the latest by the time they commence their scholarship-supported study programme; if this is not possible, they should have at least exhausted all the training options available for their instrument in their country of origin. ", " In this study programme, you can complete ", "a Master’s degree/postgraduate degree leading to a final qualification, or", "a complementary course that does not lead to a final qualification (not an undergraduate course) at a state German college of music of your choice.", " Postgraduate studies are possible in the so-called 2nd cycle (usually a four-semester Master’s degree) or a 3rd cycle which usually takes place in two semesters (concert examination, masterclass or PhD in an artistic subject).", " This programme only funds projects in the artistic field. Other DAAD scholarship programmes are available for applicants from the field of musicology or music education or musicians with a scientific project.", " Duration of the funding", "Master’s degree programme:", "Between 10 and 24 months depending on the length of the chosen study programme or study project", "Start: usually from 1st October, or earlier if a language course is taken prior to the study programme", "The\nscholarships are awarded for the duration of the standard period of\nstudy for the chosen study programme (up to a maximum of 24 months). To\nreceive further funding after the first year of study for 2-year\ncourses, proof of academic achievements thus far should indicate that\nthe study programme can be successfully completed within the standard\nperiod of study. Therefore, a reference of the main subject teacher will\nbe required.", "Applicants who are already in Germany in the first\nyear of a postgraduate course at the time of application may apply for\nfunding for their second year of study.", "An extension of the\nscholarship is possible if changing to a new stage in studies is\nintended (usually from a Master’s degree to an advanced programme of\nstudy such as a concert exam or master class). For particularly\nqualified candidates, it is possible to apply for an extension for a\nconcert exam for up to two years.", "Complementary studies not leading to a final qualification:", "One academic year. In individual cases, the scholarship can be extended on request", "Start: usually on 1st October, or earlier if a language course is taken prior to the study programme", "Value", "A monthly payment of 850 euros", "Travel allowance", "One-off study allowance", "Payments towards health, accident and personal liability insurance cover", "Under certain circumstances, scholarship holders may receive the following additional benefits:", "Monthly rent subsidy", "Monthly allowance for accompanying members of family", "To enable scholarship holders to learn German in preparation for their stay in the country, DAAD offers the following services:", "Payment of course fees for the online language course “Deutsch-Uni Online (DUO)” (", "www.deutsch-uni.com", ") for six months after receipt of the Scholarship Award Letter", "if\nnecessary: Language course (2, 4 or 6 months) before the start of the\nstudy visit; the DAAD decides whether to fund participation and for how\nlong depending on German language skills and project. Participation in a\nlanguage course is compulsory if the language of instruction or working\nlanguage at the German host institution is German.", "Allowance for a personally chosen German language course during the scholarship period", "Reimbursement\nof the fees for the TestDaF test which has either been taken in the\nhome country after receipt of the Scholarship Award Letter or in Germany\nbefore the end of the funding period", "As an alternative to the\nTestDaF for scholarship holders who have taken a language course\nbeforehand: the fee for a DSH examination taken during the scholarship\nperiod may be reimbursed.", "Selection", "\nA special DAAD committee made up of professors from German\ncolleges of music makes the final decision about scholarships in the\nfield of music. ", "For More Information:", "Visit the Official Webpage of the DAAD Study Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/daad-study-scholarships-2019-2020-postgraduate-studies-in-the-field-of-music-%e2%80%a2/"], [["DAAD In-Country/In-Region Masters & PhD Scholarship Programme 2020/2021 at University of Abomey-Calavi", "date announced:October 7, 2019", "Application Deadline: 7th February 2020. "], ["Application Deadline: 7th February 2020. ", "The programme aims at fostering strong, internationally oriented higher education", " systems in Sub-Saharan Africa with the capacity to contribute to sustainable", " development. To this end, scholarships are granted for development-related", " Master or doctoral studies for individuals who plan to pursue a career in teaching", " and / or research at a higher education institution in Sub-Saharan Africa.", " By training future academic and professional leaders, the programme contributes", " to the following long-term impacts:", " • Qualified professionals’ involvement in the solution of development-related", " problems in Sub-Saharan Africa", " • Graduates strengthening education and research in Sub-Saharan Africa", " • Structural strengthening and regional networking of partner institutions and", " partner universities", " To achieve these long term impacts, the following outcomes have been formulated", " as programme objectives:", " Programme objective 1: Graduates have qualified to take over responsible", " positions in their, or for their, region of origin", " Programme objective 2: The participation of women and underprivileged groups", " is reinforced", " Programme objective 3: Organizational, financial and personal capacities of", " partner institutions are strengthened", " As part of the „In-Country/In-Region Scholarship Programme“ DAAD offers", " scholarships for PhD and Master studies. The programme is funded by the", " German Federal Ministry of Economic Cooperation and Development (BMZ) and", " aims at university staff in the first line, without neglecting the public sector demand", " of academically trained personnel.", "The target group for scholarships are graduates and postgraduates from Sub-", "\nSaharan Africa with a first academic degree if applying for a Master’s programme,", "or with a Master’s degree if applying for a doctoral programme who want to pursue", " Master’s or PhD courses in their home country (so called In-Country", " scholarships) or in another Sub-Saharan African country (In-Region", " scholarships).", "Applicants", " • have successfully completed generally a three-year university degree", " (Master candidates) or a two-year university degree (doctoral candidates)", " with above average results (second class upper division)", " • clearly show motivation and strong commitment", " • have thorough knowledge of the language of instruction", " • have completed their last university degree not more than 6 years ago at the", " time of application", " • must be nationals or permanent resident of a Sub-Saharan African country", " • should generally be a) staff member of a public university, b) candidate", " considered for teaching or research staff recruitment, c) from the public", " sector", "Eligible fields ", "The In-Country/In-Region Scholarship Programme supports studies in subject", "areas with strong relevance to national development.", " The scholarships at University of Abomey-Calavi, Faculty of Agronomic Sciences", " are available in the following field:", " • Master Statistics, Major Biometry", " • PhD Agronomy, Major Biometry", "The duration", " • of the PhD programme is generally up to three years", " • of the Master programme is generally two years generally starting in September 2020.", "The application process contains two steps. Please be aware of the two", "\napplication deadlines.", "\nFirst step:", "\nApplicants must apply for their studies at University of Abomey-Calavi, Faculty of", "\nAgronomic Sciences using the contacts and the method that is prescribed by the", "\ninstitution. The University of Abomey-Calavi, Faculty of Agronomic Sciences has", "\nset its own deadlines.", "University of Abomey-calavi, Faculty of Agronomic Sciences will screen, pre-", "\nselect (according to DAAD selection criteria) and short-list the applicants. A", "detailed report consisting of the shortlisting procedure, the entire list of applicants,", " the ranked shortlist and the shortlisting panel members will also be availed to", " DAAD. The ranked shortlist will contain preferably triple (at least double) the", " number of scholarships that have been attributed to the institution.", " DAAD reserves the right of final selection.", " Second step:", " University of Abomey-Calavi, Faculty of Agronomic Sciences will provide the", " shortlisted candidates with the link to the DAAD-Portal. ", "Only the pre-selected candidates are asked to log into the DAAD portal,register themselves and submit an DAAD application. ", "DAAD Deadline: 7th February 2020.", " Documents to be submitted (in either English or German):", " • DAAD application form duly filled in (available in the DAAD-Portal)", " • Hand signed curriculum vitae (please use the European specimen form at", " http://europass.cedefop. Europa.eu), including a list of publications (if", " applicable).", " • Recommendation letter by university teachers (Master 1, PhD 2)", " • Letter of admission for the host university / institution / network", " • Certified copies of university degree certificates including transcripts", " • Letter of motivation (if applicable: mentioning the planned research stay in", " Germany, see “Additional benefits”)", " • Copy of the passport", "For More Information:", "Visit the Official Webpage of the DAAD In-Country/In-Region Masters & PhD Scholarship Programme 2020/2021 "], "url : https://www.opportunitiesforafricans.com/daad-in-country-in-region-masters-phd-scholarship-programme-2020-2021/"], [["2020 Jacobs Foundation Scholarships in youth and child development for study at the University of Oxford (Funded)", "date announced:October 10, 2019", "Application Deadline: 1st November, 2019. "], ["Application Deadline: ", "1st November, 2019", ". ", "The first Jacobs Foundation Scholars at Saïd Business School started their studies in September 2018.", "The Jacobs Foundation Scholarship", " was introduced in 2018 and is open to candidates with a strong interest in the field of youth and child development and/or education, or in agricultural development in Africa. Jacobs Foundation scholars have an entrepreneurial vision, are dedicated to social issues, and usually have a minimum of three years’ work experience. The Jacobs Foundation Scholars will also be committed to the goals of the Jacobs Foundation. ", "It is hoped that the Jacobs Foundation Scholars will become active participants in the Jacobs Network, connecting with other fellows online and offline through events and conferences; and contribute to the advancement of the network as well as the Foundation’s communication channels such as the newsletter or the blog.", "\nScholarship details\n", "\nValue\n", "£26,500 per scholarship", "As a Jacobs Foundation scholar, you will also benefit from interaction with the Jacobs Foundation directly.", "\nNumber available\n", "Two scholarships", "\nEligibility criteria\n", "Candidates must have an interest in the following areas (in order of priority):", "Child and youth development, learning, education (ed-tech, early-ed, parenting, brain development);", "Agricultural development in Africa (food security, microfinance, supply-chain);", "Impact investment, with a preference for education.", "Candidates who have industry experience from the NGO, education or government sector are particularly welcome to apply.", "Additionally, candidates must be ordinarily resident in one of the following countries:", "Andorra, Austria, Belgium, Benin, Bulgaria, Burkina Faso, Croatia,\nCzechia, Denmark, Estonia, Faroe Islands, Finland, France, Gambia,\nGermany, Ghana, Greece, Guinea, Guinea-Bissau, Holy See, Hungary,\nIceland, Ireland, Italy, Ivory Coast, Latvia, Liberia, Liechtenstein,\nLithuania, Luxembourg, Mali, Malta, Mauritania, Monaco, Netherlands,\nNorway, Poland, Portugal, Romania, San Marino, Senegal, Sierra Leone,\nSlovakia, Slovenia, Spain, Sweden, Switzerland, Togo, United Kingdom,\nUnited States.  (With a preference for: Senegal, Guinea, Ivory Coast,\nBurkina Faso, Benin, Ghana, United Kingdom, Switzerland, Germany and\nRomania.)", "\nHow to apply\n", "You must submit an additional Jacobs Foundation scholarship\nessay in the funding section of your programme application form. Please\nwrite up to 500 words, answering the question:  ", "Tell us about\nyour experience in one of the listed Priority Areas.  How would the MBA\nprogramme support you and your future plans in one of these areas?", " ", "\nDeadline\n", "This scholarship will be awarded following Admissions Stage 2. The application deadline for this stage is ", "1st November, 2019", ".  ", " If both scholarships are not awarded to candidates who apply by this date, the scholarship(s) will be awarded at a later admissions stage, however early application to the MBA programme is advised.", "For More Information:", "Visit the Official Webpage of the 2020 Jacobs Foundation Scholarships in youth and child development"], "url : https://www.opportunitiesforafricans.com/2020-jacobs-foundation-scholarships-in-youth-and-child-development/"], [["Google Women Techmakers Scholars Program 2020/2021 for Female Students ( 7,000 EUR Award & Funded to Women Techmakers Scholars’ Retreat in summer 2020)", "date announced:October 15, 2019", "Application Deadline: December 5th, 2019 at 11:59 pm GMT. "], ["Application Deadline: December 5th, 2019 at 11:59 pm GMT. ", "Through the ", "Women Techmakers Scholars Program – formerly the Google Anita Borg Memorial Scholarship Program ", "– Google is furthering Dr. Anita Borg’s vision of creating gender equality in the tech industry by encouraging women to excel as active participants and leaders in the field.", " Women Techmakers (WTM) ", "is excited to announce two new scholarships. Firstly, through our partnership with Stadia, Google’s all new gaming platform, we’re expanding our Scholars Program to support students pursuing gaming degrees in addition to those pursuing computer science degrees. Secondly, through the WTM Irish University scholarship, we’re introducing a multi year scholarship for students pursuing their undergraduate degree in Ireland.", "Women Techmakers Scholars for Computer Science and Gaming", " will each receive a 7,000 EUR award (or local equivalent) for the 2020-2021 academic year. Women Techmakers Irish Scholars will each receive 5,000 EUR on an annual basis for the duration of their undergraduate studies. ", "Scholarships will be awarded based on the strength of each candidate’s\nimpact on diversity, demonstrated leadership, and academic background. The\nprogram is open to students who meet all the minimum qualifications and we\nstrongly encourage women to apply. All scholarship recipients\nwill be invited to the Google Scholars Retreat in the summer of 2020 to connect\nwith fellow scholars, network with Googlers, and participate in a number of\ndevelopment workshops.", "To be eligible to apply for the WTM Scholarship for Computer Science & Gaming\napplicants must:", "Be currently enrolled as an undergraduate or graduate student at a\nuniversity for the 2019-20 academic year", "Intend to be enrolled or accepted as a full-time student in a Bachelors,\nMasters, or PhD program at an accredited college or university in Europe,\nMiddle East or Africa for the 2020-2021 academic year", "Be studying computer science, computer engineering, or a closely related\ntechnical field or be studying video game programing, game engineering, game\ndesign and development, or a closely related field in gaming", "Demonstrate a strong academic record", "Exemplify leadership and demonstrate passion for increasing the involvement\nof women in technology (i.e. computer science or gaming)", "To be eligible to apply for the WTM Irish University Scholarship applicants\nmust:", "Be currently enrolled as a first or second year undergraduate student at a university/institute of technology in Ireland for the 2019-20 academic year", "Intend to continue pursuing their Bachelors degree at a university/institute of technology in Ireland for at least the 2020-21 and 2021-22 academic years ", "Be studying computer science, computer engineering, or a closely related technical field", "Demonstrate a strong academic record", "Exemplify leadership and demonstrate passion for increasing the involvement of women in technology", "Application Requirements", "General background information (includes contact information and information about your current and intended institutions)", "Current resume", "Academic transcripts from your current and prior institutions (if you have earned a prior degree)", "One letter of reference from a professor, instructor, adviser or supervisor", "Responses to five essay questions", "For More Information:", "Visit the Official Webpage of the Google Women Techmakers Scholars Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/google-women-techmakers-scholars-program-2020-2021/"], [["VLIR-UOS Sustainable Development and Global Justice (SUSTJUSTICE) Postgraduate Scholarships 2020/2021", "date announced:October 8, 2019", "Application Deadline: 15 October 2019 "], ["Application Deadline: ", "15 October 2019", " ", "The Law and Development Research Group of Antwerp University will be running a training programme on ", "“Sustainable Development and Global Justice” (SUSTJUSTICE)", " from 10 February to 30 April 2020.", "SUSTJUSTICE offers a comprehensive teaching programme based on the\nresearch lines of the Law and Development Research Group. The training\nbrings together a diverse group of leading experts from the North and\nSouth to introduce salient features of their disciplines, and to engage\nstudents in understanding and reflecting on key challenges for\nsustainable development and global justice. The postgraduate programme\nruns in conjunction with the Faculty’s Master of Laws (LL.M).", "VLIR-UOS supports the programme with 12 scholarships for participants from the global South (please consult the eligible country list).", "Requirements:", "You can only apply for an ITP scholarship if you meet the following requirements:", "Nationality and country of residence:", "  A candidate\nshould be both a national and a resident of one of the 31 eligible\ncountries (not necessarily the same country) at the time of the\napplication.", "Relevant professional experience and a support letter:", "\nPriority is given to candidates who are employed in academic\ninstitutions, research institutes, governments, the social economy or\nNGOs, or to those who aim to have a career in one of these sectors. The\ntraining candidate should have relevant professional experience and a\nsupport letter confirming (re)integration in a professional context\nwhere the acquired knowledge and skills will be immediately applicable.", "Fungibility with other VLIR-UOS funding:", " Candidates\nwho are working at a university where we already fund IUC, TEAM or SI\nprojects, can receive an ITP-ICP scholarship if they clearly motivate\nthe reason for their application and if they clarify why the\nparticipation at the ICP or ITP programme cannot be funded as part of\nthe IUC, TEAM or SI programme or project funds that already exist.", " Other VLIR-UOS scholarship applications and previously awarded scholarships: ", "A\npotential candidate can only submit one scholarship application with us\nper year – irrespective of the scholarship type – and can, therefore,\nonly be selected for one VLIR-UOS scholarship every year. Candidates who\nalready received one of our scholarships to participate in another ITP,\nwill not be eligible. Candidates who already received one of our\nscholarship to participate in an ICP (or vice versa) can only be\nselected if the previously attended course is thematically linked to the\nITP.", "For More Information:", "Visit the Official Webpage of the VLIR-UOS Sustainable Development and Global Justice (SUSTJUSTICE) Postgraduate Scholarships"], "url : https://www.opportunitiesforafricans.com/sustjustice-postgraduate-scholarships/"], [["TU Delft Sub-Saharan Africa Excellence Scholarships 2020 for Young Africans – Netherlands (Funded)", "date announced:September 30, 2019", "Application Deadline: 15 December 2019 (23:59 CET)"], ["Application Deadline: ", "15 December 2019 (23:59 CET)", "TU Delft | Global Initiative", " offers 4 ", "Sub-Saharan Africa Excellence Scholarships.", " ", "These scholarships cover full tuition fees for a TU Delft MSc programme and living expenses for 2 years. Our aim is to give talented, motivated and broadly interested students from Sub-Saharan Africa the opportunity to study at the Delft University of Technology and to strengthen our relationship with the universities they come from. ", "\nThese scholarships give talented, motivated and broadly interested\nstudents from Sub-Saharan Africa the opportunity to study at the Delft\nUniversity of Technology. The Global Initiative aims to support capacity\nbuilding in the Global South and to advance future leadership focusing\non sustainable global development. The UN Sustainable Development Goals\nare a guiding principle for the TU Delft. ", " TU Delft | Global Initiative offers four Sub-Saharan Africa Excellence Scholarships every year. From the students we expect that they are willing to act as our ambassadors during their studies and after graduation. ", "Number of scholarships 4", " Citizenship Angola, Benin, Botswana, Burkina Faso, Burundi, Cameroon, Cape Verde, Central African Republic, Chad, Côte d’Ivoire, Djibouti, Eritrea, Ethiopia, Gabon, The Gambia, Ghana, Kenya, Lesotho, Liberia, Madagascar, Malawi, Mauritania, Mauritius, Mozambique, Namibia, Niger, Nigeria, Rwanda, Senegal, Seychelles, Sierra Leone, Somalia, South Africa, South-Sudan, Sudan, Swaziland, Tanzania, Togo, Uganda, Zambia, Zimbabwe.", " Eligibility ", " Excellent international applicants (conditionally) admitted to one of the 2-year Regular TU Delft’s MSc programmes.", "With a cumulative grade point average (GPA) of 80 percent or higher of the scale maximum in the bachelor’s degree from an accredited university in one of the above mentioned countries.", " ", " Extent of Scholarship €25.000 per year for Sub-Saharan students, which includes:", "Full tuition fees for a TU Delft MSc programme based on the statutory fee or institutional rate, according to the registered nationality, AND contribution for the living expenses.\nMembership to the Scholarship club giving access to personal development, workshops, seminars, etc.\nA MSc thesis topic which relates to the Sustainable Development Goals and TU Delft | Global Initiative.\nBe our ambassador for Sub-Saharan Africa.", "Procedure Check if you’re eligible for this scholarship", "\nComplete your MSc application (check the admission requirements)", "In addition to all the regular documents for a MSc programme application:", "Upload the Scholarship Application Form", "\nUpload two reference letters (in one PDF document),according to required documents", "Two reference letters in either English, French, German or Dutch.", "\nThese letters must be:", "from either a previous professor or assistant professor. If you have work experience, one of these letters may be from your employer.\nwritten on the official letterhead /have the official stamp of the university or company.\nsigned by the referee and include your complete name", "Is your referee hesitant to provide you with the letter? Then he/she can email a scanned PDF of the letter to ", "[email protected]", " His/her e-mail must include your complete name and TU Delft student number. You will be given this number upon registering in Studielink.", " If you choose this option, you must upload a statement under “reference letter” in osiaan.tudelft.nl informing us of this decision. This statement should include the name and e-mail address of your referee.", "Please note that Non-EU/EFTA students must include their English test with their application (if required). EU/EFTA students can submit this document in a later stage according to the Admission instructions.", "Only students meeting this deadline who have been (conditionally) admitted to one of the MSc programmes of TU Delft could be considered for these scholarships.", " Granting ", "Only students who have been granted a scholarship will be informed by TU Delft via email by begin March 2020", "Receiving the scholarship is conditional on the student fulfilling all admission criteria.", "For More Information:", "Visit the Official Webpage of the TU Delft Sub-Saharan Africa Excellence Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/tu-delft-sub-saharan-africa-excellence-scholarships-2020/"], [["Sciences Po Emile-Boutmy (Undergraduate & Postgraduate) Scholarships 2020/2021 for Study in France (Funded)", "date announced:October 7, 2019", "Application Deadline: December 15, 2019 "], ["Application Deadline: ", "December 15, 2019", " ", "Sciences Po created the ", "Emile Boutmy scholarship", ", named after the founder of Sciences Po (1871), in order to welcome the very best international students from outside the European Union. The Emile Boutmy Scholarship is awarded to top students whose profiles match the admissions priorities of Sciences Po and individual course requirements.", "Eligibility requirements", "To be eligible for the scholarship, students must be, ", "first time applicants", ", from a ", "non-European Union state, whose household does not file taxes within the European Union,", " and who have been admitted to the Undergraduate or Master’s programme.", "Students who are not eligible are:", "Swiss and Norwegian applicants, since they may be entitled to CROUS scholarships", "Candidates who have dual citizenship, including an EU citizenship", "Candidates from Quebec for master’s degree (since they may take\nadvantage of sliding scale fees same as European applicants). Candidates\nfrom Quebec for a bachelor’s degree are eligible", "Master’s level dual-degree candidates. Only applicants for the following dual degrees are eligible:", "the dual degree in Journalism Sciences Po/Columbia University", "the dual degree Sciences Po/Fudan University with the concentration\nEurope-Asia in Global Affairs (only applicants with Chinese nationality)", "the dual degree Sciences Po/Peking University (only applicants with Chinese nationality)", "Ph.D. programme students (thesis)", "Candidates for the 1 year Master’s programmes", "Bachelor dual degree candidates", "Exchange students", "Candidates applying via the French graduate admission procedure", "Candidates can not cumulate their applications for the joint scholarship with CSC and the Emile Boutmy Simple Scholarship.", "The Emile Boutmy scholarship may not be combined with other\nscholarship (Eiffel scholarship, AEFE scholarship, BGF…), unless\notherwise decided by the jury.", "This scholarship is awarded based on ", "merit and according to the type of profile sought for this programme", ". Social criteria are also taken into account.", "This scholarship is not automatically awarded: candidates must\nindicate their wish to apply directly in their online bachelor or\nmaster’s application form. ", "Bachelor’s degree programme: Amount and length of the scholarship for the 2020-2021 Academic year", "Masters level: Amount and length of the scholarship for the 2020-2021 Academic year", "Candidates with a conditional offer of admission and candidates currently in deferral", "Deadlines", "Deadline for undergraduate programme: ", "To be confirmed", "Deadline for master programme: ", "December 15, 2019", "Students must indicate that they are applying for the Emile\nBoutmy scholarship in the “Financial information” section of their\nSciences Po application", ". ", "Please note that we might ask applicants to provide a proof of income and documents explaining their family situation", "\n(e.g. income tax return for both parents, payslips, divorce\ncertificate, unemployment benefits, documents related to alimony, child\nsupport or retirement pensions, death certificate…). Applicants must\nalso attach, if applicable, their", " language test", " before the application deadline of the scholarship.", "For More Information:", "Visit the Official Webpage of the Sciences Po Emile-Boutmy Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/sciences-po-emile-boutmy-undergraduate-postgraduate-scholarships-2020-2021/"], [["University of Glasgow African Excellence Fee Waiver Scholarships 2019/2020 for young Africans", "date announced:October 6, 2019", "Application Deadline: 01 April 2020.  "], ["Application Deadline: ", "01 April 2020. ", " ", "For September 2020 entry we are offering 8 scholarships worth the ", "full tuition fee", " of a one year Masters programme to academically excellent students from Africa. ", "Eligibility", "This scholarship is open to applicants from Africa applying to all on-campus Masters programmes. Applicants must:", "be resident in Africa at time of applying", "have completed a first degree in Africa", "hold a conditional or unconditional offer of a place for a full-time postgraduate taught programme", "demonstrate academic excellence and achieve grades equivalent to a degree equivalent to a UK 1st Class Hons ", "Value", "Full tuition fee waiver ", "Number of scholarships", "8", "How to apply", "To apply for this scholarship, please submit a 500 word personal statement to ", "[email protected]", " by ", "01 April 2020. ", "Your personal statement must include:", "your full name, applicant number and clearly state that you are\napplying for the University of Glasgow African Excellence Fee Waiver", "why you have selected the programme at the University of Glasgow", "why you merit the funded place (e.g academic/personal achievement)", "how you will benefit from it (e.g. employment prospects, financial relief, etc).", "Successful candidates will be advised of the outcome by ", "30 April 2020", ".", "Note: You need to hold a conditional or unconditional offer for an eligible programme to be considered fo this scholarship.", "For More Information:", "Visit the Official Webpage of the University of Glasgow African Excellence Fee Waiver Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-glasgow-african-excellence-fee-waiver-scholarships-2019-2020/"], [["Mawazo Institute PhD Scholars Programme 2020 for African female PhD Scholars.", "date announced:October 14, 2019", "Application Deadline: November 22nd 2019. "], ["Application Deadline: November 22nd 2019. ", " ", "The Mawazo PhD Scholars Programme", " ", "is a one-year, non-residential fellowship where PhD Scholars receive a research grant worth up to $5000 to support their research, a travel grant worth up to $2000 for conference travel, and a training grant worth up to $500 for ongoing training. Scholars also benefit from professional and leadership skills trainings provided by Mawazo and its partners, research and editorial support, as well as mentorship and networking opportunities. ", "This programme is designed to amplify our Scholars’ research and position them as the next generation of leading experts, thinkers, and innovators who are finding homegrown solutions to local development challenges. ", "ELIGIBILITY ", "In order to be eligible for the PhD Scholars Programme, applicants must: ", "be women below the age of 40 as at 1st January 2020", "be citizens of an African country", "be enrolled for their PhD at an accredited university in Kenya, Rwanda, Tanzania or Uganda ", "have completed their course work if applicable and passed their departmental proposal defence (i.e. in the dissertation phase of their PhD)", "demonstrate that their research project is related to African development and is relevant to a global, regional, national or sub-national policy priority", "demonstrate potential for leadership both within and outside academia, and a strong passion to leverage their expertise for impact in society", "be available to fully participate in the programme in 2020-2021", "BENEFITS", "Mawazo PhD Scholars will receive the following benefits:", "A ", "research grant", " of up to $5000 ", "A ", "travel grant", " worth up to $2000 for participation in regional or international conferences", "A ", "training grant", " worth up to $500 for field specific training not offered by Mawazo", "A ", "stipend", " worth $500 for discretionary use ", "Participation in Mawazo’s in-house ", "professional development and leadership training programme", ", comprised of a mix of in-person and virtual training modules ", "Research and editorial support", " from the Mawazo staff and our partners", "Connections to ", "mentors", ", as well as ", "exposure to leaders", " from academia, industry, government and other sectors", "Visibility", " via Mawazo digital platforms and events", "Application process", "Interested candidates are required to fill in and submit their applications via our online ", "application portal", ". Applications will not be accepted by email or in hard copy. Applications will be considered complete when the following are provided:", "A completed online application form", "A current 2-page CV ", "A letter confirming current enrollment in an accredited PhD programme", "A letter confirming that you have completed your course work (if applicable) and passed your departmental defense", "A recommendation letter from your PhD supervisor ", "A recommendation letter from a second referee ", "A completed budget and timeline for the project (", "Please download the template here", ")", "A completed budget narrative of 500 words or less ", "For instructions on how to use our online platform, complete your application and meet all the requirements required for consideration please", " download the application guidelines here. ", "SELECTION ", "All applications will be reviewed by the Mawazo Institute staff and a panel of external expert reviewers. Successful applicants will demonstrate that they can do the following:", "Meet all eligibility requirements ", "Identify a problem which has important implications for African development and is linked to a global, regional, national or sub-national policy priority", "Demonstrate that their research is academically rigorous and addresses a unique and important gap in the field ", "Propose a research project which has clear objectives, is appropriately designed for the question being asked, and can be feasibly executed with the financial resources available and within a one- to two-year timeline.  ", "Write a summary of their project which is clear, concrete, and accessible to scholars outside their own field", "The Mawazo Institute is committed to non-discrimination in the application review process", "For More Information:", "Visit the Official Webpage of the Mawazo PhD Scholars Programme 2020 "], "url : https://www.opportunitiesforafricans.com/mawazo-institute-phd-scholars-programme-2020/"], [["National Information Technology Development Agency (NITDA) 2019/2020 (Masters & PhD) Scholarship Scheme for Nigerians", "date announced:October 20, 2019", "Application Deadline: 21 November 2019. "], ["Application Deadline: 21 November 2019. ", " ", "The National Information Technology Development Agency (NITDA)", " ", "has as its mandate to develop and regulate the Information Technology in Nigeria. Developing and regulating IT will support in transforming Nigeria into an IT driven economy for global competitiveness and the dire need of digital literacy. ", " The Agency has since 2010 established a scholarship scheme for Masters and Doctoral degree in relevant areas of Information Technology (IT) and ICT Law obtainable in Nigerian (Government and Private) Universities. ", " Minimum requirements:", "PhD: ", "Only University and Polytechnic Lecturers with MSc in any Information Technology related field are eligible to apply for sponsorship. ", "MSc: ", "Holders of First Class or Second Class (Upper) Honours Bachelor’s degree, in Information Technology related field and Law. ", "Criteria", " The scholarship award is strictly based on merit and is evenly distributed between the six geo-political zones for the PhD, 36 States and FCT for MSc. ", "Duration", "The sponsorship for the Masters programme will run for one year and the Doctorate programme for three years. ", " Application Procedure:", "\nPlease select the appropriate scholarship you wish to apply.\n", "\nScholarship Title\n", "\nProgram Type\n", "\nClosing Date\n", "Start application", "\nPh.D for IT Courses\n", "\nPh D\n", "\n21-Nov-2019\n", "Start application", "\nMSc for IT Courses\n", "\nMasters\n", "\n21-Nov-2019\n", "Start application", "\nMSc for Law Courses\n", "\nL L M\n", "\n21-Nov-2019\n", " ", "For More Information:", "Visit the Official Webpage of the NITDA 2019/2020 (Masters & PhD) Scholarship"], "url : https://www.opportunitiesforafricans.com/nitda-2019-2020-masters-and-phd-scholarship/"], [["Yale Young Global Scholars Program 2020 for outstanding High School Students worldwide (Scholarships/Financial Aid Available)", "date announced:October 3, 2019", "Application Deadline:11:59pm ET on January 15, 2020"], ["Application Deadline:11:59pm ET on January 15, 2020", " Yale Young Global Scholars (YYGS)", " is an academic summer enrichment program for outstanding high school students from around the world. Each summer, students from over 125 countries participate in one of five interdisciplinary, 2-week sessions at Yale’s historic campus. Immerse yourself in a global learning community at Yale this summer. ", "SUMMER 2020 OFFERINGS:", "Session I", "June 21 – July 3", "Biological & Biomedical Science (BBS I)", "Literature, Philosophy, & Culture (LPC I)", "Politics Law & Economics (PLE I)", "Solving Global Challenges (SGC I)", "Session II", "July 5 – July 17", "Biological & Biomedical Science (BBS II)", "Literature, Philosophy, & Culture (LPC II)", "Politics Law & Economics (PLE II)", "Solving Global Challenges (SGC II)", "Session III", "July 19 – July 31", "Applied Science & Engineering (ASE III)", "Literature, Philosophy, & Culture (LPC III)", "Politics Law & Economics (PLE III)", "Solving Global Challenges (SGC III)", "Eligibility\n", "In order to apply to YYGS, applicants MUST fulfill all of the following requirements:", "Age", "Be at least 16 years old by July 19, 2020 (first day of Session III).*", "English Fluency", "Be able to participate in a rigorous academic curriculum conducted in English. ", "Grade Level", "Be a current high school sophomore or junior (or international equivalent).", "Graduation Date", "Be graduating in May/June 2021 or 2022 from the Northern Hemisphere, or in Nov./Dec. 2020 or 2021 from the Southern Hemisphere.", "YYGS Participation", "\nBe a first-time participant in YYGS. If you have participated in ", "any", " YYGS session during a previous summer (e.g., 2019, 2018), then you are ", "not", " eligible to participate during YYGS 2020.\nPlease note: If you previously applied to YYGS but were not offered\nadmission or were unable attend AND you meet the eligibility criteria\nnoted above, then you are encouraged to re-apply for YYGS 2020.", "How to Apply\n", "Get Started:", "Step 1", "Review the ", "YYGS eligibility criteria", ".", "Step 2", "Review the ", "YYGS application required components.", "Step 3", "Review a ", "PDF of a sample blank application", ", and start preparing to answer as many application questions as possible.", "Step 4", "You will need to submit contact information for\na parent/guardian, teacher, and/or official at your school. Reach out to\nthem as soon as possible to review the ", "PDF of a sample blank application", " with you, and be sure to collect the information you need.", "Complete the Application:", "Step 5", "Once our application opens by the end of September, then you will be able to click", " ", "APPLY NOW", "to start your YYGS application. Be sure to write down your email and password to access the application at a later time.", "Step 6", "Check the “Review” page of the application to\nsee if you are missing any required components, and re-visit any pages\nthat require further information.", "Step 7", "Once your application is complete, click on the\n“Review” page. Next click on the “Finalize & Pay” button at the\nbottom of the page. ", "Step 8", "\nPay the ", "$55 USD ", "Early Action Fee", " or", " $70 USD ", "Regular Decision Fee", ".\nIf you submitted a completed Fee Waiver Form on the application page,\nthis requirement will automatically be waived. YYGS staff will contact\nyou if your Fee Waiver Request is denied, and your application will ", "not", " be reviewed until the YYGS application fee is paid.\n", "Step 9", "Check your inbox for a YYGS confirmation receipt\nthat indicates the successful submission of your application.\nConfirmation emails usually arrive within 24-48 hours of submission, due\nto occasional delays payment processing.", "For More Information:", "Visit the Official Webpage of the Yale Young Global Scholars Program 2020"], "url : https://www.opportunitiesforafricans.com/yale-young-global-scholars-program-2020/"], [["Sciences Po Mastercard Foundation (Bachelor & Master) Scholars Program 2020/2021 for study in France (Fully Funded to France)", "date announced:October 14, 2019", "Application Deadline: January 29, 2020 "], ["Application Deadline: January 29, 2020 ", "The Mastercard Foundation Scholars Program at Sciences Po", " ", "aims to support ", "126 talented African students", " through their studies and to offer the next generation of leaders a world-class social science education, so they can go on to become ", "changemakers in their home countries", ".", "Over six years (2017 – 2022), the Scholars Program will fund:", "20 scholarships ", "to complete the ", "Sciences Po Bachelor of Arts programme", ", ", "Africa specialisation", "46 scholarships", " to complete a Master’s programme at one of our seven ", "graduate schools", "60 scholarships", " reserved for Mastercard Foundation Scholars studying at other partner universities and who would like to attend Sciences Po ", "Summer School", ".", "Requirements:", "The scholarships are awarded to students from sub-Saharan African countries with an ", "outstanding academic record", " and ", "strong leadership potential", ", but who face financial and other barriers to higher education.", "The scholarships are awarded for a period of three years for the Bachelor’s degree, two years for the Master’s degree and one month for the Summer School.", "Benefits", "The scholarships are awarded to students from sub-Saharan African countries with an ", "outstanding academic record", " and ", "strong leadership potential", ", but who face financial and other barriers to higher education.  ", "The scholarships are awarded for a period of three years for the\nBachelor’s degree, two years for the Master’s degree and one month for\nthe Summer School. They cover the full cost of tuition fees at Sciences\nPo and living costs in France during the study period.", "As well as funding their studies, Sciences Po will offer scholars a\nspecific suite of resources to ensure they have appropriate academic\nsupport and to facilitate their transition from education to employment:", "An orientation programme", " and ", "individualised academic advising", " throughout their studies at Sciences Po", "A mentor programme", " offered in collaboration with the ", "Africa Division of Sciences Po Alumni", "Career guidance and support", ": an online job platform dedicated to professional opportunities in Africa (internships and first jobs), access to our ", "business incubator", " and the network of employers and alumni working in Africa, and specific career workshops.", "How to Apply", "Scholarships for the 2020/2021 academic year are awarded in collaboration with a ", "network of partner institutions accepting the terms and conditions of the nomination framework", ".", "More information on the application and selection process and dates:", "Undergraduate Candidates", "Graduate Candidates", "Summer School Candidates", "2020-2021 Deadlines", "Application deadlines", " for the Mastercard Foundation Scholarships are: ", "Bachelor: January 29, 2020", "Master: December 5, 2019", "For More Information:", "Visit the Official Webpage of the Sciences Po Mastercard Foundation Scholars Program 2020/2021 "], "url : https://www.opportunitiesforafricans.com/sciences-po-mastercard-foundation-bachelor-master-scholars-program-2020-2021/"], [["U.S. Department of State’s U.S.-Middle East Partnership Initiative (MEPI) Tomorrow’s Leaders Undergraduate Scholarship Program 2020 for North Africans (Fully Funded)", "date announced:October 2, 2019", "Application Deadline: December 2, 2019.  "], ["Application Deadline: ", "December 2, 2019. ", " ", "Tomorrow’s Leaders (TL) ", "supports academically qualified, financially disadvantaged high school graduates in the Middle East and North Africa by providing a four-year academic matriculation, civic education, and leadership development through American accredited institutions in the region.", "The program covers university tuition and fees, a study abroad\nexperience in the U.S., insurance, housing, and monthly allowance. \nStudents requiring English preparatory work may be enrolled in one to\ntwo semesters of college preparatory English classes before entering\ndegree programs.", "In addition to receiving undergraduate education, students will benefit from mentoring, career development, internship, and micro-grant opportunities with local civil society, business, and non-governmental organizations and networks.  Facilitated by each host institution, students participate in initiatives throughout their ‎academic program that go beyond the traditional classroom to foster leadership development and encourage civic engagement.", "This program is open to high school graduates in the Middle East and\nNorth Africa, who are qualified but unable to afford a college\neducation.  Students enroll at the undergraduate level in a four-year\nprogram.  For the Fall 2020 enrollment class, applicants must be\ncitizens of ", "Algeria, Jordan, Lebanon, Morocco, Tunisia, Syria (only Syrians residing outside of Syria), and Yemen", ", and cannot hold U.S. citizenship or be a U.S. Legal Permanent Resident.", "Applicants must meet the following criteria:", "Current high school senior or applicant who graduated from high school in 2019;", "Strong academic credentials;", "Proficiency in written and spoken English with a minimum of 55 for the TOEFL iBT that is less than two years old;", "Students who qualify may be eligible for up to one year of intensive English Language training;", "Maturity, flexibility and leadership potential;", "Must maintain a high GPA and pass high school leaving exam in final year;", "Ability to start the program in August/September of 2020.", "Application Process", "Interested candidates can access the online application through Tomorrow’s Leaders website at ", "www.amideast.org/tl", ".", "Please note that Tomorrow’s Leaders application window for\nYemen will close on November 15, 2019 and for all other participant\ncountries, the application will close on December 2, 2019. ", "For More Information:", "Visit the Official Webpage of the MEPI Tomorrow’s Leaders Undergraduate Scholarship Program 2020"], "url : https://www.opportunitiesforafricans.com/mepi-tomorrows-leaders-undergraduate-scholarship-program-2020/"], [["Donald A. Wehrung International Student Award 2020/2021 for study at University of British Columbia, Canada", "date announced:October 2, 2019", "Application Deadline: December 1st 2019"], ["Application Deadline: ", "December 1", "st 2019", "This need-and-merit-based award recognizes outstanding international\nundergraduate students from impoverished or war-torn areas who have\nachieved academic excellence under difficult circumstances, and who\nwould be unable to attend university without financial assistance.", "The value of your ", "Donald A. Wehrung International Student Award", " is proportional to your demonstrated financial need and sufficient to cover living expenses and tuition costs for your degree of study.", "Your award may be renewed for up to three additional years of\nundergraduate study or to degree completion – whichever comes first –\nprovided you achieve satisfactory academic standing in your faculty,\ncontinue to demonstrate financial need, and maintain your Canadian study\npermit (student visa).", "Eligibility", "To be considered for the Donald A. Wehrung International Student Award:", "You must be an international student who will be studying in Canada on a Canadian study permit.", "You must be graduating or have recently graduated from a recognized senior secondary school.", "You must be applying for your first undergraduate degree.", "You must meet UBC’s ", "admission requirements", ", including general and degree-specific requirements and the English Language Admission Standard.", "You must demonstrate superior academic achievement (achieve all As or equivalent standard) and leadership potential.", "You must come from a war-torn, politically unstable, or economically disadvantaged region of the world.", "You must have achieved academic excellence under difficult\ncircumstances and have no financial means from family or other sources\nto pursue post-secondary education in your own country (because it is\nunavailable or unattainable) or outside your country (because it is\nunaffordable).", "Please note:", " If you are nominated for a Donald A.\nWehrung International Student Award, you will not be considered for\nmerit-based awards, including International Major Entrance Scholarships\nand Outstanding International Student Awards.", "Nominations", "Award nominations are now open for the 2020/21 winter session and are open until ", "December 1", ".", "Please fill out the form below to be considered for the award.", "2020 Donald Wehrung International Student Award Nomination Package", "\n1.1 MB PDF\nDownload and complete this form.\n", "Deadlines", "December 1: ", "Submit your award application and complete the ", "online application", "\nfor admission to UBC. Although you can specify two degree choices in\nyour application, only your first-choice degree will be considered for\nthe purposes of this award.", "January 31: ", "Meet UBC’s ", "English Language Admission Standard", ".", "For More Information:", "Visit the Official Webpage of the Donald A. Wehrung International Student Award 2020/2021"], "url : https://www.opportunitiesforafricans.com/donald-a-wehrung-international-student-award-2020-2021-for-study-at-university-of-british-columbia-canada/"], [["AfDB Japan Africa Dream Scholarship (JADS) Program 2020 for young Africans to study in Japan (Fully Funded)", "date announced:October 8, 2019", "Application Deadline:October 31, 2019​"], ["Application Deadline:", "October 31, 2019​", " ", "The Japan Africa Dream Scholarship (JADS) Program", " ", "is a capacity building project by the AfDB and Japan which was initiated in 2017 with the aim of providing two-year scholarship awards to highly achieving African graduate students to enable them to undergo post-graduate studies (i.e. a two-year Master’s degree program) in selected priority development areas on the continent and Japan. ", "The overarching goal the AfDB and the Government of Japan seek to attain is to enhance skills and human resources development in Africa in under the Bank’s High 5s agenda (i.e. “Feed Africa”, “Light up Africa”, “Industrialize Africa”, “Integrate Africa” and “Improve the quality of life of the people of Africa”) and key Japanese development assistance initiatives. JADS core areas of study focus include energy, agriculture, health, environmental sustainability, and engineering. The program also seeks to promote inter-university collaboration and university-industry partnerships between Japan and Africa. Upon completion of their studies, the JADS scholars are expected to return to their home countries to apply and disseminate their newly acquired knowledge and skills in the public and private sectors, and contribute to national and continental socio-economic development. ", "Requirements:", "Broadly speaking, nationals of African countries must:", "Be a national of a AfDB member country;", "Be in good health;", "Hold a Bachelor (or equivalent) degree in the energy area (or related field) earned at least 1 years prior to the application deadline date;", "Have 1 years or more of recent development-related experience after earning a Bachelor (or equivalent) degree;", "Be accepted unconditionally to enroll in the upcoming academic year in at least one of the JADS partner universities for a Master’s degree;", "Applicants living or working in a country other than his or her home country are not eligible for scholarships.", "JADS does not support applicants who are already enrolled in graduate degree programs.", "Not be an Executive Director, his/her alternate, and/or staff of all types of appointments of the African Development Bank Group or a close relative of the aforementioned by blood or adoption with the term “close relative” defined as: Mother, Father, Sister, Half-sister, Brother, Half-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew.", "Selection Criteria", "The JADS program uses the following four main factors and the degree\nof cohesion, to review eligible scholarship applications, with the aim\nof identifying the candidates with the highest potential, after\ncompletion of their graduate studies, to impact the development of their\ncountries.", "Quality of Education Background", "Quality of Professional Recommendations", "Quality of Professional Experience", "Quality of Commitment to your Home Country", "Quality of Statement of Purpose", "Scholarship Benefits:", "The JADS Scholarship provides the recipient with the following benefits:", "Economy class air travel between your home country and the host\nuniversity at the start of the study program and immediately following\nthe end of the scholarship period.", "Tuition for a graduate program and the cost of basic medical insurance usually obtained through the university.", "A monthly subsistence allowance to cover living expenses, including books.", "For scholars engaged in research, a special grant may be\navailable for research and thesis preparation. In special circumstances,\ncomputer literacy, preparatory language and other similar courses may\nbe covered under the scholarship. Please note all JADS scholarships\ncover the duration of the graduate program or two years, whichever is\nless.", "The JADS Scholarship does not cover:", "VISA application(s) costs", "Expenses to bring and/or support scholar’s family members;", "Extra-curricular courses or training;", "Language training not provided by the graduate program;", "Additional travel during the course of the study program;", "Expenses related to supplementary educational materials, field trips, participation in workshops/seminars, or internships; or", "Educational equipment such as computers.", "Application Procedure:", "1.  Applicant completes JADS ", "application form", "2.  Applicant sends documents (application form, university\ntranscripts and certificate, CV, professional references and research\nproposal), to the JADS Secretariat for first screening through ", "[email protected]", "3.  JADS Secretariat sends shortlist of candidates to selected Japanese universities", "4.  Universities does second screening and share selected students with JADS Secretariat", "5.  JADS Secretariat recommends awardees based on its selection criteria to the Japanese Executive Director for approval.", "6.  AfDB contacts selected awardees, and informs partner universities.", "For More Information:", "Visit the Official Webpage of the AfDB Japan Africa Dream Scholarship (JADS) Program"], "url : https://www.opportunitiesforafricans.com/afdb-japan-africa-dream-scholarship-jads-program-2020/"], [["Australia Africa Awards Masters Scholarships 2020 for Study in Australia (Fully Funded)", "date announced:October 7, 2019", "Application Deadline: 6 December 2019 "], ["Application Deadline: 6 December 2019 ", " Australia Awards", " are prestigious international scholarships offering the next generation of global leaders an opportunity to undertake study, research and professional development in Australia. Australia Awards Scholarships, funded by the Australian Government’s Department of Foreign Affairs and Trade, address the development needs of Australia’s partner countries, as well as strengthening links between people and organisations.", "Master’s level scholarships are offered to eligible outstanding professionals from civil society, private and public sectors, who on completion of their studies are expected to return to their home country to drive change and contribute to development. ", "The postgraduate study opportunity provided by", " Australia Awards Scholarships, ", "undertaken in Australia, provides high-quality education and training to talented Africans in specified sectors, in which Australia is recognised as having world-class expertise and experience.Priority sectors include:", "• agricultural productivity", "• extractives", "• public policy ", " Eligibility criteria", "For eligible mid-career professionals, who receive an Australia Awards Scholarship, the following benefits will generally apply: ", " • Your minimum academic qualification is at least a four year bachelor’s degree or equivalent (as indicated in the relevant country’s requirements)", "• You are a mid-career professional, currently employed in a relevant field and sector ", "Visit https://www.australiaawardsafrica.org/awards/apply/ ", "to review country-specific sectors", "• You meet relevant postgraduate work experience requirements (as indicated in the relevant country’s eligibility criteria)", "• You can demonstrate a clear vision of how the knowledge and skills that you will gain will be used to drive policy reform and improve practice in your home country", "• Your English proficiency is sufficient to enable full participation in a training course delivered in English. (Applicants from Madagascar and Mozambique may be supported to reach a satisfactory English proficiency level)", "• You meet all the requirements of the Australian Government for the appropriate student visa (subclass 500)", "Benefits:", " For eligible mid-career professionals, who receive an Australia Awards Scholarship, the following benefits will generally apply:", " • Australian educational experience", "• Fully paid tuition fees ", "• Fully paid economy class flight to and from Australia ", "• Fully paid visa expenses ", "• Overseas Student Health Cover, for basic medical costs", "• A contribution to living expenses", "• Adjustment support for women and people with disabilities, if required", "• Supplementary academic support if required, to improve a student’s performance ", "• The opportunity to develop and maintain global links with Australians and other international students", "• The opportunity to join a prestigious alumni network after the scholarship ", "For more information on the Australia Awards Scholarships, please see the links below:", "Apply now", "Application and selection process", "Interview preparation", "Pre-departure support", "On-Award support", "Plan your reintegration", "Australia Awards Scholarships – 2021 intake brochure", "For More Information:", "Visit the Official Webpage of the Australia Africa Awards Masters Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/australia-africa-awards-masters-scholarships-2020-2021/"], [["Government of Turkey 2019/2020 Success and Support Scholarships for study in Turkey.", "date announced:October 17, 2019", "Application Deadline: October 31st 2019"], ["Application Deadline: October 31st 2019", "Success Scholarship and Support Scholarship", " is for a limited number of international students who are currently registered in Turkish universities and who meet the eligibility criteria stated below.", " A specific number of international students will be granted Success Scholarships provided that they receive education in Turkey and meet the necessary requirements.  ", "\nApplicants eligible to Success Scholarship will receive the following monthly payments: ", "\n■ ₺ 450 for undergraduate students,", "\n■ ₺ 600 for graduate students,", "\n■ ₺ 900 for PhD students.", "Application Criteria", "\n■ Students must have a foreign citizenship. In case students hold dual\ncitizenship, one of their nationality being the Republic of Turkey, they\ncannot apply to the Success Scholarship Program (Exchange students are\nnot eligible). ", "\n■ Students must complete at least one academic year (2 semesters) in\nundergraduate, graduate or PhD degrees in Turkey (including scientific\npreparation classes), and undergraduate students must have at least 3.00\n(out of 4) GPA (Grade Point Average), while PhD students must score at\nleast 3.5 (out of 4) in order to be eligible.", "\n■ Undergraduate students in Medicine, Dentistry and Pharmacy as an\nexception must have at least 2.50 (out of 4) GPA in order to be\neligible.", "\n■ Students who will apply to the Success Scholarship Program must not be\npreviously granted or currently benefitting from any other scholarship\ngranted as per Turkey Scholarships (including State, Government\nScholarships, and cancelled scholarships). ", "\n■ Also, students must not be currently benefitting from a scholarship granted by any institution or organization.", "Documents Required for Application ", "\n■ Student Certificate with signature and seal received from registrar’s office after October 1, 2019 (Mandatory)", "\n■ Transcript with signature and seal received from registrar’s office after October 1, 2019 (Mandatory)", "\n■ Copy of a valid ID or Passport (Mandatory)", "\nYou can send your questions and suggestions to ", "[email protected]", "lari.gov.tr", "\nWish you success. \n", "For More Information:", "Visit the Official Webpage of the Government of Turkey 2019/2020 Success and Support Scholarships "], "url : https://www.opportunitiesforafricans.com/government-of-turkey-2019-2020-success-and-support-scholarships-for-study-in-turkey/"], [["Danish Government Long-Term Scholarships 2020/2021 for Master’s & PhD Study in Denmark.", "date announced:October 8, 2019", "Application Deadline: March 2, 2020 at 23:59 (CET) "], ["Application Deadline: ", "March 2, 2020 at 23:59 (CET)", " ", " The Danish Government Scholarships", " under the Cultural Agreements are aimed at highly qualified exchange students wishing to immerse themselves in studies of the Danish language and culture or other fields of study related to Denmark. ", "Long-term scholarships of 5-12 months are offered to exchange\nstudents from higher education institutions in the following countries:", "Brazil", "China", "Egypt", "Japan", "Republic of Korea", "Russia", "Please note that scholarships are only offered for exchanges (not\nfull-degree studies), and only to students enrolled in full-degree\nstudies at higher education institutions in the countries listed above.\nApplications from candidates affiliated with higher education\ninstitutions in countries other than those listed will not be taken into\nconsideration.", "Scholarships are only available to master’s and PhD level students.\nHowever, bachelor’s degree students wishing to study Danish language and\nliterature can also apply if they have studied the Danish language for\ntwo years.", "PhD students must likewise be employed at, or affiliated with, higher education institutions in the above-mentioned countries.", "Please note that applicants at the time of application must be\nenrolled in, or able to document a future enrollment in, full-degree\nprogrammes in the countries mentioned above. ", "Danish institutions offering long-term scholarships", "It is only possible to apply for a scholarship for studies at higher education instutions who offer long-term scholarships. ", "cholarship period", "Scholarships are tenable during the academic year. The autumn term begins on September 1st, the spring term on February 1st.", "With respect to residence permits and/or visa, we recommend that\naccepted applicants contact the Danish diplomatic representation in\ntheir home country well in advance of their entry into Denmark.", "Scholarship amount", "Scholarships include free tuition and a monthly stipend of DKK 6,500.", "Danish Government Scholarships can be used as a contribution to cover\ntravel, visa fees, accommodation, food, and other living expenses. The\nscholarships are for one person only. Additional amounts for\naccompanying family members are not available.", "Please note that living expenses in Denmark are generally high, and\nthat housing, especially in the larger cities, is often very\nexpensive. The scholarship will not most likely not cover all expenses.", "For More Information:", "Visit the Official Webpage of the Danish Government Long-Term Scholarships "], "url : https://www.opportunitiesforafricans.com/danish-government-long-term-scholarships-2020-2021/"], [["Louis Dreyfus-Weidenfeld and Hoffmann Scholarships and Leadership Programme 2020 for Study in UK (Fully Funded)", "date announced:September 30, 2019", "Application Deadline: January 10th 2020"], ["Application Deadline: January 10th 2020", " ", "The Weidenfeld-Hoffmann Scholarships and Leadership Programme", " cultivates the leaders of tomorrow by providing outstanding university graduates and professionals from developing and emerging economies with the opportunity to pursue fully-funded graduate studies at the University of Oxford, combined with a comprehensive programme of leadership development, long-term mentoring and networking. ", "The Leadership Programme is a unique part of these scholarships, and more information on this can be found on the ", "Weidenfeld-Hoffmann Trust website", ". ", "The scholarship will cover 100% of course fees and a grant for living costs (of at least £15,009). Awards are made for the full duration of your fee liability for the agreed course.", "Eligible courses ", "BCL Bachelor of Civil Law", "MBA Master of Business Administration", "MJur Magister Juris", "MPP Master of Public Administration and Policy", "MSc African Studies", "MSc Biodiversity, Conservation and Management", "MSc Comparative Social Policy", "Msc Computer Science", "MSc Contemporary Chinese Studies", "MSt Diplomatic Studies", "MSc Economics for Development", "MSc Education (Comparative and International Education)", "MSc Education (Higher Education)", "MSc Environmental Change and Management", "MSc Evidence-Based Social Intervention and Policy Evaluation", "MSc Financial Economics", "MSc Global Governance and Diplomacy", "MSc Global Health Science", "MSc International Health and Tropical Medicine", "MSt Islamic Studies and History", "MSt Jewish Studies", "MSt Korean Studies", "MSc Latin American Studies", "MSc Law and Finance", "MSc Mathematical Modelling and Scientific Computing", "MSc Migration Studies", "MSc Modern Middle Eastern Studies", "MSc Modern South Asian Studies", "MSc Nature, Society and Environmental Governance", "MSc Refugee and Forced Migration Studies", "MSc Social Science of the Internet", "MSc Water Science, Policy and Management", "You should be intending to return to your country of ordinary\nresidence once your course is completed. Students currently at Oxford\nare not eligible to apply unless they are already Weidenfeld-Hoffmann\nscholars. ", "You should be able to demonstrate a connection between\nyour subject of study and your longer-term career objectives, explaining\nhow you see your professional work contributing to the improvement of\npublic life in your country of origin or at a wider regional or\ninternational level. ", "The above qualities will be assessed during\nthe selection process, including using your graduate application form,\nyour Weidenfeld-Hoffmann Scholarships Questionnaire and (if relevant)\nyour interview.", "This scholarship is not open to applications from candidates who hold ", "deferred offers", " to start in 2020-21.", "How to Apply:", "In order to be considered for this scholarship, you must select the ", "Weidenfeld-Hoffmann Scholarships and Leadership Programme", " in\nthe University of Oxford Scholarships section of the University’s\ngraduate application form and submit your application for graduate study\nby the relevant January deadline for your course. See the relevant ", "course page", " for the deadline applicable to your course.  ", "You must also complete a ", "Weidenfeld-Hoffmann Scholarships Statement", " and upload it, together with your graduate application form, by the deadline.", "We\nwill use the details you insert in the ‘Nationality and ordinary\nresidence’ section of the graduate application form to assess your\ncountry of ordinary residence. For a definition of ordinary residency\nand further details on how to complete this section of the graduate\napplication form, please see the Nationality and Ordinary residence\nsections of the graduate application form and the advice contained with\nthe ", "Application Guide", ".", "To\nbe eligible for consideration for this scholarship, applicants must be\nsuccessful in being offered a place on their course after consideration\nof applications received by the relevant January deadline for the\ncourse. Course applications which are held over after the January\ndeadline to be re-evaluated against applications received by the March\ndeadline or course applications which have been put on a waiting list\nare not eligible for scholarship consideration.", "If you are\nshortlisted for the scholarship, you will be required to participate in\nan interview, which is likely to be held via Skype in April/May 2020.", "For More Information:", "Visit the Official Webpage of the Louis Dreyfus-Weidenfeld and Hoffmann Scholarships and Leadership Programme 2019/2020 "], "url : https://www.opportunitiesforafricans.com/louis-dreyfus-weidenfeld-and-hoffmann-scholarships-and-leadership-programme-2020/"], [["ARES Belgian Government Masters and Training Scholarships 2020/2021 for study in Belgium", "date announced:October 2, 2019", "Application Deadline: 7 February 2020. "], ["Application Deadline: ", "7 February 2020", ". ", "Are you a national of a developing country? Do you already hold a master’s degree?", "Do you have professional experience and are you looking to further develop your skills in a development-related topic?", "Scholarships for masters and training courses offer you the chance to\npursue a one-year specialised master’s degree programme or a\n4-to-6-month advanced training course within a higher education\ninstitution of the Wallonia-Brussels Federation, Belgium.", "Each year, ", "ARES grants", " ", "an average of 150 scholarships as part of the master’s program, and 70 grants for training courses, to citizens from countries in the global South.", "Are you interested in obtaining more information about the training\ncourses available? Have a look at the list of master’s programs and\ntraining courses financed by ARES.", "01/ Specialized master’s programs for 2020-2021", "Master de spécialisation en développement, environnement et sociétés", "Master de spécialisation en droits de l’homme", "Master de spécialisation en gestion des ressources aquatiques et aquaculture", "Master de spécialisation en gestion des risques et des catastrophes", "Specialized Master in Integrated Management of Health Risks in the Global South (IManHR)", "Specialized Master in International and development Economics", "Master de spécialisation en médecine transfusionnelle", "Specialized Master in Microfinance", "Master de spécialisation en production intégrée et préservation des ressources naturelles en milieu urbain et péri-urbain", "Specialized Master in Public Health Methodology", "Master de spécialisation en sciences de la santé publique – méthodes de recherche appliquées à la santé globale", "Master de spécialisation en sciences et gestion de l’environnement dans les pays en développement", "Master de spécialisation en transport et logistique", "01/ Specialized master’s programs for 2020-2021", "Master de spécialisation en développement, environnement et sociétés", "Master de spécialisation en droits de l’homme", "Master de spécialisation en gestion des ressources aquatiques et aquaculture", "Master de spécialisation en gestion des risques et des catastrophes", "Specialized Master in Integrated Management of Health Risks in the Global South (IManHR)", "Specialized Master in International and development Economics", "Master de spécialisation en médecine transfusionnelle", "Specialized Master in Microfinance", "Master de spécialisation en production intégrée et préservation des ressources naturelles en milieu urbain et péri-urbain", "Specialized Master in Public Health Methodology", "Master de spécialisation en sciences de la santé publique – méthodes de recherche appliquées à la santé globale", "Master de spécialisation en sciences et gestion de l’environnement dans les pays en développement", "Master de spécialisation en transport et logistique", "02/ Training courses for 2020", "Stage en contrôle et assurance qualité des médicaments et produits de santé", "Stage d’initiation à la recherche pour le renforcement des systèmes de santé", "Stage en système d’information géographique", "Stage en valorisation des ressources secondaires pour une construction durable", "Stage méthodologique en appui à l’innovation en agriculture familiale", "Each year, ARES grants an average of 150 scholarships as part of the\nmaster’s program, and 70 grants for training courses, to citizens from\ncountries in the global South.", "01/ Amounts for a master’s scholarship", "\nInternational travel costs\n", "\nReceipts must be provided\n", "\nEconomy-class travel on an IATA-approved airline, with a maximum of one round-trip ticket per academic year.\n", "\nLiving allowance\n", "\nFlat rate\n", "1150 €/month ", "for a duration of 12 months.\n", "\nIndirect mission fees\n", "\nFlat rate\n", "150 €.", " This amount is given once per stay, upon arrival of the grantee.\n", "\nArrival allowance, tuition and return fees\n", "\nFlat rate\n", "700 €.", " This amount is given once per stay, upon arrival of the grantee.\n", "\nRegistration fees\n", "\n \n", "\nAt the current rate for DGD grantees.\n", "\nInsurance fees\n", "\n \n", "\nDirectly paid by ARES.\n", "\nTravel costs that are part of inter-university training\n", "\nReceipts must be provided\n", "\nReimbursed based on real costs incurred, with receipts provided.", " Application form", "Vous consultez actuellement cette page en anglais. Pour consulter la version en français, ", "cliquez ici", " ou sur le lien “FR” du sélecteur de langue en haut de page.", "Applying for an ARES grant is totally free. ARES does not charge fees\nat any stage of the application nor selection process. You may inform\nus via e-mail at ", "[email protected]", " of any problems with individuals or companies who claim to represent ARES and request any payment.", "Any application form containing payment will systematically be rejected.", "Are you interested in receiving a study grant? ", "The call for applications for the academic year 2020-2021 is now open!", "Download", " the 2020-2021 form in English (15 pages – 258 KB) (for specialized master’s degrees in English).", "For More Information:", "Visit the Official Webpage of the ARES Belgian Government Masters and Training Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/ares-belgian-government-masters-and-training-scholarships-2020-2021/"], [["University of Edinburgh Mastercard Foundation Scholars Program 2020/2021 for study in Scotland (Fully Funded)", "date announced:October 2, 2019", "Application Deadline: November 29th 2019"], ["Application Deadline: November 29th 2019", "In partnership with the ", "Mastercard Foundation, the University of Edinburgh", " will provide 200 full scholarships to students from Africa with great academic and leadership potential but few educational opportunities.", "On top of the scholarship, the Scholars Program facilitates transformative leadership programming to inspire and support Scholars in making change  in their communities and countries on their return home.", "Benefits:", "The University of Edinburgh", " offers a fully funded academic and transformative leadership program for undergraduate and postgraduate students from Sub-Saharan Africa.", "Students will receive comprehensive support to remove barriers to study in Edinburgh and will benefit from extracurricular opportunities including summer schools and internships.", "The program aims to build the abilities and talents of each student so they can make a difference to their home countries and communities on their return.", "Postgraduate ", "The Scholars Program at the University of Edinburgh will provide postgraduate scholarships to students from Africa with great academic and leadership potential but few educational opportunities.", "On Campus", "Find out more about applying to study as a Mastercard Scholar in Edinburgh.", "The Scholars Program at the\nUniversity of Edinburgh will provide postgraduate online scholarships to\nstudents from Africa with great academic and leadership potential but\nfew educational opportunities.", "10 scholarships are available for the 2020/2021 academic year, which\nwill cover the full tuition fees and expenses for accommodation and\nmaintenance.", "On top of financial support, Scholars will participate in activities\nas part of the wider Scholars Program at the University of Edinburgh\nincluding work-based placements, mentorship, and other activities during\nthe academic year.", "Scholarships are available for the following postgraduate programs:", "MSc Africa and International Development", "MSc Environment and Development", "MSc Global Health Policy", "LLM Human Rights", "MA Design for Change", "MSc Sustainable Energy Systems", "MSc Carbon Finance", "MSc Entrepreneurship and Innovation", "Eligibility criteria", "Applicants must want to apply for one of our eligible courses listed above", "Applicants must qualify academically for admission to the degree of their choice", "Applicants must be a resident and citizen of a Sub-Saharan African country", "Applicants should not have completed a postgraduate degree previously", "Applicants must demonstrate a track record of leadership and service within their community, and;", "Applicants are able to present economic circumstances which show\nthey lack financial means to pursue higher education in their home\ncountry or elsewhere", "Application to the scholarship and the University of Edinburgh ", "If the Mastercard Foundation Scholars Program is the only scholarship\nyou are interested in applying for at the University of Edinburgh,\nplease apply for the Scholarship only", "If you are also applying for other scholarships in the University of\nEdinburgh, please apply directly for the degree programme of your\nchoice.", "More information on how to apply can be found on each individual degree programme web page in the University Degree Finder.", "Online Distance Learning", "If you are a graduate, or are soon to graduate, as a\nMastercard Foundation Scholar from a Mastercard Foundation partner\ninstitution, find out more about applying to study a postgraduate\nqualification online.", "The Scholars Program at the University of Edinburgh will provide\npostgraduate online scholarships to students from Africa with great\nacademic and leadership potential but few educational opportunities.", "The scholarship will cover the full tuition fees and, if required, a\nsmall study stipend to allow for access to high-quality internet. The\nscholarship is deigned to cover three-years of part-time study.", "On top of financial support, Scholars will\nparticipate in activities as part of the wider Scholars Program with the\nUniversity of Edinburgh, including regular WhatsApp workshops with our scholars, online reflection coaching, and the opportunity to attend regional scholar-led workshops and events.", "Scholarships are available for the following postgraduate programs:", "MSc International Development (online)", "MSc Global Health Policy (online)", "MSc Global Food Security and Nutrition (online)", "MSc Carbon Management (online)", "MSc Social Justice and Community Action (online)", "MSc Data Science, Technology and Innovation (online)", "MSc Digital Education (online)", "2020/21 applications", "Applications for 2020 entry to the Mastercard Foundation Scholars\nProgram at the University of Edinburgh will open in early 2020.", "Eligibility criteria", "Applicants must be a graduate or be soon to graduate as\na Mastercard Foundation Scholar in a Mastercard Foundation partner\ninstitution", "Applicants must want to apply for one of our eligible courses listed above", "Applicants must qualify academically for admission to the degree of their choice", "Applicants must usually be resident and a citizen of a Sub-Saharan African country", "Applicants should not have completed a postgraduate degree previously", "Applicants must demonstrate a track record of leadership and service within their community, and;", "Applicants are able to present\neconomic circumstances which show they lack financial means to pursue\nhigher education in their home country or elsewhere", "Application to the scholarship and the University of Edinburgh ", "If the Mastercard Foundation Scholars\nProgram is the only scholarship you are interested in applying for at\nthe University of Edinburgh, please apply for the Scholarship only.", "Application timeline", "Application timeline with key dates for 2020/21 entry.", "2019", "October 1", "Applications open at 12.00pm GMT", "November 29", "Applications Close at 2.00pm GMT", "December 2019 – February 2020", "Review of applications ", "2020", "February – March", "Scholars Program interview period", "March 30", "Deadline for references to be submitted", "April 15", "Scholars Program interview results announced", "May – August", "Support provided through admission and immigration processes", "September", "Scholars arrive in Edinburgh", "For More Information:", "Visit the Official Webpage of the University of Edinburgh Mastercard Foundation Scholars Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/university-of-edinburgh-mastercard-foundation-undergraduate-postgraduate-scholars-program-2020-2021/"], [["US-MEPI Student Leaders Program 2020 for undergraduate & graduate Students from the Middle East and North Africa (Fully Funded to USA)", "date announced:October 2, 2019", "Application Deadline: December 3, 2019. "], ["Application Deadline: ", "December 3, 2019", ". ", "The US-MEPI Student Leaders program", " offers outstanding undergraduates from across the MENA region an intensive leadership training course of approximately 5 weeks in the United States from June 24 – July 29, 2020. The program emphasizes lessons in participatory governance and the application of leadership skills.", "The Student Leaders program", " is a rigorous leadership program for up to 60", " undergraduate and graduate students from the Middle East and North Africa. Students are divided among U.S. academic institutions where they develop leadership skills and expand their understanding of civil society and participatory governance and how both may be applied in their home communities. ", "Participants have the opportunity to meet their American peers, engage in local community service activities, and observe and take part in the governmental process on the local, state, and federal levels. The program includes academic coursework, as well as study tours to various regions of the United States.", "Upon completion of the U.S.-based program, participants are mentored by the program implementer to leverage their experiences through sponsored alumni activities designed to effect positive social change in their home countries approximately 6 months after the U.S. portion of the program. A competitive follow-on accelerator workshop may be held in the region upon completion of the U.S.-based program.", "Eligibility Requirements", "Students from the following countries are eligible to apply: Algeria,\nIsrael, Jordan, Lebanon, Libya, Morocco, Kuwait, Iraq, Bahrain, Qatar,\nand Tunisia.", "This program is open to university students between the ages of 20\nand 24 (birth dates falling between July 29, 1996 and June 30, 2000). We\nseek a gender-balanced pool of candidates and give preference to\ntraditionally under-served participants. While nominees may be\nundergraduate or graduate students in any field of academic\nspecialization, it is critical that they exhibit a serious interest in\npursuing leadership opportunities in their home countries and\ndemonstrate a desire to deepen their civic engagement.", "Preference will be given to applicants who have not previously traveled to the United States. Applicants should demonstrate sufficient English-language skills to participate in U.S. university-level classes and must be enrolled in and attending a university in their home countries. At the time of application and while participating in the program, participants cannot hold U.S. citizenship or be a U.S. Legal Permanent Resident.", "How to Apply:", "\nParticipants apply for the program online at  ", "https://studentleaders.fluidreview.com", " and are then interviewed and nominated by Embassies.", "\nExpenses for the program are fully paid by the U.S. Department of State.\n", "For More Information:", "Visit the Official Webpage of the US-MEPI Student Leaders Program 2020"], "url : https://www.opportunitiesforafricans.com/us-mepi-student-leaders-program-2020/"]]