[[["Japanese Government (Monbukagakusho) MEXT Scholarships 2020 for Study in Japan (Fully Funded)", "date announced:April 24, 2019", "Application Deadline: Varying by Country"], ["Application Deadline: Varying by Country", "The Ministry of Education, Culture, Sports, Science and Technology (MEXT)", " offers scholarships to international students who wish to study at Japanese universities as undergraduate students under the ", "J", "apanese Government (MEXT) Scholarship Program for 2020", " as follows. ", "Types of Japanese Government (Monbukagakusho) Scholarships", "There are six types of ", "Japanese Government (Monbukagakusho) Scholarships.", " Each type has its own eligibility requirements, so please apply for the type that best fits your personal criteria.", "Research students", "You must be under 35 years of age and a college graduate (includes prospective graduates). Or you must have completed 16 years of schooling.", "Teacher training students", "You must be under 35 years of age and a graduate of a college or teacher training college. You must have at least five years of active experience as a teacher in a primary, secondary or teacher training college in your country. (Please note that college and university teachers currently in active service are not considered for this scholarship).", "Undergraduate university students", "You must be at least 17 and under 22 years of age and have completed 12 years of school education or have completed courses in a school comparable to a high school (includes prospective graduates).", "Japanese studies students", "Applicants must be from 18 to 30 years old. Applicants must be enrolled as undergraduate students in faculties or schools which major in Japanese language or Japanese culture in a university outside Japan at the time when they come to Japan and must be enrolled in the home institution at the time when they return to their home countries.", "College of technology students", "You must be at least 17 and under 22 years of age and have completed school education comparable to a high school (a minimum of 11 years beginning in primary school) education (includes prospective graduates).", "Special training college students", "You must be at least 17 and under 22 years of age and have completed 12 years of schooling or have completed school education comparable to a Japanese high school (includes prospective graduates).", "Requirements:", "Eligibility Requirements:", "Research student", "Teacher training student", "Undergraduate student", "Japanese studies student", "College of technology student", "Special training college student", "Level of studies", "Graduate school level", "Undergraduate level", "Eligibility requirement", "University or college graduate", "University, college graduate or equivalent", "Secondary school graduate or equivalent", "University student (undergraduate level)", "Graduates of secondary schools or equivalent", "Age limit (at time of granting)", "Under 35", "At least 17 and under 22", "At least 18 and under 30", "At least 17 and under 22", "Duration", "Maximum 2 years including Japanese-language training", "Maximum 1 year 6 months including Japanese-language training", "5 years including Japanese-language training (7 years for medicine, dentistry, pharmacy and veterinary science)", "One academic year", "4 years including Japanese-language training(4 and a half years for merchant marines studies)", "3 years including Japanese-language training", "Preliminary Japanese-language training", "6 months (54 universities such as Hokkaido University)", "Those with sufficient Japanese proficiency are not required to go through preliminary Japanese- language training.", "1 year", "(Tokyo University of Foreign Studies and Osaka University)", "None", "1 year", "(Independent Administrative Institution: Japan Student Services Organization, Tokyo Japanese Lanugage Education Center)", "1 year", "(Bunka Institute of Language, Independent Administrative Institution: Japan Student Services Organization, Osaka Japanese Lanugage Education Center)", "Fields of study", "Major in field of specialty at a graduate school", "Special training at a teacher training department", "Undergraduate education", "Japanese language or special training related to Japan", "Third year college of technology courses", "Post secondary courses", "Designated countries", "Worldwide (168 countries and regions)", "Developing countries, etc. (64 countries and regions)", "Worldwide (100 countries and regions)", "Worldwide (74 countries and regions)", "Developing countries (40 countries and regions)", "Developing countries, etc. (49 countries and regions)", "Planned number of new scholarship recipients", "4,042 people", "89 people", "460 people", "190 people", "86 people", "90 people", "Scholarship stipend", "¥143,000～148,000 per month", "¥117,000～120,000 per month", "Tuition", "Tuition for national universities and Institute of National College of Technology waived; tuition for public and private universities paid for by the Ministry of Education, Culture, Sports, Science and Technology", "Travel allowance", "Roundtrip fare (air ticket) provided", "Embassy recommendation", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "University recommendation (overseas application)", "Yes", "No", "No", "Yes", "No", "No", "University recommendation (local acceptance)", "Yes", "No", "Yes (For the final only)", "No", "No", "No", " Eligibility", "i) Applicants must have the nationality of a country that has diplomatic relations with Japan. An applicant who has Japanese nationality at the time of application is not eligible. However, persons with dual nationality who hold Japanese nationality and whose place of residence at the time of application is outside of Japan are eligible to apply as long as they choose the nationality of the foreign country and give up their Japanese nationality by the date of their arrival in Japan. Applicant screening will be conducted at the Japanese diplomatic mission in the country of applicant’s nationality.", "ii) Applicants must be willing to learn Japanese. Applicants must be interested in Japan and be willing to deepen their understanding of Japan after arriving in Japan. In addition, in principle, applicants must be willing to carry out their academic studies in Japan in Japanese.", "iii) Applicants must be free from any mental or physical disabilities that would impede the pursuit of study at Japanese universities.", "iv) Military personnel or military civilian employees at the time of arriving in Japan are ", "not", " eligible.", "v) Availability on arriving in Japan by April/ October 2019", "vi) ", "Applicants generally must have been born on or after April 2, 1984", "vii) Undergraduate Degree holders from universities and/or colleges with a total mark of ", "GPA3.2/ Second Class Upper Division or higher", ". Applicants for this program must submit a complete research proposal at the time of applying\n \nSCHOLARSHIP BENEFITS\n", "Allowance: 117,000 yen per month. The scholarship is cancelled in principle if the recipient is absent from the university or preparatory Japanese-teaching institution for an extended period. In case that the recipient research in a designated region, 2,000 or 3,000 yen per month will be added. The monetary amount each year may be subject to change due to budgetary reasons.", "The scholarship will be also cancelled in principle in the following situations. If the recipient has been receiving the scholarship despite his/her falling under any of the following situations, the recipient will be ordered to return the amount of scholarship that he/she received during the period wherein he/she was involved with any of the following situations", "The recipient is determined to have made a false statement on his/her application", "The recipient violates any article of his/her pledge to MEXT;", "The recipient violates any Japanese laws and is sentenced to imprisonment with or without work for life or for a period of exceeding 1 year;", "The recipient is subject to disciplinary action by the university, including expulsion (The scholarship payment may be stopped during the period up until punishment is decided by the university, etc.)", "It has been determined that it will be impossible for the recipient to complete the course within the standard course period because of poor academic grades or suspension or leave of absence;", "The recipient’s residence status has changed to one other than “College Student”;", "The recipient has received a scholarship from another institution (excluding those specified for research expenditures)", "The recipient has proceeded to a higher level of education without receiving approval for an extension of the period of the scholarship", "\nTuition and Other Fees: Fees for the entrance examination, matriculation, and tuition at universities will be paid by MEXT.\n \nTraveling Costs\n \nTransportation to Japan: In principle, MEXT stipulates the travel schedule and route, and provides an economy-class airline ticket for the flight from the international airport closest to\nthe recipient’s residence (in principle, the country of nationality) to Narita International\nAirport or to any other international airport on the normal route to the accepting university.\n \nApplication Process:\n", "Japanese Government Scholarship students are recruited and selected in three ways:", "For those outside of Japan", "Embassy Recommendation", "University recommendation", "Research Students ", "* Minimum of a Bachelor’s degree required.", "Documents for Application", "Undergraduate Students ", "Documents for Application", "Specialized Training College Students ", "Documents for Application", "For More Information:", "Visit the Official Webpage of the Japanese Government (Monbukagakusho) MEXT Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/japanese-government-monbukagakusho-mext-scholarships-2019-2020/"], [["Google Africa Certifications Scholarships 2019 (Fully Funded to learn Mobile Web, Android and Google Cloud)", "date announced:April 15, 2019", "Application Deadline: Ongoing"], ["Application Deadline: Ongoing", "Google is partnering with Pluralsight to give you free access to Pluralsight course content plus support from the Andela Learning Community across three skills development tracks: ", "Mobile Web, Android and Google Cloud.", "After completing your desired skills development track, you will be eligible to receive a Google certification grant to take Google’s ", "Associate Android Developer, Mobile Web Specialist and Associate Cloud Engineer certification exams.", " Building upon our pledge to provide mobile developer training to 100,000 Africans to develop world class apps, today we are pleased to announce the next round of Google Africa Certification Scholarships aimed at helping developers become certified on Google’s Android, Web, and Cloud technologies. ", "\nThis year, we are offering 30,000 additional scholarship opportunities and 1,000 grants for the Google ", "Associate Android Developer", ", ", "Mobile Web Specialist", ", and ", "Associate Cloud Engineer", " certifications. The scholarship program will be delivered by our partners, ", "Pluralsight", " and ", "Andela", ",\nthrough an intensive learning curriculum designed to prepare motivated\nlearners for entry-level and intermediate roles as software developers.\nInterested students in Africa can learn more about the Google Africa\nCertifications Scholarships and apply", " here", " According to World Bank, Africa is on track to have the largest working-age population (1.1 billion) by 2034. Today’s announcement marks a transition from inspiring new developers to preparing them for the jobs of tomorrow. Google’s developer certifications are performance-based. They are developed around a job-task analysis which test learners for skills that employers expect developers to have. ", "Access to ", "expert-led videos", ", available on-demand with our mobile app and offline capabilities", "Guided skill development", " with curated paths and channels according to your chosen track", "Skill assessments", " that help you identify knowledge gaps and strengths, and allow you to share your proficiency on Facebook, Twitter and Stack Overflow", "Support", " from the Pluralsight Help Center and the ", "Andela Learning Community", " to help you complete your track and prepare for your chosen Google certification exam", "For More Information:", "Visit the Official Webpage of the Google Africa Certifications Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/google-africa-certifications-scholarships-2019/"], [["University of Pretoria MasterCard Foundation Undergraduate & Postgraduate Scholars Program (MCFSP) 2019/2020 for study in South Africa (Fully Funded)", "date announced:April 29, 2019", "Application Deadline: 17 September 2019. "], ["Application Deadline: ", "17 September 2019", ". ", "The University of Pretoria (UP)", " in partnership with the ", "Mastercard Foundation (MCF)", " ", "is currently offering scholarships for high achieving African students interested in studying at postgraduate levels, commencing in January 2020.", "The Mastercard Foundation Scholars Program (MCFSP) ", "targets academically talented yet economically disadvantaged young people in Africa who will contribute to the transformation of the continent through their knowledge, skills, attitudes and values evidenced by their leadership. Community service and internships are essential components of the Program. The MCFSP offers a full scholarship to selected students who have been provisionally admitted to study towards a postgraduate degree at UP. Graduates must return to their home countries on completion of their studies and give back to their communities.", "Benefits:", "If your application is successful, the Program will cover the following:", "Full tuition fees", "Accommodation and meals in a UP residence or UP-accredited accommodation", "A modest monthly stipend", "Textbooks and printed material", "Medical aid cover for the duration of the study", "VISA costs", "Reasonable travel costs (including flight ticket) to and from your home", "Leadership development opportunities", "Academic advising and counselling support  ", "Instructions", "In order to apply for the scholarship,\nyou MUST have been admitted into a degree at UP. You will need your\nstudent number to complete the MCFSP application, which must be\naccompanied by your academic records and other supporting documents as\noutlined in the application form.", "Be sure to include documents that support what your family, guardian or foster", "\nparents can afford to pay. Examples of such documentation include bank", "\nstatements, pay slips and loan documents.", "Only students admitted to full-time study at UP will be considered for the scholarship.", "Only prospective students who cannot\nafford to pay the full fees are eligible to apply. Do not apply for\nfunding if you or your parents, guardian or foster parents can afford\nthe full tuition fees.", "All the information provided must be accurate and true. Any falsification of", "\ninformation on the application form may result in disqualification from consideration for a scholarship.", "POSTGRADUATE SCHOLARS ", "Faculty of Natural and Agricultural Sciences", "Faculty of Economic and Management Sciences", "Faculty of Humanities for entry into the Honours or Masters (Political Studies or International Studies only)", "Faculty of Engineering – continuing students are eligible to apply", "How to apply ", "Step 1", "You may apply online at ", "www.up.ac.za/apply", ".", "To use the online ", "Application", " system, you will need Internet access and an email address that you can access regularly. As soon as you submit your online ", "application", ", a student number (EMPLID) will be sent to this email address as confirmation of receipt.", "Alternatively, you can submit a hard copy of your application form to the following address:", "University of Pretoria", "Student Service Centre", "Hatfield", "Pretoria 0028", "South Africa", "Step 2", "The application will be evaluated by members of the relevant faculty and you will be informed of the outcome.", "Postgraduate applicants are required to\nhave their certificate verified by the South African Qualifications\nAuthority (SAQA). Please visit www.saqa.org.za", "Step 3", "Download application forms for the MCFSP from ", "www.up.ac.za/mcfsp", ".", "Application enquiries can be directed to: ", "[email protected]", "Tel: 012 420 4297", "For More Information:", "Visit the Official Webpage of the University of Pretoria MasterCard Foundation Undergraduate & Postgraduate Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-pretoria-mastercard-foundation-undergraduate-postgraduate-scholars-program-2020/"], [["Audi Environmental Foundation Scholarships 2019 to attend the One Young World Summit 2019 in London, United Kingdom (Fully Funded)", "date announced:April 15, 2019", "Application Deadline: May 17th 2019"], ["Application Deadline: May 17th 2019", "The Audi Environmental Foundation", " actively supports research into new technologies and scientific methods for a liveable future. Its stated goal is to make a contribution to environmental protection and to create and promote ways of behaving sustainably.", "The Foundation focuses\nin particular on promoting and developing environmentally compatible\ntechnologies, measures for environmental education and protecting the\nnatural necessities of life for humans, animals and plants. It was\nestablished in 2009 by AUDI AG as a 100-percent subsidiary and is part\nof the company’s social and environmental commitment.", "Scarce\nresources, environmental destruction, climate change and population\ngrowth – these are just a few aspects that are influencing society,\npolitics and business. With the advancing change in social values, for\nmore and more people, sustainability is becoming part of their outlook\non life. The challenges that confront us are increasingly complex. Only\nby working with partners can we develop good concepts and sound\nsolutions to successfully cope with these challenges.", "Audi is\ntherefore collaborating with One Young World to offer scholarships to 15\ninspiring young leaders to attend this year’s One Young World Summit\n2019 in London, United Kingdom.", "In addition to participating in\nthe One Young World Summit, Audi Scholars will join an exclusive\npre-event where they will connect with fellow innovators from the\nprogramme as well as experts from the Audi Environmental Foundation. ", "Are you eager to join an international discussion of issues like sustainability and the environment? Would you like to build an international network and gain insight into how other people think? Then apply now as an ", "Audi Scholar for the One Young World Summit 2019! ", "Requirements:", " If you are aged between 18 and 30 years, work for or are involved with a non-governmental organisation, social enterprise, community based organisation, or you are an individual making an impact on environmental topics, then this scholarship is for you.  ", "Benefits:", "Access to the ", "One Young World Summit 2019 in London, United Kingdom", ".", "The cost of travel to and from London (economy flight).", "Hotel accommodation London between 20 and 25 (inclusive) October.", "Participation at the pre-event by Audi AG and the Audi Environmental Foundation on 21 October", "Catering which includes breakfast, lunch and dinner", "Transport between the pre-event by Audi, Summit accommodation and the Summit venue.", "Summit hand-outs and support materials.", "Selection Criteria", "Most delegates are between the age of\n18 and 30. The One Young World team will consider applications from\nthose who are older than 30, pending demonstration of appropriate\npersonal impact, initiative, and willingness to engage. We are not able\nto accept applications from those who will be aged under 18 at the time\nof the Summit.", "Candidates must demonstrate:", "A passion for environmental issues", "Impact and capacity for innovation in this field", "Leadership", "For More Information:", "Visit the Official Webpage of the Audi Environmental Foundation Scholarships 2019", " "], "url : https://www.opportunitiesforafricans.com/audi-environmental-foundation-scholarships-2019/"], [["The Cambridge Consultants’ Code for Good Scholarships (Fully Funded to attend the One Young World Summit 2019 in London,UK)", "date announced:April 13, 2019", "Application Deadline: 3 May 2019 "], ["Application Deadline: ", "3 May 2019", " ", "Cambridge Consultants", " is a world leader in disruptive innovation and technology-based consulting. Established in 1960, our world-class engineers, designers, scientists and consultants solve the world’s most complex engineering, technology and design problems to deliver world-firsts.", "Through six decades of innovation, we have\ndemonstrated the power of technology to solve complex problems at scale.\nThis year we’re excited to partner with One Young World to identify and\nsupport young leaders who share our belief in the power of technology\nto alleviate suffering and empower a new generation.", "The Cambridge Consultants’ Scholarship", " has been established to support young people who want to apply technology to address the United Nations Sustainable Development Goals. Applications using data analysis, artificial intelligence, language processing, novel designs for Human Interaction or similar fields are particularly interesting to us. Your innovation can be wholly software, or some large product or service where software is just one of the important parts.", "As well as participating in the ", "One Young World Summit 2019, ", "scholarship recipients will receive remote mentoring, an intensive two week residency at the Cambridge (UK) headquarters and support in developing their innovations.", "Requirements:", "This scholarship is designed to support young leaders* who aim to use\ntechnology to address the UN Sustainable Development Goals in their own\ncommunity or country.", "Successful applicants will be able to demonstrate:", "Developing expertise in technology, software or design", "A passion for pressing sustainability issues", "A developing concept to apply technology to drive progress on the Sustainable Development Goals", "We\nare particularly keen to connect with innovators working to address\nGoal 13: Climate Action, but would welcome applications from people\nworking on:", "Goal 4: Quality Education", "Goal 6: Clean Water and Sanitation", "Goal 9: Industry, Innovation and Infrastructure", "Goal 11: Sustainable Cities and Communities", "Goal 12: Responsible Consumption and Production", "Goal 14: Life Below Water", "Goal 15: Life on Land", "*Most One Young World scholars are between the ages of 18 and 30. The One Young World team will consider applications from those who are older than 30, pending demonstration of appropriate personal impact, initiative, and willingness to engage. We are not able to accept applications from those who will be aged under 18 by the date the programme begins (10 June 2019)", "Benefits:", "3 months remote mentoring and support to develop your innovation", "Guided access to our prototype and development capabilities and laboratories", "Travel to Cambridge (UK) and accommodation for 2 weeks between 7 and 21 October", "Workplace based mentoring and support at our Cambridge (UK) headquarters", "Fully funded participation in the", " One Young World Summit 2019", "Support in developing, or launching and refining your innovation", "For More Information:", "Visit the Official Webpage of the Cambridge Consultants’ Code for Good Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/the-cambridge-consultants-code-for-good-scholarships-2019/"], [["Lenovo Smarter Technology for All Scholarship (Fully Funded to the One Young World Summit 2019)", "date announced:April 30, 2019", "Application Deadline: 20 May 2019"], ["Application Deadline:", " 20 May 2019", "Lenovo is one of the world’s most innovative global technology\ncompanies. Powered by a diverse group of forward thinkers and innovators\nin more than 160 countries, Lenovo constantly reimagines technology to\nmake the world more interesting and solves tough global challenges.", "One\nYoung World identifies, promotes, and connects the world’s most\nimpactful young leaders to create a better world, with more responsible,\nmore effective leadership. The annual One Young World Summit convenes\nthe brightest young talent from every country and sector, working to\naccelerate social impact.", "This year, Lenovo will support one young innovator to participate in the", " One Young World Summit 2019", " held in London from 22 – 25 October. The successful scholar will join 2,000+ fellow young leaders from 190+ countries for four transformative days of speeches, panels, networking, and workshops. The scholarship recipient will also have the opportunity to apply to give a keynote speech, sharing a platform with world leaders with the world’s media in attendance.", "This scholarship is particularly intended to support a young leader who is helping to provide better access to STEM education and technology to underserved groups, or one who is leveraging technology to make a tangible impact in their community, country or world at large.", "Eligibility Criteria", "Candidates must be:", "Aged 18 – 30", "Nationals of all countries will be eligible to apply for this scholarship", "If you are to receive this scholarship, you agree to participate in interviews and articles that will be published by Lenovo.", "Please note that you will be unable to save your responses in the submission form. With this in mind, we recommend saving your responses first in an  offline document before submitting your application.   ", "Selection Criteria", "Evidenced delivery of social impact", "Demonstrated capacity for leadership", "Track record of generating impactful and innovative results", "One\nYoung World will actively seek and prioritize applicants who apply\ntechnology to drive progress on the Sustainable Development Goals", "Benefits:", "Access to the One Young World Summit 2019 in London, United Kingdom", "The cost of travel to and from London (economy flights only)", "Hotel accommodation in a single room from 22-25 October inclusive", "Catering which includes breakfast, lunch and dinner, during these days", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "For More Information:", "Visit the Official Webpage of the Lenovo Smarter Technology for All Scholarship "], "url : https://www.opportunitiesforafricans.com/lenovo-smarter-technology-for-all-scholarship/"], [["NLNG Post-Primary and Undergraduate Scholarships 2019/2020 for young Nigerians", "date announced:April 24, 2019", "Application Deadline: May 13th 2019Nigeria LNG Limited supports education through several initiatives. One of them is Scholarships. NLNG has a four-tier scholarship programme which channels support for human capital development and encourage high performance, ultimately growing a pool of high potential students, graduates and professionals with competitive advantage.   "], ["Application Deadline: May 13th 2019", "Nigeria LNG Limited", " supports education through several initiatives. One of them is Scholarships. NLNG has a four-tier scholarship programme which channels support for human capital development and encourage high performance, ultimately growing a pool of high potential students, graduates and professionals with competitive advantage.   ", "NLNG Post Primary Scholarship", "The scheme aims at supporting high performing basic six pupils in company’s host communities and the oil-producing states of Nigeria to access post primary education uninterruptedly. The scheme kicked off in 2012 with 28 beneficiaries, and has grown to a total of 172 beneficiaries by 2015. Prospective pupils are admitted onto the scheme based on excellent performance at the annual National Examinations Council’s (NECO) Common Entrance Examinations.", "Criteria", "Be an indigence of NLNG host communities", "\nBe a Basic 5 or 6 pupil", "\nProvide his/her Basic Five result", "\nMust provide an attestation letter signed & stamped by the Head Teacher of his/her school (contact number of the Head Teacher also to be included)", "\nProvide an indigene confirmation letter signed by the CDC Chairman or Chief in his/her community", "\nProvide letter of identification from his/her Local Government Council", "\nNot be a child or ward of staff of Nigeria LNG Limited.", "NLNG Undergraduate Scholarship", "This was founded as a critical component of education intervention programme for our host communities in 1998 and later opened up to the rest of Nigeria in 2003. ", "A total of 2,833 undergraduates from various universities in Nigeria have benefited from the scholarship scheme with a spend of over N600 million. ", "The introduction of online application and use of social media (Facebook) for information dissemination in 2012 made the selection process more efficient and cost effective, and increased awareness. The value of the scholarship has been reviewed upward from N100, 000 to N300, 000 per awardee for an academic year and it runs throughout the duration of the student’s course.  ", "Criteria", "Any prospective beneficiary must", "Have excellent/very good West Africa School Certificate WASC) or National Examination Council result at ONE sitting", "\nHave a top score at the Joint Admissions and Matriculation Board (JAMB) examination", "\nBe a certified Full-Time Year-One student of any Nigerian University at the time of application", "\nNot be on any other Scholarship Award from other companies or agencies", "\nNot be a spouse, child, ward or direct relation of staff of Nigeria LNG Limited", "The Application Process", "Interested persons should visit www.nigerialng.com to apply.", "\nClick on the “our CSR” menu to select “Education” from the drop down menu, click on “Scholarship” link and then on the “Under-Graduate” link to access the application portal.", "\nAll applications MUST include the following scanned copies as attachments:", "Passport sized photography", "\nWASC or NECO result", "\nJAMB result", "\nUniversity admission letter", "\nUniversity student ID card", "\nLGA Letter of identification", "Call for Entry/Application for Post Primary, Undergraduate Scholarships ", "For More Information:", "Visit the Official Webpage of the NLNG Post-Primary and Undergraduate Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/nlng-post-primary-and-undergraduate-scholarships-2019-2020-for-young-nigerians/"], [["Ashesi University Ghana MasterCard Foundation Scholarship Program 2019/2020", "date announced:April 15, 2019", "Application Deadline: June 27th 2019"], ["Application Deadline: June 27th 2019", "Ashesi University College,", " Through a $13 million partnership with The MasterCard Foundation will be awarding significant financial support to qualified undergraduate students who need such assistance to pursue bachelors degree.", "Half of the scholarships funded by the Master Card Foundation will be awarded to non-Ghanaians. This scholarship covers not only the full tuition, but also includes housing in Ashesi’s residence halls, meals on campus, a free laptop, spending money and annual trips home for international students after the second year.", "The MasterCard Foundation Scholars Program", " is an initiative to educate and prepare young people – especially from Africa – to lead change and make a positive social impact in their communities. The", " Scholars Program at Ashesi", " will provide young Africans from economically disadvantaged communities who have demonstrated academic talent and leadership potential with access to quality and relevant education.", "Benefits:", "Scholars at Ashesi represent some of the best and brightest students from across the African continent, and will receive a holistic education that includes:", "Comprehensive Scholarships", "Students receive financial support for fees, books and supplies, transportation, accommodation, and stipends.", "Life-long Skills", "Scholars at Ashesi benefit from enrichment in skill areas relevant to success, such as critical thinking, communications, and entrepreneurship.", "Transition Support", "Scholars will receive support during their transition into Ashesi, and the workforce, with mentoring, career counseling, internships and other life skills coaching.", "Give-Back Component", "An integral component s the commitment to give back to their communities. Students will get to actively work on this through volunteer and community service opportunities.", "Career Opportunities", "Since Ashesi’s inception, some 90% of our graduates have stayed to work and contribute to growth and development in Africa; over 95% our graduates receive job offers within months of graduation.", "A Global Alumni Network", "Graduates of the Programme will be connected through a network that offers information, resources, and opportunities to learn from other scholars and Ashesi graduates around the world.", " How to Apply in 3 Steps ", "(1) Start Online Application or Paper Application", "Online Application:", "Click here to open Online Application Form", "Paper Application: ", "If you prefer to fill a paper application, download and complete the forms below:  ", "Download Application Form", "Download Scholarship Form", "Please note that paper applications may delay processing for up to a month and may result in repetitive request for information.", " ", "For More Information:", "Visit the Official Webpage of the MasterCard Foundation Scholarship Program 2019/2020 at Ashesi University, Ghana"], "url : https://www.opportunitiesforafricans.com/mastercard-foundation-scholarship-program-2019-2020-at-ashesi-university-ghana/"], [["DSM: Resources & Circularity Scholarship (Fully Funded to attend the One Young World Summit 2019 in London, United Kingdom)", "date announced:April 23, 2019", "Application Deadline: 15 May 2019"], ["Application Deadline: ", "15 May 2019", "As a longstanding partner of ", "One Young World,", " DSM is proud to provide the ", "Resources & Circularity Scholarship ", "in light of the 2019 Summit in London. Our purpose is to create brighter lives for people today and generations to come. We connect our unique competencies in Life Sciences and Material Sciences to create solutions that nourish, protect and improve performance.", "With the Resources & Circularity\nScholarship DSM will offer three scholarships to young leaders around\nthe world, who are working to further the transition from a linear to a\ncircular and/or bio-based economy.", "The scholarship focuses on\nDSM’s purpose-driven domain, Resources & Circularity. DSM’s ambition\nis to safeguard the future availability of natural resources, and to\nunlock more value from the limited resources that are available. In\norder to reach this two-fold goal, DSM focuses on five circularity\ndrivers to design and manufacture its solutions:", "Reduce the use of critical resources", "Replace scarce, hazardous and potentially harmful resources with renewable and safer alternatives", "Extend the lifetime of products", "Design for recyclability", "Recover waste streams", "Requirements:", "In line with DSM’s ambition to enable the transition to a circular\nand bio-based economy, this scholarship seeks to support young leaders\nand entrepreneurs who are making an impact on circularity and addressing\nresources with their ideas, start-up companies, or other projects and\ninitiatives. Preferably they have 3-5 years of experience in the field.", "Specifically,\nthe scholarship seeks candidates who are making a positive impact on\naccelerating the transition towards a circular and/or bio-based economy\nin one (or more) of the following ways:", "Materials innovation & design: ", "redesigning,\nor designing new materials by addressing any one (or more) of DSM’s\nfive circularity drivers as outlined above – Reduce, Replace, Extend,\nDesign, Recover", "Entrepreneurship:", "\ncontributing to circularity by implementing new business models in the\nfollowing markets: Buildings (including interior) & construction,\nTextiles, Heavy Marine & Fishing industry, Electronics, Automotive,\nFood packaging, 3D printing", "Advocacy and shaping opinions: ", "raising awareness and having a leading voice in the transition towards a circular & bio-based economy", "Clean up initiatives:", " driving clean up initiatives on waste, by not only cleaning up but also by viewing waste as a resource", "Digitalization:", " using new technologies to support radical transparency, and to keep materials at their highest utility and value", "Eligibility Criteria", "Candidates must be:", "Aged 18 – 30", "Young leaders from non-profit, community organizations or social enterprises", "Nationals of all countries will be eligible to apply for this scholarship", "Please\nnote that you will be unable to save your responses in the submission\nform. With this in mind, we recommend saving your responses first in an\noffline document before submitting your application.   ", "Benefits:", "Access to the ", "One Young World Summit 2019 in London, United Kingdom", "The cost of travel to and from London (economy flights only)", "Hotel accommodation on a shared basis from 21-25 October inclusive", "Catering which includes breakfast, lunch and dinner, during these days", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Participation in DSM’s internal on-boarding program, both online and face to face prior to the Summit, which includes mentorship with DSM senior experts", "If you are selected, you are invited by DSM to participate in a pre program at the DSM headquarters in ", "the Netherlands", ". Please note that the pre-program will run from Saturday 19 until Tuesday 22 October. Furthermore, you will have a debriefing day after the summit on Saturday 26 of October.", "For More Information:", "Visit the Official Webpage of the DSM: Resources & Circularity Scholarship"], "url : https://www.opportunitiesforafricans.com/dsm-resources-circularity-scholarship-2019/"], [["Helen Lansdowne Resor (HLR) Scholarship 2019 for female creative students ($USD 10,000 & internship at a J. Walter Thompson Office)", "date announced:April 24, 2019", "Application Deadline: June 3rd 2019"], ["Application Deadline: June 3rd 2019", "It started in 1908, when ", "Helen Lansdowne", " was hired by J. Walter Thompson Cincinnati as the industry’s first female copywriter. She soon moved to the New York office, where she rose through the ranks as a creative powerhouse.", "Requirements", "Female students registered at an undergraduate, graduate, and/or portfolio school", "Be a registered student at an undergraduate, graduate, and/or portfolio school with at least 12 months of school left as of May 20, 2019", "Show creative talent and potential in a course of study like Art Direction, Copywriting, Design, Experiential Design, Sculpture, Film, etc. Basically, if you think it applies to you, it probably does", "Maintain satisfactory academic and creative progress as determined by your school ", "Benefits", "A scholarship up to $10,000 to put towards your education", "An internship at a Wunderman Thompson office", "One-on-one mentorship", "First-look placement at Wunderman Thompson after graduation", "Application Process", "Personal statement (500 words or less)", "Letter of recommendation from a faculty member", "3-5 creative samples", " Apply", "Now", " to complete the application. You’ll have to submit your application form, a personal statement, a letter of recommendation and 3–5 creative samples by Jun 03, 2019 ", "For More Information:", "Visit the Official Webpage of the Helen Lansdowne Resor (HLR) Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/helen-lansdowne-resor-hlr-scholarship-2019-for-female-creative-students/"], [["SAICA’s Thuthuka Bursary Fund 2019 for Aspiring Chartered Accountants – South Africa", "date announced:April 25, 2019", "Application Deadline: June 30th 2019"], ["Application Deadline: June 30th 2019", "As a critical stakeholder in society", ", SAICA ", "has undertaken the responsibility of ensuring that there is a consistent flow into the economy of adequately and suitably qualified accounting professionals who are representative of the country’s demographics. This is done via various skills development initiatives at primary, high school and tertiary education level.", "To drive this process and ensure its proper governance, SAICA established the ", "Thuthuka Education Upliftment Fund (TEUF) ", "in 2002. Through TEUF, SAICA focuses on two strategic objectives:", "– to grow the number of CAs(SA), and – to transform\nthe demographics of the profession to match the country’s demographic\nprofile.", "Thuthuka is a Zulu verb meaning ‘to develop,’ and it\nreflects the action-based perspective with which transformation in the\naccounting profession is being driven.", "The Thuthuka Education\nUpliftment Fund (TEUF) is a SAICA skills development implementation\nentity and is registered as a public benefit organisation in terms of\nsection 18(A) of the Income Tax Act with its principal place of business\nat 17 Fricker Road, Illovo, Johannesburg, South Africa. A board of\ndirectors is responsible for the overall running and governance of TEUF.", "The\nThuthuka Bursary (TBF) operating under TEUF, states that its primary\nactivity is assisting disadvantaged African and Coloured students to\nbecome chartered accountants (CAs[SA]).", "Thuthuka’s value proposition is to sustain the future of the charteredaccountancy profession and transform its demographics by:", "– advancing education; – empowering youth; and – sustaining the future of the CA(SA) profession", " Requirements for application of the Thuthuka bursary", "The learner must be African or Coloured", "The learner must be a South African Citizen", "The learner must obtain atleast 60% on Pure Mathematics (5 or above on the NSC Scale of Achievement) NOT MATHS LITERACY or TECHNICAL MATHS", "The learner must be in Grd12 intending on studying B comm. Accounting ", "The learner must be financially needy and will be assessed using the NSFAS MEANS TEST to confirm financial need", "The learner must not be out of Matric/school f or more than 2 years.", "To be considered for the Thuthuka Bursary Fund, you are required to register and write the National Benchmark Test (NBT).", "The Process of Awarding a Bursary", "The application must have met the above criteria", "The learner must have or be in the process of applying to one of the following tertiary institutions: ", "University of Johannesburg (UJ) – (Bachelor of Accounting (Course Code BCA012)", "University of Cape Town (UCT) (B Com – Course code CB023) ", "Nelson Mandela University (NMU) (B Com Accounting (Course Code 40003)Rhodes University (RU) – Bachelor of Commerce (Accounting)", "Stellenbosch University (SU) – B Com Accounting/B Rek (Course Code 3091001)", "University of Pretoria (UP) B Com Accounting Science (Course Code 07130042) ", " The closing date for our bursary is the 30th of June 2019 for the following year.Our postal address:- ", " Thuthuka Bursary Fund,", " Private Bag X32 Northlands 2116 OR ", "EMAIL: ", "[email protected]", "Contact centre number 08610 72422 ", "For More Information:", "Visit the Official Webpage of the SAICA’s Thuthuka Bursary Fund 2019"], "url : https://www.opportunitiesforafricans.com/saicas-thuthuka-bursary-fund-2019/"], [["Nigerian Agip Exploration Limited Post Graduate Scholarship Award Scheme 2019/2020 for Nigerians", "date announced:April 18, 2019", "Application Deadline: June 1st 2019"], ["Application Deadline: June 1st 2019", " ", "Nigerian Agip Exploration (NAE) Limited,", " on behalf of the NNPC/NAE PSC, is committed to the training and development of manpower as part of its Corporate Social Responsibility (CSR) programme. ", "In pursuance of this, NAE invites applications from suitably qualified and interested Nigerian graduates for the ", "2019/2020 Post Graduate Scholarship Award Scheme.", " The award is in two categories: – ", "1. Overseas – For study in a reputable overseas university", "2. Local – For study in a recognized Nigerian university ", "Requirements:", "\nTo qualify for 2019/2020 NAE Post Graduate Scholarship Award scheme, applicants MUST:", "1. Possess a minimum of Second Class Upper Bachelor’s degree from a recognized Nigerian university.", "2.\nHave secured admission into a Nigerian or Overseas university (based on\nthe category being applied for) for a one year Master’s Degree\nprogramme in any of the disciplines listed below.", "3. Not above 28 years of age by December 31st, 2019.", "4. Have completed the one year National Youth Service Corps (NYSC) programme.", "5. Possess an international passport valid for travel at least one year from September, 2019 (applicable to overseas category).", "Course of Study", "Only candidates with offer of admission in disciplines related to the following areas should apply;", "• Geosciences", "• Engineering (Petroleum, Mechanical, Civil, Subsea, Electrical/Electronics, Marine, Chemical)", "• Petroleum Economics", "• Law (Oil and Gas/Petroleum)", "Please note:", "1. ONLY Shortlisted candidates will be contacted for the aptitude test.", "2.\nShortlisted candidates will be contacted with details of the qualifying\ntest via SMS text and Email (Ensure to provide valid email and phone\ncontacts).", "3. Employees of NAE and other affiliate companies and their dependents are not eligible for this scholarship", "4. Current and past beneficiaries of similar awards from NAE, other affiliate companies and agencies are not eligible.", "5.\nPlease ensure you understand the Instructions carefully before you\nstart this application to avoid errors and disqualification. ", "6. Strict compliance with above guidelines is required. ", "Completion\nof the application form and test invitation shall NOT be construed as a\ncommitment on the part of the NNPC/NAE/OANDO PSC nor shall it entitle\napplicants to make any claims whatsoever and/or seek any indemnity from\nNAE and/or any of its partners by virtue of responding to this\ninvitation to apply for Post Graduate scholarship award.", "The NAE scholarship award applies to tuition, books, field trips, accommodation, living expenses and a return economy ticket for selected one-year course of study. ", "How to Apply:", "SECTION A", "1. Candidates should have the following clearly scanned documents before\nstarting the application process:   ", "      a. Passport photograph (450 × 450 pixel) with\nwhite background not more than 3 months old ", "\n      b. Provisional\nadmission letter for post graduate studies 2019/2020 session into any reputable\nuniversity – Local/Overseas. This admission letter must be for the\ncourse stated on the candidate’s application. ", "\n      c. First\nDegree Certificate ", "\n      d. NYSC\nDischarge Certificate ", "\n      e. Valid\nID card (Driver’s license, Voter’s card, National Identity card) ", "      f. Valid\nInternational Passport Data Page for Overseas category only (Valid for\ntravel at least one year from September 2019) ", "     g. Birth\nCertificate from Local government", "     h. NAE Compliance\nDeclaration Form\n", "2. All candiates are required to fill and sign the NAE compliance declaration form. ", "To download the ", "NAE compliance declaration, click ", "https://dragnetscreening.ng/files/compliance.pdf", "3. Label the\nscanned documents accordingly, to avoid mix up during upload. ", "4. Attach\nthe right documents in the appropriate upload section. ", "SECTION B", "\nTo apply, follow the steps below: ", " 1. Click on “", "Apply Now", "” tab. ", " 2. Click on “", "Register Now", "” to create an\naccount. ", " 3. Proceed to your email box to activate your account ", " 4. Click on ", "www.scholastica.ng", " to return to Scholarship site ", " 5. Enter your registered email and password to create\nyour profile. ", " 6. Candidates ", "are", "\nrequired to fill the Personal Details, Undergraduate and Postgraduate Sections only. Candidates are also required to\nupload only applicable documents (refer to section A).  ", "Note to Overseas category applicants: ", "Applicants for the Overseas category are encouraged to also apply for the Local Post Graduate Scholarship Award.", "\n 7.  Candidates ", "are not", " required to fill the Secondary\nLevel, Bank details or download the undergraduate profile verification form in the application portal.", " 8.  Ensure the name used in application matches the\nnames on all documentation in same order. Upload a sworn affidavit or\ncertificate if otherwise. ", " 9.  Ensure you view all documents after uploading, to\neliminate errors during uploading. ", "10. Recheck application information to avoid errors ", "\n11. Click “", "Apply Now", "” to submit\ninformation at ", "http://scholastica.ng/schemes/naescholarships", " or return to the home page ", "www.scholastica.ng", " and select the 2018 NAE Postgraduate\nScholarship Awards to be redirected to the application page ", "\n12. You will receive an email that confirms your\napplication was successful. \n", "For More Information:", "Visit the Official Webpage of the Nigerian Agip Exploration Limited Post Graduate Scholarship Award Scheme 2019/2020 "], "url : https://www.opportunitiesforafricans.com/nigerian-agip-exploration-limited-post-graduate-scholarship-award-scheme-2019-2020/"], [["The Institute of Development Studies (IDS) Graduate Scholarship 2019 for scholars from the Global South", "date announced:April 22, 2019", "Application Deadline: April 30th 2019"], ["Application Deadline: April 30th 2019", "The Institute of Development Studies (IDS)", " is delighted to offer up to six scholarships to encourage high achieving scholars from the Global South to study for a master’s degree commencing in 2019.", "These scholarships have been jointly endowed by the Allan and Nesta\nFerguson Charitable Trust, the Albertina Scholarship Fund and the estate\nof Sir Hans Singer.", "The scholarships are available to international students from lower-\nor middle-income countries who have accepted a full-time place on an IDS\nmaster’s degree. Priority will be given to students who have the\ngreatest potential to make a difference in their home countries after\ncompleting the degree.", "Type of award", "Taught full-time master’s degree plus essential living costs", "Award amount", "Up to £16,750 for fees and up to £11,000 for essential living costs", "Eligibility", "The scholarship is only open to applicants who are nationals of and\ncurrently living in a lower or middle income country. For details please\nrefer to our ", "country list", ".", "Applicants:", "Must have received and accepted an offer of a place on an full-time taught IDS masters degree (see our list of ", "IDS masters courses", ")", "Must have proven academic skills and an established career with a\ntrack record of excellence and achievement in the field of development", "Must be able to demonstrate, through your previous experience and\nfuture plans, that you are committed to working for development – be it\neducational, economic, social or cultural – in your home country", "Must not have studied nor worked in a high-income (developed) country", "Must meet all of IDS and the University of Sussex’s general entrance requirements.", "Must have received an unconditional offer on an eligible Masters by\nFriday 17 May 2019 (it is possible to apply for the scholarship before\nreceiving an offer of a place).", "It is not possible to defer an award made in one academic year to a\nlater academic year if a student is unable to take up the original\nplace.", "Application procedure", "To be considered for the IDS Graduate Scholarship, you must have\naccepted an offer of a place on an eligible IDS master’s degree.", "Applications for the scholarship award should be submitted via our online ", "IDS Scholarship Application Form.", "In fairness to other applicants, we are unable to consider\napplications from candidates who have not already secured sufficient\nfunds to meet the remaining tuition and living expenses at the time of\napplication (after taking account of the possible award of this\nScholarship) and you must provide evidence of how you will fund your\nexpenses.", "The closing date for receipt of scholarship applications is Tuesday 30 April 2019.", "Your application will be reviewed and successful candidates may be\ncalled for an interview (by phone or Skype). Once an award has been\napproved, the candidate will be notified in writing in June 2019. \nPlease note that candidates should not make irreversible plans to leave\nfor the UK until they have received a formal offer letter for the\nscholarships.", "Application deadline", "The deadline to submit your scholarship application is Tuesday 30\nApril 2019 but you must be in receipt of an unconditional offer on an\neligible course by Friday 17 May 2019.", "Contact details", "If you have any questions regarding the scheme please email: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the IDS Graduate Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/the-institute-of-development-studies-ids-graduate-scholarship-2019/"], [["Schwarzman Scholars Program 2020/2021 for Young Leaders to study in China (Fully Funded)", "date announced:April 16, 2019", "Application Deadline: September 30th 2019"], ["Application Deadline: September 30th 2019", "Every year, up to 200", " ", "Schwarzman Scholars", " will represent the world’s next generation of leaders — high-caliber individuals with open minds and limitless potential — a network of leaders who will serve as bridges between China and the rest of the world.", "Schwarzman Scholars will be selected on the basis of not only their\nacademic aptitude and intellectual ability, but also their leadership\npotential, entrepreneurial spirit, ability to anticipate and act on\nemerging trends and opportunities, exemplary character, and desire to\nunderstand other cultures, perspectives and positions.", "All qualified candidates will have successfully completed their undergraduate degrees prior to enrollment and must be proficient in English.", "Eligibility Requirements:", "Undergraduate degree or first degree from an accredited college or university or its equivalent. ", " Applicants who are currently enrolled in undergraduate degree programs must be on track to successfully complete all degree requirements before August 1 of their Schwarzman Scholars enrollment year. There are no requirements for a specific field of undergraduate study; all fields are welcome, but it is important for applicants, regardless of undergraduate major, to articulate how participating in Schwarzman Scholars will help develop their leadership potential within their field. ", "Age Requirement.", "Candidates must be at least 18 but not yet 29 years of age as of August 1 of their Schwarzman Scholars enrollment year.", "Test of English as a Foreign Language (TOEFL PBT). Minimum score 600.", "Internet-based Test of English as a Foreign Language (TOEFL iBT). Minimum score 100.", "International English Language Testing System (IELTS). Minimum score 7.", "English language proficiency. ", " Applicants must demonstrate strong English skills, as all teaching will be conducted in English. If the applicant’s native language is not English, official English proficiency test scores must be submitted with the application. This requirement is waived for applicants who studied at an undergraduate institution where the primary language of instruction was English for at least two years of the applicant’s academic program. The requirement will also be waived for applicants who have studied in English for two or more years at a Master’s degree level or higher.", "Benefits:", "The students selected to become Schwarzman Scholars will receive a comprehensive scholarship. It will include:", "Tuition Fees", "Room and board", "Travel to and from Beijing at the beginning and end of the academic year", "An in-country study tour", "Required course books and supplies", "Health insurance", "A stipend of $4,000 for personal expenses", "Application Procedure:", "Interested candidates participate in a rigorous and thorough\nselection process, designed to identify the most promising young leaders\nfrom around the world. Those selected will have demonstrated their\npotential to produce results within their own culture and context by\ninspiring and guiding groups and to not only benefit ", "from ", "but also contribute ", "to", " the\nSchwarzman Scholars program. The process includes an online application\nand evaluation as well as in-person regional interview.", "Applications for U.S and Global applicants open in April 2019 ", "for\nthe 2020-2021 class, with selections made in November 2019. Applicants\nwith Chinese passports apply by May 2019, with selections made in\nSeptember 2019.  Please review basic eligibility requirements via the\nlink to the right.", "Required forms and records include:", "Online application", "Resume (2 page maximum)", "Transcripts/Academic Records", "Essays (2)", "Letters of Recommendation (3)", "Video (optional)", "For More Information:", "Visit the Official Webpage of the Schwarzman Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/schwarzman-scholars-program-2020-2021/"], [["EducationUSA Opportunity Funds Program (OFP) 2019/2020 for young Nigerians (Funded to School in USA)", "date announced:April 17, 2019", "Application Deadline: 31st May 2019"], ["Application Deadline: 31st May 2019", "There are many determined and talented, low-income students in Nigeria who only require financial resources and access to information to better their educational future. For the 11th year, the United States Embassy, Nigeria seeks to identify academically qualified and highly motivated, low-income students in Nigeria to join the ", "EducationUSA Opportunity Funds Program (OFP).", "OFP’s mission is to assist talented and determined, low-income\nstudents who are good candidates for financial assistance from U.S.\ncolleges and universities but lack the financial resources to cover the\nup-front cost of obtaining admission.", "OFP works closely with students through regularly scheduled meetings\nand seminars to assist them throughout the application process to secure\nadmission and scholarships to attend colleges and universities in the\nUnited States. OFP finances the cost of the application process,\nincluding registration fees for required standardized examinations and\nprovides free membership to the U.S. EducationUSA Advising Center for\nits participants. OFP expects a sincere commitment from the students to\ngive their energy and time to the program so that they may achieve their\ndreams of study in the United States.", "Applicants are welcome from all the states in Nigeria. However, students must be able to reach our offices in Abuja or Lagos on a monthly basis during the program for full participation. Participants will work with our EducationUSA Advisors from June 2019 – August 2020 to try to secure places and financial assistance to begin study in the U.S. in August 2020.", "NOTE: ENTRANCE INTO THIS PROGRAM IS NO GUARANTEE OF A SCHOLARSHIP OR FINANCIAL ASSISTANCE TO STUDY IN THE U.S.", "SELECTION CRITERIA", "The selection of finalists for OFP is highly competitive, given limited funding. We look for applicants with:", "Strong academic record/ transcript", "Robust participation in extracurricular activities", "Involvement in leadership roles", "Excellent community service participation", "Financial Need", "NOTE:  ", "Undergraduate Applicants", "– If\nWAEC results are not available; the student must be currently in SS3.\nIf WAEC results are available, they must be from May/June WAEC.", "Students who have already started a University education are ", "NOT", " eligible to apply.", "Requirements", "Complete Application Form", "Academic Results:", "Undergraduate Applicants", "– Attach a ", "copy", " of your WAEC “O” Level results (from WAEC website).  Include Cambridge A’Level or IGSCE results if applicable or available.", "Graduate Applicants", "– Attach a ", "copy ", "of your Final year results and degree results (if available) ", "First Class only (STEM majors preferred).", "Letters of recommendation:", "Undergraduate Applicants", ": ", "Request\na teacher or your school principal to complete a letter of\nrecommendation form, attesting to your character, talent and skills. \nPlease do not include a basic testimonial that does not talk about you\nas an individual.", "Graduate Applicants", ":", " Provide the details of a lecturer, professor, or Head of Department (HOD) that we can contact to find out more about you.", "Transcript:", "Undergraduate Applicants", ": Send a scanned copy of your transcript from JS1 to SS3 including your mock and first term results, if possible.", "Graduate Applicants", "– Send a scanned copy of your transcripts that show a GPA of 4.5 or above on a 5.0 scale.", "Essays:", "Write ", "two essays", ", one from Group A and one\nfrom Group B, each of about 250– 300 words. The essay topics will be on\nthe application form you receive. (Essay topics will be found on the\nform)", "HOW TO APPLY", "Undergraduate applicants ", "apply here ", "Graduate applicants ", "apply here", "For inquiries send an email to ", "[email protected]", " ", "or ", "[email protected]", "For More Information:", "Visit the Official Webpage of the EducationUSA Opportunity Funds Program (OFP) 2019/2020 "], "url : https://www.opportunitiesforafricans.com/educationusa-opportunity-funds-program-ofp-2019-2020/"], [["University of Pretoria LLM/MPhil (Sexual & Reproductive Rights in Africa) Scholarships 2019 for African citizens (Fully Funded to study in South Africa)", "date announced:April 12, 2019", "Application Deadline: 30 June 2019 "], ["Application Deadline: ", "30 June 2019", " ", "The Centre for Human Rights, University of Pretoria", " ", "now offers an LLM/MPhil (Sexual & Reproductive Rights in Africa) degree. This two-year programme is offered as a blended learning course comprising of online interaction and residential block-weeks in Pretoria. Two contact sessions will be scheduled every year (four contact sessions over a period of two years).", "Requirements:", "The LLM degree is open to individuals with an LLB degree or equivalent.", "The MPhil degree is open to non-lawyers with at least an honours\ndegree in an academic discipline relevant to sexual and reproductive\nrights in Africa", "OR any other qualification in an academic\ndiscipline relevant to sexual and reproductive rights in Africa that\nallows admission to a master’s programme at the institution where the\nundergraduate qualification was obtained. If that qualification has a\nduration of fewer than 4 years, substantial proven practical or\nprofessional experience in sexual and reproductive rights in Africa,\nsubject to the discretion of the Dean, is further required.", "Applicants must have excellent academic credentials and demonstrate human rights experience or interest. A maximum of fifteen students will be accepted for the 2018 academic year.", "Scholarships", "UP TO 15 FULL SCHOLARSHIPS ARE AVAILABLE FOR AFRICAN CITIZENS.", "Goals of the programme:", "The LLM/MPhil (Sexual & Reproductive Rights in Africa) has\nshort-term as well as long-term goals. In the short-term, it aims to\nsecure the following goals:", "to equip the learner with knowledge and understanding of sexual and\nreproductive health and rights from domestic, regional and global\ninternational perspectives", "to equip the learner with research skills in sexual and reproductive health and rights", "to equip the learner with advocacy skills for promoting sexual and reproductive health and rights", "to equip the learner with practical skills for securing the realization of sexual and reproductive health and rights", "The goals of the Master’s programme go beyond the mere enrichment of\nthe learner. In the long-term, the LLM/MPhil Programme should yield to\nindividuals, and communities in the African region and beyond, tangible\nsocial benefits, including:", "grooming of leaders with a capacity to influence the social transformation of societies", "raising of public awareness about sexual and reproductive health and rights", "increasing the public understanding of sexual and reproductive health and rights", "enhancing the capacity of groups, networks or organisations that\npromote sexual and reproductive health and rights and related rights,\nincluding the rights of women and sexual minorities", "advancing the reproductive and sexual health and rights of individuals and communities", "combating discrimination and stigma surrounding sexual and reproductive health and rights", "influencing interventions in sexual and reproductive health and rights national and regional levels", "influencing policy-making in sexual and reproductive health and rights at the national and regional levels", "How to apply", "Click here to read about the application process", "Click here to apply online (please note – you must create an account on the Submittable platform before you can apply)", "Course duration (two years)", "2020 intake: January 2020 – December 2021", "Application deadline: 30 June 2019", "This is a selection course and applications must be submitted before 31 July 2019 to be admitted to the 2020 academic year.", "For More Information:", "Visit the Official Webpage of the University of Pretoria LLM/MPhil (Sexual & Reproductive Rights in Africa) Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/university-of-pretoria-llm-mphil-sexual-reproductive-rights-in-africa-scholarships-2019/"], [["The Nigeria LNG Limited 2019 Postgraduate Scholarship Award for study in the United Kingdom", "date announced:April 24, 2019", "Application Deadline: May 13th 2019"], ["Application Deadline: May 13th 2019", " Nigeria LNG Limited (NLNG) invites applications from qualified candidates for the ", "NLNG Postgraduate Scholarship Scheme for Masters Degree Programmes in the United Kingdom", " in September 2019. ", "Description", "The scheme seeks to grow a pool of high potential Nigerian graduate and professionals with competitive advantage.", "Criteria For Award", "\nProspective beneficiaries must:", "Have provisional admission from any of the underlisted UK institutions to study any of the following disciplines: Engineering, Geosciences, Environmental Sciences, Management Sciences, Information Technology, Law, and Medicine: ", "University of Aberdeen", "University of Manchester", "University of Cranfield ", "Possess minimum of 2nd Class Upper degree in a relevant field of study", "Completed NYSC programme", "Obtained not less than a 8.0 IELTS score", "Not be no more than 30 years of age as at the time of application", "Be resident in Nigeria", "Provide letter of identification from respective Local Government Councils.", "Provide letter of consent from employer (if in service of any organization)", "Possess international passport valid for travel, at least, one year from September 2019", "Be able to obtain UK Tier-4 student Visa upon being successful", "Provide evidence that they are available to travel in September 2019 if selected", "Not a direct relative to staff of Nigeria LNG Limited", "Application Procedure", "Click on the “Our CSR” menu to select “Educaition” from the drop down menu,", "Click on “Scholarship” link and then on the “Post Graduate” link to access the application portal.", "All applications MUST include the following scanned copies as attachments:", "International Passport bio-data page", "First degree certificate", "NYSC certificate", "Provisional admission letter from indicated select UK institutions.", "IELTS result", "LGA Letter of identification", "Employer consent letter (where applicable)", "Note", "To fill in valid contact details as these will be used to communicate status of application", "Only shortlisted applicants shall be invited for the selection interview/test.", "Applicants are advised to check their mailbox regularly for\ninformation on status of their application. Application will be\ndisqualified:\n", "For incomplete attachments", "Non-adherence to advertised criteria.", "NLNG is not under obligation to offer any kind of employment to\nsuccessful candidates upon graduation, neither are candidates bonded to\nNLNG on account of this scholarship.", "For More Information:", "V", "isit the Official Webpage of the Nigeria LNG Limited 2019 Postgraduate Scholarship Award"], "url : https://www.opportunitiesforafricans.com/the-nigeria-lng-limited-2019-postgraduate-scholarship-award-for-study-in-the-united-kingdom/"], [["University of Cape Town MasterCard Foundation Scholars Program 2019/2020 for study in South Africa (Fully Funded)", "date announced:April 17, 2019", "Application Deadline: June 30th 2019"], ["Application Deadline: June 30th 2019", "The University of Cape Town (UCT)", " ", "has partnered with the Mastercard Foundation in its global Scholars’ Program: an educational initiative that provides academically talented young people from economically disadvantaged communities in Africa with access to quality university education.  ", "The Mastercard Foundation Scholars Program at UCT provides full-cost\nscholarships to young Africans who are first-time undergraduate or\npostgraduate (honours and master’s) degree-seeking applicants. The\nscholarships ensure a premium educational package that will produce\ngraduates whose qualifications are internationally recognised and\nlocally applicable, and whose transition into the workforce is\nunderpinned by values of engaged citizenship and social justice.", "These scholarships cover the full period of study and are renewable annually subject to satisfactory performance and participation in the activities and opportunities offered by the programme. Successful candidates will be required to commit themselves to returning to their home countries and to invest their gained skills and education in their country’s social and economic growth.", "Selection criteria:", "Academically talented – value learning and are driven to complete their education.", "Economically disadvantaged – facing significant financial barriers to completing their education.", "Committed to giving back – investing in their communities, using the skills and knowledge that they have acquired.", "Future leaders – committed to embracing ethical leadership and making a positive change in their home communities.", "The scholarship includes:", "Comprehensive financial assistance", " with visa applications, travel, tuition, living expenses, medical aid and accommodation.", "A relevant and recognised education", " through academic curricula aimed at producing graduates whose qualifications are internationally recognised and locally applicable.", "Academic and peer mentor support", " – to ensure that each Scholar successfully progresses academically.", "An array of ", "cultural and transition support and training", " aimed at academic and professional enrichment and assisting in the challenges facing university going students.", "Career and internship", " opportunities in Africa, service learning, experiential learning – career guidance and support for transition to further study or the workforce.", "Leadership", " development and training.", "Alumni networks", " for further support.", "How to apply", "Postgraduates", "Mentors", "How to apply to UCT", "For More Information:", "Visit the Official Webpage of the University of Cape Town MasterCard Foundation Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-cape-town-mastercard-foundation-scholars-program-2019-2020-for-study-in-south-africa-fully-funded/"], [["Mo Ibrahim Foundation 2019/2020 Masters Scholarships in Governance and State-building (Fully Funded to United Kingdom)", "date announced:April 29, 2019", "Application Deadline: 19 May 2019. "], ["Application Deadline: ", "19 May 2019", ". ", " The International Development Department, University of Birmingham,", " ", "is pleased to offer one scholarship for the ", "MSc in International Development (Governance and State-building), ", "for the academic year starting in September 2019.  ", "The scholarship is provided by the Mo Ibrahim Foundation and is for a\ntwo-year programme, with the successful candidate undertaking the full\nMSc programme, with a one year internship being integral to the\nprogramme. The internship will consist of six months with IDD and six\nmonths with the Mo Ibrahim Foundation in London.", "The programme", "The Governance and Statebuilding programme is one of the specialised\nstreams within international development, and takes an interdisciplinary\nstandpoint, combining the theoretical rigour of political economy and\nthe practical experience of development. The good governance agenda\noccurs now increasingly alongside debate on state-building, which\nencompasses issues such as accountability and transparency, corruption,\nconflict, political settlement, human rights, participation, access to\njustice and democratisation. Governance and state-building are of\nparticular interest to governments, nongovernmental organisations and\ndevelopment agencies, as well as to a growing and vibrant academic\ncommunity.", "The pathway for the Foundation scholarship comprises the following modules:", "International Development (20 credits)", "Governance and State Building (20 credits)", "One of the following four modules (20 credits)", "Development Policy and Politics", "Development in Practice", "Conflict and Development", "Post Conflict Reconstruction and Development", "Choice of optional modules (60 credits) – choose from over 25 IDD\nmodules plus others from across the University. Dissertation (60\ncredits) – in depth focus on a topic of particular interest, with\nsupport from a supervisor. This may involve overseas fieldwork in a\ncountry chosen by the candidate.", "Eligibility", "The entry requirements consist of:", "A first class Honours degree or equivalent from an approved university.", "Good written and spoken English. For those whose first language is not English, evidence of this capacity is required. Applicants should reach at least level 6.5 in the IELTS or 580 /93 for TOEFL. Please check the University website for more information on English language requirements.", "Applicants must be African nationals domiciled (or permanent residents) in an African country. Preference will be given to scholarship candidates living in Sub-Saharan Africa.", "Application process", "Applications must be received through the University ", "online application system", ", by ", "19 May 2019", ". In addition to the usual documents to be submitted, applicants should also upload a 500 word statement and CV. ", "This statement should set out why the applicant is the best candidate for the scholarship. Applicants must then send an email to Mrs Debra Beard (", "[email protected]", ") informing her of their wish to be considered for the Mo Ibrahim Scholarship and their ID number. Please include ‘Mo Ibrahim Scholarship’ in the subject line of the email.", "The scholarship", "The scholarship includes:", "1. Full tuition fee", "2. Air fare to and from the United Kingdom and visa", "3. Monthly stipend of £950 for 18 months", "4. Arrival allowance of £950", "The remaining six months for the internship will be funded directly to the successful candidate by the Mo Ibrahim Foundation.", "For More Information:", "Visit the Official Webpage of the Mo Ibrahim Foundation 2019/2020 Masters Scholarships"], "url : https://www.opportunitiesforafricans.com/mo-ibrahim-foundation-2019-2020-masters-scholarships-in-governance-and-state-building/"], [["UNESCO Institute for Lifelong Learning (UIL) CONFINTEA Research Scholarships 2019", "date announced:April 22, 2019", "Application Deadline: 30th April 2019"], ["Application Deadline: 30th April 2019", "In 2012, ", "the UNESCO Institute for Lifelong Learning (UIL)", " launched a new initiative offering scholarships to researchers and education professionals from UNESCO Member States. Research Scholarships generally run every September, though under special circumstances, Scholarships may run in other months. Research Scholars conduct their research at the UIL Library for a period of one month. In addition, they have the opportunity to exchange knowledge with other scholars, UIL staff and UIL’s external partners. UIL covers travel and accommodation costs and contributes a lump sum towards the costs of food, visas, etc.", "Since the UIL Research Scholarship programme was launched in 2012, a total of 52 scholars have taken part.", "Research Scholarships are funded by private donations. To date, donations have been kindly made by:", "the British educationalist Peter Jarvis and his publisher Taylor & Francis;", "the Nomura Centre for Lifelong Integrated Education in Japan; and", "the US educationalist Alexander Charters", "Requirements:", "Researchers and education professionals from UNESCO Member States who\nwork in the area of lifelong learning with a focus on adult education\nand continuing education, literacy and non-formal basic education.", "Participants are selected on the basis of their potential to produce:", "policy proposals;", "programme tools;", "articles; and", "research papers", "that can be shared with decision-makers in their home countries.", "How to apply for a Research Scholarship", "In order to apply, please submit the following:", "A cover letter", "Your research proposal (2–4 pages)", "A concise and up-to-date CV", "Interested candidates are asked to submit their application by ", "30 April 2019", " to UIL Research Scholarship Coordinator Ms Lisa Krolak, at: ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the UIL CONFINTEA Research Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/unesco-institute-for-lifelong-learning-uil-confintea-research-scholarships-2019/"], [["South African-German Centre for Development Research (SA-GER CDR) Master & PhD scholarships 2019/2020 (Funded)", "date announced:April 20, 2019", "Application Deadline: 30 November 2019"], ["Application Deadline: 30 November 2019", "For applicants from Sub-Saharan African countries with an excellent academic record the DRD offers a limited number of", " DAAD merit scholarships", " per year.", "Scholarships are available for ", "full-time", " students of", "the ", "MA in Development Studies", "the ", "Master in Public Administration", "the ", "MA in Development Management", " (Bochum Programme, next deadline 30 November 2019)", " the different PhD options at the centre (", "PhD UWC)", " ", "Requirements:", "Scholarship applicants are adviced to carefully read about the specific entry requirements and course application procedure of the programme of their choice. The information is available from the respective ", "programmes sections", ". In addition to programme requirements, all applicants have to meet the following requirements:", "Applicants should be from Sub-Sahara Africa", "Applicants should have an outstanding academic record – at least 70% for your last degree", "Applicants should apply within 6 years of having completed their previous degree", "The study must have been completed at an internationally recognised university", "The previous degree (Baccalaureus or Master) should have been an academic discipline which is related to Development Studies or Public Administration", "South African students are required to have an honours degree in order to be admitted to a Masters degree course. Other students need the equivalent of a 4 year undergraduate degree", "Applicants must provide evidence of proficiency in English, both written and spoken. This can be TOEFL test or a similar standard test or a letter from an academic institution", "Work and/or voluntary experience in your field of interest would be a recommendation", "Women are encouraged to apply", "South African students are encouraged to apply", "Applicants must be able to study fulltime at the UWC for the required period.", "Benefit", "Scholarships include monthly allowances of 650 Euro plus travel allowances for Master candidates and 900 Euro plus travel allowances for PhD candidates. Tuition and registration fees are covered by the Scholarship Programme. ", "Scholarship application procedure for ", "MA in Development Studies", "Master in Public Administration", "PhD options at the CDR", "For the MADM please refer to the “", "How to apply", "” section of the Bochum programme or the ", "course homepage", ".", "You will have to fill in an ", "electronic application form (ONLY AVAILABLE FROM mid APRIL to 15th July during open Calls)", "!\nApplications not using this e-form can´t be considered! As the e-form\ncan only be submitted once, please make sure that your application is\ncomplete before submitting it!", "Documents that have to be uploaded when using the e-form are:", "a letter of application", "a CV: Please use the europass CV form available at ", "https://europass.cedefop.europa.eu/en/home", "an academic transcript from your last university", "certified copies of all academic certificates", "MA applicants will have to write a one page paper about 1 of 3\ndifferent topics, available in the “How to apply” section of each Master\nProgramme1 ", "PhD applicants don´t write an essay, but are asked to submit a 5\npage proposal on the research they would want to undertake for the\nthesis. This should include their research question, the research\nmethodology and a (provisional) theoretical framework. A list of topics\nis given in the ", "PhD section", ".", "Additional one signed reference\n(academic) (and one professional if applicable) have to be uploaded to\nthe e-form. Only if referees don´t want you to submit the reference\nyourself, the reference can be send by the referee directly to ", "[email protected]", ", indicating the applicant’s name!", "\nCandidates for the Masters Programme in Public Administration (MPA),\nthe MA in Development Studies as well as PhD candidates in the fields of\nGovernance, Public Policy, Public Management or Development Studies can\nsubmit their scholarship application without needing to apply for\nadmission at UWC. If they are awarded a scholarship, or if they intend\nto finance themselves, they may apply for admission through the online\napplication procedure (", "www.uwc.ac.za", ").\n", "We are unfortunately not able to engage in extended correspondence with applicants.", "For applicants of the MPA, the MA in Development Studies as well as PhD candidates there are no open Calls in 2018.", "For additional information on the courses or on registration please write to:\n", "[email protected]", " for the MA and M Econ or PhD in Development Studies and to", "[email protected]", " on the MPA course or an PhD in Public Administration or Governance.", "Britta Niklas", " for the Master of Arts in Development Management (Bochum Programme)", "For More Information:", "Visit the Official Webpage of the SA-GER CDR Master & PhD scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/south-african-german-centre-for-development-research-sa-ger-cdr-master-phd-scholarships-2019-2020/"], [["DAAD Helmut-Schmidt-Programme Master’s Scholarships for Public Policy and Good Governance 2020 for Study in Germany (Fully Funded)", "date announced:April 29, 2019", "Application Deadline: July 31st 2019"], ["Application Deadline: July 31st 2019", " Since 2009, the ", "DAAD Helmut-Schmidt-Programme", " ", "(known as Public Policy and Good Governance) is supporting future leaders from Africa, Central and Latin America, Asia, from countries in the Middle East as well as from the Ukraine (see list of countries), who want to promote democracy and social justice in their home countries. ", "The programme, which is funded by the German Federal Foreign Office, offers the chance to acquire a Master’s degree in Master programmes of particular relevance for the social, political and economic development in the students’ countries of origin. In the light of the principles of Good Governance, highly qualified graduates with a first academic degree are being educated in political science, law, economics and administration and prepared for future leading positions in their home countries.", "Requirements:", " The scholarship programme is open to graduates in the field of social sciences, political sciences, law, economics and in public administration from Africa, Central and Latin America, Asia, from countries in the Middle East as well as from the Ukraine", " The programme is open for very well qualified graduates with a first university degree (bachelor or equivalent) who want to actively contribute to the social and economic development of their home countries. It is offered both for young graduates without professional experience and for mid-career professionals. ", "Benefits:", " Scholarship of monthly 850 € for selected MA programmes at German institutions of higher education listed below. ", "The study programmes are usually starting in Sep/Oct 2020 and are taught in German and/or English. ", "contributions to health insurance in Germany ", "appropriate travel allowancestudy and research subsidy", "monthly rent subsidy where applicable, allowances for spouses and/or children where applicable. ", "6-months-German language course from April 2020 to September 2020. The language course takes place at selected institutes in Germany and usually not at the universities of the selected MA programmes. The language course is compulsory also for those who attend a master ́s course taught in English ", "For More Information:", "Visit the Official Webpage of the DAAD Helmut-Schmidt-Programme (Master’s Scholarships for Public Policy and Good Governance 2019/2020"], "url : https://www.opportunitiesforafricans.com/daad-helmut-schmidt-programme-masters-scholarships-for-public-policy-and-good-governance-2020-for-study-in-germany-fully-funded/"], [["Pop-Kultur 2019 Goethe Institut Talents Scholarship for Music Professionals (Fully Funded to Berlin, Germany)", "date announced:April 15, 2019", "Application Deadline: April 17th 2019"], ["Application Deadline: April 17th 2019", "Are you a young musician, DJ, composer, singer-songwriter, instrumentalist between 20 and 30 years old from a transition or developing country? You want to work professionally in the music field, with your own label or with a booking agency or want to use your music more target-oriented? If you have made first experiences in your field already,", " ", "Goethe Talents Scholarship", " will help you to reach the next level.", "Pop-Kultur Festival in cooperation with the Goethe-Institut offers\nactivities to experience the Music City Berlin in the run-up to the\nFestival: Studio visits, jam-sessions, short traineeships in selected\ncompanies of the Berlin creative industries, listening sessions and\nmeetings with scholarship holders of Musicboard Berlin GmbH, as well as\nmany other activities, such as visiting concerts will be taking place\nduring the week before Pop-Kultur. Networking will be a big part of the\nexperience.", "You will also be joining the ", "Pop-Kultur Nachwuchs", " programme which is going down from August 21st to August 23rd in a couple of locations at Kulturbrauerei Berlin. International professionals give personal insights into their work and share their expert knowledge through workshops, case studies and talks with you – lively and practical instead of dry and read off.", " Once more the programme offers spots to talents from all over the world. Hence, you’ll be able to network across borders. You will also get a chance to perform on the Nachwuchs-Stage on one of the evenings in the Pop-Kultur Live programme.", "In summer 2020, one of the Goethe 2019 alumni will get the chance to return to Berlin for a month-long Goethe residency. The aim of the residency is to support artistic and cultural exchange through the creation a new piece of music in collaboration with a Berlin-based artist, which will then be presented in the official live programme of Pop-Kultur 2020.", "Requirements:", "Every participant should prepare a ", "short input talk", "\n(approx. 10 min.) in advance about his/her experience in the music field\nthus far and about the music scene in his/her respective country.", "Advanced English skills", " are crucial as there is no translation available. You will be tested in advance by the local Goethe-Institut.", "You need ", "work experience in the field of music", ". We need proof of at least 3 projects.", "You have to ", "cover all additional expenses", " that might occur during your stay.", "All applications are for a one person. No accompanying persons can be sponsored or included in the programme.", "If you ", "do not board your booked flight", " or ", "cancel the programme", " on short notice, you are obliged to ", "reimburse the Goethe-Insititut and the Musicboard for any expenses accrued.", "Benefits:", "The ", "participation fee, accommodation, travel expenses, hospitality", " (per diem of 10 €) ", "will be covered", " by the Goethe-Institut for the period of ", "August 13th to August 24th, 2019", ". The Goethe-Institut will also ", "book and pay for flights", " and will ", "help with visa issues", ". Additionally, the Musicboard will give the talents a ", "Festival Ticket free of charge", " plus access to ", "Pop-Kultur’s networking area", " for professionals, organize accommodation (breakfast included), cover ", "health insurance", " and ", "public transportation in Berlin", ".", "For More Information:", "Visit the Official Webpage of the Pop-Kultur 2019 Goethe Institut Talents Scholarship"], "url : https://www.opportunitiesforafricans.com/pop-kultur-2019-goethe-institut-talents-scholarship-2019/"], [["Italian government Scholarships Bachelors, Masters & PhD Scholarships 2019/2020 for study in Italy ( 900 Euros per month)", "date announced:April 30, 2019", "Application Deadline: May 30th, 2019, 2 p.m. C.E.T."], ["Application Deadline: ", "May 30", "th", ", 2019, 2 p.m. C.E.T.", "The ", "Ministry of Foreign Affairs and International Cooperation ", "(", "MAECI", ") offers ", "grants ", "in favor of ", "foreign citizens not residing in Italy* and Italian citizens living abroad (IRE)** ", "for the ", "academic year 2019-2020", " in order to foster international cultural, scientific and technological cooperation, to promote Italian language and culture and to support Italy’s economic system in the world (According to Law 288/55 and its subsequent changes and additions).", "The grants are only available to attend academic courses in Italy.", "RANTS OPPORTUNITIES", "1.1 Master’s Degree (Laurea Magistrale 2° ciclo)", "Grants for Master’s Degree courses are awarded for a ", "period of study of 6 (six) or 9 (nine) months", ".", "Admission to the first year of a Master’s Degree course in Italy\nrequires the completion of a Bachelor’s degree in the applicants’\ncountry of origin; admission to the second year is granted to applicants\nupon evidence to be on track with their first year studies.", "1.2 Courses of Higher Education in Arts, Music, and Dance (AFAM) ", "Grants for Courses of Higher Education in Arts, Music, and Dance (AFAM) are awarded for ", "a period of study of 6 (six) or 9 (nine) months.", "To be admitted to an Italian AFAM Institute, applicants need to meet\nthe entry requirements and academic qualifications established by the\nrelevant University/Institute.", "1.3 PhD program", "Grants for a PhD program are awarded for a ", "period of study of 6 (six) or 9 (nine) months.", "To be admitted to a PhD in Italy, applicants need to meet the entry\nrequirements and academic qualifications established by the University;\nthey are also required to provide a letter of acceptance on behalf of\nthe relevantItalian University.", "1.4 Research under academic supervision (Progetti in co-tutela)", "Grants for a research under academic supervision are awarded for a ", "period of study of 6 (six) or 9 (nine) months.", "This type of grants can be awarded to research projects carried out\nat the Italian Research Institutions (i.e Italian Research Council –\nCNR, Italian National Institute of Health – ISS, Italian National\nInstitute for Nuclear Physics – INFN, Italian National Institute for\nAstrophysics – INAF, The Italian Institute for Environmental Protection\nand Research – ISPRA) under the academic supervision of public\nUniversities or Museums and Archives.", "Applicants must submit a research project and the letter of admission\non behalf of the host University/Institute; they are also required to\nprovide the name and contacts (e-mail address) of their supervisors.", "Note: Admission to some Master’s Degree courses or AFAM Institutes\nrequires an admission test. Please refer to the relevant\nUniversity/AFAM Institute to check whether an admission test is\nrequired. ", "1.5 Italian Language and Culture Courses ", "Grants for Italian language and culture courses are awarded exclusively for a period of ", "3 (three) months", " to students currently attending an Italian course at a Universityor at an Italian Cultural Institute.", "Applicants must provide a certificate of their proficiency in Italian language. The minimum level required is A2 within the Common European Framework of Reference for Languages (CEFR):", "ELIGIBILITY", "Applicants who will meet the following requirements by the deadline of this call (May 30", "th", ", 2019, 2 p.m. C.E.T.) may apply for a grant.", "2.1 Academic qualifications", "Applications must only be submitted by foreign students not residing\nin Italy* and by Italian citizens living abroad (IRE)** holding an ", "appropriate academic qualification required to enroll to the Italian University/Institute", " (more information on: ", "https://studyinitaly.esteri.it/en/Recognition-of-qualification", " ).", "2.2 Age requirements", "Applicants for Master’s Degree/Higher Education in Arts, Music, and\nDance (AFAM) Programmes/ Italian Language and Culture Courses should not\nbe over ", "28 years old", " by the deadline of this call (May 30th, 2019), with the sole exception of renewals.", "Applicants for ", "PhD Programmes", " should not be over ", "30 years old", " by the deadline of this call (May 30th, 2019), with the sole exception of renewals.", "Applicants for ", "Research Projects under academic supervision ", "should not be over", " 40 years old", " by the deadline of this call (May 30th, 2019).", "2.3 Language proficiency", "2.3.1 Italian-taught courses", "In order to enroll in an Italian-taught course, applicants must provide a certificate of their proficiency in Italian language. ", "The minimum level required is B2 within the Common European Framework of Reference for Languages (CEFR):", "(", "https://www.linguaitaliana.esteri.it/data/lingua/corsi/pdf/tabella_certificazioni.pdf", ").", "Candidates who were enrolled in Italian course at the University may\nsubmit a language certification issued by a language teacher of the\nUniversity department.", "2.3.2 English-taught courses", "In this case applicants must provide a language certificate of their proficiency in English Language. ", "The minimum level required is B2 within the Common European Framework of Reference for Languages (CEFR)", ".", "Proof of proficiency in Italian is not required for courses entirely taught in English. ", "Self-certification may be valid for candidates from countries where\nEnglish is an official language and who are applying for courses held\nentirely in English.", "2.3.3 Italian language and culture courses", "For Italian language and culture courses", ", applicants must provide a certificate of their proficiency in Italian language.", " The minimum level required is A2 within the Common European Framework of Reference for Languages (CEFR):", "(", "https://www.linguaitaliana.esteri.it/data/lingua/corsi/pdf/tabella_certificazioni.pdf", ").", "Candidates who were enrolled in Italian course at the University may submit a language certification issued by a language teacher of the University department.", "Benefits:", "TUITION FEES", "Grantees may be exempted from the payment of enrollment and tuition fees depending on the policy of each University.", "Exemptions are not granted for courses in Italian language and culture, for which enrollment fees are due.", "TERMS OF GRANT", "Grantees will receive a ", "900 Euros monthly allowance", " on a quarterly basis, which will be paid on their Italian bank account.", "The first installment of the grant can be received only after the\ncompletion of University enrollment and the submission of all the\ndocuments requested according to the necessary administrative\nprocedures.", "The MAECI will begin the disbursment procedures at the end of each\nquarter. Individual payments will therefore commence after that period.", "The last installment of the grant will be paid only upon verification of satisfactory academic progress.", "Art. 9", "HEALTH AND MEDICAL INSURANCE", "Grantees will be covered by a health and medical/accident insurance contracted by MAECI for the entire duration of the grant.", "Insurance coverage will not apply to events derived from pre-existing physical and pathological conditions.", "FUNDING PERIOD", "Grants are awarded for a period of study from", " January 1", "st", ", 2020", " to ", "October 31", "st", ", 2020", ".", "For renewals only, grants may be awarded for a period of study from ", "November 1", "st", ", 2019 ", "to ", "October 31", "st", " 2020.", "SUBMISSION OF APPLICATIONS", "Applicants must complete and submit the online application form available upon registration", " ", "at the following link: ", "\nhttps://studyinitaly.esteri.it\n", "Click ", "here", " to access the registration form", "We recommend choosing a frequently used email address; subsequent communications will be sent to the chosen address.", "Applications must be submitted by 2 pm C.E.T. May 30", "th", ", 2019.", "Applications submitted after the deadline will not be considered. ", "For More Information:", "Visit the Official Webpage of the Italian government Scholarships "], "url : https://www.opportunitiesforafricans.com/italian-government-scholarships-bachelors-masters-phd-scholarships-2019-2020/"]]