[[["IBFD Centre for Studies in African Taxation (CSAT) Scholarships 2018 (Full Tuition for Advanced Master’s in International Tax Law & Six-month internship with IBFD in Amsterdam, The Netherlands)", "date announced:January 22, 2018", "Application Procedure:"], ["Once a year, IBFD awards a scholarship through its ", "Centre for Studies in African Taxation (CSAT)", ". CSAT is an integral part of IBFD, an independent not-for-profit foundation that provides high-quality information and education on international taxation. Open to employees of African tax authorities, the ", "CSAT Scholarship", " is based in Amsterdam, the Netherlands.", "Established in 2015, CSAT is a fully autonomous think tank dedicated to the study and development of African taxation.In 1938, the ", "International Bureau of Fiscal Documentation (IBFD),", " was established as a small centre staffed by 4 researchers. The purpose of this bureau was to supply information concerning (the application of) tax law and to stimulate the development of tax science. From that day, IBFD has steadily grown into what it is today: the world’s foremost authority on cross-border taxation.", "Requirements for the CSAT Scholarship", "Employees of an African tax authority, meeting all of the following criteria, may apply for the scholarship. The candidate:", "Has been an employee of a tax authority for at least three years", "Has a university degree in law, economics or business administration and a proven interest in tax law", "Is proficient in the English language", "Is willing to actively participate in the classroom", "Has an open mind towards different cultures", "How the CSAT Scholarship is awarded", "The following factors are taken into consideration in awarding the scholarship", "A letter from the employer confirming the employment status and that the applicant will return after completion of the scholarship", "Grades obtained by the applicant in his or her first degree", "Whether the applicant has demonstrated international mobility by pursuing a joint university study programme or has previously been granted an award to study outside his or her home country", "Whether the applicant has published articles related to tax law in an academic journal and the quality of those articles", "Other academic achievements", "Benefits:", "Within this framework, the CSAT Scholarship annually offers the following package to the most promising employee from an African tax authority:", "Full tuition fees for the", " UvA-IBFD Advanced Master’s in International Tax Law (LLM programme)", "A six-month internship at", " IBFD’s headquarters in Amsterdam", " upon completion of the LLM", "A monthly stipend for living expenses for the duration of the scholarship", "About the IBFD internship", "Upon successful completion of the LLM programme, the scholarship will then progress with a six-month internship at IBFD’s headquarters, also based in Amsterdam. Here you will work with, and continue to learn from, our core team of nearly 200 experts from over 40 countries.", "This core team liaises daily with a global network of authors and correspondents to maintain IBFD’s position as the pre-eminent authority on cross-border taxation. Throughout the duration of the CSAT Scholarship, the successful candidate will also receive a small monthly stipend towards living expenses.", "Application Procedure:", "The LLM programme starts in September every year and applications must be received by 1 April of the same year. The application process has the following steps:", "1. The candidate applies for the LLM (see link below)", "2. The candidate pays the LLM application fee (approximately EUR 125)", "3. The candidate sends all required documents to the LLM student services (see link below)", "4. When sending the above-mentioned documents, the candidate should include a motivation letter for the scholarship, together with a 2,000-word essay on the challenges and opportunities for African taxation", "5. The University of Amsterdam will first assess the candidate’s credentials and determine his or her eligibility for the LLM", "6. If the candidate is eligible, the application will be forwarded to the CSAT Scholarship", "committee", "7. All forwarded applications will be considered in accordance with the factors detailed under", "How the CSAT Scholarship is awarded", "8. A decision will be made and communicated to all forwarded candidates", "For More Information:", "Visit the Official Webpage of the IBFD Centre for Studies in African Taxation (CSAT) Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/ibfd-centre-for-studies-in-african-taxation-csat-scholarships-2018/"], [["Abel Visiting Scholar Program 2018/2019 for Mathematicians from Developing Countries (Fully Funded & USD 5,000/Grantee)", "date announced:February 12, 2018", "Application Deadline: April 1st, 2018"], ["Application Deadline: April 1st, 2018", "The ", "Niels Henrik Abel Board ", "and the International Mathematical Union invite applications from mathematicians professionally based in developing countries to visit an international research collaborator ", "for a period of one month.", "In case the length of the visit exceeds one month, the candidate should provide evidence of financial support from the host institution to cover the living expenses beyond the first month.", "The program is designed for post doctoral mathematicians in the early stages of their professional careers. It is designed to offer the opportunity for a ‘research sabbatical,’ a necessary complement to teaching and other academic duties for mathematicians desiring to also sustain a viable research program.", "The Abel Visiting Scholar Program is fully funded by fund IMU – CDC received from the Abel Board.", "Requirements", "Applicants must", "1.   hold at the time of application a PhD ", "in Mathematics", ",", "2.   be based in ", "a developing country", " at the time of application", "3.   ", "hold a position in a university/ research institution", "4.   be in the ", "early stages of their professional careers", ", more precisely: the applicants  should", "4. 1) not yet be of full professorial rank but have a working contract in a university/ college", "4. 2) be under 40 years of age at the day of the application deadline.", "The maximum age may be increased by up to three years in the case of an individual with a broken career pattern", ". This should be noted in the application together with the reason for the broken career pattern.", "Applications from women mathematicians are strongly encouraged.", "Benefits:", "Financial Support", "The grant can cover ", "for one month and only for the applicant:", "travel costs to the host institution (economy flight or equivalent) ", "Please note that the flight will be booked and directly paid by the IMU Secretariat.", "accommodation expenses (monthly rent should not exceed 1,200 USD – in case you expect higher accommodation cost, please explain in your application the expected higher cost)", "travel health insurance", "Basic living cost  (daily allowance based on living cost of the visiting country/city, This amount includes the cost for public transport and all other living costs). ", "For a list please go here.", "visa costs", "The total maximum amount is 5,000 USD per grantee.", "Family expenses and any other costs cannot be covered.", "The grant is paid in two installments:", "First payment for accommodation in the host country, travel insurance, 50% of the living cost and visa ", "before", " departure.", "Second payment for the remaining living costs and transport to the airport ", "after", " the visit", " (excluding living costs). ", "The activity and financial report, pictures and all invoices must be send to the IMU Secretariat before the second payment can be initiated.", "Application Procedure:", "Each application must include:", "The completed ", "Online Application Form", "A curriculum vitae including a list of recent publications", "A research plan for the visit", "An official invitation from the institution of the international research partner", "One letter of recommendation ", "If the letter of recommendation is not written by the international research partner (the host), the application should include a statement from the host approving the research plan.", "A copy of the PhD certificate", "A statement about the current employment status/ position in the home institution signed and stamped by your employer. The statement should include the duration of your employment", "A budget estimation. Please, use the ", "Tentative Budget Form", ". (for more information see ‘Financial Support’)", "In case you are planning to stay for more than one month you must attached a proof of the matching funds for your living costs from the host institution", "Please submit", " ", "the completed ", "bank information", " ", "form", " ", "in order to receive your funds.", "Please merge all required documents into one (1) PDF file.", "For More Information:", "Visit the Official Webpage of the Abel Visiting Scholar Program 2018/2019"], "url : https://www.opportunitiesforafricans.com/abel-visiting-scholar-program-2017-2018-for-mathematicians-from-developing-countries/"], [["Bilateral Education Agreement (BEA) Scholarship Awards 2018/2019 for Nigerians to Study Abroad (funded)", "date announced:January 31, 2018", "Application Deadline:  15th February, 2018"], ["Application Deadline:  15th February, 2018", "The Honourable Minister of Education (HME), Mallam Adamu Adamu,", " hereby invites interested and qualified Nigerians to participate in the 2018/2019 Nomination Interview fo", "r ", "Bilateral Education Agreement (BEA) Scholarship Award", " for:", "i) Undergraduate (UG) studies tenable in Russia, Morocco,Algeria, Serbia, Hungary,Egypt,", "Tunisia, Turkey,Cuba, Romania, Ukraine, Japan,Macedonia; and", "ii) Postgraduate (PG) studies tenable in Russia (for those whose first degrees were obtained from Russia), China, Hungary, Serbia, Turkey, Japan, Mexico, South Korea, e.t.c", "All qualified candidates are advised to:", "a. Visit Federal Ministry of Education’s website www.education.gov.ng and click on READ MORE", "on Federal Scholarship Board ICON on the Home Page:.", "b. Read Guidelines and then Complete the Application Form online", "c. Print the completed Application Form", "d. Submit two sets of the Printed Application Forms at the venue of the interview as scheduled below FIELDS OF STUDY", "a. Undergraduate level- Engineering, Geology, Agriculture, Sciences, Mathematics,", "Languages, Environmental Sciences, Sports, Law, Social Sciences, Biotechnology, Architecture,", "Medicine (very limited), etc; and", "b. Postgraduate level (Masters Degree and Ph.D) in all fields", "UNDERGRADUATE SCHOLARSHIPS:", "All applicants for undergraduate degree courses must possess a minimum qualification of Five (5) Distinctions (As & Bs) in the Senior Secoundary School Certificates, WAEC (May/June) only in the subjects relevant to their fields of study including English Language and Mathematics.", "Certificates should not be more than Two (2) years old (2016 & 2017).", "Age limit is from 18 to 20 years.", "POSTGRADUATE SCHOLARSHIPS:", "All applicants for Undergraduate degree courses must hold a First Degree with at least 2nd Class Upper Division. The applicants who are previous recipients of Foreign Awards must have completed at least two (2) years post qualification or employment practice in Nigeria.", "All applicants must have completed N.Y.S.C. Age limit is 35 years for Masters and 40 years for Ph.D. and only:", "i) N.Y.S.C discharge or exemption certificates only are accepted;", "ii) Evidence of readiness to be released by employer.", "NOTE ( For all Applicants):", "i) Since the BEA countries are non-English speaking, applicants should be prepared to undertake a mandatory one year foreign Language course of the country of choice which will be the standard medium of instruction; and", "ii) All applicants for Hungarian Scholarships must visit the website: www.stipendumhungaricum.hu before 15th February, 2018.", "• Complete the application form online", "• Print the completed form and bring to the interview venue in addition to 2.0 above.", "VENUE OF INTERVIEW:", "All eligible applicants are to report for interview at the venues scheduled for their respective", "Zones of origin for proper identification.", "Two sets of completed application forms should be submitted at the various interview centres with the following attachments:", "Two sets of Photocopies of Educational Certificates and", "Testimonials of previous schools attended with the originals for sighting;", "ii. Only one certificate is accepted i.e WAEC of May/June for Undergraduate applicants;", "iii. Two copies of Birth Certificate from National Population Commission;", "iv. State of origin/LGA certificate duly signed, stamped and dated;", "v. Four (4) coloured passport sized photographs on white background; and", "vi. Postgraduate applicatns will be required to submit Academic transcripts and NYSC discharge or Excemption certificates only.", "NB: Candidates nominated by the Board will be required to submit to Federal Scholarship Board the following:", "i) Authenticated copies of academic certificates;", "ii) Data page of current International passport; and", "iii) Specified Medical Reports from Government hospitals.", "iv) Police Clearance Certificate where necessary.", "TIME : 9.00 A.M DAILY", "For More Information:", "Visit the Official Webpage of the Bilateral Education Agreement (BEA) Scholarship Awards 2018/2019 "], "url : https://www.opportunitiesforafricans.com/bilateral-education-agreement-bea-scholarship-awards-2018-2019-for-nigerians-to-study-abroad-funded/"], [["Sasol Undergraduate/Postgraduate Bursary Scheme Programme 2019 for Young South Africans (Fully Funded)", "date announced:February 6, 2018", "Application Deadline: April 30th 2018"], ["Application Deadline: April 30th 2018", "The Sasol Bursary Programme", " offers bursaries on the basis of a service-binding (work back obligation after graduation) contract.", "Grade 12 learners must have achieved the following marks in:", "BEng and BSc", "Required subjects", "Old curriculum Symbols", "New curriculum Mark", "Maths", "HG A", "7", "Science", "HG B", "6", "English", "HG C", "5", " ", "B Com Degrees", "Required subjects", "Old curriculum Symbols", "New curriculum Mark", "Maths", "HG C", "5", "English", "HG C", "5", " ", "What criteria must I meet to be able to apply for a bursary?", "All individuals ", "writing matric after 2007 ", "must meet the following criteria:", "Applicants must be South African citizens with a valid ID number.", "A minimum of a Level 4 for English First Language or a Level 5 for English Second Language in Grade 11.", "A minimum of a level 7 for Mathematics and a minimum of a level 6 in Physical Science in Grade 11 if you are applying for a bursary in one of the ", "Engineering", " or ", "Science", " fields.", "A minimum of a level 6 in Mathematics if applying for a ", "B com Accounting/ Business Science ( CA route) ", "fields.", "A minimum of a level 5 in Accounting if you are applying for B Com Accounting", "Applications must be for full-time studies towards an academic degree at an accredited South African university.", "All applicants invited to attend an interview must be willing to undergo psychometric testing.", "All individuals writing matric before 2007 must meet the following criteria:", "A minimum of a D symbol for English First Language HG or a C symbol for English Second Language HG in Grade 12. (The majority of academic textbooks used at university are imported from overseas and are thus published in English).", "A minimum of an A symbol for Mathematics HG and a B symbol for Physical Science HG in Grade 12 if you are applying for a bursary in one of the engineering or science fields.", "A minimum of a C symbol for Accounting HG in Grade 12 if you are applying for B Com Accounting.", "If you are already studying towards the degree course for which you are applying for a bursary, you must have passed all courses for which you have registered at the university for the study period already completed.", "Applications must be for full-time studies towards an academic degree at an accredited South African university. No bursaries are awarded for studies at a university of technology or college.", "Applicants must be South African citizens with a valid ID number.", "All applicants invited to attend an interview must be willing to undergo psychometric testing.", "Benefits", "The Sasol bursary", " is a comprehensive bursary which includes the following:", "100% of the prescribed university tuition fees, registration fees and exam fees.", "An amount equal to the average rate for accommodation in a single room at a university residence at the university at which the Sasol bursar is studying. This rate is determined by Sasol in conjunction with the university.", "An amount for meals based on three meals per day, as determined by the university.", "An amount of approximately R12 000,00 per annum, towards book and pocket money", "Fields of Study", "Applications may be submitted for one of the following fields of study:", "Undergraduate studies:", "B Eng or BSc Engineering", "B Sc", "B Com", "Chemical", "Chemistry (Masters compulsory)", "B Com/BSc Accounting  CA Stream (CTA, PGDA compulsory)", "Mechanical", "Geology (Hons compulsory)", "Electrical", "Metallurgy (Hons compulsory)", "Civil", "Industrial", "Electronic", "Mining", "Computer", "Postgraduate studies:", "Masters and PhD bursaries in Chemistry and Engineering", "University of Technology:", "Electrical Engineering", "Process Instrumentation", "Mechanical Engineering", "Mine Surveying", "Note:", "No bursaries are awarded in fields of study not listed above. Bursaries are not necessarily awarded in each field of study every year. Applicants should submit an application based on a real interest in the field and must be a South African citizen.", "For More Information:", "\u2028Visit the Official Webpage of the Sasol Undergraduate/Postgraduate Bursary Scheme Programme 2019"], "url : https://www.opportunitiesforafricans.com/sasol-undergraduate-postgraduate-bursary-scheme-programme-2019/"], [["African Leadership University (ALU) Mandela Centennial Scholars Programme 2018 for outstanding young Africans (Fully Funded to study in ALU,Rwanda)", "date announced:February 12, 2018", "Application Deadline: 15 May 2018."], ["Application Deadline: 15 May 2018.", "African Leadership University (ALU) ", "is proud to partner with the ", "Graça Machel Trust ", "and the ", "Mandela Institute of Development Studies (MINDS) ", "to launch the Mandela Centennial Scholarship Programme, a landmark scholarship that will celebrate the 100th birthday of one of the greatest African leaders of the last century – Nelson Rolihlahla Mandela, fondly known as Madiba.", "President Mandela firmly believed in the transformative power of education and its ability to bring dignity, self-actualization, and prosperity to Africans. Throughout his presidency and after, he dedicated much of his efforts to ensure that children from all walks of life had equal access to education, regardless of their economic background.", "The objective of the ", "Mandela Centennial Scholars Programme", " is to honor President Mandela’s legacy and carry forward the important work he began in education by identifying ", "100 outstanding young Africans", " from disadvantaged backgrounds to attend ALU. These students will benefit from a scholarship and unparalleled opportunities for leadership development.", "Requirements:", "Candidates should have approval to study at ALU in Rwanda for any degree programme, and should be an African national.", "You will only be able to apply for the scholarship once you have been accepted to ALU and have been approved for study at the Rwanda campus.", "Benefits:", "The scholarship covers full tuition,  travel, housing, and a stipend to cover food and other living expenses. For Rwandans living in Kigali, it will only cover tuition fees.", "Timeline:", "15 May 2018", "\nDeadline to apply for scholarship", "July 2018", "\nPublic announcement of Scholars", "September 2018", "\nStudents begin studies at ALU in Kigali, Rwanda", "Application Process:", "Once admitted, eligible candidates can access and submit their application for the Mandela Centennial Scholarship on the ALU Admitted Student Portal.", " Candidates for the scholarship will be required to take an Artificial Intelligence admissions simulation called", " Knack,", " and submit a 500-1000 word essay for review by the scholarship committee.", "For More Information:", "Visit the Official Webpage of the ALU Mandela Centennial Scholars Programme 2018"], "url : https://www.opportunitiesforafricans.com/alu-mandela-centennial-scholars-programme-2018/"], [["Commonwealth Eye Health Consortium Masters Scholarships 2018/2019 at London School of Hygiene & Tropical Medicine, United Kingdom (Fully Funded)", "date announced:January 25, 2018", "Application Deadline 11 May, 2018"], ["Application Deadline 11 May, 2018", "The Masters in Public Health for Eye Care at the London School of Hygiene & Tropical Medicine", " ", "is a well-established course that aims to train leaders in prevention of blindness and to strengthen research and academic capacity for eye care programmes and training facilities, particularly in low- and middle-income countries. The course provides eye health professionals with the public health knowledge and skills required to reduce blindness and visual disability in their population.", "Eligibility criteria", "The applicant must:", "come from low or middle income Commonwealth countries that are less represented in the alumni body of the MSc Public health for eye care", "work in regions where there are severe constraints in human resources for eye health", "work in regions where there are no / limited training opportunities in PHEC / community eye health", "demonstrate previous involvement / commitment to community eye health activities or VISION2020 programmes", "present a clear career plan in public health for eye care, which they will realistically", "be able to follow on completion of the MSc", "have experience in public health for eye care based research and/or training in eye care", "fulfil the UK Border Agency English Language Requirement by passing the LSHTM English language requirement by 11 May, 2018", "Scholarship details", "Several scholarships are awarded each year.  Each scholarship covers the following:", "all course fees", "two return flights", "dissertation project fund", "living costs", "accommodation with food at the International Students House in Central London.", "Application Procedure:", "1.", " Apply to the London School of Hygiene & Tropical Medicine for a place on the course:", "\n– ", "For new applicants", ": LSHTM online application system is open for the 2018/19 academic year now. ", "Apply here", ".", "\n– ", "For those who have been accepted from 2017/18", ": if you applied and were accepted to the 2017/18 academic year you must have requested to “", "be deferred", "” for the 2018/19 academic year. If you do not already hold a deferred offer of admission you will need to complete a new application.", "2. To download the CEHC application, please click: ", "CEHC 2018.19 – MSc PHEC Scholarships Application.", "*Please note that only completed applications will be moved forward for review.", "For More Information:", "Visit the Official Webpage of the 2018 Masters in Public Health for Eye Care at the London School of Hygiene & Tropical Medicine"], "url : https://www.opportunitiesforafricans.com/commonwealth-eye-health-consortium-masters-scholarships-2018-2019/"], [["EADB Math, Science, Technology and Engineering University Scholarship Program 2018/2019 (Fully Funded Study in the USA)", "date announced:February 3, 2018", "Application Deadline: March 7th, 2018. "], ["Application Deadline: ", "March 7th, 2018. ", "The East African Development Bank", " and the ", "Africa-America Institute", " are pleased to announce that applications are now being accepted for the ", "2018-2019 EADB Math, Science, Technology and Engineering University Scholarship Program.", "In partnership with the Africa-America Institute (AAI), the East African Development Bank (EADB) launched the ", "EADB Math, Science, Technology and Engineering University Scholarship Program ", "in 2015 to support the capacity of regional faculty teaching in fields (science, technology, engineering and math) which are critical to local employment and the growth of national economies. The fast-track, 12 month scholarships provide experienced teachers and lecturers from EADB member countries (Kenya, Tanzania, Rwanda and Uganda) to earn a Masters’ degree in science, technology, engineering and Math (STEM) at Rutgers University in New Jersey, USA.", "Since 2015, eight students have received this full scholarship to pursue a graduate degree at Rutgers University. As alumni, they have returned to their respective countries and are contributing towards building a skilled workforce in STEM fields in East Africa.", "Eligibility:", "To be eligible for this prestigious scholarship, you must meet the following requirements:", "Be a citizen of one of the following countries: ", "Kenya, Tanzania, Rwanda and Uganda", "A university graduate with a bachelor’s degree with first class/upper second honors in mathematics, sciences or engineering", "Have at least three (3) years of teaching experience in a STEM related field at a public institution in East Africa;", "Currently working full-time in public, government-owned educational institutions", "Committed to returning to their home country, to teach in a public government owned institution which is a mandatory requirement.", "Diligent in successfully completing the application process by the allotted deadlines at Rutgers University", "The following Master’s Degrees are eligible under the EADB-AAI STEM Graduate Program:", "Math Education:", "https://gse.rutgers.edu/academic-programs/edm-programs/mathematics-education", "Science Education: ", " ", "https://gse.rutgers.edu/academic-programs/edm-programs/science-education", "Cell and Developmental Biology(MS)    ", "https://grad.admissions.rutgers.edu/GraduateProgram/Detail.aspx?code=16148&degr ee=MS", "Chemical and Biochemical Engineering (ME)    ", "https://grad.admissions.rutgers.edu/GraduateProgram/Detail.aspx?code=16155&degree=ME", "Industrial and Systems Engineering (MS)     ", " ", "https://grad.admissions.rutgers.edu/GraduateProgram/Detail.aspx?code=16540&degree=MS", "Application Requirements:", "Phase 1: Due March 7 ", "A copy of your Bachelors degree", "Transcripts of your grades", "A completed application form ", "(the Application Form can be downloaded here)", "A copy of your valid Passport", "A copy of your GRE scores**** ", "(due in phase 2 with your application to Rutgers University, April 1)", "One-page essay on how you imagine the masters level education would advance your own career; and how you would then make a positive impact in advancing STEM skills development in your home country; also specify why you should be added to the pool of the applicants to apply to Rutgers University?", "Letter of support from your employer committing to employ you on completion of studies ", "and", " confirming that your role is currently that of a ", "teacher or lecturer in the STEM field", ".", "Please ensure that you have all required documents to us by March 7", "All applicants invited to move to Phase 2 will be informed, via email, by March 14, 2018.", "Phase 2: Due April 1", "Selected students are invited to apply to Rutgers University in one of the selected graduate programs. It is important to note that only those who have been selected from Phase 1 are invited to apply to Rutgers University.", "Rutgers University requires applications to take the General GRE as part of their application process. Please refer below to specific information regarding the GRE. The result are due as part of your application to Rutgers University, by April 1.", " ", "Important Information about the GRE test dates", "If selected, each applicant is responsible for submitting his/her GRE scores to Rutgers University by April 1. Please note that AAI does not cover the fee for the test.", "To find out more information about the available dates and the test centres in your country, please go to the following link ", "https://ereg.ets.org/ereg/public/workflowmanager/workflow?workflowItemId=tcAvailability", "Due to limited availability for the GRE, we suggest you reserve your seats as soon as possible. the fee to take the GRE is $205 which is covered by the applicant. As you book your test dates, please note that it generally takes 10-14 days to receive your GRE results.", "Send your application to ", "[email protected]", ", with the above information.", "All submissions must be in Microsoft Word or PDF format.", " Terms and conditions apply. Application deadline is", " March 7, 2018", "For More Information:", "Visit the Official Webpage of the East African Development Bank Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/eadb-math-science-technology-and-engineering-university-scholarship-program-2018-2019/"], [["Scholarships to study online at University of South Wales", "date announced:January 31, 2018", "Application Deadline: October 22, 2018"], ["Application Deadline: ", "October 22, 2018", "The University of South Wales is a major player in UK higher education. The University is renowned for its partnerships with major employers all over the world. The university has partnered with UNICAF to offer you scholarships for a variety of courses.", "You can ", "take the Sqore challenge", " and win a scholarship of up to 50% to study one of the online Bachelors or Masters programmes at Unicaf University:", "BA (HONS) – Business Studies (Top-up degree)", "MBA – Master of Business Administration", "MA Education (Innovation in Learning and Teaching)", "MSc in Psychology", "LLM (Master of Laws)", "MSc in Public Health", "Take the Sqore challenge now for a chance to win a scholarship.", " All you need to do is: take a short quiz and fill in your details!", " ", "For More Information:", "Visit the Official Webpage of the UNICAF Scholarship Programme Online studies at University of South Wales"], "url : https://www.opportunitiesforafricans.com/unicaf-scholarship-programme-online-studies-at-university-of-south-wales/"], [["UNFPA International Training on Strategic partnership with Muslim Religious Leaders in Family Planning, Yogyakarta, Indonesia (Funded)", "date announced:January 30, 2018", "Application Deadline: 5th March, 2018"], ["Application Deadline: ", "5th March, 2018", "The Government of Indonesia under the framework of the ", "South-South and Triangular Cooperation programme,", " with technical assistance from UNFPA, will host a training session on “", "Strategic Partnerships with Muslim Religious Leaders in Family Planning”, in Yogyakarta, Indonesia,", " from 23-28 April 2018.", "As part of the initiative, the Government of Indonesia will provide a maximum of 20 scholarships for participants from other developing countries and members of Organization of Islamic Cooperation to join this training programme.", "Training Objectives:", "The goal of the training course is to enhance the participants’ knowledge about the Indonesian government-MRL strategic partnership in family planning and to apply lessons learned in designing action plans for their respective countries.", "Eligibility Requirements", "The SSTC training course is open to religious leaders, mid-level managers/program officers in government, faith-based and non-governmental organisations involved in planning and implementation of population, family planning, and reproductive health programmes", "A team will select the best 20 candidates to participate in the course.", "Benefits:", "These scholarships will cover tuition fees, accommodation, their meals (breakfast, lunch, and dinner) throughout the training, and airport transfer in Yogyakarta.", "Please be advised, however, that the sponsoring organization should be responsible for covering the air-transportation costs to Yogyakarta from their respective countries, and also a partial daily allowance for incidental expenses.", "Application Procedure:", "To apply for the programme, interested applications need to fill out the enclosed registration form and send it to ", "[email protected]", " by ", "05 March, 2018", ".", "The joint committee will then select the top 20 participants to join the training programme in Yogyakarta.", "For More Information:", "Visit the Official Webpage of the UNFPA International Training on Strategic partnership with Muslim Religious Leaders in Family Planning"], "url : https://www.opportunitiesforafricans.com/unfpa-international-training-on-strategic-partnership-with-muslim-religious-leaders-in-family-planning-yogyakarta-indonesia-funded/"], [["Desmond Tutu/Church of Scotland Masters Scholarship 2018 for young Africans to study in Scotland (Fully Funded)", "date announced:January 25, 2018", "Application Deadline: 2nd April 2018."], ["Application Deadline: ", "2nd April 2018.", "The scholarship will be awarded to a student from Africa who is accepted on a full-time basis for a one year postgraduate Masters programme of study within the School of Divinity and who has the official endorsement from the General Secretary or Principal Clerk of their Church.", "This scholarship was set up in 2009 to commemorate the Honorary Degree of Doctor of Divinity conferred by the University on the Most Reverend Desmond Tutu.", "Eligibility", "The scholarship will be awarded to a student from Africa who is accepted on a full-time basis for a one year postgraduate Masters programme of study within the School of Divinity. Shortlisted candidates will require to have the official endorsement from the General Secretary or the Principal Clerk of their Church.", "Applicants must be a member of a Church of Scotland partner church in Africa.  Eligible partner churches are:", "Evangelical Presbyterian Church, Ghana", "Presbyterian Church of Ghana", "Presbyterian Church of East Africa", "Synod of the Nile of the Evangelical Church of Egypt", "Church of Central Africa Presbyterian", "Igreja Evangelica de Cristo em Mocambique", "Presbyterian Church of Nigeria", "Uniting Presbyterian Church of Southern Africa", "Presbyterian Church of South Sudan", "United Church of Zambia", "Uniting Presbyterian Church of Southern Africa", "The scholarship will be awarded broadly on the basis of academic merit with candidates requiring a Bachelor Degree equivalent to a ", "UK", " first class or 2:1 Honours degree.", "In addition to the above academic qualifications, the selection panel will also take into account the financial circumstances of applicants to ensure that as far as possible a student’s financial situation does not impede a university education.", "Award", "The scholarship will cover:", "Full overseas tuition fee", "Accommodation within a Church of Scotland flat within Edinburgh", "£440 per calendar month for living costs", "Visa costs", "One return airfare", "Insurance from Church of Scotland business travel, underwritten by Aviva.", "The award will be tenable for one academic year.", "Application Procedure:", "Eligible applicants should complete an online scholarship application", "The scholarship deadline is ", "2nd April 2018.", "Please note you will not be able to access the online application form unless you have applied for admission to the University of Edinburgh.", "The online scholarship application form is located in EUCLID and can be accessed via MyEd our web based information portal at ", "https://www.myed.ed.ac.uk", "When logging in to MyEd, you will need your University User Name and password. If you require assistance, please go to ", "http://www.ed.ac.uk/student-systems/support-guidance", "Notification", "All applicants will be notified of the outcome by the end of June 2018.", "For More Information:", "Visit the Official Webpage of the Desmond Tutu/Church of Scotland Masters Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/desmond-tutu-church-of-scotland-masters-scholarship-2018/"], [["Canon Collins Trust Scholarships 2018/2019 for Masters Study in the United Kingdom (Fully Funded)", "date announced:January 24, 2018", "Application Deadline: Sunday 18th March 2018."], ["Application Deadline: ", "Sunday 18th March 2018.", "Canon Collins Trust", " ", "offers scholarships to support taught masters degree programmes at certain UK universities.", "School of Oriental and African Studies, University of London", "Canon Collins Trust", " partner with SOAS to co-fund one scholarship annually. Applicants must:", "Be a national of, and normally resident in one of the following countries: ", "Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia, Zimbabwe.", "Be in possession of a good Honours degree (minimum second class, upper division or equivalent) or about to graduate in the year of application.", "Be applying for a full-time one-year taught masters course in any subject.", "Have at least 2 years work experience in a relevant field.", "University of Sussex", "Canon Collins Trust", " partner with the ", "Mandela Scholarship Fund at the University of Sussex", " to co-fund two awards annually. Applicants must:", "Be a national of, and normally resident in one of the following countries: Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia, Zimbabwe.", "Be in possession of a good Honours degree (minimum second class, upper division or equivalent) or about to graduate in the year of application.", "Be applying for a full-time one-year taught masters course in any subject.", "Have at least 2 years work experience in a relevant field.", "University of Edinburgh, MSc in African Studies", "This scholarship is co-funded by Canon Collins and the University of Edinburgh. It is limited to the ", "MSc in African Studies", ". Applicants must:", "Be a national of, and normally resident in one of the following countries: Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia, Zimbabwe.", "Be in possession of a good Honours degree (minimum second class, upper division or equivalent) or about to graduate in the year of application.", "Be applying for the MSc in African Studies.", "Have at least 2 years work experience in a relevant field.", "Scholarship Worth:", "All these scholarships cover full tuition fees, a monthly stipend, a return economy flight, a settling-in allowance and other support whilst in the UK.", "Apply Now for the Canon Collins Trust Scholarships 2018/2019", "For More Information:", "Visit the Official Webpage of the Canon Collins Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/canon-collins-scholarships-2018-2019/"], [["Nordic Africa Guest Researchers’ Scholarship Programme 2019 for Africa-based researchers (Fully Funded)", "date announced:January 22, 2018", "Application Deadline: April 1st 2018"], ["Application Deadline: April 1st 2018", "The purpose of the ", "Guest Researchers’ Scholarship Programme", " is to provide opportunities for Africa-based researchers with a PhD to pursue their own research projects, thereby indirectly strengthening the academic milieux in African countries. The scholarship offers access to the Institute’s library and other resources that provide for a stimulating research environment. Through the programme,the ", "Nordic Africa Institute", " can establish and maintain relations with and between African and Nordic research communities.", "Eligibility Requirements:", "The scholarship programme is directed at postdoctoral researchers based in Africa and engaged in Africa-oriented research within the discipline of Social Sciences and Humanities.", "The applicant should be affiliated to an African university/research center and have a proven track record of extensive research experience.", "The Institute strives to achieve a fair distribution of scholarship positions in regards to gender and geographic focus.", "Benefits:", "The scholarship includes a return air-fare (economy class), accommodation, a subsistence allowance of 300 SEK (approx. 34 USD) per day plus an installation grant of 2,500 SEK (approx. 280 USD) and access to a computer in a shared office at NAI.", "The maximum duration of the stay is 90 days, minimum is 60 days. ", "Please note that the subsistence allowance will be provided only for the days spent in Uppsala.", " Also note that most academic institutions in the Nordic countries, including the Nordic Africa Institute, are closed or at least running at a reduced capacity during the periods 15 June–15 August and 15 December–15 January. Applicants are thus asked not to choose these periods for their visit.", "The Institute’s library is specialized in literature on contemporary Africa and focuses on Social Sciences. Guest Researchers also have access to the Uppsala University Library, including their online resources, and to the Library of the Swedish University of Agricultural Sciences.", "Guest Researchers have the possibility to present their research at the Nordic Africa Institute and to visit other institutions in the Nordic countries.", "Application Procedure:", "The application should contain", "Application form", "Up-to-date CV, including list of publications (if available online, please include links)", "Outline of research project, 5 pages:", "\n– A well elaborated research proposal; the research topic must relate to ", "t", "he research themes of the Institute ", "\n– A work plan, including expected results, specific for the time spent at the Institute", "Reference: A signed letter of support from the applicant’s Head of Department or other senior scholar in the same field, which ", "confirms current affiliation and field of research", ". (Scanned versions of signed support letters can be emailed by the applicant.)", "Please note that incomplete applications will not be considered. Persons currently or previously employed by or otherwise professionally affiliated with the Nordic Africa Institute are not eligible for scholarships. Kindly also note that the application must be in English. In the extraordinary event that the Scholarship Programme for 2018 does not receive full funding, applicants will be informed immediately.", "Submission of applications", "\nApplications can be sent by post/airmail or by email. Applications sent by post/airmail should contain 2 copies of each document. Applications sent by email should contain only 1 copy of each document.", "Applications sent by post/airmail should be addressed to", "\nThe Nordic Africa Institute", "\nAnnika Franklin", "\nP.O. Box 1703", "\nSE-751 47 Uppsala, Sweden.", "Applications sent by email should be addressed to", "\nAnnika Franklin, Research Administrator, email: ", "[email protected]", "Please note", ": On the subject line of your email, write: “Application: Guest Researchers’ Scholarship Programme”. Scanned versions of signed support letters can also be sent to the above email address.", "For More Information:", "Visit the Official Webpage of the Nordic Africa Guest Researchers’ Scholarship Programme "], "url : https://www.opportunitiesforafricans.com/nordic-africa-guest-researchers-scholarship-programme-2019/"], [["Mwalimu Nyerere African Union Masters & PhD Programmes in STEM Scholarship Scheme 2018/2019 (Fully Funded)", "date announced:February 3, 2018", "Application Deadline: 30th April 2018"], ["Application Deadline: 30th April 2018", "The Mwalimu Nyerere African Union Scholarship Scheme", " was launched in 2007 with the aim of contributing to the production and retention of high caliber African human capital for sustainable development of the continent in critical development areas, while promoting regional integration through", " intra-Africa mobility of students.", " The Scholarship Scheme is intended to enable young Africans to study in reputable African Universities with a binding agreement that beneficiaries will work in any African country for at least the same duration of scholarship period after graduation.", "To encourage the participation of young African female students at postgraduate level, for Masters and PhD programmes in the fields of Science, Technology, Engineering and Mathematics (STEM), the African Union Commission is offering a Call for Scholarship Applications (For Female Applicants Only).", "Eligibility Requirements:", "To be eligible for the Scholarship, a candidate must:", "Be a Female Citizen of an African Union Member State", "Be under the age of thirty five (35) years for Masters Programmes; and under forty (40) years for PhD Programmes.", "Be a holder of a Bachelor’s Degree in the relevant field, at the level of Upper Second Class Honours for a Masters’ Programme; and a holder of Masters’ Degree in the relevant field for a PhD Programme. The degree must be from a reputable University", "Have demonstrated outstanding academic achievement as evidenced by academic transcripts, and academic awards if any.", "Have proof of admission to undertake a full time Masters or PhD programme in a recognized university of an African Union Member State.", "Be willing to commit to work in an African Union Member State on completion of studies for at least three (3) years.", "ELIGIBLE FIELDS OF STUDY", "The following fields of study are eligible:", "Science", "Technology", "Engineering", "Mathematics", "The Masters programme should be of two years duration; while the PhD programme should be of three years duration", "THE SCHOLARSHIP AWARD", "The scholarship award covers the following:", "Tuition Fees: According to an official invoice from the Host University.", "\nStipend: 500 US$ monthly, to support living expenses such as housing, food, utilities, local transportation and medication.", "Book Allowance: An allowance of 500 US$ per year for the purchase of books.", "Air ticket: A round-trip economy fare for the most direct route between the beneficiary’s home country and the study destination of host Institute.", "Travel Allowance: One-off payment of 250 US$ to contribute towards ground transportation from airport and settling-in costs", "One-off payment of 350 US$ to assist with shipping and other terminal expenses; upon departure from the host Institution after successful completion of the study.", "Computer Allowance: One-off payment of 1,000 US$ for the purchase of laptop computer and accessories.", "Note: Candidates must complete all academic work within the specified period of the programme as the scholarship cannot be extended.", "Application Procedure:", "Interested candidates should complete the Application Form in PDF format as well as the EXCEL Applicants’ Data Sheet, which are available on the Africa Union website: ", "www.au.int/en/scholarship", "The applicants should submit their formal application which should include the following:", "i. Completed application form", "ii. Recent passport-size photograph", "iii. Summarized CV with names and contacts of two referees.", "iv. Certified copies of academic certificates and transcripts", "v. Certified copies of Passport or national Identity Card indicating citizenship", "vi. Copy of admission letter from a reputable African University vii. Two (2) Reference Letters with contact addresses.", "viii. An essay of not more than 500 words that explains why the candidate has chosen her particular field of study and its importance to Africa’s development.", "Note that Electronic Copies of all the above documents should be submitted.", "Applicants must scan and produce electronic copies of all the above documents (converted to PDF format) and send to the following e-mail address. ", "[email protected]", " copied to ", "[email protected]", "In addition two (2) sets of hard copies of the above documents must be sent by post to the address below.", "Mwalimu Nyerere Scholarship Programme Education Division Department of Human Resources, Science and Technology African Union Commission", "\nP.O. Box 3243 Addis Ababa, Ethiopia", "Downloads", "Application Guideline", "For More Information:", "Visit the Official Webpage of the Mwalimu Nyerere African Union Scholarship Scheme 2018/2019"], "url : https://www.opportunitiesforafricans.com/mwalimu-nyerere-african-union-scholarship-scheme-2018-2019/"], [["German Bundestag International Parliamentary Scholarships (IPS) Scheme 2018/2019 for Young Leaders (500 Euros/Month & Funded to Germany)", "date announced:January 19, 2018", "Application Deadline: January 31st 2018"], ["Application Deadline: January 31st 2018", "Would you like to get to know the German Parliament?"], "url : https://www.opportunitiesforafricans.com/german-bundestag-international-parliamentary-scholarships-ips-scheme-2018-2019/"], [["NFP/MSP (MENA) Scholarship Programme 2018/2019 for Study in the Netherlands (Fully Funded)", "date announced:February 9, 2018", "Application Deadline: Varying by Institution"], ["Application Deadline: Varying by Institution", "The MENA Scholarship Programme (MSP)", " offers scholarships to professionals for short courses in the Netherlands.", "After formal publication of the subsidy and policy outline in the Dutch Staatscourant, the start of MSP will be confirmed. Please note that all information on MSP is conditional until that time.", "Aim", "The overall aim of the MSP is to contribute to the democratic transition in the participating countries. It also aims at building capacity within organisations by enabling employees to take part in short courses in the Netherlands.", "While the scholarship is awarded to individuals, all candidates must be nominated by their employer to be able to participate. The need for training has to be demonstrated in the context of the organisation the applicant is employed by.", "Target group", "The MSP is open to professionals who are nationals of – and living and working in – one of the countries listed below:", "Algeria", "Egypt", "Iran", "Iraq", "Jordan", "Lebanon", "Libya", "Morocco", "Syria *", "Tunisia", "Eligibility criteria", "To be eligible for an MSP scholarship:", "▪ one must be a professional and national of, and living and working in one of the countries on the MSP country list valid at the time of application;", "▪ one must have a current employer’s statement that complies with the formal Nuffic has", "provided. All information must be provided and all commitments that are included in the formal must be endorsed in the statement;", "▪ one must not be employed by an organisation that has its own means of staff-development. Organisations that are considered to have their own means of staff development are for example: multinational corporations (e.g. Shell, Unilever, Microsoft);", "large national and/or a large commercial organisation;", "bilateral donor organisations (e.g. USAID, DFID, Danida, Sida, Dutch ministry of Foreign affairs, FinAid, AusAid, ADC, SwissAid);", "multilateral donor organisations, (e.g. a UN organisation, the World Bank, the IMF, Asian Development Bank, African Development Bank, IADB);", "international NGO’s (e.g. Oxfam, Plan, Care).", "▪ one must have an official and valid passport ( valid at least 3 months after the candidate submission date);", "▪ one must have a government statement that meets the requirements of the country in which the employer is established (if applicable);", "the age of the MSP candidate must not exceed 45 years of age at the time of the grant submission.", "the candidate must not receive more than one MSP scholarship for courses that take place at the same time.", "How to apply", "Application for the MSP takes place via Dutch institutions. Each deadline, these institutions provide a list of courses available for that deadline. The short courses on offer fall within several fields of study, and have a duration of 2 to 12 weeks", "Follow these steps to apply:", "1. Select a course on the MSP course list", "2. Contact the Dutch higher education institution that is offering the course for information on:", "▪ course content", "▪the application deadline (deadlines can differ per Dutch institution)", "▪ the application and selection procedures", "▪ the online application form and the supporting documents", "3. Prepare your application and the supporting documents", "4. Submit your online application via the Dutch institution offering the course", "For More Information:", "Visit the Official Webpage of the NFP/MSP (MENA) Scholarship Programme 2018/2019 "], "url : https://www.opportunitiesforafricans.com/nfp-msp-mena-scholarship-programme-2018-2019-for-study-in-the-netherlands/"], [["International Federation for Clinical Neurophysiology (IFCN) Scholarships 2018 for Young Clinical Neurophysiologists to study in Canada (Funded)", "date announced:January 26, 2018", "Application Deadline:  Friday, March 30, 2018"], ["Application Deadline: ", " Friday, March 30, 2018", "The International Federation for Clinical Neurophysiology IFCN is pleased to announce two sets of ", "IFCN Scholarships for Young Clinical ", "Neurophysiologists", " for 2018: ", "• Three education scholarships", "\n• Three research scholarships", "Both the education and research scholarships are for $25,000 USD.", "EDUCATION SCHOLARSHIP", "The IFCN awards THREE scholarships each of $25,000 USD for young clinical neurophysiologists wishing to spend at least 6 months in a neurophysiological laboratory with a national/international reputation. Applicants are expected to advance their training in Clinical Neurophysiology.", "These scholarships will be split between applicants from economically disadvantaged countries and applicants from developed countries and covers at least 6 months of study (application should stipulate duration of studies). Applicants who are 35 years of age or less will be given preference.", "RESEARCH SCHOLARSHIP ", "The IFCN awards THREE scholarships each of $25,000 USD for young clinical neurophysiologists wishing to spend at least 6 months in a neurophysiological research laboratory with a national/international reputation. Applicants are expected to participate in a research project.", "IN ORDER TO APPLY FOR THESE SCHOLARSHIPS, APPLICANTS MUST ATTACH: ", "• A Curriculum Vitae and list of publications", "\n• Copy of identity card or passport with date of birth", "\n• Description of the goal of the intended project (1 page)", "\n• Letter of recommendation from home institution – ", "*Letter must be signed and on the institution letterhead", "• Letter of acceptance from the host institution – ", "*Letter must be signed and on the institution letterhead", "Kindly note that the above documents must be in the order listed above on 1 PDF file.", "The IFCN requires a positive progress report from the winners’ supervisor at the end of the first semester to continue the scholarship support, plus a final report by the winner to be sent within 3 months after completing the scholarship.", "The Executive Committee of the IFCN will judge applications and its decision is final.", "Deadline for submission is Friday, March 30, 2018 (date of receipt). ", "\nPlease send your application to the Secretariat of the IFCN via email at ", "[email protected]", " or mail to:", "IFCN Secretariat – Stephanie Stevenson", "\nc/o Venue West Conference Services Ltd.", "\n300 – 1040 Hamilton Street", "\nVancouver, BC, Canada, V6B 2R9", "\nFax: 1.604.681-2503", "For More Information:", "Visit the Official Webpage of the International Federation for Clinical Neurophysiology (IFCN) Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/international-federation-for-clinical-neurophysiology-ifcn-scholarships-2018-for-young-clinical-neurophysiologists/"], [["DAAD-RUFORUM In-Country /In-Region Doctoral Scholarships 2018/2019 for study across Africa (Funded)", "date announced:January 19, 2018", "Application Deadline: 8th February 2018"], ["Application Deadline: ", "8", "th", " February 2018", "The Regional Universities Forum for Capacity Building in Agriculture (RUFORUM) Secretariat", " is pleased to announce a call for PhD scholarships available through the ", "German Academic Exchange Services (DAAD)", " funding support. These scholarships are targeting both in-country/in-region (sub-Saharan Africa) applicants to support selected RUFORUM regional PhD Programmes in the Eastern and Central Africa (ECA).", "The scholarships are tenable for the ", "2018/19", " academic period. DAAD promotes international academic exchange as well as educational cooperation with developing countries through various funding and scholarship programmes. The PhD training programmes will commence in September 2018; therefore, only candidates available to start the PhD training this September 2018 need to apply.", "List of Eligible Programmes/ Study fields", "The call is open to students who are interested/ registered in the following programmes:", "PhD in Life Sciences at Nelson Mandela African Institution of Sciences and Technology – Tanzania (", "2", " ", "in-region", ")", "PhD in Food Science and Nutrition at Jomo Kenyatta University of Agriculture and Technology – Kenya (1 ", "in-region", " & 1 ", "in-country", ")", "PhD in Plant Breeding & Biotechnology – Makerere University, Uganda(1 ", "in-region", " & ", "1 in-country", ");", "PhD Agricultural and Rural Innovations at Makerere University, Uganda ", "(1 in-region & 1 in- country)", "Applications are invited from qualified candidates in relevant disciplines (the last university degree (MSc) must have been completed less than six years ago at the time of application) from Sub Saharan Africa.  Female applicants, candidates from less privileged regions or groups as well as candidates with disabilities are especially encouraged to apply.", "Duration and commencement ", "The PhD Scholarships are available for a period of ", "three years", " beginning in September 2018. The scholarships will be initially granted for one year and may be extended upon individual student request and receipt of a complete application by using the attached form provided by DAAD secretariat.", "Application Requirements", "A filled and signed ", "DAAD Application Form for In-Country/In-Region Scholarships ", "A signed ", "curriculum vitae", "; please use the Europass CV template (", "http://europass.cedefop.europa.eu", ")", "A signed copy of this ", "DAAD Information Sheet for Students ", "Certified copies of all ", "university degree certificates ", "Certified copies of all ", "university transcripts ", "At least temporary ", "admission letter ", "including fee structure of respective course (original or certified copy only), or an official letter assuring admission", "A Ph.D. ", "research proposal (", "which should outline; the research area (background, rationale, objectives of the proposed research, proposed Methodology, and expected Results) and a detailed work plan (10 to 15 pages); ", "plagiarism will be checked by the host university!", "An abstract of the proposal on one page (please include name and title of proposal)", "A", " r", "ecommendation letter ", "by head of department indicating that you are a member or prospective member of staff and how you will be integrated into the staff development agenda of the university.", "Confirmation of study leave from your university (if applicable)", "Confirmation of teaching release (university staff members only)", "A letter from the applicant confirming availability to start PhD studies in September 2016 at the host university", "Application Timelines", "All applications must be received by end of day on", " 8", "th", " February 2018", "Pre- scholarship selection will be completed by", " 14", "th", " February 2018", "Final selection of scholarships will be carried out by", " May 2018", " ", "Application Procedure", "Candidates must apply online for scholarships via the online RUFORUM Information Management System (RIMS): ", "http://rims.ruforum.org/", " [", "See Section VII below – How to apply for a scholarship via RIMS", "]", "In addition to the application documents requested, all applicants must send in the soft copies of the application and filled DAAD application form to DAAD through ", "[email protected]", " [", "See VIII Sending the application package to DAAD", "]", "Candidates should attach copies of the completed host university application documents or admission letter if already admitted [", "See IX How to download the host university application forms", "]", "For any urgent inquiries please email ", "[email protected]", " & ", "[email protected]", " with a copy to ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the DAAD-RUFORUM In-Country /In-Region Doctoral Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/daad-ruforum-in-country-in-region-doctoral-scholarships-2018-2019/"], [["Coimbra Group Short Stay Scholarship Programme 2018/2019 for young researchers from Sub – Saharan Africa", "date announced:February 1, 2018", "Application Deadline:16 March 2018 midnight (Brussels time)"], ["Application Deadline:", "16 March 2018 midnight (Brussels time)", "Coimbra Group Universities", " have been providing, since 2008, young researchers from universities in Sub-Saharan Africa with the opportunity to spend a short period (generally 1 to 3 months) at a ", "Coimbra Group University", " to carry out part of their research there.", "Universities of the Coimbra Group offer short-term visits (generally 1 to maximum 3 months) to young African researchers from higher education institutions from Sub-Saharan Africa", ". The main aim of this scholarship programme is to enable scholars to undertake research in which they are engaged in their home institution and to help them to establish academic and research contacts. The scholarships are financially supported by the Coimbra Group member", "universities participating in this programme,", " ", "Eligible countries", ": all African countries ", "except", " Algeria, Egypt, Libya, Morocco, and Tunisia (applicants from these countries are eligible under the ", "Scholarship Programme for Young Researchers from the European Neighbourhood", ").", "Eligibility Criteria", "Applicants should be:", "• born on or after 1 January 1973", "• nationals of and current residents in a country in Sub-Saharan Africa", "• current staff members of a university or an equivalent higher education institution in Sub-Saharan Africa", "• of doctoral/postdoctoral or equivalent status although some universities offer grants for Master’s level students (please see details in the table below). In most universities the language of instruction is that of the country itself, but in many universities it is possible to use", "English as the working language.", "The following Coimbra Group universities are participating in the 2018 edition of the scheme:", "• University of Barcelona (Spain)", "• Eötvös Loránd University Budapest (Hungary)", "• University of Coimbra (Portugal)", "• University of Granada (Spain)", "• University of Graz (Austria)", "• University of Groningen (The Netherlands)", "• KU Leuven (Belgium)", "• University of Padova (Italy)", "• University of Pavia (Italy)", "• University of Poitiers (France)", "• University of Salamanca (Spain)", "•  University of Würzburg (Germany)", "Application Procedure", "Online application form: www.coimbra-group.eu/activities/scholarships", "Applicants must fill in the on-line application form before 16 March 2018 midnight (Brussels time). Candidates will be able to select one university only. Multiple applications will not be considered valid.", "Contact Details", "For further information please contact Anna Quici via email (", "[email protected]", ").", " ", "For More Information:", "Visit the Official Webpage of the Coimbra Group Scholarship Programme 2018 "], "url : https://www.opportunitiesforafricans.com/coimbra-group-short-stay-scholarship-programme-2018-2019-for-young-researchers-from-sub-saharan-africa/"], [["Netherlands Fellowship Programmes (NFP)–Orange Knowledge Programme (OKP) 2018/2019 for study in Netherland (Funded)", "date announced:February 3, 2018", "Application Deadline: Varying by Institution"], ["Application Deadline: Varying by Institution", " The Orange Knowledge Programme", " ", "aims to advance the development of the capacity, knowledge and quality of both individuals, and institutions in higher and vocational education.", "The Orange Knowledge Programme aims to advance the development of the capacity, knowledge and quality of both individuals as well as organisations both in the field of Technical and Vocational Education and Training and Higher Education and in other fields related to the priority themes in the OKP partner countries.", "Eligibility criteria:", "One must be a professional and a national of, and working and living in one of the countries on the OKP Country list valid at the time of application;", "One must have a current employer’s statement that complies with the formal Nuffic has provided. All information must be provided and all commitments that are included in the formal must be endorsed in the statement;", "One must not be employed by an organisation which can be expected to have their own funds for staff development, e.g.: a multinational corporation (e.g. Shell, Unilever, Microsoft) a large national and/or a large commercial organisation; a bilateral donor organisation (e.g. USAID, DFID, Danida, Sida, Dutch ministry of Foreign affairs, FinAid, AusAid, ADC, SwissAid); a multilateral donor organisation (e.g. a UN organisation, the World Bank, the IMF, Asian Development Bank, African Development Bank, IADB); an international NGO (e.g. Oxfam, Plan, Care);", "One must have a current employer’s statement which complies with the Nuffic format. All information must be provided and all commitments, which are included in the Nuffic format, must be endorsed in the statement;", "One must have a government statement that meets the requirements of the country in which the employer is established (if applicable);", "One must have an official passport valid at least three months after the submission date of the registration form by the candidate.", "Criteria:", "A OKP scholarship is intended to supplement the salary that you should continue to receive during the study period in the Netherlands. The allowance is a contribution towards your costs of living such as tuition fees, visa, travel, insurance etc.", "If applicable, the scholarship holder is expected to cover the difference between the actual costs and the OKP scholarship amount.", "The scholarships are awarded in a very competitive selection to highly motivated professionals who are in a position to introduce the newly-acquired skills and knowledge into their employing organisation", "How to apply", "Before you apply, make sure you review the eligibility criteria carefully and check whether your employer is willing to nominate you for the scholarship. When you are certain that you are eligible for a OKP scholarship, you can start making the necessary preparations for your application.", "Application Procedure:", "The deadline for application opens 1 February 2018. The closing date differs per institution. For more information about the closing date, please contact the institution directly.", "\nFollow these steps to apply:", "1. If you want to apply for a OKP scholarship for a short course or Master’s in the Netherlands, you need to first find a course that is eligible for the scholarship. You can find the eligible courses in our study programme database , specifying in the search criteria: ‘ NFP qualified –Yes’.", "2. Contact the Dutch higher education institution that is offering the course for information on:", "course content", "the application deadline (deadlines can differ per Dutch institution)", "the application and selection procedures", "the online application form and the supporting documents", "3. Prepare your application and the supporting documents", "4. Submit your online application via the Dutch institution offering the course", "For any questions on the application – and selection procedures please contact the Dutch institution directly.", "For More Information:"], "url : https://www.opportunitiesforafricans.com/nfp-orange-knowledge-programme-okp-2018-2019-for-study-in-netherland-funded/"], [["All Bar None Scholarship to attend the 2018 One Young World Summit in The Hague, The Netherlands (Fully Funded)", "date announced:January 22, 2018", "Application Deadline: Monday 2 April 2018, 12PM GMT"], ["Application Deadline: ", "Monday 2 April 2018, 12PM GMT", "All Bar None", " is an initiative designed to ensure that outstanding young people from every country in the world are represented at the ", "One Young World Summit 2018 in The Hague.", "All Bar None", " have selected 125 countries that have been less well represented at previous One Young World Summits. Through All Bar None, we will work closely with our partners and sponsors to find sponsorship for one young leader from each of these countries to attend the Summit in The Hague.", "One Young World was founded in 2009 by ", "David Jones", " and ", "Kate Robertson", ". OYW stage an annual Summit where the most valuable young talent from global and national companies, NGOs, universities and other forward-thinking organisations are joined by world leaders, acting as the ", "One Young World Counsellors.", "At the Summit, delegates debate, formulate and share innovative solutions for the pressing issues the world faces. At past Summits delegates were joined by a line-up of Counsellors that included Justin Trudeau, Emma Watson, Archbishop Emeritus Desmond Tutu, Sir Bob Geldof, Kofi Annan, Sir Richard Branson, Meghan Markle, Professor Muhammad Yunus, Jamie Oliver, Jack Dorsey and Mary Robinson.", "After each Summit, the delegates, who are then known as One Young World Ambassadors, work on their own initiatives or lend the power of the One Young World network to those initiatives already in existence. Of those in employment, many return to their companies and set about creating change from within, energising their corporate environment.", "Eligibility Requirements:", "You are eligible for All Bar None sponsorship if you can answer ‘yes’ to the following questions:", "Are you aged 18-30?", "Do you have a passion for world issues and evidenced commitment to making a positive change?​", "Are you a national (passport holding citizen) of one of the 125 countries listed below?", "Afghanistan", "Albania", "Andorra", "Angola", "Antigua and Barbuda", "Armenia", "Azerbaijan", "Bahamas", "Bahrain", "Barbados", "Belize", "Benin", "Bhutan", "Bolivia", "Bosnia and Herzegovina", "Botswana", "Brunei Darussalam", "Burkina Faso", "Burundi", "Cameroon", "Cape Verde", "Central African Republic", "Chad", "Comoros", "Congo, Republic of the (Congo-Brazzaville)", "Congo, The Democratic Republic of the", "Côte d’Ivoire", "Croatia", "Cuba", "Cyprus", "Czech Republic", "Democratic People’s Republic of Korea", "Djibouti", "Dominica", "Dominican Republic", "El Salvador", "Equatorial Guinea", "Eritrea", "Ethiopia", "Fiji", "Finland", "Gabon", "The Gambia", "Georgia", "Grenada", "Guatemala", "Guinea", "Guinea-Bissau", "Guyana", "Haiti", "Honduras", "Iceland", "Iran, Islamic Republic of", "Iraq", "Israel", "Jamaica", "Kazakhstan", "Kiribati", "Kosovo", "Kuwait", "Kyrgyzstan", "Lao People’s Democratic Republic", "Latvia", "Lesotho", "Liberia", "Libya", "Liechtenstein", "Luxembourg", "Macedonia, Republic of", "Madagascar", "Malawi", "Malaysia", "Maldives", "Mali", "Malta", "Marshall Islands", "Mauritania", "Mauritius", "Micronesia, Federated States of", "Moldova, Republic of", "Monaco", "Mongolia", "Montenegro", "Mozambique", "Myanmar", "Namibia", "Nauru", "Nicaragua", "Niger", "Oman", "Palau", "Palestinian Territory, Occupied", "Papua New Guinea", "Paraguay", "Qatar", "Rwanda", "Saint Kitts and Nevis", "Saint Lucia", "Saint Vincent and the Grenadines", "Samoa", "San Marino", "Sao Tome and Principe", "Senegal", "Seychelles", "Sierra Leone", "Slovenia", "Solomon Islands", "South Sudan", "Sudan", "Suriname", "Swaziland", "Syria", "Tajikistan", "Tanzania, United Republic of", "Timor-Leste", "Togo", "Tonga", "Tunisia", "Turkmenistan", "Tuvalu", "Uruguay", "Uzbekistan", "Vanuatu", "Yemen", "Zambia", "Benefits:", "Access to the One Young World Summit 2018 in The Hague, the Netherlands.", "Hotel accommodation on a shared basis between 17 October and 20 October 2018.", "Catering which includes breakfast, lunch and dinner.", "Transport between the Summit accommodation and the Summit venue.", "Summit hand-outs and support materials.", "The cost of travel to and from The Hague. ", "Your flight to and from The Hague must depart from and return to one and the same international airport.", "Please note that if you are ultimately selected for a Scholarship and require a visa to enter The Netherlands to attend the One Young World Summit 2018, you will be required to pay a Schengen visa fee yourself. The Schengen visa costs €60 EUR plus the applicable service charge of your local visa application centre. The costs of the visa and the applicable service charge as well as any further costs associated with the visa application (including travel to and from the visa application centre) fall on you as the participant.", "Application Procedure:", "The strongest applicants from each eligible country will be shortlisted between 2 and 27 April and we will work to secure sponsorship for at least one person from each eligible country. You will be contacted individually by a member of the One Young World team after 27 April if you have been shortlisted. Please note that we cannot guarantee any applicant that they will be shortlisted or that we will secure sponsorship for any shortlisted applicant.", "Please note that, due to the overwhelming amount of applications we receive, One Young World is unable to respond to individual emails enquiring about the outcome of the All Bar None selection process.", "For More Information:", "Visit the Official Webpage of the All Bar None Scholarship to attend the 2018 One Young World Summit"], "url : https://www.opportunitiesforafricans.com/all-bar-none-scholarship-to-attend-the-2018-one-young-world-summit-in-the-hagues-netherland/"], [["Government of Mauritius Undergraduate Africa Scholarships 2018 for Study in Mauritius (Fully Funded)", "date announced:January 19, 2018", "Application Deadline: 2nd May 2018"], ["Application Deadline: 2nd May 2018", "The Government of Mauritius is awarding scholarships to deserving students", " who are resident citizens of member states of the African Union or of African Commonwealth countries as per the following criteria:", "1. Applicants should be above 18 years of age and should not have reached their 26th", "birthday by the closing date of application.", "2. Applicants must have applied for a full-time on-campus programme at a public Tertiary Education Institution in Mauritius (listed in Section 8) for academic year starting in 2018.", "3. The Scholarship will be for a maximum of four (4) years or the minimum course duration whichever is lesser", " ", "Benefits:", "The Scholarship will support successful candidates in meeting tuition fees and contribute to their living expenses during their studies in Mauritius.", "Further, the scholarship also covers a return airfare by the most economical route. This will be valid for travel from the country of origin at the beginning of the studies and back to the country of origin upon successful completion of studies.", "Application Procedure:", "The following documents are available for download from the Ministry’s website (http://ministry-education.govmu.org):", "I. Guidelines for Applicants ➢", "Th is document contains important information regarding the conditions attached to the scholarship, the application procedure, and a list of public Tertiary Education Institutions in Mauritius where the applicants must have applied for full-time on-campus studies.", "II. Application Form ➢", "Application for the scholarship can only be made on the application form,duly filled-in. Section 5", "of the application form should be endorsed and completed by the Nominating Agency in the country of citizenship of the applicant.", "Applications which are not made through the Nominating Agency of the respective countries will not be entertained. An application under this Scheme is to be made solely through the Nominating Agency responsible for the processing of scholarships in the country of citizenship of the applicant. Such a Nominating Agency, which may typically be part of the Ministry of Education in the country of the applicant, will then short list and endorse the applications of a maximum of five (5) nominated candidates and submit the duly completed application forms electronically by 16 April 2018 and in hard copy by 02 May 2018 to the", "Ministry of Education and Human Resources, Tertiary Education and Scientific Research of Mauritius at the address mentioned below for a final selection.", "The Senior Chief Executive,", "Ministry of Education and Human Resources,", "Tertiary Education and Scientific Research", "(Attn: Tertiary Education and", "Scientific Research Division)", "MITD House, Pont Fer, Phoenix 73544.", "Republic of Mauritius (Email:", "[email protected]", ")", " ", "For More Information:", "\u2028Visit the Official Webpage of the Government of Mauritius Undergraduate Africa Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/government-of-mauritius-undergraduate-africa-scholarships-2018/"], [["University of Edinburgh Julius Nyerere Masters Scholarships 2018/2019 for Tanzanians to study in the UK (Fully Funded)", "date announced:January 30, 2018", "Application Deadline: 2nd April 2018."], ["Application Deadline: ", "2nd April 2018.", "The Julius Nyerere Scholarship", " was set up in 2009 in memory of Mwalimu Julius Nyerere who led Tanganyika to independence in 1961 and became the first prime minister and later president of Tanzania. Nyerere received a scholarship in 1949 to attend the University of Edinburgh where he obtained a Masters of Arts degree that saw him study courses in English, Political Economy, Social Anthropology, British History, Economic History, Constitutional Law, and Moral Philosophy.", "Award", "The Julius Nyerere Masters Scholarship will cover tuition fees, living costs of £10,000, and a return flight from Tanzania to the UK.", "The scholarship is tenable for one academic year. In addition to their studies, the successful applicant will be expected to participate in Swahili language conversation tutorials. This will amount to no more than 20 hours for each scholar per semester.", "Eligibility", "The scholarship will be awarded to a Tanzanian citizen who is normally resident in Tanzania, and who is accepted for admission on a full-time basis for a postgraduate one year Masters programme of study at the University of Edinburgh. Applicants who already hold a degree from outside Tanzania will not be considered.", "Applicants should already have been offered a place at the University of Edinburgh and should have firmly accepted that offer or be intending to do so.", "Criteria", "The scholarship is awarded broadly on the basis of academic merit, with candidates requiring a Bachelors degree equivalent to a UK First Class Honours (‘First’) or Upper Division/Upper Second Class Honours (‘2:1’) degree.", "The Julius Nyerere Masters Scholarship is highly competitive and only the best candidates are considered. Prospective applicants should note that, to date, in almost all cases successful candidates for the Scholarships have held a First Class Honours degree. Applicants with a 2:1 Honours degree will be considered if they can show a very strong track record of work experience relevant to their prospective degree.", "Applying", "Information on how to apply will follow shortly – ", "the closing date will be ", "2 April 2018.", "As part of the personal statement section of the scholarship application applicants will be asked to answer the following question:  ‘If Julius Nyerere was a student at the University of Edinburgh in 2018 and had a Twitter account, what would he tweet, and who would he follow? Explain your answer in 500-750 words.’", "For More Information:", "Visit the Official Webpage of the University of Edinburgh Julius Nyerere Masters Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/university-of-edinburgh-julius-nyerere-masters-scholarships-2018-2019/"], [["GSK Scholarships 2018/2019 for Future Health Leaders to study in the United Kingdom (Funded)", "date announced:January 19, 2018", "Application Deadline: midnight (GMT) on Sunday 18 February 2018."], ["Application Deadline: ", "midnight (GMT)", " on ", "Sunday 18 February 2018", ".", "Three ", "GSK scholarships", " are offered to support the training and development of the next generation of leaders in global health, and strengthen the capacity of health systems and health-related research in Africa.", "These highly competitive scholarships are available to applicants intending to study on a one-year, full-time, London-based MSc programme at the London School of Hygiene & Tropical Medicine.", "Award Details", "Each scholarship will cover", "tuition fees, including any mandatory field trip fees, and", "a tax-free stipend (living allowance) of GBP16,750.00.", "Eligibility Criteria", "To be eligible for these scholarships, applicants must", "be nationals of, and resident in, countries in sub-Saharan Africa; and", "intend to return to sub-Saharan Africa on completion of their MSc year at the School; and", "confirm in writing that they would not otherwise be able to pay for the proposed programme of study; and", "meet the School’s minimum English language requirements; and", "hold a first degree at either a first or upper second class equivalency level, and", "hold an offer of admission for 2018-19 for one of the School’s 18 London-based MSc programmes of study.", "Preference will be given to applicants who demonstrate (in their application documentation) the potential to make significant contributions to public health and/or health-related research in Africa.", "How to Apply", "Applicants should complete both steps below by the scholarship deadline.", "Step 1: Submit an application for 2018-19 for a ", "London-based MSc programme of study", ", as per instructions under the ‘How to Apply’ tab on the relevant programme of study page. Applicants should ensure that all necessary supplementary documents (including references) are submitted via the School’s Admissions Portal by the scholarship deadline.", "Step 2: Submit an ", "online scholarships application", ", selecting this scholarship option from the drop-down menu. A completed ", "Supplementary Questions Form", " for this scholarship must be uploaded as part of this application. This is the only attachment required in Step 2 (as applicants should have already submitted references; transcripts; a CV etc with their application for study).", "If you encounter any technical difficulties whilst using the online application system please contact ", "LSHTM IT", " by email, providing them with your full name; the scholarship that you are applying for; and the issue that you have encountered. Please attach a screen shot of the difficulty.", "Application notes", "Applicants who have already submitted a completed 2018-19 London-based MSc application and/or have been made an Offer of Admission should apply for the scholarship by completing the scholarship application (Step 2 above) and submitting this by the scholarship deadline.", "Incomplete applications will not be considered for this funding. Incomplete applications include those with missing supplementary documentation at either/both Steps 1 and 2 above. Both the application to study and the scholarship application must be complete by the scholarship deadline.", "If you have a deferred offer of admission from the 2017-18 cycle you do not need to resubmit your application to study at the school. You will need to submit a scholarships application.", "These scholarships are open to applicants for any of the 18 non-distance learning programmes offered by the School (including our joint programmes: MSc Global Mental Health; MSc Health Policy, Planning & Financing; MSc One Health; MSc Veterinary Epidemiology). Please note that for the following programmes you will be directed to the joint provider to complete your application to study as the School does not administer the admissions for these courses: MSc Global Mental Health; MSc One Health; MSc Veterinary Epidemiology.", "By applying for this funding applicants agree to its ", "Terms & Conditions", ".", "For More Information:", "Visit the Official Webpage of the GSK Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/gsk-scholarships-2018-2019-for-future-health-leaders/"], [["World Social Science Forum Scholarship (travel grants) Fund 2018 for Early Career Social Scientists from Low-Income Countries (Funded to Japan)", "date announced:February 7, 2018", "Application Deadline:  17 March, 2018 (24:00 Japan Standard Time)"], ["Application Deadline: ", " 17 March, 2018 (24:00 Japan Standard Time)", "In order to secure the voices of young researchers in this global event, the Forum organizers are putting together a ", "WSSF Scholarship (travel grants) Fund", " for early career social scientists from low- or lower-middle income countries.", "Selection & Requirements", "The WSSF Scientific Program Committee", " will competitively select grantees. Candidates eligible to apply for support from the Fund are early career social scientists from a low- or lower-middle income country with a presentation accepted in the 2018 WSSF program. The grant is conditional to the acceptance of the presentation by the Scientific Program Committee, Candidates should", "preferably be under 40 years of age;", "preferably be post-doc level (or equivalent experience) and", "live and work on research in a low- or lower-middle income countries (according to the ", "World Bank Data", ").", "Benefits:", "The ", "WSSF2018 Scholarship for Early Career Social Scientists", " will cover", "economy return flight (to be booked by the WSSF Secretariat);", "visa application expenses( if necessary);", "5 nights’ accommodation (:@JPY10,300 /night);", "daily allowance for meals etc. for 5 days(:@JPY2,200/day) and", "early registration fee.", "Application Guidelines", "Download the application form and submit via the online ", "Call for Papers", ".", "In case you have already been accepted as a speaker through the Call for Sessions, please email us at the address: ", "[email protected]", " with your application document attached.", "You will also be asked to provide a short CV (2 pages maximum) and proof of employment for a research institution. You are required to set all the documents into one PDF file.", "WSSF Scholarship for Early Career Social Scientists from Low-Income Countries application form ", "Application deadline: 17 March, 2018 (24:00 Japan Standard Time)", "Successful applicants will be notified by email no later than 30 May, 2018.", "For More Information:", "Visit the Official Webpage of the WSSF Scholarship (travel grants) Fund 2018"], "url : https://www.opportunitiesforafricans.com/wssf-scholarship-travel-grants-fund-2018-for-early-career-social-scientists-from-low-income-countries/"]]