[[["UCT Klaus-Jürgen Bathe Leadership Scholarships 2019 for Undergraduate African Students (Fully Funded).", "date announced:July 27, 2018", "Application Deadline: August 31st 2018"], ["Application Deadline: August 31st 2018", "The Klaus-Jürgen Bathe Leadership Programme", " was established at the ", "University of Cape Town", " in 2014 through a gift donated by ", "Professor Klaus-Jürgen Bathe of Massachusetts (USA).", " The primary goal of the Programme is to produce graduates with outstanding leadership qualities and with a strong sense of social justice, who will go on to play leading and significant roles in business, government, industry and civil society in South Africa and on the African continent. The Programme specifically aims to find, educate and nurture UCT undergraduate students towards becoming leaders who are able to tackle issues at the national level and uplift their countries for the betterment of all citizens. The recipients of the award will be known as the ", "Klaus-Jürgen Bathe Scholars.", "Requirements", "Selection will be made from students who show potential to be national leaders of tomorrow, and who will make a significant impact in business, government, industry or civil society.", "Scholars will be selected primarily on the basis of academic merit and demonstrated leadership potential. Financial circumstances will be taken into account where appropriate, and in this regard, all applicants are required to provide information about family income on the application form.", "Applicants should be academically outstanding. If applying for the scholarship in the first year of enrolment at UCT, they must have passed all first-semester courses with an average mark of at least 65%; if applying in second or subsequent years, they must have a cumulative grade aggregate of at least 65%.", "The Programme is open to undergraduate students enrolled in any of the six Faculties of UCT. It will provide support only for undergraduate studies; ", "postgraduate students are not eligible", "Students of any nationality on the African continent may apply, but preference will be given first to South African citizens and permanent residents, followed by nationals of other African countries. A condition for candidates who are not citizens or permanent residents of South Africa is that they must demonstrate a commitment to either (i) remain in South Africa and serve the country for at least 10 years after the completion of their studies, or (ii) move to another country in the African Union and serve that country while working closely with South Africa in addressing the problems faced by the continent as a whole", "Students should only apply for this scholarship when there is ", "only two years of the undergraduate degree programme remaining", ". This means that students doing a 3-year degree should apply in first year, those doing a 4-year degree should apply in their second year, and so forth. Exceptional circumstances aside, the scholarship cannot be held for periods of study of less than two years; neither can it be awarded for more than two years.", "Shortlisted candidates will be invited to an interview, and will be required to make a presentation as part of the selection process. They will be required to demonstrate why they are deserving of the scholarship, and to explain how they see themselves playing a leadership role in South Africa (or Africa) in the future.", "Scholars will receive full financial support for the remaining two years of their studies. This will cover tuition fees, UCT residential charges (including meals), as well as an allowance for books, stationery, a laptop, transport and travel costs. The total amount paid may be reduced at the discretion of the Programme Director if the scholar is already receiving some other scholarship or bursary.", "It is envisaged that scholars will take the normal courses of their degree programs, plus two additional UCT courses (one per year) intended to develop leadership attributes. In the second year of the scholarship, scholars will be required to spend up to 6 weeks attached to an approved organization in South Africa, Germany or the USA, gaining exposure to sound leadership practices.", "Submission Instructions", "The application form must be completed electronically and submitted via email as a ", "PDF attachment", " to Mrs. Tammy Matose: ", "[email protected]", "Supporting documents (certified copies and 3 references in sealed envelopes) must be delivered in ", "one", " package to the following physical address:", "Mrs Tammy Matose: ", "Programme Administrator", "Klaus-Jürgen Bathe Leadership Programme", "Room 6.19, Menzies Building, UCT Upper Campus", "Tel: 021 650 1228", "For More Information:", "Visit the Official Webpage of the UCT Klaus-Jürgen Bathe Leadership Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/uct-klaus-jurgen-bathe-leadership-scholarships-2019/"], [["DAAD Postdoctoral Researchers International Mobility Experience – P.R.I.M.E. 2018 (Funded to Germany)", "date announced:July 19, 2018", "Application Deadline: 31 August 2018"], ["Wissenschaftler diskutieren an einer Tafel des Max-Planck-Institut fuer Quantenoptik in Muenchen (MPQ)\nScientists discussing at a board of the Max-Planck-Institut fuer Quantenoptik in Muenchen (MPQ)\n(c) Copyright: DAAD/Volker Lannert\nD3S_5819.jpg", "Application Deadline: 31 August 2018", "In 2014 ", "the German Academic Exchange Service (DAAD)", " initiated the programme ", "“Postdoctoral Researchers International Mobility Experience” (PRIME)", " to support the international mobility of postdoctoral researchers by temporary positions at German universities in place of conventional scholarships.", " The programme has been funded by the ", "German Federal Ministry of Education and Research (BMBF)", " and the European Union (EU/FP7/Marie Curie Actions/COFUND). ", "Funding is provided for 18 months, in which 12 months have to be spent abroad and 6 months (re-integration phase) at a German university. The re-integration phase is mandatory. The German university administrates the salary during the whole funding period.", "Programme Evaluation", "After completing three PRIME application/selection cycles, DAAD has commissioned an intermediate programme evaluation in December 2016. The evaluators’ final report has been adopted by the DAAD Directorate in July 2017.", "Eligibility Requirements:", "Eligibility to the programme is defined by four criteria:", "Applicants must have completed their PhD before starting the fellowship;", "Applicants must comply with the programme’s mobility rule, i.e. they are free to choose any country (except Germany) as destination for their research stay abroad, provided they have not resided or carried out their main activity (work, studies, etc.) in that country for more than 12 months in total during the three years preceding the application deadline of 31 August 2018.", "Time spent as part of a procedure for obtaining refugee status under the Geneva Convention is not taken into account;", "Applicants who are already permanently employed by the research milieu where the research training activities are planned to take place and that is recruiting them may not be supported;", "Applicants must accept that the research stay abroad and the return phase to Germany are both mandatory parts of the programme", "Duration", "The support is provided for 18 months, of which the first 12 months have to be spent abroad and the remaining six months in Germany (reintegration phase). Support Funding is provided through an 18-month temporary job position at the selected German university. The position will be remunerated according to the appropriate rate for postdoctoral researchers (according to the German pay scale“ TV-L E13”).", "The specific level within the salary group “TV-L E 13” will be determined by the employing universities on the basis of the previous work experience of the fellows. DAAD will provide the respective universities with a grant agreement to cover the costs for the regular salary and an additional monthly expatriate allowance for the research stay abroad.", "Benefits:", "An additional lump sum travel allowance in accordance with DAAD rates for the selected candidate and, if applicable, accompanying spouse or partner (with in the meaning of the German law on civil partnerships ) and children will be paid directly by DAAD.", "Successful applicants will be invited to an orientation seminar before the start of the fellowship, together with current fellows, alumni and representatives of other funding institutions and possibly other researchers from science and business.", "Timeline", "Application deadline: 31 August 2018", "Selection: February 2019", "Earliest starting date: 1 April 2019", "Documents:", "Executive Summary (", "German", ")", "\nExecutive Summary (", "English", ")", "Call for applications 2018 (", "German", ")", "Call for applications 2018 (", "English", ")", "The application form will be available at the application portal. To get to the portal please click on ", "Stipendiendatenbank für Deutsche", ", fill in Fachrichtung (subject of your research), Zielland (country of the period abroad) and Status “Promovierte” (position), and select the programme.", "\nPlease mind the ", "instructions on registering", " on the portal, choose ", "English as portal language", ", activate, if necessary, the compatibility view of your browser and choose English as browser language. After registration in the portal, please click on the tab “", "personal funding", "“.", "For More Information", "Visit the Official Webpage of the DAAD Postdoctoral Researchers International Mobility Experience"], "url : https://www.opportunitiesforafricans.com/daad-postdoctoral-researchers-international-mobility-experience-p-r-i-m-e-2018/"], [["German Academic Exchange Service (DAAD) Development-Related Postgraduate Scholarships 2019/2020 in Germany for Developing Countries", "date announced:July 12, 2018", "Application Deadline: Varying by Institution"], ["Application Deadline: Varying by Institution", "From among the large number of postgraduate courses offered by German institutions of", "higher education, the", " German Academic Exchange Service (DAAD)", " supports a carefully chosen selection of programmes of particular interest to junior executives from developing countries. These degree courses, which consist of one to two years of concentrated study, provide young, academically-trained professionals in leading positions from developing countries with the opportunity to engage in postgraduate education and training in their particular field or", "profession..", "At present, postgraduate courses are offered in the following fields:", "•Economic Sciences/ Business Administration/ Political Economics", "•Development Cooperation", "•Engineering and Related Sciences", "• Mathematics", "• Regional and Urban Planning", "•Agricultural and Forest Sciences", "• Natural and Environmental Sciences", "• Medicine and Public Health", "• Social Sciences, Education and Law", "• Media Studies", "Postgraduate courses for young professionals from developing countries", "• Internationally recognised Master’s and PhD degree", "• Duration: 12-24 months for Master (depending on the particular institution) and 36 months for PhD", "• Includes German Universities and “Fachhochschulen” (Universities of Applied Sciences)", "• Support of selected programmes with a variety of scholarships (including German language courses)", "Funded by the BMZ (Federal Ministry for Economic Cooperation and Development), but admission also open to self-financed participants or students financed through government or other sources", "• Academic year 2019/2020", "Prerequisites and Requirements", "The Typical Scholarship Holder:", "• Works either for a public authority or a state or private company in a developing country and,", "as such, is engaged in the planning and execution of directives and projects with emphasis on", "development policies having a bearing on technological, economic or social areas.", "• Holds a Bachelor’s degree (normally four years) in a related subject.", "• Has completed an academic degree with far above average results (upper third) and at least", "two years of related professional experience after the first degree (bachelor).", "• His/her academic degrees should normally not be more than six years old.", "Language Skills:", "• For study courses in German (scholarship includes a 6-month German language course):", "DSH 2 or TestDaF 4 at the beginning of the study course; a minimum German language level", "of A2 at the time of application. In addition, preparatory German language courses at B1 level", "are highly recommended.", "• Exception:", "Candidates for some German-speaking or bilingual courses need a very good command of German at the time of application. For detailed information see the relevant course description on the following pages.", "• Note: It is not possible to pass the required German language courses (DSH or TestDaF)", "without any previous basic knowledge in the German language (at least A.2.1 Level), even with the preceding six-month intensive course in Germany. Passing the language test is a formal prerequisite for matriculation at the respective German university.", "• For courses in English:", "IELTS (Band 6) certificate or TOEFL (minimum score: 550 paper based, 213 computer based, 80 internet based)", "• Note:", "Some courses may expect a different level. For detailed information see the relevant", "course description on the following pages", "Application Procedure:", "DAAD application forms are available on the DAAD website .", "Applications have to be sent to the respective course directly!", "Please refer to their respective websites for the application procedure (e.g. online application), for the application deadline and the documents to be submitted.", "Applications sent to the DAAD will not be forwarded to the respective course/university.They become property of the DAAD and will NOT be returned. The applicant has no right to claim for reimbursement.", "Required Documents for a DAAD scholarship application (in the following order):", "• Signed DAAD application form (www.daad.de/medien/deutschland/stipendien/formulare/", "forschungsstipendium_en.pdf)", "• Hand-signed CV (please use the sample europass form at http://europass.cedefop.europa.eu/) with recent date", "• Hand-signed Letter of Motivation (with reference to current occupation, two pages maximum) with recent date", "• Academic Letter/s of Recommendation from your university; the letter must have a letterhead, signature and official stamp and must be of recent date (not in a sealed envelope)", "• Letter/s of recommendation from your employer; the letter must have letterhead, a signature and official stamp and must be of recent date (not in a sealed envelope)", "• Certificate(s) of Employment from the employer in the home country and if possible, a guarantee of re-employment upon returning home.", "• Proof of Language Skills:", "• English – IELTS or TOEFL (Note: The institutional TOEFL is not accepted)", "• German – required for courses taught in German", "• Copies of Academic Degrees (certified translation if necessary)", "• Copies of Academic Transcripts, incl. grading-scale (certified translation if necessary)", "• Copy of School Leaving Certificate", "• Applicants from the People’s Republic of China are asked to submit an APS Certificate with", "their application documents.", "Note: Some courses may require additional documents. For detailed information, please see", "the relevant course description on the following pages and on the respective websites.", "For More Information:", "Visit the Official Webpage of the German Academic Exchange Service (DAAD) Development-Related Postgraduate Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/daad-development-related-postgraduate-scholarships-2019-2020/"], [["World Congress of Science and Factual Producers (WCSFP) Emerging Producers Bursary Program 2018 (Fully Funded to Brisbane, Australia)", "date announced:August 6, 2018", "Application Deadline: September 7th 2018"], ["Application Deadline: September 7th 2018", "The Emerging Producers Bursary Program", " offers up-and-coming producers working in science, history, and non-fiction media a range of financial support for accreditation, travel and accommodation for the ", "World Congress of Science and Factual Producers (WCSFP).", "Recipients will have access to the event’s industry intelligence and professional development opportunities, including guaranteed meetings and networking opportunities with the top producers and commissioning editors in the industry.", "The goal of the program is to welcome and represent diverse talent at all career stages, and encourage a new generation of Congress members. Producers and content creators working in all science and non-fiction media are encouraged to apply including those working in digital media, social media and gaming.", "Eligibility:", "Any producer or content creator under the age of 35 may apply for the bursary. Exceptions will be made for producers and content creators who have undergone a career change. Please self-identify in your application.", "For Tier 1 bursaries, priority will be given to applicants from outside the WCSFP’s traditional attendance base (i.e. outside of Australia, Austria, Belgium, Canada, Denmark, Finland, France, Germany, Ireland, Italy, Netherlands, New Zealand, Norway, Sweden, Switzerland, UK, USA).", "The Emerging Producer Bursary Program welcomes underrepresented voices and encourages applications from across all cultural and geographic backgrounds.", "Applicants must demonstrate experience working in the science, history or factual genres in one of the following roles: executive producer, producer, associate producer, assistant producer, or digital, gaming or social media content creator.", "How It Works", "Qualified applicants will be selected to receive one of the following tiers of support for ", "the 2018 Congress in Brisbane, Australia, from November 27 to 30", ":", "Tier 1 – Full Scholarship", "Full registration for the 2018 Congress in Brisbane, Australia;", "Travel and accommodation;", "Formal introduction at the Congress’ opening plenary;", "Guaranteed one-on-one meetings with decision makers;", "Meetings with leading producers to help facilitate the most effective WCSFP experience;", "Tailored assistance and advice to successfully navigate WCSFP.", "Tier 2 – Partial Scholarship (no travel support)", "Full registration for the 2018 Congress in Brisbane, Australia;", "Formal introduction at the Congress’ opening plenary;", "Guaranteed one-on-one meetings with decision makers;", "Meetings with leading producers to help facilitate the most effective WCSFP experience;", "Tailored assistance and advice to successfully navigate WCSFP.", "All applicants will receive a 15% discount on early-bird registration.", "REQUIREMENTS", "A one-page application statement detailing the applicant’s involvement in science, history or non-fiction media, including a description of his/her most recent project and his/her goals for attending Congress. The letter must include an indication of which tier of support is requested.", "CV and short bio that outlines the applicant’s experience as a producer.", "A scanned copy of a government issued piece of identification that provides date of birth.", "A letter of support from a broadcaster or senior producer. In lieu of a letter of support digital media content creators may submit a letter detailing their audience reach, including information on how they interact with their audiences and numbers indicating their audience and social media reach.", "Links to the applicants previous work. Please indicate your role on the supporting footage.", "SELECTION PROCESS", "Applications are now open, with a final deadline of September 7. Please send your application and documents to ", "Stephanie McArthur", " as PDF attachments.", "Applicants will be notified of the committee’s decision by October 15, 2018.", "For More Information:", "Visit the Official Webpage of the Emerging Producers Bursary Program 2018 "], "url : https://www.opportunitiesforafricans.com/wcsfp-emerging-producers-bursary-program-2018/"], [["University of Lausanne (UNIL) Master’s Grants Scholarships 2018/2019 for Study in Switzerland.", "date announced:July 10, 2018", "Application Deadline: November 1st 2018"], ["Application Deadline: November 1st 2018", "Masters scholarships", " are scholarships for excellence awarded exclusively to students who have graduated from a foreign university and whose academic results are of a very high level. UNIL grants around ten scholarships a year.", "The scholarship is granted for the minimum statutory period of the programme chosen by the student. It amounts to CHF 1,600 per month from 15 September to 15 July (or 10 months a year) for the complete duration of the masters (one and a half years or two years depending on the chosen masters), with the exception of cases of definitive failure after the first year.", "Candidates are made aware of the fact that the sum of the scholarship awarded is not sufficient to live in Switzerland.", "Programmes for which it is possible to apply for a Masters scholarship:", "First of all, it is not possible to apply for the following programmes:", "Master from the School of Medicine", "Master of education", "Master of Law from the Universities of Zurich and Lausanne", "Master of criminal Law, magistracy specialism", "All MASs (PhD programmes)", "Requirements:", "To have obtained a foreign university degree considered equivalent to a bachelor at UNIL before the beginning of the masters programme at UNIL.", "To have distinguished yourself during your studies, especially through particularly brilliant academic results.", "To have a language level of at least B2 (according to the European Language Portfolio global scale) in French or English according to the language in which your chosen masters is taught.", "Not to have been registered with UNIL in the past.", "To have paid the CHF 200.00 administration fee (see document, “list of documents to attach to your application”).", "How to Apply:", "Candidates must send their completed application (refer to the document, “list of documents to attach to your application”), unbound, by post only to the following address:Université de Lausanne", "\nService des affaires sociales et de la mobilité étudiante (SASME)", "\nBâtiment Unicentre", "\nCH – 1015 Lausanne", "\nSwitzerland", "The application form must be completed on a computer and duly signed by the candidate.", "The application for the Masters scholarship also serves as an application for admission to your chosen masters (and therefore an application to register at UNIL).", "Calendar of the selection process", "1 November: application deadline", "November-December: Processing of applications by the Social Affairs and Student Mobility Office (SASME) and the Admissions department (SII)", "December-January: The SASME informs candidates whose application is incomplete or has not been accepted by the admissions department that their application for the scholarship has been unsuccessful.", "January-February: Complete applications are transferred to the faculties for consideration of their eligibility for the chosen masters degrees.", "February-March: The SASME informs candidates whose application has not been accepted by the faculty.", "March: The selection board for masters scholarships selects the candidates who will be offered a masters scholarship.", "Early April: candidates are informed of the selection board’s decision.", "Documents:", "Application form Masters scholarship.pdf", "  (444 Ko)", "FAQ Masters scholarship at UNIL.pdf", "  (210 Ko)", "List of documents to attach to your application.pdf", "  (196 Ko)", "For More Information:", "Visit the Official Webpage of the University of Lausanne (UNIL) Master’s Grants Scholarships"], "url : https://www.opportunitiesforafricans.com/university-of-lausanne-unil-masters-grants-scholarships-2018-2019/"], [["University of Pretoria MasterCard Foundation Undergraduate & Postgraduate Scholars Program (MCFSP) 2019 for study in South Africa (Fully Funded)", "date announced:July 5, 2018", "Application Deadline: 15 September 2018"], ["Application Deadline: ", "15 September 2018", "The University of Pretoria (UP)", " in partnership with the", " Mastercard Foundation (MCF)", " is currently offering scholarships for high achieving African students interested in studying at undergraduate or postgraduate levels, commencing in January 2019.", "The Mastercard Foundation Scholars Program (MCFSP)", " targets academically talented yet economically disadvantaged young people in Africa who will contribute to the transformation of the continent through their knowledge, skills, attitudes and values evidenced by their leadership. Community service and internships are essential components of the Program.", "The MCFSP offers a full scholarship to selected students who have been provisionally admitted to study towards an undergraduate or postgraduate degree at UP. Two thirds of these bursaries will be for postgraduate study and one third will be for undergraduate study. Graduates must return to their home countries on completion of their studies and give back to their communities.", "Benefits:", "If your MCFSP application is successful the Program will cover the following:", "Full tuition fees", "Accommodation in a UP residence", "Meals", "Books and printed material", "A modest monthly stipend", "Medical aid", "Travel costs (one return trip for the duration of the study period)", "Cost of one visa application for the duration of the study period.", "Undergraduate", "This Program targets academically qualified, yet economically disadvantaged, young people in Africa who will go back to contribute to the transformation of the continent. Applicants from countries outside the borders of South Africa should meet the requirements of the Universities of South Africa (USA), for more information visit ", "http://www.universitiessa.ac.za", "Mastercard Foundation offers a full Pretoria University MasterCard Foundation Scholarship Program to students who have applied for and been admitted to one of the following ", "undergraduate study programmes", " at the University of Pretoria:", "Faculty of Engineering", "BEng (Industrial Engineering)", "BEng (Chemical Engineering)", "BEng (Civil Engineering)", "BEng (Electrical Engineering)", "BEng (Electronic Engineering)", "BEng (Mechanical and Aeronautical Engineering)", "BEng (Mining Engineering)", "BEng (Computer Engineering)", "Faculty of Economic and Management Sciences", "BCom (Accounting Science)", "BCom (Financial Science)", "BCom (Economics)", "BCom (Informatics)", "BCom (Agribusiness Management)", "Faculty of Natural and Agricultural Sciences ", "BScAgric (Food Science and Technology)", "BScAgric (Agricultural Economics/Agribusiness Management)", "BScAgric (Animal Science)", "BScAgric (Plant Pathology)", "BScAgric (Applied Plant and Soil Sciences)", "Faculty of Humanities", "BSW – Bachelor of Social Work", "BPolSci –  Political Sciences", "Faculty of Education", "BEd (Senior Phase and Further Education and Training Teaching)", "The MCFSP currently offers scholarships to students who have applied for and have been admitted to one of the following faculties at UP:", "Faculty of Natural and Agricultural Sciences", "Faculty of Economic and Management Sciences", "Faculty of Humanities for entry into the BPolSci (Political Studies or International Studies only)", "Postgraduate", "The Mastercard Foundation Scholars Program (MCFSP) at the University of Pretoria (UP)", " for full-time postgraduate study is open to students who have already completed a bachelor’s degree and are residents or citizens of an African country. This Program targets academically qualified, yet economically disadvantaged, young people in Africa who will go back to contribute to the transformation of their countries. Applicants should not already be in possession of a Masters Degree/ Qualification.", "If your MCFSP application is successful the Program will cover the following:", "Full tuition fees", "Accommodation in a UP residence", "Meals", "Books and printed material", "A modest monthly stipend", "Medical aid", "Travel costs (one return trip for the duration of the study period)", "Cost of one visa application for the duration of the study period.", "Post Graduate", "Faculty of Natural and Agricultural Sciences", "Faculty of Economic and Management Sciences", "Faculty of Humanities for entry into the Honours or Masters (Political Studies or International Studies only)", "Faculty of Engineering – continuing students are eligible to apply", "For more information on the specific courses offered in the above mentioned faculties,", "How to apply", "Step 1", "You may apply online at ", "www.up.ac.za/apply", ".", "To use the online ", "Application", " system, you will need Internet access and an email address that you can access regularly. As soon as you submit your online ", "application", ", a student number (EMPLID) will be sent to this email address as confirmation of receipt.", "Alternatively, you can submit a hard copy of your application form to the following address:", "University of Pretoria", "Student Service Centre", "Hatfield", "Pretoria 0028", "South Africa", "Step 2", "The application will be evaluated by members of the relevant faculty and you will be informed of the outcome.", "Undergraduate applicants are required to write the Scholastic Aptitude Test (SAT) or the National Benchmark Test (NBT). Please visit ", "www.collegeboard.org", " and ", "http://www.nbt.ac.za/", " for more details. Please check with your faculty regarding the requirements for the Scholastic Aptitude Test (SAT) or the National Benchmark Test (NBT).", "Step 3", "Download application forms for the MCFSP from www.up.ac.za/mcfsp.", "MCFSP Postgraduate Application Form PDF – PDF (0.54 MB)", "MCFSP Undergraduate Application form – PDF (0.14 MB)", "Step 4", "Submit your MCFSP application from to ", "[email protected]", " for undergraduates and ", "[email protected]", " for postgraduates together with ", "ALL", " supporting documents as stated on the first page of the application form.", "Application enquiries can be directed to:", "[email protected]", "Tel: 012 420 4297", "Please visit ", "www.up.ac.za/isd", " for general information for international students.", "For More Information", "Visit the Official Webpage of the University of Pretoria MasterCard Foundation Scholars Program (MCFSP) 2019"], "url : https://www.opportunitiesforafricans.com/university-of-pretoria-mastercard-foundation-scholars-program-mcfsp-2019/"], [["Wits-TUB Urban Lab Interdisciplinary Bilateral Postgraduate Studies Programme Masters Scholarships 2018/2019 for study in South Africa (Fully Funded", "date announced:July 20, 2018", "Application Deadline: 30 September 2018"], ["Application Deadline: 30 September 2018", "By recognising that cities and their inhabitants safeguard global common goods, such as climate, economic prosperity, social integration, democratization and political stability, a profound change in policy responses is needed to enable truly transformative actions,", "motivating changes in the way we use, build and govern the urban environments.", "\nThe bilateral Wits-TUB Urban Lab programme", " supported by the ", "Federal Ministry for Economic Cooperation and Development (BMZ)", " and ", "German Academic Exchange Service (DAAD)", " seeks to improve graduate education in urban fields across sub-Saharan Africa. Both lead partners", ", the Habitat Unit at the School of Architecture of the Technische Universität Berlin,", " and ", "the School of Architecture and Planning at University of the Witwatersrand", " offer a new urban-oriented graduate and postgraduate training and capacity building programme that would effectively address the challenges and needs outlined above.", "14 fully funded scholarships will be awarded on a competitive basis to South Africans and citizens from other African countries across the following degrees:", "MSc in Development Planning", "Masters in Urban Studies in the fields of\n", "Housing and Human Settlements", "Sustainable Energy Efficient Cities", "Urban Politics and Governance", "Urban Management", "Wits-TUB Urban Lab focus", "The programme includes bilateral exchange activities, workshops and conferences implemented through the Wits-TUB Urban Lab and will focus on four innovation areas that address SDG implementation in urban areas:", "• Politics and policy of the urban", "• Understanding complex urban systems", "• Managing change processes", "• Coproducing knowledge between theory and practice (Wits-TUB Urban Studio)", "The scholarship recipients will benefit from guest lectures, joint supervision scheme and a summer school at Wits University.", "Scholarship Worth:", "The masters scholarship covers the duration of one academic year. Successful candidates will be expected to sign a contract stipulating the conditions of the scholarship.", "The scholarship includes:", "• Full tuition fee", "• Monthly stipend (living expenses including: subsistence expences, accommodation, other costs)", "• Travel from home country/place of origin is covered.", "• Costs of Summer/Spring School in Berlin", "Eligibility Requirements:", "Scholarships are open to :", "• South African citizens", "• Citizens from other countries in sub-Saharan Africa", "• Applicants must possess the requisite qualifications to be granted the scholarship.", "There is no age limit applying to the scholarships for study purposes. However, at the time of the application, no more than 6 years should have passed since an applicant graduated from his/her previous bachelor or master studies.", "All scholarship applicants must have applied for admission to the relevant degree (as per above list) at Wits", "Documents:", "Please download the full call for these scholarships by clicking ", "here", ".", "For the dedicated call for the Urban Management scholarships, click ", "here", ".", "Please download the application form which applies for both the above calls by clicking click ", "here", ".", "For any other related enquiries contact ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Wits-TUB Urban Lab Interdisciplinary Bilateral Postgraduate Studies Programme "], "url : https://www.opportunitiesforafricans.com/wits-tub-urban-lab-interdisciplinary-bilateral-postgraduate-studies-programme-masters-scholarships/"], [["African Biomedical Engineering Mobility (ABEM) Scholarships 2018/2019 for African postgraduate students & academics (Fully Funded)", "date announced:July 7, 2018", "Application Deadline: 11:59pm East African Time on 26 AUGUST 2018"], ["Application Deadline: 11:59pm East African Time on 26 AUGUST 2018", "The call for applications for the 3rd round of scholarship awards is now open", "The African Biomedical Engineering Mobility (ABEM) project", " ", "is funded by the ", "Intra-Africa Academic Mobility Scheme of the Education, Audiovisual and Culture Executive Agency of the European Commission.", " The scheme is modelled on Europe’s well-established and successful ", "Erasmus-Mundus programme.", " As part of the Roadmap 2014-2017 of the Joint Africa-EU Strategy, the Intra-Africa Mobility Scheme underlines the contribution of higher education towards economic and social development and the potential of academic mobility to improve the quality of higher education.", "Applications for the following will be considered:", "Credit-seeking mobility (6-12 months) for registered master’s and PhD students", "Degree-seeking mobility (48 months) for PhD students only", "Staff mobility", "ABEM will build human and institutional capacity in Africa for needs-­based health technology research and development. The project will train postgraduate students with skills and specialisations not offered at their home institutions. Furthermore, it will support the development of biomedical engineering programmes that are being established, or have recently been established, at partner institutions and contribute toward harmonising biomedical engineering curricula across the continent. This will be achieved through the provision of scholarships to cover the full cost of mobility between African higher education institutions.", "Overall, the project will enhance employment opportunities for graduates, enhance staff research profiles and teaching competencies, enhance institutional research profiles and inter-­university cooperation, and support the development of solutions for health challenges from an African perspective.", "ABEM will train up to 32 MSc and 10 PhD graduates, and offer development opportunities to up to 10 staff members.", "Eligibility Requirements:", "Student mobility – eligibility criteria", "To be eligible for a scholarship, master’s and doctoral students must comply with the following criteria:", "Be a national and resident in any of the eligible countries covered by the Programme (see Section 2.1)", "At the time of the application for a scholarship, be registered/admitted in their final year or have obtained their most recent degree (or equivalent) from:\n", "one of the higher education institutions included in the partnership (Target Group 1); or", "a higher education institution not included in the partnership but established in an eligible country (Target Group 2)", "Have sufficient knowledge of the language of instruction in the host institution.", "Meet the specific requirements of the host institution.", "Students can only benefit from one scholarship under the Intra-Africa Academic Mobility Scheme.", "Students having benefited from scholarship(s) under the previous Intra-ACP Academic Mobility Scheme cannot receive scholarships under the Intra-Africa Academic Mobility Scheme.", "Academic and administrative staff mobility", "Staff may undertake mobility visits for 1-6 months, at any of the African partner institutions.", "Areas of activity", "\nStaff mobility should contribute to strengthening the academic, management and co-operation capacity of partner institutions, through participation in research projects, teaching, production of new teaching material, development of teaching methods, harmonisation of curricula, development of joint curricula, deve", "lopment of administrative tools and sharing of management approaches. The mobility is also expected to be an integral part of the institutional staff development plan and recognised as such upon return of the staff member.", "Eligibility criteria", "In order to be eligible for a scholarship, staff must comply with ALL the following criteria:"], "url : https://www.opportunitiesforafricans.com/african-biomedical-engineering-mobility-abem-scholarships-2019/"], [["Swiss Government Excellence Scholarships 2019/2020 for Foreign Scholars & Artists to study in Switzerland (Fully Funded)", "date announced:August 2, 2018", "Application Deadline: Varying by Country"], ["Application Deadline: Varying by Country", "Each year the Swiss Confederation awards ", "Government Excellence Scholarships", " to promote international exchange and research cooperation between Switzerland and over 180 other countries. Recipients are selected by the awarding body, the Federal Commission for Scholarships for Foreign Students (FCS).", "The Swiss Government Excellence Scholarships", " are aimed at young researchers from abroad who have completed a master’s degree or PhD and at foreign artists holding a bachelor’s degree.", "Types of scholarship", "The ", "research scholarship", " is available to post-graduate researchers in any discipline (who hold a master’s degree as a minimum) who are planning to come to Switzerland to pursue research or further studies at doctoral or post-doctoral level.", "\nResearch scholarships are awarded for research or study at all Swiss cantonal universities, universities of applied sciences and the two federal institutes of technology. Only candidates nominated by an academic mentor at one of these higher education institutions will be considered.", "Art scholarships", " are open to art students wishing to pursue an initial master’s degree in Switzerland.", "\nArt scholarships are awarded for study at any Swiss conservatory or university of the arts. This scholarship is available to students from a limited number of countries only.", "Selection criteria", "The FCS assesses scholarship applications according to three criteria:", "a) Candidate profile", "\nb) Quality of the research project or artistic work", "\nc) Synergies and potential for future research cooperation", "Application Procedure:", "Select your country of origin according to your passport", ":", "Countries A – L", " / ", "Countries M – Z", "Check the application deadline and the different types of scholarship on offer. These vary according to country. You will also find details of what to do next and where to get more information.", " ", "For More Information:", "Visit the Official Webpage of the Swiss Government Excellence Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/swiss-government-excellence-scholarships-2019-2020/"], [["UCT GSB Bertha Center for Social Innovation and Entrepreneurship Scholarships 2018/2019 for Study in South Africa (Funded)", "date announced:August 1, 2018", "Application Deadline: October 31st 2018"], ["Application Deadline: October 31st 2018", "The Bertha Centre for Social Innovation and Entrepreneurship", " was established as a specialised unit at the UCT Graduate School of Business (GSB) in 2011, in partnership with the ", "Bertha Foundation", ", a family foundation that works with inspiring leaders who are catalysts for social and economic change.", "In early 2018, the Bertha Centre celebrated six years of pioneering work in the field, with the inaugural ", "Centre Review", ". Through this partnership (Foundation & Centre) the GSB strengthens its ", "commitment to transformation and equality", " and UCT’s strategic goal to address key development challenges facing Africa.", "The Bertha Foundation supports activists, storytellers and lawyers across the world, who are working to bring about social and economic justice, and human rights for all. The Bertha Scholars at the GSB are part of this global Bertha Foundation network.", "Scholarship Benefits:", "The Bertha Scholarship", " covers full or partial costs of the MBA (both full-time and the modular programme) and MPhil in Inclusive Innovation programmes at the University of Cape Town’s Graduate School of Business.", "The scholarship entails joining an illustrious cohort of alumni, and a thriving community of dynamic change makers. Being a scholar is about joining a collective, as much as it is about propelling your own professional and personal trajectory.", "Requirements:", "You are eligible for a Bertha Scholarship:", "if you meet the admission ", "requirements of the university", " for your selected course of study.", "if you are an ", "African citizen", " or permanent resident.", "if you are an ", "entrepreneur ", "who has started or worked with a social/green/entrepreneurial innovative idea that seeks social and/or economic change.", "if you are an ", "intrapreneur ", "who has worked on advancing social justice and pioneering inclusive opportunities through social innovation within an organisation.", "if you demonstrate strong ", "leadership ", "qualities within your field.", "How to Apply:", "If you are interested, follow these steps to apply:", "Submit your MBA or MPhil in Inclusive Innovation ", "programme application", " before the respective deadlines to the GSB.", "Submit the ", "GSB Scholarship Application", " Form which should include:", "Your UCT GSB application number received from the GSB Admissions Office", "Your contact details and your CV uploaded.", "Your answers to the three essay questions, which shows how the degree programme at this stage in your career will help to accelerate impact in your area of work/interest and how it will contribute to society as a whole.", "Your short [no longer than four minute] video.", "In the choice of scholarship on the application form, remember to select the option for Focus on Social Innovation & Social Entrepreneurship (Bertha Scholarship).", "Note:", " You will only be able to take up the Bertha Scholarship if you are successfully admitted to the UCT GSB programme for which you have applied.", "Timeline:", "STAGE", "DATE", "1. Applications Open", "1 August", "2. Application Deadline", "31 October", "3. Scholarship shortlisting (internal committee meeting)", "19 – 20 November", "4. Shortlisted applicants invited for interview", "23 November", "5. Interviews", "26 – 27 November", "6. Scholarship committee meeting (internal)", "4 – 5 December", "7. Scholarships offered", "7 December", "Contact The Bertha Centre", "E-mail:  ", "[email protected]", "Tel:  +27 (0)21 406 1524 / 1514 or +27 (0)76 365 4440", "For More Information:", "Visit the Official Webpage of the UCT GSB Bertha Center for Social Innovation and Entrepreneurship Scholarships"], "url : https://www.opportunitiesforafricans.com/uct-gsb-bertha-center-for-social-innovation-and-entrepreneurship-scholarships-2018-2019/"], [["Deutsches Museum Scholar-in-Residence Program 2018 in Munich Germany (Funded)", "date announced:July 5, 2018", "Application Deadline: October 12th 2018"], ["Application Deadline: October 12th 2018", "The Deutsches Museum in Munich", " has several attractive scholarships to offer research scholars interested in working for six or 12 months on projects involving the museum`s vast and heterogeneous collections. The scholarship programme is international and interdisciplinary in scope.", "There are myriad opportunities at the ", "Deutsches Museum for innovative research", " into scientific processes and the changing cultures of technology. Founded in 1903, the museum’s holdings comprise some 100,000 objects; an ", "archive", " of 4,500 shelf metres including an extensive collection of scientific photographs, technical illustrations, trade literature and private papers; and a specialist ", "research library", " with 875,000 volumes, 5,000 journals, and an extensive collection of rare books on te history of science and technology.", "The museum’s collections have evolved over the years, absorbing the instruments, books and archives of individual scientists and engineers as well as of companies and scientific institutions, and reflect bygone experimental systems and cultures of innovation. The unique structure of this collection enables scholars to develop innovative ", "cross-disciplinary ", "methods of research on the basis of texts, images and artefacts available on site and to engage in both the historical and archaeological exploration of science and technology.", "Requirements:", "Applicants are invited to base their projects on the collections of the Deutsches Museum and to cooperate closely with museum staff on site when formulating their research proposals. Projects involving innovative approaches to artefact-oriented research are especially welcome.", "The ability to read German is a prerequisite for the application (passive language skills).", "During their stay, visiting scholars will have daily contact with the museum´s curators, archivists and librarians (approx. 50 staff members) as well as members of the ", "Münchner Zentrum für Wissenschafts- und Technikgeschichte", " (Munich Center for the History of Science and Technology; approx. 50 staff members).", "Benefits:", "Scholarship holders will have their own workplace with a desktop computer and telephone, and the opportunity to reside temporarily in subsidized apartments of the museum complex insofar as these are available. They will present their research projects to colleagues at the beginning of their stay and will be expected to participate regularly in the museum’s and the Munich Centre’s Monday colloquium series and workshops.", "Pre-doctoral stipends: € 7,500 (six months) / € 15,000 (full year). Post-doctoral stipends: € 15,000 (six months) / € 30,000 (full year).", "Scholars at any level of seniority are eligible to apply, provided they have at least one university degree (Master or PhD). BA is not sufficient. There are no restrictions regarding nationality. All scholars are requested to make their own provisions for health insurance.", "Application Procedure:", "Please send applications,", " including:", "completed application form (", "pdf-file", ", 20 kB or ", "rtf-file", " 60 kB)", "curriculum vitae", "project description (3 to 5 pages)", "two confidential references (can be sent directly by the referees)", "\nto the following address:", "Andrea Walther", "\nCoordinator of the Research Institute", "\nDeutsches Museum", "\n80306 Munich", "\nTel.: 00 49 (0) 89 2179-280", "\nFax: 00 49 (0) 89 2179-239", "\nE-Mail: ", "a.walther", "deutsches-museum.de", "Detailed information available upon request:", " Prof. Dr. Elisabeth Vaupel", "Please find the current and former Scholars ", "here", "For More Information:", "Visit the Official Webpage of the Deutsches Museum Scholar-in-Residence Program 2018"], "url : https://www.opportunitiesforafricans.com/deutsches-museum-scholar-in-residence-program-2018/"], [["Africa Initiative for Governance (AIG) Scholarships 2019/2020 for Study in the University of Oxford, UK (Fully Funded)", "date announced:July 16, 2018", "Application Deadline: September 14, 2018."], ["Application Deadline: September 14, 2018.", "Every year,", " Africa Initiative for Governance (AIG", ")", " will fund five scholarships for outstanding individuals from Nigeria and Ghana to pursue the ", "Master of Public Policy degree at the Blavatnik School of Government (BSG), University of Oxford.", " AIG Scholars will be expected, upon graduation, to return to their home country and apply their learning experience as change agents in their country’s public sector.", "To achieve the goal of being a catalyst for public sector transformation, AIG will every year, for five years starting in 2017, fund five scholarships for outstanding West Africans from all backgrounds who are passionate about the public sector, to pursue the ", "Master of Public Policy at the Blavatnik School of Government , University of Oxford.", " Upon graduation, ", "AIG Scholars", " will be expected to return to their home country and apply their learning experience as change agents in their country’s public sector.", "Benefits:", "The AIG Scholarships are ", "full scholarships", " covering fees, accommodation and living expenses", "The AIG Scholarships Programme", " is targeted at graduates between the ages of 25 and 35, some of whom may have work experience. The Scholars will be exceptionally intelligent graduates who have excelled academically as well as in other areas of their lives.", "Eligibility Criteria:", "Citizen of Nigeria or Ghana", "Age between 25 and 35 years", "Achieved an academic standing sufficiently advanced to ensure admission to the University of Oxford and ", "the MPP programme.", " This means a first-class or strong upper second-class undergraduate degree with honours (or equivalent international qualifications), as a minimum, in any discipline. For applicants with a degree from the USA, the minimum GPA sought is 3.7 out of 4.0", "Strong commitment to public service and a willingness to commit to working for a fixed number of years in your country’s public sector", "Demonstrated leadership capabilities and resultant impact", "Impeccable moral character", "PLEASE NOTE:", "We will only contact applicants shortlisted for the next stage of the selection process and any inquiries regarding individual application status are strictly prohibited. Applications sent via post or in person are also NOT acceptable.", "Candidates who emerge as finalists in the Africa Initiative for Governance (AIG) selection process will be expected to apply directly to the Blavatnik School of Government, University of Oxford, for admissions. Finalists who are offered admission to the Master of Public Policy will be considered by the School in the final selection of AIG Scholars.", "For More Information:", "Visit the Official Webpage of the Africa Initiative for Governance (AIG) Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/africa-initiative-for-governance-aig-scholarships-2019-2020/"], [["Leading Ethiopia: Kana Scholarship (Fully Funded to attend the One Young World Summit 2018 in The Hague, Netherlands)", "date announced:July 10, 2018", "Application Deadline: July 18th 2018"], ["Application Deadline: July 18th 2018", "Kana TV are Ethiopia’s leading broadcaster. Since 2016 they have been transforming the media landscape in Ethiopia, pioneering the way entertainment can be accessed across the country. As a revolutionary industry leader, Kana TV is proud to partner with One Young World to launch the inaugural", " Leading Ethiopia: Kana Scholarship. ", "The scholarship will discover and recognise an outstanding Ethiopian young leader who has made extraordinary contributions to Ethiopia in the fields of agriculture, environment, health, poverty alleviation, human rights or education.", "Eligibility Criteria", "Candidates must be of Ethiopian nationality", "Candidates must reside in Ethiopia", "They must be aged between 18 and 30 (inclusive) by the date of the One Young World Summit 2018.", "Benefits:", "The award winner will receive:", "Title of Leading Ethiopia: Kana Scholar.", "Profiling in Kana TV publications & channels.", "Access to the One Young World Summit 2018 in The Hague, Netherlands.", "Hotel accommodation on a shared basis between 17 and 20 (inclusive) October, 2017.", "Provisions may be made for delegates to avail of an additional night’s accommodation on 16 October, should their travel itinerary require.", "The cost of travel to and from The Hague (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Successful candidates will demonstrate impact in one of the following fields:", "Agriculture", "Environment", "Health", "Poverty alleviation", "Education", "In addition, the strongest candidates will demonstrate:", "Proven leadership ability", "A capacity for innovation and values-driven problem solving", "A concern for local and global issues", "An ability to generate and articulate impactful ideas", "An ability to work towards a shared goal through teamwork and collaboration", "Apply Now for the Leading Ethiopia: Kana Scholarship", "For More Information:", "Visit the Official Webpage of the Leading Ethiopia: Kana Scholarship"], "url : https://www.opportunitiesforafricans.com/leading-ethiopia-kana-scholarship/"], [["PricewaterhouseCoopers (PwC) Bursary Program 2018/2019 for young South Africans", "date announced:July 24, 2018", "Application Deadline:"], ["Application Deadline:", "Central Region:", " Mafikeng, Bloemfontein, Kimberley, Welkom Offices", "31 August 2018", "Eastern Cape:", " Port Elizabeth, East London Offices", "31 October 2018", "Gauteng:", " Johannesburg, Pretoria Offices", "31 December 2018", "KwaZulu Natal:", " Durban, Pietermaritzburg Offices", "31 July 2018", "North East Region:", " Nelspruit, Middleburg, Emalahleni Offices", "30 September 2018", "Western Cape:", " Cape Town, Paarl, Stellenbosch, Robertson, Worcester Offices", "12 August 2018", "Bursaries", " are financial assistance given to students for further studies. Bursaries are awarded to students with an outstanding academic track record at school and/or university.", "Please bear in mind that bursaries do not generally cover the full costs of the tuition, accommodation and books and as a result applicants must be prepared to pay a portion of their tuition costs themselves.", "Bursaries are also awarded on the condition that when you complete your studies successfully, you will be required to work for PwC on a training contract, gaining hands-on experience in the business.", "Requirements:", "Academic requirements for matriculants:", "Commitment to studying towards a Chartered Accountancy qualification", "You must be intending to study full-time at a SAICA accredited institution", "You must have a minimum of a Level 6 in Mathematics and English (1st or 2nd language), and an overall average of 70%", "Academic requirements for university students:", "You must be studying towards a CA qualification", "You must be studying full time at a SAICA accredited institution", "If you are a first-year student you must be passing all University courses with an average of at least 65%", "If you are a second-year student you must be passing all University courses with an average of at least 60%", "Third and fourth year students must be passing all courses consistently and must qualify for honours according to the relevant university", "Closing dates", "Please note that closing dates for ", "bursary applications for the 2019", " year of study are as follows:", "Central Region:", " Mafikeng, Bloemfontein, Kimberley, Welkom Offices", "31 August 2018", "Eastern Cape:", " Port Elizabeth, East London Offices", "31 October 2018", "Gauteng:", " Johannesburg, Pretoria Offices", "31 December 2018", "KwaZulu Natal:", " Durban, Pietermaritzburg Offices", "31 July 2018", "North East Region:", " Nelspruit, Middleburg, Emalahleni Offices", "30 September 2018", "Western Cape:", " Cape Town, Paarl, Stellenbosch, Robertson, Worcester Offices", "12 August 2018", " ", "For More Information:", "Visit the Official Webpage of the PricewaterhouseCoopers (PwC) Bursary Program 2018/2019 "], "url : https://www.opportunitiesforafricans.com/pricewaterhousecoopers-pwc-bursary-program-2018-2019-for-young-south-africans/"], [["The African Centre for Cities (ACC) Pan African Research College PhD Scholarship 2018 ( R200,000 per year)", "date announced:July 13, 2018", "Application Deadline: midday on 6th August 2018"], ["Application Deadline: midday on ", "6th August 2018", "The African Centre for Cities (ACC)", " was established in 2007 at the University of Cape Town as an urban research institute. The ACC is based in the School of Architecture, Planning and Geomatics in the Faculty of Engineering and the Built Environment, but is interdisciplinary in its scope, drawing expertise on urban issues from across the university. The mission of the ACC is to “facilitate critical urban research and policy discourses for the promotion of vibrant, democratic and sustainable urban development in the global South”.The ACC is a partner in the ", "Pan African Research College on Sustainable Cities,", " launched in 2018. Funded by the ", "Robert Bosch Stiftung,", " the college will see researchers in diverse fields share knowledge to better understand the complexities of urban Africa. The College is made up of senior researchers from five partner universities, namely the University of Ghana, University of Nairobi, the United Nations University Institute for Natural Resources (Accra, Ghana), the University of the Witwatersrand, and the University of Cape Town.", "PhD researcher in urban sprawl and land use dynamics in Cape Town", "The ACC is seeking to recruit a full-time PhD candidate who will be one of a cohort of 8 PhD candidates and 5 Post-Doctoral fellows based at the 5 partner universities that constitute the Pan African Research College on Sustainable Cities."], "url : https://www.opportunitiesforafricans.com/the-african-centre-for-cities-acc-pan-african-research-college-phd-scholarship-2018/"], [["Bank of Tanzania Mwalimu Julius Nyerere Memorial Scholarship Fund 2018/2019 for young Tanzanians.", "date announced:July 30, 2018", "Application Deadline: August 17th 2918"], ["Application Deadline: August 17th 2918", "The Mwalimu Julius Nyerere Memorial Scholarship Fund", " announces Scholarships for the 2018/19 academic year. The Fund grants Scholarships to best female Tanzanian students to pursue Undergraduate studies in Mathematics and Science in Tanzania’s accredited universities.", "It is also partly used to sponsor both male and female Tanzanians top students to pursue undergraduate studies in Economics, Information Technology, Accounting and Finance as well as best students intending to pursue Master’s programmes in those fields.", "The primary objective of the Fund is to promote interest and excellence in Mathematics and Science courses among female students in the United Republic of Tanzania.", "The Scholarships are granted on academic merit and based on a rigorous selection process.", "Successful applicants are granted full scholarship which covers all university direct cost (tuition fees etc.) and student direct costs (meal, accommodation, book and stationery allowance, field practical training, special faculty requirement etc.) as specified in the respective institutions ‘costs structure including a lap top computer.", "1. Undergraduate Degree Programmes (4 Scholarships)", "The Undergraduate Scholarships are granted to top performers at the level of the", "Advanced Certificate of Secondary Education Examinations (ACSEE) to pursue Undergraduate degree programmes in two categories:", "Category A: Science and Mathematics Studies (Female Students only)", "Category B: Information Technology, Economics, Accounting and Finance Studies (Male and Female Students)", "The Fund will obtain the list of the 2018 ACSEE top ten (10) students from the National", "Examinations Council of Tanzania (NECTA) and the said Scholarship will be granted to qualified candidates", "Master’s Degree Programmes ( 2 Scholarships)", "The Scholarships are open to both female and male best students who are to enrol in Master’s degree programmes in the fields of Mathematics, Science, Economics, Information Technology, Accounting and Finance.", "Requirements:", "a) Applicant must be a Tanzanian citizen.", "b) Applicant must have obtained First Class or an Upper Second Class (honours) in the Bachelor", "degree with a minimum GPA of 4.0 from an accredited university within the United Republic of Tanzania.", "c) Applicant must not be more than thirty-five years of age and should have completed Bachelor’s degree in studies related to Mathematics, Science, Economics, Information Technology, Accounting or Finance.", "d) Applicant must have applied/be admitted to a full time Master’s degree programme in an", "accredited university within the United Republic of Tanzania. The programme should commence", "in 2018/2019 academic year in any of the following fields: Mathematics, Science, Economics, Information Technology, Accounting or Finance.", "Mode of Application:", "Applicants are required to complete Scholarship Application Forms which can be accessed on the BOT website: www.bot.go.tz.", "Printed forms can be obtained from the", "\nFund Administrator, Bank of Tanzania Head Office,", "\n2 Mirambo Street,11884, DAR ES SALAAM.", "The forms can also be obtained at the Bank of Tanzania Branch Offices (Arusha,Zanzibar, Mwanza, Mbeya, Dodoma, Mtwara and the Bank of Tanzania Training Institute, Mwanza).", "All application forms should be completed and submitted to the Chairperson, Mwalimu Julius Nyerere Memorial Scholarship Fund, Bank of Tanzania Head Office, 2 Mirambo Street, 11884, DAR ES SALAAM by 17th August, 2018 (16:00hr).", "Note: Only shortlisted candidates will be contacted for interview The Chairperson, Scholarship Awards Committee, Mwalimu Julius Nyerere Memorial Scholarship Fund,", "\nBank of Tanzania, 2 Mirambo Street,11884, DAR ES SALAAM.", "Mwalimu Julius Nyerere Memorial Scholarship Announcement (2018-19)", " ", "Mwalimu Julius Nyerere Memorial Scholarship Application form – Undergraduate (2018-19)", " ", "Mwalimu Julius Nyerere Memorial Scholarship Recommendation form – Master (2018-19 )", " ", "Mwalimu Julius Nyerere Memorial Scholarship Application form – Master (2018-19 )", " ", "Tangazo la ufadhili – Mwalimu Julius Nyeree Memorial Scholarship 2018-19", "For More Information:", "Visit the Official Webpage of the Bank of Tanzania Mwalimu Julius Nyerere Memorial Scholarship Fund 2018/2019 "], "url : https://www.opportunitiesforafricans.com/bank-of-tanzania-mwalimu-julius-nyerere-memorial-scholarship-fund-2018-2019/"], [["University of Dundee Gbowee Peace Foundation Africa Scholarship 2018/2019 for Postgraduate study in the United Kingdom (Funded)", "date announced:July 7, 2018", "Application Deadline: 17th November 2018\nThe University of Dundee, in partnership with Leymah Gbowee Foundation, is offering one African female student from Liberia, Nigeria or Ghana, the opportunity to undertake a 1 year postgraduate taught degree at the University of Dundee. The scholarship award is up to £20,000 and covers tuition fees, accommodation and living expenses. Any additional costs relating to tuition fees will be covered by the University of Dundee."], ["Application Deadline: 17th November 2018", "The University of Dundee,", " in partnership with ", "Leymah Gbowee Foundation,", " is offering one African female student from Liberia, Nigeria or Ghana, the opportunity to undertake a 1 year postgraduate taught degree at the University of Dundee. The scholarship award is up to £20,000 and covers tuition fees, accommodation and living expenses. Any additional costs relating to tuition fees will be covered by the University of Dundee.", "The ", "Gbowee Peace Foundation Africa Scholarships", " ", "are open to students who are currently Liberian, Nigerian or Ghanaian nationals permanently resident in these countries and are female. (Must be free of immigration regulations). Applicants will be selected on the basis of their merit and potential evidenced by the information in this application.", "Any student meeting the above criteria and formally accepted on an eligible Postgraduate Degree programme may apply.", "Eligibility", "To be eligible to apply for the Gbowee Peace Foundation Africa scholarship, you must meet the following criteria:", "Hold an academic offer of entry to the University of Dundee for January 2019 entry", "You must be a Liberian, Nigerian, Ghanaian country national citizen", "You must be permanently resident in Liberia, Nigeria or Ghana at the time of your application", "Available to female applicants only", "Fee Status\n", "International", "Subject\n", "Anatomy / Forensic Anthropology / Forensic and Medical Art, Architecture and Urban Planning, Biomedical Engineering, Business (Accountancy / Economics / Finance / International Business), Computing, Energy Petroleum and Mineral Law and Policy, Geography / Environmental Science, Law, Mechanical Engineering, Nursing and Health Sciences, Politics and International Relations", "Value\n", "Up to £30,000", "Level of Study\n", "Postgraduate", "Mode of Study\n", "Full-time", "Start Date\n", "January 2019", "Duration\n", "1 Year", "Helps With\n", "Living costs, Tuition Fees", "Country of domicile\n", "Overseas:", " Ghana, Liberia, Nigeria", "How to Apply", "You must first assess your eligibility against the criteria above. You can then download and complete the ", "Gbowee Peace Foundation Africa Scholarship Application Form", " and return by the deadline to ", "[email protected]", " using ‘Gbowee Scholarship Application’ as your subject. With your application form, you must also submit documentation to support your citizenship and permanent residence.", "Please ensure you include your Applicant ID number in all communications, as we cannot accept applications for this scholarship if you have not yet been made an offer of entry to the University of Dundee.", "A reminder that the closing date for all applications is 17th November 2018, applications after this date cannot be considered or amended.", " ", "Contact:", "For any pre-application enquiries and support, please email ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the Gbowee Peace Foundation Africa Scholarship 2018/2019"], "url : https://www.opportunitiesforafricans.com/gbowee-peace-foundation-africa-scholarship-2018-2019/"], [["2018/2019 Slovak Republic Government Scholarships for Foreign Students to study in Slovakia (Funded)", "date announced:August 2, 2018", "Application Deadline: 31 October 2018 till 16:00 CET"], ["Application Deadline: ", "31 October 2018 till 16:00 CET", "The Government of the Slovak Republic", " approved the establishment of the National Scholarship Programme of the Slovak Republic for the support of mobility of students, PhD students, university teachers, researchers and artists in 2005.", " The National Scholarship Programme of the Slovak Republic (NSP)", " is funded by the ", "Ministry of Education, Science, Research and Sport of the Slovak Republic.", "The National Scholarship Programme of the Slovak Republic", " supports mobility of international students, PhD students, university teachers, researchers and artists for scholarship stays at ", "higher education institutions", " and ", "research organisations", " in Slovakia.", "Eligible applicants", "Eligible applicants for a scholarship in the framework of the NSP:", "A)", " ", "students", " who:", "are university students at universities outside Slovakia;", "are students of the second level of higher education (master’s students), or are students who at the time of application deadline have already completed at least 2.5 years of their university studies in the same study programme;", "will be on a study stay in Slovakia during their higher education outside Slovakia and who will be accepted by a public, private or state university in Slovakia for an academic mobility", "1", " to study in Slovakia.", "All 3 conditions must be met. This category does not apply to doctoral (PhD) studies (or their equivalent).", "Duration of a scholarship stay (students): 1 – 2 semesters (i.e. 4 – 5 or 9 – 10 months) or 1 – 3 trimesters, in case the academic year is divided into trimesters (i.e. 3 – 4 or 6 – 7 or 9 – 10 months).", "B)", " ", "PhD students", " whose higher education or scientific training takes place outside Slovakia and who are accepted by a public, private or state university or a research institution in Slovakia eligible to carry out a doctoral study programme", "2", " (e.g. the Slovak Academy of Sciences) for an academic mobility", "1", " to study/conduct research in Slovakia.", "Duration of a scholarship stay (PhD students): 1 – 10 months.", "C)", " international ", "university teachers, researchers and artists", " who are invited to a teaching/research/artistic stay in Slovakia by an institution with a valid certificate of eligibility to carry out research and development, which is not a business company", "3", " and it has its headquarters in Slovakia.", "Duration of a scholarship stay (university teachers, researchers or artists): 1 – 10 months.", "Scholarship Worth:", "The scholarship is intended to cover international scholarship holders’ living costs, i.e. the costs related to staying in Slovakia (food, accommodation, etc.), during their study, research/artistic or teaching stay at universities and in research organisations", "3", " in Slovakia. The scholarship holder can ask for assistance concerning accommodation and formalities related to entering and staying in the territory of the Slovak Republic either his/her host institution, or he/she can handle all the necessities him-/herself.", "Amount of the Monthly scholarship", "a) university student", "350 €", "b) PhD student", "580 €", "c)  university teacher/researcher/artist:", "without PhD degree (or its equivalent) and less than 4 years of work experience as a university teacher/researcher/artist", "580 €", "with PhD degree (or its equivalent) and less than 10 years of work experience as a university teacher/researcher/artist", "850 €", "with PhD degree (or its equivalent) and more than 10 years of work experience as a university teacher/researcher/artist", "1,000 €", "Note:", "To determine the monthly scholarship amount (in case of university teachers, researchers and artists) with regard to their work experience, only work experience until the day of the application deadline is taken into consideration.", "PhD studies are considered as work experience (max. 6 years of PhD studies can be considered as work experience).", "In addition, ", "students and PhD students", " (eligible applicants under the category A) and B) can be awarded a ", "travel allowance", ", if they apply for it along with their scholarship application. Travel allowance is awarded as a lump sum and it will be paid to the scholarship holder at the end of his/her stay together with the last scholarship payment. Travel allowance amount depends on the distance (in a direct line) between applicant’s place of residence and the place of his/her stay in Slovakia", "4", ":", "distance up to 750 km – ", "0 €", ",", "distance more than 750 km, max. 1 500 km – ", "100 €", ",", "distance more than 1,500 km, max. 5,000 km – ", "300", " ", "€", ",", "distance more than 5,000 km – ", "700 €", ".", "Application Procedure:", "Scholarship ", "applications are submitted", " ", "online", " at ", "www.scholarships.sk", ". ", "Online application system is opened at least 6 weeks prior to the application deadline.", " Applications can be filled in only in case that the online application system has already been opened.", "Note:", " Applicants are recommended not to submit their applications at the last moment. Number of operations executed within the last minutes prior to the application deadline may have an influence on the reaction time of the application system. Please, keep that in mind, in order not to miss the application deadline.", "Applicants must fill in their online applications and upload all the required attachments in required format to their online application.", "Students", " (eligible applicants under the category A) are allowed to submit (fill in) applications and the required attachments ", "in Slovak or English language only", " (documents written in other languages must be officially translated into Slovak or English language – translation can be certified by the same institution that issued the respective document).", "Other applicants", " (eligible applicants under the categories B) and C) are allowed to submit (fill in) applications in the following languages:", "Slovak language", " – in this case, ", "all attached documents", " must be in ", "Slovak or English language only", ";", "English language", " – in this case, ", "all attached documents", " must be in ", "Slovak or English language only", ";", "Russian language", " – in this case, ", "all attached documents", " must be in ", "Slovak, English or Russian language only", ".", "For More Information:", "Visit the Official Webpage of the 2018/2019 Slovak Republic Government Scholarships"], "url : https://www.opportunitiesforafricans.com/2018-2019-slovak-republic-government-scholarships/"], [["The International Federation for IT in Travel and Tourism (IFITT) ICT4D Scholarships 2019 (Fully Funded to ENTER2019 eTourism Conference in Nicosia, Cyprus)", "date announced:August 2, 2018", "Application Deadline:September 3, 2018"], ["Application Deadline:September 3, 2018", "Under the", " IFITT ICT4D Scholarship", " (Information and Communication Technologies for Development), ", "IFITT (The International Federation for IT in Travel and Tourism", ") will fund young talents coming from developing/emerging countries, to provide a positive impact onto their respective communities through the application of information and communication technology (ICT).", "Submission should be connected with a Master or PhD thesis, having a clear orientation to the application of ICT in local tourism development. Awarded students will have the possibility to present their work at the PhD workshop during ", "ENTER2019 eTourism Conference.", "Benefits:", "The scholarship consists of an assignment of a tutor, a non-cash prize for participation at ", "ENTER2019 eTourism Conference", " (comprising of return travel from home country to Nicosia, Cyprus, accommodation, and conference fee) and free IFITT membership for one year.", "The non-cash prize consists of:", "• An invitation from IFITT (International Federation of IT in Travel and Tourism) to attend ENTER2019 in Nicosia, Cyprus from 29th of January to 1st of February 2019.", "• Return international economy flights to the nearest airport from the nearest major airport to the candidate’s university.", "• Accommodation for four nights.", "• Return transfer from/to airport to city accommodation at the destination", "Eligibility Criteria", "• The applicant must be enrolled in a University program either PhD (priority) or Master (or", "equivalent) in the below listed eligible countries. Evidences should be included in the application.", "• The applicant may also have a research/work contract in one University belonging to the below listed eligible countries (e.g. researcher, lecturer). Evidences should be included in the application.", "• The contract with the University of the eligible country should expire at least 6 months after ENTER2019 (i.e. July 2019). Evidences should be included in the application.", "• Every applicant can apply only one time per year.", "• The University should belong to the “Eligible Countries,” including: Priority countries (priority) Also eligible countries", "• The IFITT ICT4D committee will make decision on the scholarship award. Committee members are elected by IFITT board.", "• Scholarship will be ONLY awarded in relation to ENTER2019.", "• IFITT will issue an invitation letter to successful candidates,conditional to the participation at ENTER2019.", "• Each candidate is responsible for obtaining a valid travel visa and will have to cover all", "cost that occurs from that.", "Downloads:", "Call for application for 2019", "Application form", "Timeline:", "Submission Deadline: September 3, 2018", "Initial feedback: September 28, 2018", "Submit final revised proposal: October 12, 2018(*)", "Final acceptance: October 30, 2018(*)", "PhD Workshop: January 29, 2019", "ENTER2019 Conference", ": January 30 – 1 February 2019", "(*)Please note that submission deadlines differ from the one of PhD workshop in order to facilitate necessary visa procedure.", "For More Information:", "Visit the Official Webpage of the IFITT ICT4D Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/ifitt-ict4d-scholarships-2019/"], [["2019 African Union Scholarships for the Masters Programme in Epidemiology at the University of the Witwatersrand, School of Public Health (Fully Funded)", "date announced:July 25, 2018", "Application Deadline: August 31st 2018"], ["Application Deadline: August 31st 2018", "The Africa Centre for Disease Control and Prevention (Africa CDC)", " – a Specialized Technical Health Agency of the African Union, invites qualified candidates to apply for a full scholarship to undertake the full-time study in the Master of Science in Epidemiology degree programme at the University of the Witwatersrand’s School of Public Health.", "The candidates can apply for any of the six fields of study under the programme. These are:", "Epidemiology and Biostatistics", "Field Epidemiology", "Infectious Diseases Epidemiology", "Public Health Informatics", "Biostatistics and", "Implementation Science.", "The degree programmes are open to candidates from a range of disciplines including clinical", "and other health-related fields; statistics and other quantitative fields, as well as demography", "and social sciences. The scholarship will focus on candidates currently working with the National Public Health Institutes in their respective countries.", "DEGREE PROGRAMME TO BE SPONSORED", "Master of Science in Epidemiology in any of the fields of study listed above (18 months fulltime)", "Eligibility Requirements:", "Be a citizen of and resident in any of the 55 African Union Member States, and working with a National Public Health Institute", "Must be nominated by a National Public Health Institute of any of the 55 African Union Members States", "Have proof of admission to undertake the full time Masters programme at the University of Witwatersrand", "Be a holder of a honours degree or equivalent in a relevant field, an MBBCh or other health related degree, at the level of Upper Second Class Honours or equivalent", "The degree must be from a reputable fully accredited University", "Have demonstrated outstanding academic achievement as evidenced by academic transcripts, and academic awards, if any", "Be able to commit to work in a National Public Health Institute in an African Union Member State on completion of studies for at least three (3) years", "Applicants should be 35 years or younger by 31st August 2018", "Be proficient in English", "Meet the university programme’s requirements: ", "http://www.wits.ac.za/publichealth/academic-programmes/postgraduate/master-of-science-in-epidemiology/", "Scholarship Worth:", "The Africa CDC will provide full scholarships for ten Masters students in the 2019 academic", "year. The scholarship covers the following:", "The cost of one most direct return economy air ticket per year;", "Tuition fees which will be paid directly to the University;", "Basic medical and accident insurance;", "Monthly stipend to cover living expenses including accommodation;", "A limited allowance towards the costs of recommended learning materials (reference text books and necessary software);", "Limited support for the research project expenses and", "Limited support towards the cost of a laptop.", "How to Apply:", "The application process is in two-fold.", "1. a. Application for admission to the University of the Witwatersrand", "Apply by completing a University of the Witwatersrand postgraduate application form online at: http://www.wits.ac.za/postgraduate/applications/", "You can also go to: www.wits.ac.za/askwits for general application queries.", "An application fee of R200 is required for all applications.", "Deadline for application for admission into the programme is 31 August 2018.", "b. Application for university accommodation", "Applicants should apply for university accommodation also. https://www.wits.ac.za/accommodation/applications/", "Deadline for application for accommodation is 31 October 2018.", "Scholarship application", "The application for the scholarship must be done separately. Interested candidates should send the following:", "a. Completed application form (http://www.africacdc.org/scholarships)", "b. Recent passport-size photograph", "c. Comprehensive curriculum vitae including a description of relevant research and work experience and names and contacts of two referees", "d. Certified copies of academic certificates and transcripts", "e. Certified copy of bio-data page of Passport or National Identity Card", "f. Evidence of application to study in the MSc Programme at the University of the Witwatersrand of the School of Public Health commencing in the 2019 academic year", "g. Completed application form and all other required documents (a-f above) MUST", "be sent by email to: ", "[email protected]", " by 31 August 2018.", "Two (2) sets of hard copies of the documents must also be sent by post to the address below:", "\nAfrica CDC Public Health Scholarship Programme", "Education Division", "Department of Human Resources, Science and Technology", "African Union Commission", "P.O. Box 3243", "For More Information:", "Visit the Official Webpage of the African Union Scholarships for the Masters Programme in Epidemiology "], "url : https://www.opportunitiesforafricans.com/african-union-scholarships-for-the-masters-programme-in-epidemiology/"], [["Reporters Without Borders Berlin Scholarship Programme 2018 for journalists from war zones & crisis areas (Fully Funded to Berlin, Germany)", "date announced:July 26, 2018", "Application Deadline: August 9th 2018"], ["Application Deadline: August 9th 2018", "Reporters Without Borders Germany Berlin Scholarship Programme", " invites ", "journalists from war zones and crisis areas", " to come to Berlin for three to four months. During this time they can enjoy a break and complete a comprehensive training program in digital security issues relevant to their work.", "The program is funded by the ", "Berlin Senate Department for Economics, Energy and Public Enterprises.", "The aim of the scholarship is to provide scholarship holders with practical knowledge on how to protect themselves against digital threats such as surveillance or hacker attacks in their journalistic work. In addition, they will also receive training in how to teach others in their home region about digital security issues.", "Requirements:", "Professional journalists, bloggers and citizen journalists who", "are exposed to digital threats due to their work in their home regions,", "want to learn and work extensively with digital security in order to improve their personal security", "are interested in passing on the knowledge acquired during the scholarship program to colleagues in their home regions and, ideally, already have some experience in teaching (including in other areas).", "Scholarship holders must have good to very good command of English, as the working language of the scholarship program will be English.", "They should also have adequate experience working as a journalist. In addition, applicants must have every intention of returning to their home region after three to four months of residence in Germany.", "Benefits:", "Reporters Without Borders", " cover the travel costs, take care of all visa-related matters, provide a pleasant apartment in Berlin for the duration of the scholarship, pocket money of around € 1000 per month, free use of public transport in Berlin and a fully equipped computer, and also organize participation in a varied scholarship program taught by experts in the field of digital security and didactics.", "Furthermore, during their stay in Berlin scholarship holders will be given insights into the activities of a globally active journalist and human rights organization.", "Application Procedure:", "Please send a completed and signed application form, the completed questionnaire, your CV and your identity documents (scanned copies) in separate PDF documents as email attachments (in total 4 PDFs) by email to ", "[email protected]", " (", "GnuPG/GPG-Key", ").", "If you use Proton-Mail, please send your application to ", "[email protected]", ". The deadline for applications is 09.08.2018.", "For More Information:", "Visit the Official Webpage of the Reporters Without Borders Berlin Scholarship Programme 2018"], "url : https://www.opportunitiesforafricans.com/reporters-without-borders-berlin-scholarship-programme-2018/"], [["Africa London Nagasaki Scholarship Fund 2018/2019 for African Scientists to study in the UK (Fully Funded)", "date announced:August 2, 2018", "Application Deadline: August 31st 2018"], ["Application Deadline: August 31st 2018", "The Africa London Nagasaki (ALN) Fund", " is a scholarship fund set up to support African scientists to undertake a Master’s degree in a subject relevant to the control of infectious disease in Africa.", "The awards will support a candidate to undertake a Master of Tropical Medicine degree at the School of Tropical Medicine and Global Health, Nagasaki University, Japan or an MSc at the London School of Hygiene & Tropical Medicine, London, UK.", "Benefits:", "Four of five awards will be made each year for the period 2010 to 2018. Successful applicants will receive a maximum of US$50,000 each to cover tuition fees, travel and living expenses.", "Candidates applying for an Africa London Nagasaki (ALN) MSc scholarship must meet the following criteria.", "LSHTM", "Candidates applying for a Scholarship at the London School of Hygiene & Tropical Medicine must:", "be of African nationality and normally be resident in sub-Saharan Africa,", "be fluent in English. If the applicant’s first language is not English or if the studies at university have not been conducted wholly in the medium of English candidates must take and pass one of the approved internet-based tests (IELTS, TOEFL or a Pearson Test of English) (", "http://www.lshtm.ac.uk/prospectus/english.html", "). The standard of English needed to pass the tests is high and is in line with the level of English required by the UK Border Authority in order to issue a student visa.", "have a first or upper second class BSc degree or equivalent from an established university in a relevant area of science (a medical degree is not essential),", "usually have had at least two years’ prior research experience in an area relevant to the study of infectious diseases, and", "have the support of the head of their institution for undertaking their chosen course.", "TMGH", "Candidates applying for a Scholarship at the School of Tropical Medicine and Global Health, Nagasaki, must:", "be of African nationality and normally be resident in sub-Saharan Africa,", "be fluent in English,", "have obtained an MB ChB or equivalent medical qualification from a recognised university,", "have had at least two years of clinical experience following graduation,", "Application Procedure:", "Step 1 – Register", "\nEnter your details to create an account with ALN", "\nC", "reate your account now.", "Step 2 – Activate your account", "You will receive a confirmation email. Click on the link in this email and login to the ALN web site to activate your account.", "Step 3 – Complete the application form", "Log in", " (if not already done so) and click ‘Start application in the header to complete your application.", "Step 4 – Submit your application", "You may only submit your application form once to ALN. To submit the form tick the box ‘Submit to Secretariat’ and click ‘Save’.", "Step 5 – Confirmation", "A message will appear confirming that your form has been submitted successfully. You will also receive an email confirming that your application has been received by the ALN secretariat.", "Step 6 – Wait", "You wil receive an email from the selection committee about your application by end February 2019.", "For More Information:", "Visit the Official Webpage of the Africa London Nagasaki Scholarship Fund 2018/2019"], "url : https://www.opportunitiesforafricans.com/africa-london-nagasaki-scholarship-fund-2018-2019/"], [["Higherlife Foundation Capernaum scholarships 2018 for Orphaned & Vulnerable Children in Lesotho", "date announced:July 4, 2018", "Application Deadline: July 31st 2018"], ["Application Deadline: July 31st 2018", "The Capernaum scholarship", " supports eligible children in Grade 1 to Form 4. In Lesotho it offers scholarships to eligible children in Form A to Form D, while in Burundi the scholarship covers eligible children from Grade 1 to Grade 10.", "Documentation Required", "Applicant’s certified birth certificate", "Deceased parent’s or guardian’s certified death certificate", "School invoice and banking details showing the amount of fees to be paid", "An affidavit in case of missing or no documents", "Where the beneficiary does not have the deceased’s death certificate, a letter from the school authorities or local leadership to confirm the child’s orphan- hood will suffice", "For More Information:", "Visit the Official Webpage of the Higherlifefoundation Capernaum scholarships 2018"], "url : https://www.opportunitiesforafricans.com/higherlife-foundation-capernaum-scholarships-2018/"], [["Czech Republic Scholarship Programme 2019/2020 for foreign nationals from developing countries (Funded)", "date announced:July 23, 2018", "Application Deadline: September 30th 2018"], ["Application Deadline: September 30th 2018", "The Government of the Czech Republic", " offers scholarships within the framework of its Foreign Development Assistance in support of the study of foreign nationals from developing countries at public institutions of higher education in the Czech Republic.", "These so called ", "Government Scholarships", " are designed to cover the ", "standard length of study", ":", "1) in ", "follow-up Master", " study programmes ", "plus one-year preparatory course of the Czech language", " (which is combined with other field-specific training). Government scholarships of this category are awarded to graduates from Bachelor’s degree courses who can enrol only in study programmes in which ", "instruction is given in the Czech language.", " Depending on the subject area, applicants are normally required to sit entrance examinations at the higher education institution concerned. Successful passing of entrance examinations constitutes a precondition for the scholarship award;", "or", "2) in ", "follow-up Master study programmes", " or ", "Doctoral study programmes.", " Government scholarships of this category are awarded to graduates from Bachelor or Master study programmes, respectively, who enrol in study programmes with instruction in the English language.", "The scholarships are intented solely to promote the studies of adults who are foreign nationals from the eligible developing third countries listed below. Neither a citizen of the Czech Republic, nor a citizen of a member state of the European Union, nor any other foreign national with a permit to permanent residence on the territory of the Czech Republic may therefore be granted this type of scholarship. Furthermore, the scholarships may not be granted to persons under 18 years of age. (The applicants have to turn 18 as of 1 September of the year when they commence studies in the Czech Republic at the latest.)", "Scholarship Worth:", "The scholarship covers the necessary costs related to staying and studying in the Czech Republic. The scholarship amount is regularly amended.", "Currently the amount paid to students on a Bachelor’s, Master’s or follow-up Master’s study programme stands at CZK 14,000 per month", "Whereas the amount paid to students of a Doctoral study programme stands at CZK 15,000 per month.", "The above scholarship amounts include an amount designated for the payment of accommodation costs. Costs of accommodation, food and public transport are covered by scholarship holders from the scholarship under the same conditions that apply to students who are citizens of the Czech Republic. Should health services exceeding standard care be required by the student, s/he shall cover them at his/her own cost.", "Scholarships for 2019/2020 are offered only to the citizens of the following countries:", "eligiblecountries_2019-20.doc", ".", "Prospective applicants are advised to peruse the guidelines before applying.", " ", "Prospective applicants are requested to acquaint themselves with information on personal data protection at the Ministry of Education, Youth and Sport of the Czech Republic, in compliance with the respective EU GDPR Regulation:", "in Czech: ", "http://www.msmt.cz/ministerstvo/zakladni-informace-o-zpracovani-osobnich-udaju-ministerstvem", ";", "in English: ", "personal_data_protection_at_MEYS.docx", ".", "Information on personal data protection at the Ministry’s subordinate agency, Centre for International Cooperation in Education, is available at:", "http://www.dzs.cz/file/6546/oznameni_stipendia-msmt-pdf/", "; ", "http://www.dzs.cz/cz/o-dzs/gdpr/", ";", "http://www.dzs.cz/file/6633/gdpr_scholarships_en-pdf/", "; ", "http://www.dzs.cz/en/about-dzs/gdpr_en/", " .", "For More Information:", "Visit the Official Webpage of the Czech Republic Scholarship Programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/czech-republic-scholarships-2019-2020-for-foreign-nationals/"]]