[[["University of British Columbia International Leader of Tomorrow Award 2019/2020 for study in Canada (Fully Funded)", "date announced:October 1, 2018", "Application Deadline: December 1st 2018"], ["Application Deadline: December 1st 2018", "The University of British Columbia International Leader of Tomorrow Award", " recognizes international undergraduate students who demonstrate superior academic achievement, leadership skills, involvement in student affairs and community service, and recognized achievement in other key areas.", "The value of your ", "International Leader of Tomorrow Award", " is proportional to your financial need. Financial need is determined by totalling tuition, fees, and living costs, and subtracting the financial contribution you and your family can make each year. A standard needs assessment is based on the financial information provided by you and your family.", "Your award may be renewed for up to three additional years of undergraduate study or to degree completion – whichever comes first – provided you achieve satisfactory academic standing in your faculty, continue to demonstrate financial need, and maintain your Canadian study permit (student visa).", "Eligibility", "To be considered for the International Leader of Tomorrow Award:", "You must be an international student who will be studying in Canada on a Canadian study permit.", "You must be entering UBC from a recognized secondary school, college, or other university.", "You must be applying for your first undergraduate degree.", "You must meet UBC’s ", "admission requirements", ", including general and degree-specific requirements and the English Language Admission Standard.", "You must demonstrate superior academic achievement (at least an A average or equivalent standard).", "You must demonstrate a level of financial need that would otherwise prevent you from pursuing a UBC degree.", "Applications", "Applications for the 2018/19 academic year are now closed. Information on how to apply for the 2019/20 academic year will be available on October 1, 2018.", "Deadlines", "December 1, 2018: ", "Submit your award application and complete the ", "online application", " for admission to UBC. Although you can specify two degree choices in your application, only your first-choice degree will be considered for the purposes of this award.", "January 31, 2019: ", "Meet UBC’s ", "English Language Admission Standard", ".", "For More Information:", "Visit the Official Webpage of the University of British Columbia International Leader of Tomorrow Award 2019/2020 "], "url : https://www.opportunitiesforafricans.com/university-of-british-columbia-international-leader-of-tomorrow-award-2019-2020/"], [["Ooni Adeyeye Enitan Ogunwusi Scholarships 2019 for young Nigerians to study at University of Oxford, UK (Funded)", "date announced:September 21, 2018", "Application Deadline: January 2019"], ["Application Deadline: January 2019", "One full scholarships is available for applicants who are ordinarily resident in Nigeria and who are applying to a full-time one-year master’s course within the African Studies Centre at Oxford.", "The scholarship covers course fees and a grant for living costs of at least £14,777. Awards are made for the full duration of your fee liability for the agreed course. The scholarship is funded by the Imperial Majesty Oba Adéyeyè Enitan Ògúnwùsì and aims to provide funding to exceptional candidates pursuing postgraduate study of Africa.", "There is no separate application process for this scholarship: to be considered, submit your application for graduate study by the relevant January deadline for your course. ", "Selection is expected to take place in April 2019", ".", "Unless otherwise stated, you will be considered automatically for these scholarships if:", "You are applying to start a new graduate course;", "You submit your course application by the relevant January admissions deadline;", "You are subsequently offered a place after consideration of applications received by the deadline;", "Your application is not placed on a waiting list or held back after the January admissions deadline to be re-evaluated against applications received by the March admissions deadline; and", "You meet the eligibility criteria.", "About the selection process:", "The eligibility criteria will be applied automatically, using the details you provide in the relevant sections of the graduate application form (for example, your country of ordinary residence and your previous education institutions), to determine whether you are eligible.", "Selection is based on academic merit, unless specified otherwise.", "Some of the scholarships are only tenable at specific colleges. Unless specified otherwise, you do not need to select that college as your preference on the graduate application form. All eligible applicants will be considered, regardless of which college (if any) you state as your preference. However, successful applicants will be transferred to the relevant college in order to take up the scholarship.", "Applicants who hold deferred offers to start in 2019-20 are not eligible to be considered for these scholarships.", "For More Information:", "Visit the Official Webpage of the Ooni Adeyeye Enitan Ogunwusi Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/ooni-adeyeye-enitan-ogunwusi-scholarships-2019/"], [["Microsoft Research PhD Scholarship Programme 2019 in EMEA (Europe, Middle East, Africa) for PhD Students.", "date announced:September 17, 2018", "Application Deadline: October 8th 2018"], ["Application Deadline: October 8th 2018", "Each year, PhD supervisors from academic institutions in EMEA are invited to submit their proposals for collaborative research projects with ", "Microsoft Research Cambridge.", " Applications are then peer reviewed and ", "a number of ", " projects selected for funding. PhD students are appointed to the selected projects and begin their research in the following academic year under the supervision of their academic supervisor, with co-supervision from a researcher at Microsoft Research Cambridge.", "The Microsoft Research PhD Scholarship Programme in EMEA (Europe, Middle East, Africa)", " was launched in 2004 and has so far supported more than 200 PhD students from more than 18 countries and 51 institutions.", "Some of the Scholars may also be offered—at the sole discretion of Microsoft Research—an internship in one of the Microsoft Research laboratories. Internships involve working on a project alongside and as part of a team of Microsoft researchers. Scholars are paid during their internship—in addition to their scholarship bursary.", "Eligibility criteria", "Applications must not be made by students but by PhD supervisors, who must have been nominated by Microsoft Research prior to the submission deadline. If their project is selected, the supervisor has until 31 March 2020 to find the best possible student for the project; otherwise, the PhD Agreement will be terminated automatically. Only applications from institutions in Europe, the Middle East, and Africa will be considered.", "For an application to be considered, the following key requirements apply:", "The institute agrees to the terms and conditions in the ", "PhD Term Sheet", " and ", "EPSRC Term Sheet", " where appropriate and there will be no negotiation once the selections have been made and communicated.", "Applicants must be nominated by a Microsoft supervisor by 1st September 2018 to be eligible to submit an application.", "The proposed research must be closely related to our research ambitions at Microsoft Research in Cambridge:", "Artificial Intelligence", "Infrastructure for the Cloud", "The Future of Work", "Biological Computation", "This year, we are particularly interested in proposals related to:", "Machine Learning for Healthcare", "Optics in the Cloud (networking, storage and compute)", "Confidential Computation", "Designing AI for Human Partnership", "Benefits:", "Microsoft scholarships consist of an annual bursary up to a maximum of three years for PhD supervisors and students to do collaborative research projects with ", "Microsoft Research Cambridge", ".", "The monetary value of the award varies by country to reflect local differences in costs and overheads. Payment is made directly to the institution. The amount of the scholarship is the maximum amount Microsoft Research pays to the institution. In addition, every Scholar receives a fixed hardware allowance and conference allowance.", "Selection process", "Applications are sent for comprehensive review to Microsoft internal reviewers only. Ranking depends on review feedback. Other factors, such as relevance to Microsoft research topics, are taken into account for the selection.", "Decisions are made solely at the discretion of Microsoft Research and all decisions are final.", "Applicants (PhD supervisors) have until 31st March 2020 to propose the best and most suitable student possible to carry out the proposed research project.", "Timeline:", "For the application process:", "Nominations received by:", "\nOnline submission tool open:", "1st September 2018", "\n17th September 2018", "Application deadline:", "8th October 2018", "Notification of results:", "By early January 2019", "For successful applicants:", "PhD Agreements sent to Institutes via DocuSign by:", "End of February 2019", "Signed PhD Agreements returned to MSR via ", "Docusign", " by:", "30th June 2019", "PhD students to be appointed by:", "31st March 2020", "For More Information:", "Visit the Official Webpage of the Microsoft Research PhD Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/microsoft-research-phd-scholarship-programme-2019-in-emea-for-phd-students/"], [["General Electric Scholarships 2018/2019 for Undergraduate Study at the University of Ghana.", "date announced:September 21, 2018", "Application Deadline: OCTOBER 11th, 2018 at 3:00pm"], ["Application Deadline: ", "OCTOBER 11th, 2018 at ", "3:00pm", "GE a wholly-owned affiliate of ", "General Electric Company", " has been engaged in infrastructure development in Ghana for several years, notably through the supply of technology, services and know-how, training initiatives, investment and supply chain development in the power, transportation and healthcare sectors", "General Electric will provide a flat-rated scholarship support through the “", "the GE Scholarship", "”,", " for the benefit of certain University of Ghana under-graduate students in the areas of BA Computer Science and some BSc Applied Sciences during the next two years of  2017-2018 and 2018-2019 (individually the “", "Scholarship Year", "”). Scholarships are renewable annually provided they maintain a Grade Point Average of (GPA) 2.5 or better.", "Benefits", "The Scholarship ", "covers academic and residential fees and book allowance", ". In addition, ", "leadership training ", "and limited ", "Internship", " may be offered as long as an excellent academic standard of at least a 2.5 CGPA continues to be met and ", "need is demonstrated", ".", "The Students Financial Aid Office (SFAO) is accepting 2018/19 applications for the award of ", "The GE Scholarship", " for ", "UG students from areas of need reading BA Computer Science or any of the following APPLIED SCIENCES at University of Ghana", ":", "School of Engineering:", "Bachelor of Science in Computer Engineering", "Bachelor of Science in Material Science and Engineering", "School of Physical and Mathematical Sciences", "Bachelor of Science in Computer Science", "Bachelor of Science in Earth Science", "Bachelor of Science in Information Technology", "DEADLINE", " for the submission of applications for the ", "General Electric Scholarship", " ", "is", " THURSDAY OCTOBER 11th, 2018 at 3:00pm.", "You are eligible to apply if you:", "Are a Ghanaian.", "Are a University of Ghana regular student.", "Obtained an aggregate of 15 or better at the WASSCE or CGPA 3.0.", "Are able to demonstrate limited family income and/or insufficient funds to cover most or all educational related expenses.", "Have the will to succeed (determination, perseverance and success in other pursuits).", "Are reading", " BA Computer Science or Basic Applied Sciences in the following areas:", "  BSc in Information Technology, Material Science and Engineering, Earth Science, Computer Engineering or Computer Science.", "Will maintain at least a 2.5 CGPA", "Are of a Good Conduct.", "Download and submit a completed ", "GE- SFAO FORM AF SCHOLARSHIP APPLICATION ", "and the required essays, a copy of your academic records (WASSCE grades), letters of recommendation and supporting need documents.", "For More Information:", "Visit the Official Webpage of the General Electric Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/general-electric-scholarships-2018-2019-for-undergraduate-study-at-the-university-of-ghana/"], [["Harry Frank Guggenheim Foundation (HFG) Young African Scholars Program 2018/2019 ( $2,000 USD grant)", "date announced:October 1, 2018", "Application Deadline: 11:59 EST on October 15th, 2018."], ["Application Deadline: 11:59 EST on ", "October 15th,", " 2018.", "Every two years the foundation hosts the", " ", "Young African Scholars program", ". Ten scholars whose proposed projects are judged to be of high quality and closely relevant to the foundation’s interest in violence and aggression are selected to take part.", "The program includes a methods workshop, fieldwork research grants of $2,000 USD each, editorial and publication assistance, and sponsorship at an international conference to present research findings.", "Application Guidelines", "Applicants must be aged 40 or younger, currently enrolled in a Ph.D. program at an African higher education institution, and living on the continent.", "Applications should be no more than ten pages in length and include the following:", "Research question", "Short literature review", "Description of research methods to be used", "Reference letter from official academic advisor", "Two-page C.V.", "Copy of passport or government-issued ID card", "The online application will be available beginning August 1st, 2018. The deadline for submission of all application materials has been extended to 11:59 EST on ", "October 15th,", " 2018.", "Eligible applicants may apply ", "here", ". For further information, please contact the foundation at ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the HFG Foundation Young African Scholars Program 2018 /2019"], "url : https://www.opportunitiesforafricans.com/harry-frank-guggenheim-foundation-hfg-young-african-scholars-program-2018-2019/"], [["The African Doctoral Academy (ADA) 2019 Summer School at Stellenbosch University, South Africa (Fully Funded)", "date announced:September 19, 2018", "Application Deadline:  10 Ocotober 2018, 23:59 SACT."], ["Application Deadline: ", " 10 Ocotober 2018, 23:59 SACT.", "The African Doctoral Academy (ADA)", " is privileged to offer a limited number of candidates, at the start of their Doctoral careers, the opportunity to attend the ", "ADA ", "Summer School", " at ", "Stellenbosch University", " ", "in January 2019.", "In awarding this funding, our aim is to give successful candidates the opportunity to attend an ADA Doctoral School and spend time at a world-class research university, building their individual capacity and resilience for the journey ahead. This Summer the ADA will offer 19 courses over three weeks which includes a non-compulsory preparatory course followed by week-long courses in Research Design and Methodology (Quantitative and Qualitative), Mixed Methods Research Design as well as courses in analytical techniques and software applications (such as SPSS, R and ATLAS.ti), Preparing for a PhD, Writing and Publishing articles and training in Doctoral Supervision.", "Eligibility:", "ADA are once again privileged to offer full scholarships (fees, airfare and accommodation) to delegates across South Africa and Africa, as well as a select number awards for SU candidates based in Stellenbosch. Eligible candidates can be from any discipline and will be enrolled at their home institutions by February 2019 and have been enrolled for no more than 12 months by 1 February 2019.", "If your application is dependent on the bursary, we suggest that you wait for the outcome before applying to avoid duplication.", "Stellenbosch University registered candidates can apply via this stream – we include a field to indicate your affiliation with the university.", "Preference will be given to candidates from Africa.", "Successful candidates will be awarded the following as part of the programme:", "Two, week-long courses at the ADA Summer School.", "The option to attend a preparatory course (03 – 05 January), as well as a one day course (12 January).", "Self-catering accommodation in Stellenbosch.*", "Transport to visit the V&A Waterfront in Cape Town on Sunday 13 January.", "Return Economy airfare to and from Cape Town International Airport, if applicable.**", "Ground Transport to and from Cape Town International Airport.", "We request that the candidate’s home institution sponsors the candidate’s daily subsistence allowance and visa fees if needed, as a token of good faith in support of their PhD candidate.", "Application Process:", "Applicants must complete ", "the online form", " to submit their details and apply to take part in the programme. This includes a field with a 300 word motivation of how the Summer School would benefit your research and track as a PhD candidate.", "Applicants have to upload the following documents as part of the application process. No documents will be accepted by email. Please make use of the following naming convention: your ", "surname.document_type.programme (for example", " smit.curriculumvitae.edp.doc).", "Your application will not be considered as complete if complet you do not submit all the required documentation in full. In this case and you will be unable to submit the form if all documents are not uploaded", "​A 300 word ", "motivation ", "on why you would benefit from the residency in general, and specifically how the workshops selected would assist and add to the successful completion of your degree (in line on the form)", "Curriculum Vitae", " (Resume)", "Brief description of your research ", "(roughly 400 words)", "A written approval / referee report", "On your university letterhead & containing your supervisor’s signature by the current (home) supervisor ", "or", " head of department to endorse the applicant’s application. This will indicate the home supervisor’s approval for the applicant to participate in the ADA’s Summer School and provide legitimacy of applicant’s intention.", "We will a​ward a bonus point during the evaluation process if your supervisor also states your case and your suitability for the programme, in addition to simply endorsing your application.", "Proof of registration where possible, otherwise a separate motivation from the home supervisor is required, confirming registration by February 2019.", "After a vigorous selection process, the results will be made available shortly afterwards the closing date with the intention being to allow candidates to arrange for their visas and leave to travel.", "The ADA reserves the right not to make any selections for the programme if enough applications have not been received. We also reserve the right to rescind any scholarship awards made, including if the delegate is unable to commit to the programme’s full duration.", "Candidates that have benefitted from African Doctoral Academy or other funding via Stellenbosch University International in the last 18 – 24 months will be placed on the B list of applications to ensure the equitable distribution of funds available.", "For More Information:", "Visit the Official Webpage of the African Doctoral Academy (ADA) 2019 Summer School "], "url : https://www.opportunitiesforafricans.com/the-african-doctoral-academy-ada-2019-summer-school-at-stellenbosch-university/"], [["Stellenbosch University SU-Africa Postgraduate scholarship for Excellence in Campus Life for young Africans ( R32400 funding)", "date announced:October 2, 2018", "Application Deadline: October 16th 2018"], ["Application Deadline: October 16th 2018", "Two bursaries for R32400 each are available for postgraduate full time studies in 2019. The bursaries are available to students who hold citizenship from African countries outside the borders of South Africa. South African citizens are not eligible.", "Eligibility criteria :", "Available to students who hold citizenship from African countries. ", "South African citizens are not eligible", ".", "Any field of POSTGRADUATE study", "Full-time study", "Leadership involvement within the African communities on SU Campuses in the following fields for the ", "past two years", ": sport, cultural, academics, religion. In order to comply with the requirements candidate need to state 3 outstanding achievements in at least 2 of the following categories, i.e. participation in ", "SU student leadership structures", ", ", "sport", ", participation in ", "cultural activities", "/", "community involvement", ", or leadership roles in ", "faith communities", " or roles within their academic department (e.g. tutor, research assistant)", "Academic cut-off 60% in final year or immediate preceding previous completed degree.", "Two reference letters verifying the criteria must accompany application. One an academic reference and one verifying involvement in Campus activities.", "A CV should accompany the application.", "Although not a requirement for the award, the panel will give preference to applicants who, in addition to the stipulated conditions, demonstrate financial need. Applicant should provide a budget indicating income and expenses for their 2019 academic year.", "Applicant should not be older than 35 years on 1 January 2019.", "Application ", "Form ", "Application Process:", "TWO bursaries for R32, 400.00 each are available.", "Two reference letters and CV should accompany the ", "attached application form", " ", "with Addendum A", "-one an academic reference and one verifying involvement", "in campus activities.", "Closing date ", "16 October 2018", "For More Information:", "Visit the Official Webpage of the SU-Africa Postgraduate scholarship for Excellence in Campus Life"], "url : https://www.opportunitiesforafricans.com/stellenbosch-university-su-africa-postgraduate-scholarship-for-excellence-in-campus-life/"], [["University of British Columbia Mastercard Foundation Scholars Program 2019/2020 for study in Canada (Fully Funded)", "date announced:September 27, 2018", "Application Deadline: November 9th 2018"], ["Application Deadline: November 9th 2018", "The UBC Mastercard Foundation Scholars Program (MCFSP)", " ", "provides opportunities for students from Sub-Saharan Africa to pursue undergraduate and graduate studies at UBC.", "The University of British Columbia is pleased to partner with The MasterCard Foundation Scholars Program to provide comprehensive scholarships to students from Sub-Saharan Africa. The Program provides access to education for academically talented, yet economically marginalized young people. Scholars in the Program have a demonstrated commitment to giving back to their communities and develop the leadership needed to contribute to social and economic transformation across the continent.", "Eligibility and Selection Criteria", "To be eligible for consideration for The Mastercard Foundation Scholars Masters’ Degree Program at UBC, the applicant must:", "have completed a Bachelor’s degree;", "be a citizen of and have lived a significant part of their life in a Sub-Saharan African country;", "present economically disadvantaged financial circumstances, and be able to show lack of financial means from family or other sources to pursue graduate education in their home country or elsewhere;", "have achieved academic excellence under difficult circumstances, and show leadership qualities or potential;", "demonstrate an interest in and commitment to giving back to his/her home community in ways that enhance the economic growth and social development of Africa, through engagement in activities in their current profession, university or community;", "be applying for a Master’s degree in one of the following Faculties and programs at UBC’s Vancouver campus;\n", "Sauder School of Business\n", "Full-Time MBA Program", "Faculty of Forestry\n", "Master of Science (MSc)", "Master of Applied Science (MASc)", "Master of Sustainable Forest Management (MSFM)", "Master of International Forestry (MIF)", "Master of Geomatics for Environmental Management (MGEM)", "Faculty of Land and Food Systems\n", "Master of Food and Resource Economics (MFRE)", "Master of Food Science (MFS)", "Master of Land and Water Systems (MLWS)", "Faculty of Education\n", "Master of Educational Administration and Leadership (EDAL)", "Master of Higher Education (HIED)", "Master of Education in Science Education (SCED)", "Faculty of Medicine\n", "Master of Public Health (MPH)", "Faculty of Science\n", "Master of Data Science", "be a person who requires a Canadian study permit to study in Canada;", "commit to returning to Africa immediately after graduation from UBC in order to apply their training and skills to the betterment of others.", "Please note that Convention refugees and students intending to become landed immigrants to Canada are not eligible for consideration for this award.", "Benefits:", "The Mastercard Foundation Scholars Program covers all expenses associated with UBC tuition, housing and food. Scholars also receive a stipend each month to support their lives in Vancouver.", "DEADLINES", "Step 1: Admissibility Submission:", "Sauder Admissibility Submission: ", "October 25, 2018", "All other faculties: ", "November 9, 2018", "Step 2: Mastercard Foundation Scholars Program Application ", "November 16, 2018", "Step 3: UBC Faculty Applications:", "Forestry: ", "December 14, 2018", "Land and Food Systems: ", "December 14, 2018", "Education:\n", "Masters of Educational Administration and Leadership (EDAL) – ", "TBC", "Masters of Higher Education (HIED) – ", "TBC", "Masters in Science Education (SCED) – ", "December 1, 2018", "Medicine: ", "TBC", "Sauder School of Business: ", "December 14, 2018", "Science: ", "TBC", "These dates may vary from those posted on faculty websites. Please note that if you are applying for the Mastercard Foundation Scholars Program at UBC, you ", "must", " submit all your documents by the dates requested above. ", " ", "APPLICATIO", "NS", "Step One: Admissibility Submission", "Decide your Program(s) of Interest from the list", "Consult the Minimum Academic Requirements/International Credentials for Graduate Students, listed by country to determine your academic eligibility for the program and MCF", "studies* ", "https://www.grad.ubc.ca/prospective-students/application-admission/minimum-academic-", "requirements-international-credentials", "*", "Given that the number of applicants exceeds the number of positions available, a record that satisfies basic entrance requirements does not guarantee admission to graduate ", " If you meet the minimum academic requirements, ", "email", " the MCF Program Assistant at ", "[email protected]", "  to determine your eligibility for the scholarship. In the subject line of the email, please state “Applying for Mastercard Foundation Scholarship- ", "[Intended Program]”. ", "Attach to your email a scanned copy of your transcripts and your CV/Resume. Also provide in the body of the email:", "First Name:", "Preferred First Name:", "Last Name:", "Email:", "Intended Program:", "Country of Nationality:", "Gender:", "The MCF Program Assistant will accept and determine Admissibility Submissions ", "until ", "November 9", "th", ",2018. ", "If you are planning to apply for the MBA, please email the MBA Office Admissions team at ", "[email protected]", " by ", "October 25th, 2018 ", "to determine your eligibility.", "Step Two: Additional Tests", "If your Bachelor’s degree was not taught in English, make arrangements to take an English Proficiency Exam (TOEFL or IELTS) and have the results sent to UBC; ", "https://you.ubc.ca/applying-ubc/english-language-competency/", " .", "Step Three: Mastercard Foundation Scholars Program Eligibility Package", "You must complete the Mastercard Foundation Scholars Program Applications ", "before ", "you apply to UBC. ", "The Mastercard Foundation Scholars Program Applications are ", "due on November 16th, 2018. ", "We strongly recommend you use email as this is faster and costs less. Late or incomplete packages cannot be accepted and UBC is not responsible for any packages not received by the deadline.", " ", "In order for the Selection Committee to determine your eligibility for this scholarship, you must demonstrate financial need, a commitment to give back and how your education will contribute towards the transformation of your community, your region or your country in Africa. You must:", "Complete the Mastercard Foundation Scholars Program Eligibility Form. ", "This would be sent to you by the Program Assistant after determining your eligibility. If submitting a hand-written Eligibility Form, ensure that the document is clearly legible.", "Submit the Personal Statements ", "as listed at the end of the Eligibility Form. Please see below:\n", "What is of importance to you and reflects who you are?(200-300 words)", "Describe a recent, meaningful involvement in your community, including what your role is/has been in the activity/ies. (200-300 words)", "Why are you interested in studying at UBC, and how do you envision your chosen program of study at UBC helping you to reach your long-term career and personal goals? What drives you to achieve your goals? (200 – 300 words)", "Persistence is crucial to the completion of this Please describe a situation where you had to overcome a significant obstacle/ challenge(s) to reach a goal. How did you react to this challenge, and what did you learn from the situation? (200 – 300 words)", "What else should we know about your financial condition in order to consider you for this scholarship?(200-300 words)", "Provide two reference ", "The same references can be provided for academic application. However, a strong preference will be given to references that can attest to your leadership skills, commitment to community services and why you are suited for this award. (These references are in addition to the ones you have already submitted for your academic references). Please note that each faculty will have specific requirements for reference letters separate to The Mastercard Foundation Scholars Program – please make sure to follow these requirements.", "Submit a CV/resume.", " This should include any relevant education and work experience.", "Submit the Eligibility Form, Personal Statements, CV and two references", ".  Please complete and convert your eligibility documents to .pdf format and email them as attachments to ", "[email protected]", " ", "by November 16, 2018.", "Step Four: UBC Graduate Program Application ", "Apply Online:", " Once your Mastercard Foundation Application is complete, you will receive an email with instructions to submit an online application to\n", "Review the instructions for faculty applications at: ", "https://www.grad.ubc.ca/prospective-students/application-admission/application-process", "Application Fees:", " You may be eligible for a fee waiver if your country is listed as one of the world’s 50 least developed countries, according to the United Nations. If you have any questions, please contact the MCFSP Program Please visit this website to check if you are eligible: ", "https://www.un.org/development/desa/dpad/least-developed-country-category/ldcs-at-a-glance.html", "Step Five:  Reviewing Process", "In March 2019, Faculties will nominate admitted candidates for the Mastercard Foundation Scholarship. A university-wide selection committee will review scholarship applications from all three Faculties, rank them and select award recipients.", "In April 2019, ", "only", " the MCF Scholar award recipients will be contacted and soon thereafter an announcement of award recipients will be made. Unfortunately, due to the high volume of applications we receive, we are not able to respond to all applicants who have not receive the scholarship.", "For More Information:", "Visit the Official Webpage of the University of British Columbia Mastercard Foundation Scholars Program 2019"], "url : https://www.opportunitiesforafricans.com/university-of-british-columbia-mastercard-foundation-scholars-program-2019-2020/"], [["University of Edinburgh Mastercard Foundation (Undergraduate & Postgraduate) Scholars Program 2019/2020 for study in Scotland (Fully Funded)", "date announced:October 1, 2018", "Application Deadline:November 30 2018 at 12:00pm GMT."], ["Application Deadline:", "November 30 2018 at 12:00pm GMT.", "In partnership with the ", "Mastercard Foundation, the University of Edinburgh", " will provide 200 full scholarships to students from Africa with great academic and leadership potential but few educational opportunities.", "On top of the scholarship, the Scholars Program facilitates transformative leadership programming to inspire and support Scholars in making change  in their communities and countries on their return home.", "Benefits:", "The University of Edinburgh", " offers a fully funded academic and transformative leadership program for undergraduate and postgraduate students from Sub-Saharan Africa.", "Students will receive comprehensive support to remove barriers to study in Edinburgh and will benefit from extracurricular opportunities including summer schools and internships.", "The program aims to build the abilities and talents of each student so they can make a difference to their home countries and communities on their return.", "Undergraduate", "The Scholars Program at the University of Edinburgh", " will provide 80 undergraduate scholarships to students from Africa with great academic and leadership potential but few educational opportunities.", "30 scholarships are available for the 2019/2020 academic year which will cover the full tuition fees and expenses for accommodation and maintenance.", "On top of financial support, Scholars will participate in activities as part of the wider Scholars Program at the University of Edinburgh including a series of summer schools, project-based placements, mentorship, and activities during each academic year.", "2019/20 applications", "Applications for 2019 entry to the Mastercard Foundation Scholars Program at the University of Edinburgh open on October 1 2018 at 12:00pm GMT and close on November 30 at 12:00pm GMT. ", "Eligibility Criteria", "For undergraduate entry, applicants must qualify academically for admission to the University of Edinburgh in any course except Medicine and Vet Medicine\n", "You need to have achieved your school leaving qualifications in the last three years prior to entry date, for 2019 entry that is from 2016 onwards", "Applicants must be a resident and citizen of a Sub-Saharan African country", "Applicants should not have completed an undergraduate degree previously", "Applicants must demonstrate a track record of leadership and service within their community, and;", "Applicants are able to present economic circumstances which show they lack financial means to pursue higher education in their home country or elsewhere", "Postgraduate", "The Scholars Program at the University of Edinburgh will provide 60 postgraduate scholarships to students from Africa with great academic and leadership potential but few educational opportunities.", "10 scholarships are available for the 2019/2020 academic year, which will cover the full tuition fees and expenses for accommodation and maintenance.", "On top of financial support, Scholars will participate in activities as part of the wider Scholars Program at the University of Edinburgh including work-based placements, mentorship, and other activities during the academic year.", "Scholarships are available for the following postgraduate programs:", "MSc Africa and International Development", "MSc Environment and Development", "MSc Global Health Policy", "LLM Human Rights", "MA Design for Change", "MSc Sustainable Energy Systems", "2019/20 applications", "Applications for 2019 entry to the Mastercard Foundation Scholars Program at the University of Edinburgh open on October 1 2018 at 12:00pm GMT and close on November 30 at 12:00pm GMT. ", "Eligibility criteria", "Applicants must want to apply for one of our eligible courses listed above", "Applicants must qualify academically for admission to the degree of their choice", "Applicants must be a resident and citizen of a Sub-Saharan African country", "Applicants should not have completed a postgraduate degree previously", "Applicants must demonstrate a track record of leadership and service within their community, and;", "Applicants are able to present economic circumstances which show they lack financial means to pursue higher education in their home country or elsewhere", "Application to the scholarship and the University of Edinburgh", "If the Mastercard Foundation Scholars Program is the only scholarship you are interested to apply for in the University of Edinburgh, please apply for the Scholarship only.", "If you are also applying for other scholarships in the University of Edinburgh, please apply directly for the degree programme of your choice.", "More information on how to apply can be found on each individual degree programme web page in the University Degree Finder.", "October 1", "Applications open at 12.00pm GMT", "November 30", "Applications Close at 12.00pm GMT", "December 2018 – March 2019", "Review of applications", "2019", "March – April", "Interview period", "March 29", "Deadline for references to be submitted", "April 30", "Interview results announced", "July – August", "Acceptance of Offer and Visa applications", "September", "Scholars arrive in Edinburgh", "For More Information:", "Visit the Official Webpage of the University of Edinburgh Mastercard Foundation Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-edinburgh-mastercard-foundation-undergraduate-postgraduate-scholars-program-2019-2020/"], [["Shell SPDC Joint Venture University Scholarship Scheme 2018 for Young Nigerian Undergraduates.", "date announced:October 2, 2018", "Application Deadline: November 12th 2018"], ["Application Deadline: November 12th 2018", "The Shell Petroleum Development Company of Nigeria Limited", " ", "(Operator of the NNPC/SPDC /TEPNG/AGIP Joint Venture) invites applications from suitably qualified full-time Nigerian students admitted in the 2017/2018 academic session to apply for the", " SPDC JV University Scholarships.", "Requirements:", "The merit-based scholarships are in two categories:", "The National Merit Award (NM) and – open to all Nigerians.", "The Areas of Operation Merit Award – open to indigenes of SPDC’s operational areas in Abia, Bayelsa, Delta, Imo and Rivers States.", "Eligible Applicants must:", "Be Nigerian citizens", "Be registered FULL-TIME undergraduates in an accredited and approved University in Nigeria.", "Be in 200 Level with a minimum CGPA of 2.5", "Have a minimum of five credits in one sitting, including Mathematics and English, in their Senior School Certificate Examinations.", "Have a minimum of 200 score in UTME.", "How to Apply", "All applicants should have a valid personal email account – for subsequent communication on their applications.", "All applications must be done ONLINE via the application portal-", "Scanned copies of letters of identification, stamped and signed by:", "The Paramount Ruler of the Community;and", "The Chairman of the Community Development (CDC) or", "The Chairman of the Executive Council (CEC) or", "The Community Trust (CT) are also required for applicants for the Operational Area Awards. The letters should be addressed to:", "The ER Manager", "Social Performance/Social Investment", "\nThe Shell Petroleum Development Company of Nigeria Limited, Port Harcourt.", "Scanned documents must be in JPEG format and must not exceed 200KB.", "For more information or clarification please send an email to ", "[email protected]", "Note:-", "Application is free", "SPDC JV does not assign ‘Representatives’/‘Agents’ to assist applicants to process applications.", "Application opens on October 2", "nd", ", 2018 and closes November 12", "th", ", 2018.", "There will be no selection tests as selection will be based strictly on relative academic performance.", "Only short-listed candidates will be contacted.", "For More Information:", "Visit the Official Webpage of the SPDC JV University Scholarships"], "url : https://www.opportunitiesforafricans.com/shell-spdc-joint-venture-university-scholarship-scheme-2017-2018/"], [["VLIR-UOS Training Scholarships for Sustainable Development and Human Rights Law (SUSTLAW) Postgraduate Programme 2019", "date announced:September 19, 2018", "Application Deadline:30 September 2018"], ["Application Deadline:30 September 2018", "Sustainable Development and Human Rights Law (SUSTLAW) Postgraduate Programme", "The University of Antwerp Law Faculty’s ", "Law and Development Research Group", " runs a post-graduate programme on “Sustainable Development and Human Rights Law” (SUSTLAW", ") from 11 February to 3 May 2019. SUSTLAW offers a comprehensive teaching programme based on the research lines of the Law and Development Research Group. The programme runs in conjunction with the Faculty’s ", "LL.M", ".", "The Sustainable Development and Human Rights Law Postgraduate programme", " is ", "part of the English Master of Laws", " taught at the law faculty of the University of Antwerp. The programme joins the", " very best of the Global South with the best of the Global North for a unique educational experience", ". SUSTLAW offers ", "four courses", ": International sustainable development law, human rights and global justice, law in developing countries and external actors in economic global governance. The programme ", "combines theoretical insights with hands-on training, site visits, moot courts and other role plays", ", making it a very rich and intense learning experience. It seeks to offer profound legal training in a critical and contextualized way.", "SUSTLAW attracts a very diverse student body with ", "participants from all over the globe", ". ", "Leading experts from the North and South", " introduce salient features of their disciplines, and challenge students to reflect and digest key challenges for sustainable development and global justice.", "The University of Antwerp Law Faculty’s Law and Development Research Group will be running a training programme on ", "“Sustainable Development and Human Rights Law”", " (SUSTLAW) from ", "11 February to 3 May 2019", ".", "SUSTLAW offers a comprehensive teaching programme based on the research lines of the Law and Development Research Group. The postgraduate programme runs in conjunction with the Faculty’s Master of Laws (LL.M).", "VLIR-UOS supports the programme with 12 scholarships for participants from the global South (please consult the eligible country list).", "How to apply", "More information about the programme", "More information about the eligibility criteria for a scholarship", "Application procedure", "For self-funded applicants:", "We accept applications on rolling basis.  Find the application form ", "here", ".", "For scholarship applicants", "There is limited number of scholarships (application deadline for scholarships: 30 September 2018). Please ", "check the eligibility requirements", " before applying. Find the application form", " here", ".", "For More Information:", "Visit the Official Webpage of the VLIR-UOS Training Scholarships for Sustainable Development and Human Rights Law"], "url : https://www.opportunitiesforafricans.com/vlir-uos-training-scholarships-for-sustainable-development-and-human-rights-law-sustlaw-postgraduate-programme-2019/"], [["MasterCard Foundation Scholars Program 2019/2020 at McGill University in Canada (Fully Funded)", "date announced:September 18, 2018", "Application Deadline: February 4th 2019"], ["Application Deadline: February 4th 2019", "McGill University", " and the ", "Mastercard Foundation", " are pleased to offer full scholarships to economically challenged, academically gifted Master’s students from Sub-Saharan Africa through the ", "Mastercard Foundation Scholars Program.", " This scholarship program is designed to sponsor outstanding, community engaged students to attend university who otherwise would not have the opportunity, thereby, fostering the development of future Sub-Saharan African leaders and entrepreneurs.", "In addition to financial support, Scholars are provided with a comprehensive support network that includes an array of mentoring and support services to ensure each student’s academic success, community service engagement and transition to socially relevant employment opportunities, when they return to Africa at the conclusion of their studies.", "To be eligible for consideration for the Mastercard Foundation Scholars Master’s Program at McGill, you must:", "Be admissible to one of the eligible programs at McGill University (see Program List below);", "Have never completed any graduate studies;", "Be nominated by a professor of a recognized Mastercard Foundation Partner University, or;", "Be nominated by a current McGill Professor or Staff Member ( ", " ", "Mastercard Foundation Scholars Program – 2019 Nomination Form.pdf", ");", "Be a citizen of and have lived a significant part of your life in a Sub-Saharan African Country (see List of Eligible Countries below);", "Have an exceptional record of service and activity in your school and/or community;", "Have an intent to return to your country immediately upon the completion of your degree with the goal of transforming your community through social and economic development;", "Demonstrate that your financial status is in the lowest two quintiles of your country.", "Timeline:", "Application Period Begins : September 15, 2018", "Deadline to submit the Application for Admission in uApply and the Mastercard Scholars", "Program application documents in uApply: Your choice program’s deadline (no later than February 4th)", "Deadline to submit Supporting Documents (including transcripts, reference letters, resumes, etc.): February 4, 2019", "Mastercard Foundation Scholars Selection Committee begins to make scholarship offers: March 14, 2019", "For further questions about the application and admission process please contact ", "[email protected]", "Downloads:", "Mastercard Foundation Scholars Program – Eligible Masters Programs 2019 ", "Mastercard Foundation Scholars Program – List of Eligible Countries", "For More Information:", "Visit the Official Webpage of the MasterCard Foundation Scholars Program 2019/2020 at McGill University"], "url : https://www.opportunitiesforafricans.com/mastercard-foundation-scholars-program-2019-2020-at-mcgill-university-in-canada/"], [["Georgetown University Master of Science in Foreign Service (MSFS) Scholarships 2019/2020 for study in the United States of America ( full-tuition scholarship)", "date announced:September 26, 2018", "Application Deadline: January 15, 2019."], ["Application Deadline:", " January 15, 2019.", "As of Fall 2014,", " the Master of Science in Foreign Service (MSFS) at Georgetown University", " began offering a", " full-tuition scholarship", " for a talented graduate student from sub-Saharan Africa.", "MSFS is a two-year, full-time graduate degree program in international affairs. Students will take courses in international relations, international trade, international finance, statistics and analytical tools, and history. In addition, students choose an area of concentration such as Global Politics and Security, International Development, or Global Business and Finance.", "Special consideration will be given to applicants from:", "Côte d’Ivoire", "Ghana", "Kenya", "Liberia", "Nigeria", "Senegal", "South Africa", "To be considered for the scholarship, applicants must submit all required application materials (online application, personal statement, official transcripts and test scores, letters of recommendation). The scholarship will be awarded based on the strength of the student’s application in the admissions process.", "To be considered for the scholarship, applicants must submit all required application materials (online application, personal statement, official transcripts and test scores, letters of recommendation). The scholarship will be awarded based on the strength of the student’s application in the admissions process.", "Application Requirements:", "Application requirements include:", "A completed undergraduate degree from an accredited university and a strong academic record;", "One set of standardized test scores: TOEFL/IELTS or GRE/GMAT (for more information on which test applicants need to take, visit ", "http://msfs.georgetown.edu/admissions/faq#standardized", ");", "Completion of a course in microeconomics and a course in macroeconomics, or ability to complete both courses ", "before ", "August 1 of their matriculating year;", "Professional work experience, ideally in a field related to their future professional goals. Students have an average of four years of work experience prior to joining MSFS.", "For complete information on required application items, please visit", "How to Apply", "or more information on the academic program, visit ", "http://msfs.georgetown.edu", ". For information on how to apply, visit ", "http://msfs.georgetown.edu/admissions", ".", "For More Information:", "Visit the Official Webpage of the MSFS Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/georgetown-university-master-of-science-in-foreign-service-msfs-scholarships-2019-2020/"], [["CLIFF-GRADS scholarships 2019 for PhD students from developing countries in Agriculture & Climate change mitigation (12,000 USD in funding)", "date announced:September 19, 2018", "Application Deadline: September 30, 2018"], ["Application Deadline: ", "September 30, 2018", "The CLIFF-GRADS program", " invites applications from students from developing countries", "[1]", " currently enrolled in PhD programs for short-term scientific training and research stays on topics related to the measurement and management of greenhouse gas emissions and carbon storage in agricultural systems.", "Applicants should have a background in agriculture and climate change research and be pursuing graduate research related to agricultural greenhouse gas quantification.", "Selected students will be sponsored in the amount of ", "10,000", "–", "12,000 USD ", "for short-term (4–6 month) scientific training and research stays to collaborate with projects associated with ", "CCAFS", " and ", "GRA", ". Specific topics will depend on student and host institution scientist interests. A list of projects seeking to host students is included in the attached call for proposals under “List of research opportunities.”", "The grants will be used to support travel to and living and research costs at the host institution. Grants may not be used for tuition or unrelated personal expenses.", "CLIFF-GRADS is a joint initiative of the ", "CGIAR Research Program on Climate Change (CCAFS) L", "ow Emissions Development Flagship", " and", " the Global Research Alliance on Agricultural Greenhouse Gases (GRA).", " CLIFF-GRADS aims to build the capability of early career agriculture students in developing countries to conduct applied research on climate change mitigation in agriculture.", "Eligibility", "Applicants must be currently enrolled PhD students in a field related to quantification of greenhouse gas emissions or carbon sequestration in agricultural systems", "Applicants must be students from a developing country", "1", "Requirements of grant recipients", "Grant money should be used to finance the short-term scientific visit, including living and research costs at the host institution and all costs associated with that research, including travel, housing, meals, and research materials and services. Funding is not to be used for tuition, fees, or unrelated personal costs", "Scientific visits must take place during 2019", "Each CLIFF-GRADS recipient will work directly with a research supervisor at the host institute. The activities to be conducted by the student and a budget for the scientific visit will be agreed upon between the student and research supervisor in a Managed Contract", "The research supervisors will assess the quality of the CLIFF-GRADS recipient’s science performance and monitor the achievement of milestones and deliverables set out in the Managed Contract", "At the end of the research stay, the CLIFF-GRADS student will submit a Final Report describing the activities undertaken. Final payment to the CLIFF-GRADS recipient is dependent on this Final Report being approved by CCAFS and GRA.", "Application requirements", "The application must include the following documents ", "merged into one pdf file", ":", "1-2 page motivation letter (described below)", "1-page curriculum vitae that includes your contact details", "Letter of support from your university supervisor", "All applications must be in English", "The motivation letter, which must be no more than two A4 pages", ", must ", "include the following:", "Your name, citizenship and the country where you are conducting your graduate study", "The objectives of your graduate research", "The specific research opportunity (number and title) to which you are applying (see ", "list", "). If you are interested in more than one research opportunity, please list your preferred research opportunities (up to 3) in order of preference.", "Your research experience with greenhouse gas emissions from agriculture or soil carbon storage in agricultural systems, as relevant to the research opportunity for which you are applying", "A description of how scientific training with CCAFS/GRA scientists will improve your graduate research", "More information", "Call for proposals", ", including list of research opportunities.", "For More Information:", "Visit the Official Webpage of the CLIFF-GRADS scholarships 2019"], "url : https://www.opportunitiesforafricans.com/cliff-grads-scholarships-2019/"], [["Donald A. Wehrung International Student Award 2019/2020 for study at University of British Columbia, Canada", "date announced:October 1, 2018", "Application Deadline: December 1, 2018:"], ["Application Deadline: ", "December 1, 2018:", "The ", "Donald A. Wehrung International Student Award", " recognizes outstanding international undergraduate students from impoverished or war-torn areas who have achieved academic excellence under difficult circumstances, and who would be unable to attend university without financial assistance.", "The value of your ", "Donald A. Wehrung International Student Award", " is proportional to your demonstrated financial need and sufficient to cover living expenses and tuition costs for your degree of study.", "Your award may be renewed for up to three additional years of undergraduate study or to degree completion – whichever comes first – provided you achieve satisfactory academic standing in your faculty, continue to demonstrate financial need, and maintain your Canadian study permit (student visa).", "Eligibility", "To be considered for the Donald A. Wehrung International Student Award:", "You must be an international student who will be studying in Canada on a Canadian study permit.", "You must be graduating or have recently graduated from a recognized senior secondary school.", "You must be applying for your first undergraduate degree.", "You must meet UBC’s ", "admission requirements", ", including general and degree-specific requirements and the English Language Admission Standard.", "You must demonstrate superior academic achievement (at least an A average or equivalent standard) and leadership potential.", "You must come from a war-torn, politically unstable, or economically disadvantaged region of the world.", "You must have achieved academic excellence under difficult circumstances and have no financial means from family or other sources to pursue post-secondary education in your own country (because it is unavailable or unattainable) or outside your country (because it is unaffordable).", "Applications", "Applications for the 2018/19 academic year are now closed. Information on how to apply for the 2019/20 academic year will be available on October 1, 2018.", "Deadlines", "December 1, 2018: ", "Submit your award application and complete the ", "online application", " for admission to UBC. Although you can specify two degree choices in your application, only your first-choice degree will be considered for the purposes of this award.", "January 31, 2019: ", "Meet UBC’s ", "English Language Admission Standard", ".", "For More Information:", "Visit the Official Webpage of the Donald A. Wehrung International Student Award 2019/2020 "], "url : https://www.opportunitiesforafricans.com/donald-a-wehrung-international-student-award-2019-2020/"], [["WAAW Foundation 2018/2019 STEM Scholarship for Need-Based African Female Students.", "date announced:September 24, 2018", "Application Deadline:November 30, 2018."], ["Application Deadline:", "November 30, 2018.", "WAAW foundation’s annual scholarship initiative", " is aimed at supporting need based African female STEM-focused college education. Please read the eligibility criteria before you apply. All non qualifying applications will be automatically deleted!", "Criteria for eligibility includes:", "Female", " students of ", "African", " origin, ", "living and studying", " in Africa.", "Currently enrolled in ", "undergraduate B.S.degree", " program.", "Studying ", "STEM related courses", " in a ", "University", " or ", "college", " in ", "Africa", ".", "Demonstrable financial need, and", "Excellent Academic Record.", "Below the age of ", "32 years", ".", "Graduation date is after December of award year", "Please note that we do not fund graduate (masters, MBA or Phd) programs, second or subsequent degrees, students older than 32 years, non-STEM focused courses or Diploma degrees. There no NO EXCEPTIONS to these requirments.", "WAAW Foundation awards annual scholarships to students who demonstrate need and prove their status as full time students in a STEM related course in an African University. Recipients will be required to start a ", "STEM Outreach Chapter ", "at their university.", "L", "ist of accepted and not accepted courses. ", "Note that there are NO EXCEPTIONS to the courses listed.", "Accepted: ", "Agriculture, Aircraft engineering, Architecture, Bio Medical, Biochemistry, Biology, Botany, Chemistry, Civil engineering and urbanism, Computer Science, Construction technology and management, Economics, Electronics Engineering, Engineering Agriculture, Environmental Health, Environmental Science, Food Science Technology, Genetics, Geography, Geology, Home Science Nutrition and Dietetics, Industrial Chemistry, IT, Math related fields, Natural Science, Pharmacy, Physics, Science related fields, Statistics, Technology, Zoology", "How to Apply", "Your application will include the following:", "Application form filled out completely. We will only accept online applications this year. NO PAPER APPLICATIONS WILL BE ACCEPTED*.", "Personal and Contact Information.", "Educational background and Family Information.", "Statement of need should describe why scholarship funds are needed and what the funds will be used for if received.", "Essays are a strong criteria in determining candidates who are short listed. Responses to essay ", "where to buy modafinil online reddit", " questions that address career goals and how you expect the WAAW scholarship will assist in your education. Please have you essay responses ready before you begin the application.\n", "1. In 500 words or less, please write an essay on your future career goals and how you expect the WAAW foundation scholarship will assist in fulfilling those goals.", "2. In 300 words or less, please describe what you believe about female education in Africa and its impact on research, development or advancement in African economies.", "3. Describe in ten or less sentences why you need a scholarship. Tell us about your need or personal/family/financial situation and how the funds from WAAW scholarship will assist your education and/or career plans.", "Two academic/professional references. Note recommendations and transcripts ARE NOT REQUIRED AT THIS TIME. ONLY after a candidate has been shortlisted. However, you must provide the names of 2 references in your application.", "Submitting your application", "Please complete all sections of the application form and submit all required materials to WAAW foundation by the deadline. Application may be completed online. ", "Click Here to Begin your application", ".", "For further information or inquiries please email:", "[email protected]", "For More Information:", "Visit the Official Webpage of the WAAW Foundation 2018/2019 STEM Scholarship"], "url : https://www.opportunitiesforafricans.com/waaw-foundation-2018-2019-stem-scholarship-for-need-based-african-female-students/"], [["Albert Einstein German Academic Refugee Initiative (DAFI) UNHCR’s scholarship programme 2018 for refugee students", "date announced:September 18, 2018", "UNHCR’s scholarship programme, the Albert Einstein German Academic Refugee Initiative (DAFI), enables access to higher education for refugee students in their country of asylum since 1992."], ["UNHCR’s scholarship programme,", " ", "the", " Albert Einstein German Academic Refugee Initiative (DAFI)", ",", " enables access to higher education for refugee students in their country of asylum since 1992.", "The DAFI programme provides undergraduate refugee students with scholarships that cover a wide range of costs: from tuition fees and study materials, to food, transport and accommodation.", "To support their academic achievements and skill development, DAFI scholars receive additional support through close monitoring, academic preparatory and language classes based on students’ needs, as well as psychosocial support, mentoring and networking opportunities.", "Who can apply?", "In order to be eligible, a candidate must:", "be a refugee with recognised refugee status;", "have successfully completed secondary schooling to a high standard;", "have no other means of support for university studies;", "select a course of study that is likely to lead to employment in the country of origin with maximum three to four years duration;", "not be older than 28 years at the beginning of studies;", "have no other family member receiving a DAFI scholarship.", "In which countries are DAFI scholarships offered?", "As of 2018, DAFI scholarships are available in 50 countries, namely:", "Sub-Sahara Africa:", " Benin, Botswana, Burkina Faso, Burundi, Cameroon, Chad, Cote d’Ivoire, Eritrea, Ethiopia, Gambia, Ghana, Guinea, Guinea Bissau, Kenya, Liberia, Mali, Mozambique, Namibia, Niger, Nigeria, Rwanda, Senegal, South Africa, South Sudan, Sudan, Tanzania, Togo, Uganda, Zambia & Zimbabwe.", "Middle East & Northern Africa (MENA):", " Algeria, Egypt, Kurdistan Region of Iraq, Jordan, Lebanon, Mauritania, Morocco, Syria & Yemen.", "Asia & Pacific:", " Bangladesh, India, Iran, Kyrgyzstan, Pakistan & Tajikistan.", "The Americas:", " Ecuador.", "Europe:", " Azerbaijan, Russian Federation, Turkey & Ukraine.", "How to apply?", "Check in the list above if there is a current DAFI Programme in your country of asylum.", "Check if you meet the above-mentioned criteria.", "You can contact the respective office by emailing your country of interest in the following ", "contact form", ".", "Complete the country specific application form and submit as indicated on the form.", " ", "For More Information:", "Visit the Official Webpage of the DAFI UNHCR’s scholarship programme "], "url : https://www.opportunitiesforafricans.com/albert-einstein-german-academic-refugee-initiative-dafi-unhcrs-scholarship-programme-2018-for-refugee-students/"], [["Google Women Techmakers Scholars Program 2019/2020 for Female Students ( 7,000 EUR Award & Funded to Women Techmakers Scholars’ Retreat in summer 2019)", "date announced:September 24, 2018", "Application Deadline: December 6th, 2018 at 11:59 pm GMT."], ["Application Deadline: December 6th, 2018 at 11:59 pm GMT.", "Through the ", "Women Techmakers Scholars Program – formerly the Google Anita Borg Memorial Scholarship Program", " ", "– Google is furthering Dr. Anita Borg’s vision of creating gender equality in the field of computer science by encouraging women to excel in computing and technology and become active leaders and role models in the field.", "Scholarship", "An academic scholarship, awarded based on academic performance, leadership, and impact on the community of women in tech.", "Retreat", "An opportunity to connect with fellow scholars and Google mentors, while participating in professional and personal development trainings and workshops.", "Community", "An online network with fellow scholars program participants designed to share resources, support the global community of women in tech and collaborate on projects to make continued impact.", "Eligibility Requirements:", "To be eligible to apply, applicants must:", "Currently be enrolled at an accredited university for the 2018-2019 academic year", "Intend to be enrolled in or accepted as a full-time or part-time student in a Bachelor’s, Master’s or PhD program at a university in Europe, Middle East or Africa for the 2019-2020 academic year", "Be studying computer science, computer engineering, informatics or a closely related technical ﬁeld", "Demonstrate a strong academic record", "Exemplify leadership and demonstrate passion for increasing the involvement of women in Computer Science", "Benefits:", "Women Techmakers Scholars will each receive a 7,000 EUR award (or local equivalent) for the 2019-2020 academic year.", "A group of undergraduate and graduate students will be chosen from the applicant pool, and scholarships will be awarded based on the strength of each candidate’s impact on diversity, demonstrated leadership and academic background.", "The program is open to qualified students who meet the criteria and we strongly encourage people who identify as female to apply.", "All scholarship recipients will be invited to attend ", "the annual Women Techmakers Scholars’ Retreat in summer 2019", " to connect with fellow scholars, network with Googlers and participate in a number of workshops. ", "Professional development and community outreach opportunities will continue to be offered after the retreat. As a Women Techmakers Scholar, you will join a long-term community of scholars program participants designed to provide a forum to share resources, support other women in tech, and collaborate on projects to make continued impact.", "Application Requirements", "General background information (includes contact information and information about your current and intended institutions)", "Current resume", "Academic transcripts from your current and prior institutions (if you have earned a prior degree)", "One letter of reference from a professor, instructor, adviser or supervisor", "Responses to five essay questions", "The Women Techmakers Scholarship is a one-time scholarship. While past applicants and finalists are encouraged to reapply, unfortunately, past recipients of any Google scholarship, including the Women Techmakers Scholarship and Google Anita Borg Memorial Scholarship, are not eligible to apply. For questions, please email ", "[email protected]", ".", "The application for the 2019-2020 Scholars Program is now open and will close December 6th, 2018 at 11:59 pm GMT.", "For More Information:", "Visit the Official Webpage of the Google Women Techmakers Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/google-women-techmakers-scholars-program-2019-2020/"], [["Guinness Nigeria Undergraduate Scholarship Scheme 2018/2019 for young Nigerians", "date announced:September 28, 2018", "Applications are invited from suitable qualified students who which to be considered for the Guinness Undergraduate Scholarship."], ["Applications are invited from suitable qualified students who which to be considered for the ", "Guinness Undergraduate Scholarship.", "This scholarship supports Guinness Nigeria’s commitment to implementing transformative schemes that foster youth development. The scholarship will provide full tuition for students who are currently studying in Nigerian Universities and Polytechnics. Students from Guinness host communities are encouraged to apply.", "Selection Criteria:", "Candidates may be required to write an aptitude test", "Shortlisted candidates may be required to provide a letter of introduction from the chairman of their community of their Community Development Associations where applicable.", "Eligibility Requirements:", "Applications are open to students studying the following courses: Engineering & Sciences – Mechanical, Electrical, Chemical, Lab Science, Microbiology, Bio-Chemistry, Marketing & Sales, Human Resources/Industrial & Labour Relations and Accounting", "Candidates must be 1st or 2nd year students in Nigeria Universities or Polytechnics", "Application Procedure:", "Candidates who meet the above selection criteria should send the following details to: ", "[email protected]", "Full Name", "\nUniversity/Polytechnic", "\nMatriculation Number/Year of study", "\nHome Town/Local Government Area/State of Origin", "\nPhone Number/e-mail address", "\nScanned copy of Student ID card or", "\nAdmission letter", "For More Information:", "Visit the Official Webpage of Guinness Nigeria"], "url : https://www.opportunitiesforafricans.com/guinness-nigeria-undergraduate-scholarship-scheme-2018-2019-for-young-nigerians/"], [["Irish Aid Fellowship Training Programme 2019/2020 for study in Ireland (Fully Funded)", "date announced:October 3, 2018", "Application Deadline: 30 November, 2018."], ["Application Deadline: ", "30 November, 2018.", "The Fellowship Training Programme", " was", " Irish Aid’s first scholarship programme", ",", " begun in 1974. Since that time, it has brought suitably qualified candidates from developing countries to undertake Masters degrees at universities and colleges in Ireland, with further students supported for similar courses in their own region.", "Awards are made in fields such as development studies, rural development, health care, education and law with the aim of supporting and enhancing the contribution recipients can make to Irish Aid’s partner organisations. Fellowship eligibility requirements aim to ensure close alignment with Irish Aid’s programmatic approach.", "The scholarship award covers course fees, required flights, accommodation (for out of country study), monthly allowances, insurance and other incidental expenses. Eligible Masters programmes in Ireland commence in the period August to September each year and, depending on the course, scholarships will run for between 10 and 16 months.", "Eligibility", "To be eligible, applicants must", "be a citizen of one of Irish Aid’s partner countries (i.e. Ethiopia, Malawi, Mozambique, Sierra Leone, Tanzania, Uganda, Vietnam and Zambia), or of Cambodia, Kenya, Liberia, Palestine, Myanmar, Rwanda or Zimbabwe.", "be resident in that country.", "have achieved the necessary academic standard to be accepted onto a Master’s degree course in a higher education institution in Ireland or within their own region.", "be able to demonstrate a strong commitment to the development of their home country.", "have identified relevant college courses in a higher education institution in Ireland or within their own region. For study in Ireland, you must select courses from the Irish Aid Directory of Eligible Postgraduate Courses", "be applying to commence a new qualification and not be seeking funding for a course they have already commenced or which will begin before fellowship awards have been notified.", "be able to take up the fellowship in the academic year 2019/2020.", "For study in Ireland, applicants must also", "be able to demonstrate skills in academic English by achieving an appropriate score on a recognised test (IELTS 6.5)", "contact the Irish Embassy to confirm that the courses they have chosen from the Directory of Postgraduate Courses accord with the Embassy’s priorities in their country (see contact information below).", "All applicants who apply to study in Ireland and are selected to go forward to second stage will be required to sit an ", "IELTS exam", ", unless they are already in possession of an IELTS certificate that is less than 12 months old at the time of application which shows the applicant has achieved the necessary score for the course they intend to apply to. ", "Early preparation", " for the IELTS exam is strongly advised, even for native English speakers.", "Eligible Countries:", "Cambodia", "Ethiopia", "Kenya", "Laos", "Liberia", "Malawi", "Mozambique", "Myanmar", "Palestine", "Rwanda", "Sierra Leone", "Tanzania", "Uganda", "Vietnam", "Zambia", "Zimbabwe", "Eligible Courses:", "Relevant Masters programmes in Ireland and regionally.  A directory listing suitable courses for study in Ireland is available to applicants, covering programmes in up to 12 subject areas.", "Before finalising your course choices and submitting your application, please confirm with the relevant Irish Embassy that they remain fully satisfied that the courses you have chosen from the Irish Aid Directory of Eligible Postgraduate Courses accord with the Embassy’s country priorities. Embassy contact details are available below.", "Contact", "Click on your country below to contact the relevant Embassy of Ireland / Mission.", "Cambodia", "Ethiopia", "Kenya", "Liberia", "Malawi", "Mozambique", "Myanmar", "Palestine", "Rwanda", "Sierra Leone", "Tanzania", "Uganda", "Vietnam", "Zambia", "Zimbabwe", "For More Information:", "Visit the Official Webpage of the Irish Aid Fellowship Training Programme 2019/2020"], "url : https://www.opportunitiesforafricans.com/irish-aid-fellowship-training-programme-2019-2020/"], [["DIIS/Kofi Annan International Peacekeeping Training Centre PhD Scholarships 2018/2019 for study at the University of Ghana (Fully Funded)", "date announced:September 21, 2018", "Application Deadline:15 October 2018, at noon. "], ["Application Deadline:", "15 October 2018, at noon. ", "Security Implications of United Nations Peacekeeping in Ghana", "Advance theoretical, research-based and policy-applicable knowledge on the domestic security implications of Ghana’s contributions to UN peacekeeping", "University of Ghana, Kofi Annan International Peacekeeping Training Centre (KAIPTC), Danish Institute for International Studies (DIIS),", " and ", "Danish Institute Against Torture (DIGNITY)", " are undertaking a collaborative research project on the ", "Domestic Security Implications of United Nations Peacekeeping (D-SIP)", " in Ghana. D-SIP’s objective is to understand the linkages between peacekeeping contributions, domestic security provision and drivers of stability in Ghana. By producing knowledge on how participation in international peacekeeping shapes the legitimacy and effectiveness of security institutions and practices in troop contributing countries, D-SIP offers insight into broader dynamics of peace and state-building.", "Since the early 2000s, UN peacekeeping has increased in scope and complexity. The global spend in 2016 was $7.87 billion with 118,792 personnel deployed to 16 operations. The sustainability of UN operations depends on countries from the global South that constitute the top ten troop contributors. Their motivations to provide peacekeepers are economic, political, institutional and normative. However, knowledge is lacking on how peacekeeping participation impact on domestic security and stability in troop contributing countries, both at national and local levels.", "As part of the D-SIP programme, the University of Ghana invites interested and qualified citizens of Ghana, holding MPhil/MA/MSc/LLM degrees in law, social or political sciences, to submit their applications for 3 PhD positions. The successful candidates will be enrolled at the Institute of African Studies at the University of Ghana and receive a PhD in African Studies with a specialisation in security and peacekeeping. They will be supervised by a joint team of D-SIP researchers from the University of Ghana, KAIPTC, DIIS and DIGNITY.", "The candidates will spend their experiential learning attachments at DIIS and KAIPTC, including study stays and thesis writing time at both institutions, in Accra and Copenhagen, respectively. The candidates will be fully integrated members of the D-SIP research team.", "Benefits:", "The successful candidates will receive a stipend throughout the 4-year period of their studies, and all costs for fieldwork, PhD training-related travel, and conferences abroad will be covered by D-SIP.", "The positions are for four (4) years full-time and will ", "commence on 1 February 2019", " or as soon as possible thereafter. While undertaking qualitative fieldwork in Accra, Tamale and/or another location in rural or urban Ghana, the three successful PhD candidates will each adopt a specific thematic focus, for example:", "National level organisation of security and how it has been influenced by Ghana’s peacekeeping experience;", "How security is provided in Accra, and trace how Ghana’s experience of peacekeeping has shaped local-level policing; and", "How security is provided in Tamale, and trace how Ghana’s experience of peacekeeping has shaped local-level policing.", "Any other theme related to security provision and peace-keeping in rural or urban Ghana.", "The candidates are expected to conduct up to 8 months of ethnographic fieldwork, and to participate in teaching at the University of Ghana.", "The successful PhD candidates will contribute to the overall research objective of identifying the domestic security implications of UN peacekeeping contributions in Ghana.", "D-SIP is funded by the Danish Ministry of Foreign Affairs.", "Eligibility", "Successful candidates are required to:", "Hold a master’s degree in the social sciences, political science, law or inter-disciplinary studies.", "Be highly motivated to develop a scientific career, and to pursue doctoral studies according to the approved study plan.", "Possess and demonstrate good scientific writing skills.", "Have a strong methodological and conceptual background in the relevant scientific disciplines or areas.", "Ideally have ethnographic fieldwork experience.", "Ideally have worked with security related issues in Accra, Tamale or elsewhere.", "Be a constructive and engaged team worker", "Application Process", "Potential applicants are invited to prepare a 4-5-page concept note (maximum 2,000 words) which, with reference to the selected PhD focus (please select from above), outlines a detailed focus for the proposed PhD project as well as research assumptions and questions. Applicants, who wish to apply for the PhrD position under two or more thematic areas, should develop a separate concept note for each of the focus areas. The following details must be included in the concept note:", "Statement of the research problem and how it will be investigated through more specific research questions.", "Discussion of the analytical framework of the research problem in light of relevant theory.", "Description of the geographical and socio-political context of the study (Accra/Tamale).", "Presentation of the research design and the methods that will be employed to generate the data.", "Practical considerations.", "Ethical considerations.", "Time plan.", "Please make sure to clearly indicate which of the PhD positions you apply for.", "In addition to this concept note, the application should be accompanied by a CV, including a list of publications as well as names and contact details of a 2-3 academic references.", "Deadline for application is 15 October 2018, at noon. ", "   ", "The application should be submitted online to Dr Richard Asante via ", "[email protected]", " and ", "[email protected]", ", with copy to Dr Kwesi Aning (", "[email protected]", "), Professor Dzodzi Tsikata (", "[email protected]", "), Dr Peter Albrecht (", "[email protected]", "), and Professor Raymond Atuguba (", "[email protected]", "). ", "All five can be contacted for more information on D-SIP.", "For More Information:", "Visit the Official Webpage of the DIIS/Kofi Annan International Peacekeeping Training Centre PhD Scholarships "], "url : https://www.opportunitiesforafricans.com/diis-kofi-annan-international-peacekeeping-training-centre-phd-scholarships-2018-2019-for-study-at-the-university-of-ghana/"], [["Funza Lushaka Bursary Programme 2019 for young South Africans", "date announced:October 1, 2018", "Application Deadline: 16 November 2018;"], ["Application Deadline: ", "16 November 2018;", "The Funza Lushaka Bursary Programme", " is a multi-year programme to promote teaching as a profession. Bursaries are available to enable eligible students to complete a teaching qualification in an area of national priority. Recipients of these bursaries will be required to teach at a public school for the same number of years that they received the bursary.", "Recipients of the bursary must apply on-line for the bursary in every year. The recipient must also complete the placement information as required in every year. The provincial education department (PED) will place a graduate bursar in a suitable teaching post. If a particular PED does not have a suitable teaching post for the graduate bursar, the applicant may be placed in a PED that does have a suitable post. Please note that bursars cannot choose the school in which they would like to be placed and placement cannot be deferred for any reason.", "IMPORTANT NOTICE:", "Applications for the Funza Lushaka bursary for 2019 will open on ", "01 October 2018.", "Please note that there are a limited number of new bursaries available for 2019.", "New applicants are advised to also pursue other funding opportunities such as NSFAS.", "The outcome of the selection process will be available from the University not later than 30 April 2019.", "  ", "Closing dates:", "Re-applications ", "close on ", "16 November 2018;", "New applications ", "close on ", "11 January 2019.", "For More Information:", "Visit the Official Webpage of the Funza Lushaka Bursary Programme 2019"], "url : https://www.opportunitiesforafricans.com/funza-lushaka-bursary-programme-2019-for-young-south-africans/"], [["The African Development Institute of the African Development Bank Next African Global IT Leaders Program 2019 for study in Korea (Funded)", "date announced:September 13, 2018", "Application Deadline:  5pm on 14 September 2018 (Seoul time)."], ["Application Deadline: ", " 5pm on 14 September 2018 (Seoul time).", "The African Development Institute of the African Development Bank", " has announced the implementation of the", " Next African Global IT Leaders Program", " under the aegis of the", " Korea-Africa Economic Cooperation (KOAFEC) Knowledge Sharing Program (KSP).", "The objective of the program is to create a critical mass of highly trained professionals in ICT across the African continent at the level of Global IT experts.", "The program is designed to expose mid-career professionals in African countries to the latest techniques and knowledge available through graduate studies at higher educational institutions in Korea, the announcement said.", "Upon completion of their studies, the scholars would return to their home countries in order to apply and to disseminate their newly acquired knowledge and skills to enhance the socio-economic development of their countries.", "This two-year Master’s degree program in Information Technology provides integrated courses focused on the IT technologies and strategies of Korea.", "It also avails opportunities for networking with Korean IT industrial companies through classes and seminars; field trips to traditional sites to experience Korean culture and history; and on-site workshops at IT companies to take a view of the scene of Korea’s IT industry.", "Benefits:", "KAIST", " scholarship recipients will be announced with the admission result.", "\nThe scholarship amount and conditions are set prior to student enrollment based on the merits of the applicant.", "The KAIST Scholarship Committee will examine further exemption of tuition and fees every year. KAIST scholarship recipients are generally exempt from paying tuition and fees. A monthly allowance of 350,000 KRW for Master’s course students and 400,000KRW for Doctoral degree course students and the National Health Insurance fee are supported by the recipient’s advisor/department.", "A rigorous student selection program is in place that targets employees in the field of ICT in public and private sector in the Bank’s Regional Member Countries. Applicants should additionally have the following qualifications:", "A certified bachelor`s degree in an IT-related area", "A certificate of English proficiency: TOEFL (iBT 83, PBT 560, CBT 220), IELTS 6.5, TEPS 599, TOEIC 720 or higher). These should have been taken at least two years ahead of the deadline of the application", "A public official, employee of public institutions or senior-level researcher at national research institutes working in the IT fields.", "This program is not available to Korean citizens, including Koreans who hold dual citizenship.", "For More Information:", "Visit the Official Webpage of the African Development Bank Next African Global IT Leaders Program 2018 "], "url : https://www.opportunitiesforafricans.com/the-african-development-institute-of-the-african-development-bank-next-african-global-it-leaders-program-2019/"], [["Echidna Global Scholars Program 2018/2019 at Brookings Institution, Washington D.C USA ( USD $5,000/Month Stipend & Fully Funded)", "date announced:September 24, 2018", "Application Deadline: October 1st 2018"], ["Application Deadline: October 1st 2018", "The Echidna Global Scholars Program", " is a visiting fellowship hosted by the ", "Center for Universal Education (CUE) at the Brookings Institution.", " The program aims to build the research, analytical, and leadership skills of NGO leaders and academics who have substantial experience with and ties to developing countries, whose work has a specific focus on improving learning opportunities and outcomes for girls in the developing world.", "Echidna Global Scholars spend four to six months at Brookings Institution in Washington D.C. The structure of the program is divided into two main components to assist the scholars in having impact when returning to their home countries: research on global education issues, and leadership training. The research component of the program will include a data-collection phase at home and a writing and analysis phase during a residency at Brookings. It aims to equip global girls’ education leaders with the skills and support necessary to create a written policy research product to affect change for girls in their home countries.", "The leadership component of this program is built on the understanding that emotionally intelligent leadership is a core competency in girls’ education leadership and is thus integrated throughout the scholars’ residency at Brookings. Scholars will be exposed to new frameworks of leadership and be required to continually think reflexively on their own leadership style and philosophy. Upon completion of their fellowship, CUE supports the scholars in implementing an action plan that applies their new skills and expertise in the developing country where they have demonstrated substantial ties. This position would be ideal for a candidate with 10-15 years of professional experience in a related field.", "Qualifications", "Education /Experience Requirements: ", "The program selects professionals with substantial experience in and ties to developing countries, a demonstrated intent to return to a developing country after completing the period of residency at Brookings, and a passion and demonstrated commitment to girls’ education.", "Applicants should have a background in education, development, economics, or a related area, with a minimum of 10 years of professional experience in either research/academia; non-government and civil society; government; or business.", "Master’s degree required; Ph.D. or research background strongly preferred.", "Knowledge/Skills Requirements: ", "Strong analytical and writing skills. Successful applicants will have an intimate understanding of education development issues and gender.", "Benefits:", "Please note that this position is a short-term full-time resident fellowship at Brookings (it is not an employee position).", "Applicants selected for the fellowship will receive a living stipend of USD $5,000 a month (subject to U.S. tax withholding and reporting), paid single-occupancy housing for the four-and-a-half-month term, and round-trip travel expenses, and a limited health insurance plan.", "Program Requirements:", "Echidna Global Scholars must be available for a full-time, on-site affiliation with the Brookings Institution for the entire duration of the residency of the program as well as a pre-arrival data collection phase of research prior to their arrival.  Soon after selection, Echidna Global Scholars are required to conduct research on a topic approved by Christina Kwauk, Fellow and lead of the Girl’s Education team at CUE. Scholars will  present their research papers at a Brookings hosted day-long conference at the end of the residency.  Each Scholar is expected to be an active participant in Brookings and CUE activities, including, but not limited to, regularly-scheduled organizational staff meetings, informal discussions, seminars, presentations, and other CUE and Brookings events. ", " ", "How to Apply:  ", "Submit a cover letter that explains your goals and intent for the program, along with your curriculum vitae or resume which will include a list of your publications, and fellowships, honors, awards, funded research, or  foundation support that you have received. Please attach curriculum vitae or resume and cover letter as one document when you apply, as instructed.", "When prompted, attach answers to Questionnaire, in the Writing Sample section. Click  ", "here", " to access document", "When prompted, attach Research Project Proposal, in the Writing  Sample section. Click ", "here", "  to access document", "*Documents must be saved with a format of Last Name, First Name and document name (for example: Doe_Jane_CV).Note that letter of recommendations, writing samples and transcripts are NOT required. Please upload Questionnaire and Research Project Proposal in the Writing Sample section.", "Only applicants selected for interviews will be contacted. Candidates selected for interviews may be asked to submit additional materials.", " Incomplete applications, and any applications received after the deadline will not be considered. If you require visa sponsorship to participate in this fellowship program, your English proficiency will be verified via an objective assessment as required by the U.S. Department of State.", "Timing and Application Deadlines:", "Application deadline: October 1, 2018", "Tentative Residency Term: June 3, 2019- October 18, 2019", "For More Information:", "Visit the Official Webpage of the Echidna Global Scholars Program 2018/2019"], "url : https://www.opportunitiesforafricans.com/echidna-global-scholars-program-2018-2019/"]]