[[["Hungary Scholarship Programme 2020/2021 for Christian Young People to study in Hungary (Fully Funded)", "date announced:January 3, 2020", "Application Deadline: 31st January, 2020 (23:59 Budapest time)."], ["Application Deadline: 31st January, 2020 (23:59 Budapest time).", "Hungary ", "provides high quality education in the heart of Europe. Today, there is a growing demand of international students to study in Hungary. Besides the quality of education and degrees recognised throughout Europe and beyond, students are attracted by the affordable living costs with an extremely favourable cost-to-value ratio, a safe and friendly living environment with convenient public transportation, the central location of the country in Europe, and the unspoiled natural beauties combined with a 2000 year-old, rich Hungarian history and several UNESCO World Heritage Sites. ", "Hungary is also within the top countries with the highest number of scientific Nobel Prize Winners per capita, and a numerous scientific inventions from Vitamin C to Rubik’s cube and so on.", " ", "The core mission of the Scholarship Programme for Christian Young People is to provide the possibility of studying in Hungary for young Christian students living in the crisis regions of the world and/or being threatened in their country because of their faith. After completing their studies, the scholarship holders will return to help their home community with their gained knowledge, and they will participate in the reconstruction of war-destroyed countries and contribute to improvement of social situation and preservation of culture of Christian communities.", " ", "The Programme is managed by the State Secretariat for the Aid of Persecuted Christians and for the Hungary Helps Programme and is organized by Tempus Public Foundation.", "Eligibility", " ", "Eligible Participating Countries, available study levels, preferred study fields", " The Scholarship Programme for Christian Young People is based on the cooperation between the State Secretariat for the Aid of Persecuted Christians and for the Hungary Helps Programme and Churches that pursue humanitarian activities in crisis regions. List of churches can be found in Annex 1.", " For the 2020/21 academic year, the scholarship is announced for the citizens of the following countries: Egypt, Lebanese Republic, Republic of Iraq, State of Israel, Palestine, Islamic Republic of Pakistan, Syrian Arab Republic, Republic of Kenya, Federal Democratic Republic of Ethiopia, Republic of Armenia and Nigeria.", "Benefits:", " Tuition-free education", "\no exemption from the payment of tuition fee", "\n Monthly stipend", "\no bachelor’s, master’s and one-tier master’s level: monthly amount of HUF", "\n128,520 (cca. EUR 400) contribution to the living expenses in Hungary, for 12", "\nmonths a year, until the completion of studies", "\no doctoral level: the monthly amount of scholarship is HUF 140,000 (cca EUR 450)", "\nfor the first phase of education (4 semesters) and HUF 180,000 (cca EUR 570) for", "\nthe second phase (4 semesters) – for 12 months a year, until completion of studies.", "\n Accommodation", "\no free dormitory place or a contribution of HUF 40,000 to accommodation costs for", "\nthe whole duration of the scholarship period (Please note that if the student does", "\nnot live in the dormitory, then the HUF 40 000/month (cca. EUR 125) is only a", "\ncontribution to rental costs, and in bigger cities – especially in the capital city – this", "\ncontribution would not cover the full amount of rental costs.)", "\n Reimbursement of travel costs", "\no HUF 200,000 /academic year (cca. EUR 640)", "\n Medical insurance", "\no health care services according to the relevant Hungarian legislation (Act LXXX of", "\n1997, national health insurance card) and supplementary medical insurance for up", "\nto HUF 65,000 (cca. EUR 205) a year/person", "For More Information:", " ", " ", "Visit the Official Webpage of the Hungary Scholarship Programme 2020/2021"], "url : https://www.opportunitiesforafricans.com/hungary-scholarship-programme-2020-2021/"], [["TaiwanICDF’s International Higher Education Scholarship Program 2020 for study in Taiwan (Fully Funded)", "date announced:January 2, 2020", "Application Deadline:March 15th 2020"], ["Application Deadline:March 15th 2020", "International education and training has long been one of the ", "TaiwanICDF’s ", "core operations, among many others. Human resources development programs play a vital role in assisting partner countries achieve sustainable development, and education is a crucial mechanism for training workforces in developing countries. The TaiwanICDF provides scholarships for higher education and has developed undergraduate, graduate and Ph.D. programs in cooperation with renowned partner universities in Taiwan.", "Requirements:", "An applicant must:", "  Be a citizen of a country on the List of Countries Eligible for TaiwanICDF Scholarship, and satisfy any specific criteria established by his or her country and/or government of citizenship.", "  Neither be a national of the Republic of China (Taiwan) nor an overseas compatriot student.", "  Satisfy the admission requirements of the partner university to which he or she has applied to study under a TaiwanICDF scholarship.", "  Be able to satisfy all requirements for a Resident Visa (Code: FS) set by the Bureau of Consular Affairs, Ministry of Foreign Affairs, and an Alien Resident Certificate (ARC) set by the Ministry of the Interior, of the ROC (Taiwan) government (this means that the TaiwanICDF has the right to revoke a scholarship offered if an", "applicant cannot satisfy the visa requirements).", "  Upon accepting a TaiwanICDF scholarship, not hold any other ROC (Taiwan) government-sponsored scholarship (such as the Taiwan Scholarship) in the same academic year in which the TaiwanICDF scholarship would be due to commence.", "  Not be applying for another TaiwanICDF scholarship in unbroken succession —to apply for a 2020 scholarship, applicants who have already held a TaiwanICDF scholarship, MOFA’s Taiwan Scholarship or an MOE scholarship must have graduated before July 31, 2019.", "  Have never had any scholarship revoked by any ROC (Taiwan) government agency or related institution, nor been expelled from any Taiwanese university", "Scholarship Benefits", "Airfare: The TaiwanICDF arranges economy class, return tickets for the", " most-direct flights to and from Taiwan.", "Housing: All students must reside in student dormitories.", "Tuition fees: The TaiwanICDF covers tuition fees as required by a student’s", " university.", "Credit fees: Credit fees, which vary with the number of credits registered,", " are also covered as required by a student’s university.", "Insurance: In addition to the mandatory student safety insurance set by the", " Ministry of Education, each student must be insured for accident and medical", " coverage while in Taiwan. The TaiwanICDF covers insurance fees for the", " entire duration of a student’s program.", "Textbook costs: The costs of textbooks purchased as required by instructors are covered by the TaiwanICDF, subject to the approval of the director of the student’s institute.", "Allowance:", " (1) Undergraduate Program: Each student receives NT$12,000 per month as", " an allowance for food and miscellaneous living expenses. This is deposited", " into a student’s local bank account on a monthly basis.", " (2) Master’s Program: Each student receives NT$15,000 per month as an", " allowance for food and miscellaneous living expenses. This is deposited into a", " student’s local bank account on a monthly basis.", " (3) Ph.D. Program: Each student receives NT$17,000 per month as an", " allowance for food and miscellaneous living expenses. This is deposited into a", " student’s local bank account on a monthly basis. A student’s host institute may", " offer to continue paying this monthly allowance for courses exceeding four", " years; the duration and amount will be determined by the host institute.", "Application Procedure", "The annual application period runs, in principle, from January 1 to March 15. For 2020 Scholarship program, the application period runs from January 1 to March 15, 2020.", "Applicants should submit the documents listed below to the ROC (Taiwan) Embassy/ Consulate General/ Representative Office in their country. Applicants must ensure that they submit accurate and complete documentation; failure to do so will result in the application not being processed.", "Please also note: 1. Late submissions will not be accepted and/or processed. 2. All Undergraduate Programs only accept applications submitted by citizens of allied countries of ROC(Taiwan).", "A photocopy of applicant’s passport or other document showing proof of nationality.", "A photocopy of applicant’s highest-level diploma and academic transcripts.", "A photocopy of applicant’s English proficiency certificate.", "Please note: This means a TOEFL test score or that of another recognized English proficiency exam, or documents certifying that the applicant has graduated from a program where all courses were taught in English. Applicants who are unable to provide such proof of English proficiency due to special circumstances may be assessed for English proficiency by an ROC (Taiwan) Embassy/ Consulate General/ Representative Office via interview or other forms of testing. Applicants whose official national language is English are exempt from needing to supply these documents.", "Two letters of reference.", "Any other documents specifically requested by an ROC (Taiwan) Embassy/ Consulate General/ Representative Office.", "For More Information:", " ", " ", "Visit the Official Webpage of the TaiwanICDF’s International Higher Education Scholarship Program 2020"], "url : https://www.opportunitiesforafricans.com/taiwanicdfs-international-higher-education-scholarship-program-2020/"], [["Chinese Government Scholarship—China-Africa Friendship General Scholar Program of Wuhan University 2020 (Funded to study in China)", "date announced:January 7, 2020", "Application Deadline:  April 30, 2020 "], ["Application Deadline:  April 30, 2020 ", "Chinese Government Scholarship-China-Africa Friendship Program", " is a full scholarship established by Ministry of Education to support Chinese universities to attract outstanding international students from African Countries for six month general studies in China. Wuhan University is one of the prestigious universities designated to undertake this program to recruit students.", "Supporting Categories, Duration and Instruction Language", " Program", "Field", "Program length", "Teaching language", "Clinical Medicine(   Stomatology)", "Medicine and health", "February 17, 2020- July 15,    2020August 31, 2020- February 28,    2021", "Chinese/English", "Clinical Medicine(Surgery)", "Medicine and health", "February 17, 2020- July 15,    2020August 31, 2020- February 28,    2021", "Chinese/English", "Globe Health", "Medicine and health", "February 17, 2020- July 15,    2020August 31, 2020- February 28,    2021", "Chinese/English", "Eligibility of Applicants:", "1. Full time applicants of African countries’ nationalities and in good health.", "2. Applicants for English-medium programs should provide score report of English Language test. TOEFL requires 80, IELTS requires 5.5. For those who could not offer the above mentioned standard English test results, additional oral or written English test organized by Wuhan University will be required to participate in.", "Native English-speaking applicants could be exempted from providing the above English proficiency certificate.", "3. This program also support the students who had been studied or are studying in China.", "4. Applicants did not receive any other types of scholarship.", "Scholarship Coverage and Criteria", "1. Tuition waiver;", "2. Accommodation(700RMB/per month);", "3 .Living allowance: ( 3000RMB/per month);", "4. Comprehensive medical insurance.", "Procedure of Application", "1. Register and submit your online application at the CSC Online Application System for International Students at ", "http://laihua.csc.edu.cn", ". The code of Wuhan University is", " 10486. Please Choose Program category type B which refers to scholarship programs responsible by ", "China-Africa Friendship", " under Chinese Government Scholarship", ". ", " ", "Please download and print a hard copy of the “Application Form for Chinese Government Scholarship” after you complete the form.", "2. Register and submit your online application at Wuhan University Online Application System for International Students at ", "http://admission.whu.edu.cn", ", submit online the completed “Application Form for International Scholars and Students of Wuhan University” and required application documents listed below:", "Application Document", "1. Application Form for Chinese Government Scholarship (written in Chinese or English).", "2. Application Form for International Scholars and Students of Wuhan University (written in Chinese or English).", "3. Notarized degree certificate and transcripts. Prospective diploma recipients should submit official document issued by your current school to prove not only your current student status, but also the expected degree certificate and graduation date. Documents in languages other than Chinese or English should attach notarized Chinese or English translations.", "4. Study Plan, within 800 words, written in Chinese or in English.", "5. One recommendation letters from either professors or associate professors, in Chinese or English.", "6. Scanned copy of valid ordinary passport with a minimum of one year before its expiration (personal information page).", "7. Photocopy of Foreigner Physical Examination Form, filled in English or Chinese, can be downloaded from http://www.csc.edu.cn/laihua or http://admission.whu.edu.cn/en/?c=content&a=list&catid=81.The Physical examinations must cover all the items listed in the Foreigner Physical Examination Form. Incomplete forms or forms without the signature of the attending physician, or the official stamp of the hospital, or a sealed photograph of the applicant are considered as invalid.", "Please carefully plan your physical examination schedule as the result is valid for only six months. Please keep the original copy of the form for the school registration. ", "8. Valid English level certificate is required if applying for English-medium program (e. g TOEFL or IELTS).", "9. Acceptance letter from the professor of Wuhan University (if available).", "10. Performance certificate from the China’s universities if the applicants had been or are studying in China.", "Application Time", "Before November 20, 2019 (study period: February 17, 2020- August 17, 2020)", "Before April 30, 2020     (study period: July 15, 2020- February 28, 2021)", "Others", "1. The admitted students must apply X visa (X1 or X2) to enter China. University will not register the students who come with other types of visa. The Scholarship will not be reserved if the recipient cannot arrive campus before the registration deadline (The registration time will be notified on your admission notice).", "2. The Scholarship recipients shall not change their host university, field of study, or duration of study unless they give up the scholarship.", "Contact Information", "Mail Address", "Admissions Office 101, School of International Education, Wuhan University, No.299, Bayi Road, Wuchang Dist., Wuhan, Hubei Province, China 430072; Post code:430072", "Tel:  ", "0086-27-68753912   ", "Fax:  ", "0086-27-87863154", "Email:", " ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Chinese Government Scholarship—China-Africa Friendship General Scholar Program"], "url : https://www.opportunitiesforafricans.com/chinese-government-scholarship-china-africa-friendship-general-scholar-program-of-wuhan-university-2020/"], [["Marshal Papworth Scholarships Programme 2020/2021 at the University of Reading,UK.", "date announced:January 2, 2020", "Application Deadline:11th February 2020, 4:00 PM GMT "], ["Application Deadline:", "11", "th", " February 2020, 4:00 PM GMT", " ", "Th", "e Marshal Papworth Scholarships Programme at Reading", " ", "is a merit and experience-based award given to talented individuals who demonstrate that they have the potential, at the end of their Master’s programme, to motivate people and communities in their home country towards positive change. The Scholarships are offered in collaboration with the Wallace and Muriel Hurst Fund.", "Requirements", "Eligibility Criteria", "1. Candidates must have demonstrable work or voluntary experience working in community development and/or agricultural development.", "2. Candidates must have a 2:1 or 1", "st", " class degree at the undergraduate level (we use ", "NARIC", " to assess degree equivalency).", "3. The awards enable Scholars to study on any one of the following one-year postgraduate Master’s courses offered by the Graduate Institute of International Development and Applied Economics (GIIDAE) at the University of Reading:", "Agriculture and Development", "Applied International Development", "Climate Change and Development", "Communication for Development", "Environment and Development", "Food Security and Development", "At least one scholarship will be awarded to the MSc Agriculture and Development. The remaining scholarships will be awarded to applicants across a range of the remaining degree programmes.", "4. The candidate should usually be from one of the countries listed in Appendix 2 and be domiciled in that country at the time of their application. These have been derived based on countries with a GNI per capita below $11500 USD, and be residing in that country at the time of application.", "5. Candidates must demonstrate that they have achieved the English language requirements stipulated by the University of Reading ", "6. Those who have already pursued study at the Master’s level will not normally be considered unless this forms part of the entry level criteria.", "7. Candidates should normally have an unconditional offer from the University of Reading by the time they apply for the scholarship. If their offer is conditional, it will be considered, but all conditions must be successfully met immediately upon request by GIIDAE.", "8. Receipt of an application form in and of itself DOES NOT mean that the candidate is eligible to apply; you must meet all of the eligibility criteria list above.", "9. The deadline for applications ", "11", "th", " February 2020, 4:00 PM GMT", " (Greenwich Mean Time). All applications received after this date will be disqualified.", "For More Information:", " ", " ", "Visit the Official Webpage of the Marshal Papworth Scholarships Programme 2020/2021"], "url : https://www.opportunitiesforafricans.com/marshal-papworth-scholarships-programme-2020-2021/"], [["IMU Abel Visiting Scholar Program 2020/2021 for Mathematicians from Developing Countries (Fully Funded & USD 5,000/Grantee)", "date announced:January 7, 2020", "Application Deadline:April 30, 2020"], ["Application Deadline:April 30, 2020", "The International Mathematical Union", " ", "invites applications from mathematicians professionally based in developing countries to visit an international research collaborator ", "for a period of one month.", "In case the length of the visit exceeds one month, the candidate should provide evidence of financial support from the host institution to cover the living expenses beyond the first month.", "The program is designed for post doctoral mathematicians in the early stages of their professional careers. It is designed to offer the opportunity for a ‘research sabbatical,’ a necessary complement to teaching and other academic duties for mathematicians desiring to also sustain a viable research program.", "The Abel Visiting Scholar Program is fully funded by the ", "Abel Prize", " in mathematics.", "Usually up to 3 Grants are available per YEAR.", "Requirements", "Applicants must", "     1.   hold at the time of application a PhD ", "in Mathematics", ",", "     2.   be based in ", "a developing country", " at the time of application", "     3.   ", "hold a position in a university/ research institution", "     4.   be in the ", "early stages of their professional careers", ", more precisely: the applicants  should", "            4. 1) not yet be of full professorial rank but have a working contract in a university/ college", "            4. 2) be under 40 years of age at the day of the application deadline.", "The maximum age may be increased by up to three years in the case of an individual with a broken career pattern", ". This should be noted in the application together with the reason for the broken career pattern.", "Applications from women mathematicians are strongly encouraged.", "Applications must be received at least four months before the desired starting date. The selection committee will review the applications and award fellowships every four months. The result is announced on the Abel Visiting Scholar 2019 Recipients page.", "The following deadlines apply:", "August 31, 2019 is for visits during January 1 and April 30, 2020", "December 31, 2019 for visits between May 1 and August 31, 2020 ", "April 30, 2020 for visits starting between September 1 and December 31, 2020", "If your application is not complete by the deadline, it cannot be considered for the evaluation round.", "For More Information:", "Visit the Official Webpage of the Abel Visiting Scholar Program 2020/2021 "], "url : https://www.opportunitiesforafricans.com/imu-abel-visiting-scholar-program-2020-2021/"], [["Call for PhD Applications – 2020 Gerda Henkel Foundation Scholarship Enhancing Doctoral Training in the Humanities in West Africa", "date announced:January 4, 2020", "Application Deadline: January 31st 2020"], ["Application Deadline: January 31st 2020", "The University of Ghana has received a grant from the Gerda Henkel Foundation of Germany to support the training of PhD students in the Humanities under a project titled Enhancing Doctoral Training in the Humanities in West Africa. Under the project, the University of Ghana will be the sub-regional hub for the training of PhD scholars in the historical humanities (History, Archaeology, Historical Islamic Studies, Art History, Philosophy, History of Law, History of Science, Prehistory and Early History, Classics and other disciplines with historical component).", " ", "The project will fund the tuition, accommodation, research, stipend and airfare of international students starting from 2020/2021 academic year. ", "Eligibility-PhD", "  Applicant must have successfully completed a Master’s degree in any of the disciplines listed above, or in a related field.", "  Should have excellent academic credentials and demonstrate motivation and commitment to pursue an academic career.", "  Has thorough knowledge of the language of instruction (English)", "  Applicant must be a national or permanent resident of one of the following", " West African countries: Ghana, Nigeria, Sierra Leone, Burkina Faso and Senegal.", " Documents to be submitted to Project:", "  Graduate and Undergraduate Certificates", "  Graduate andUndergraduate Transcripts", "  One-page motivation statement", "  PhD research proposal of not more than 3 pages(of1.5linespaced minimum)clearly", " outlining the background, objectives, scope and methodology for applicant’s research.", "  Applicant’s curriculum vitae", "  Copy of applicant’s passport or national ID card", "Application process", "\nCompletedapplication forms with copies of required documents should be sent to:", "\nThe Provost’s Office", "\nCollege of Humanities", "\nUniversity of Ghana", "\nP.O Box LG 1173, Legon", "\nEmail: ", "[email protected]", "\nPhone: (+233) (0)307080635", "\n(+233) (0)267143255", "\nOffice location: International House, Annie Jiagge Road, Legon Campus, University of Ghana", "\nApplicants should takenote of the followingdates:", "Candidates should apply using the application form (attached) by January 31st 2020", "Shortlisted candidates will be notified by March 31st", " 2020", "D e t a i l s o f shortlisted candidates will be submitted to the Gerda Henkel", " Foundation in Germany byApril 11t h 2020", "Scholarship awardees to receive notification byApril/May 2020", "All shortlisted candidates are to apply to the University of Ghana for admissions when admissions open.Please check the University of Ghana website for more information at www.ug.edu.gh", " The College of Humanities through its relevant departments will do the initial review of applications. The final selection of awardees will be done by the Gerda Henkel Foundation.", "For More Information:", "Visit the Official Webpage of the 2020 Gerda Henkel Foundation Scholarship"], "url : https://www.opportunitiesforafricans.com/2020-gerda-henkel-foundation-scholarship-enhancing-doctoral-training-in-the-humanities-in-west-africa/"], [["Chinese Government Scholarships 2020/2021 for South Africans to study in China (Funded)", "date announced:January 6, 2020", "Application Deadline:15 January 2020."], ["Application Deadline:", "15 January 2020.", "The Chinese Government ", "is offering scholarships for South African students to study at Chinese institutions starting in the 2020/21 academic year. The Department of Higher Education and Training (the Department) is responsible for nominations. ", "The scholarship is offered for undergraduate (Bachelors) studies in the identified scarce skills, postgraduate (Masters or PhD) or non-degree Chinese language studies. ", "Bachelor’s degree scholarships are taught in Chinese and will only be awarded to applicants who already have the required level of Chinese proficiency (HSK 4 or above).", "Criteria and Eligibility", "–    ", "South African citizens in good health ", "(medical check will be required for successful applicants);", ";", "–    Strong academic record with a minimum 65% average in previous studies;", "–    Availability to study in China from September 2020;", "–    Demonstrated interest in China and commitment to the development of South Africa;", "–    Applications in all fields of study except medicine will be considered;", "–    Preference will be given to postgraduate applicants, previously disadvantaged applicants and applications in the following fields:", "– Applicants must meet the minimum academic requirements for entry into a similar programme at a South African university.", "– Bachelor’s applicants must have HSK 4 level language certificate and be willing to study in Chinese, applications without a HSK level 4 language certificate will be automatically disqualified.", "Important: The scholarship does not support any medical degrees and preference will be given to applications for postgraduate studies.", "Benefits", "The South African Government provides the following ", "(subject to the availability of funds):", " –    One return economy airfare;", " –    Monthly stipend;", " –    Once-off settlement allowance;", " –    Research funding (postgraduate only)", " –   Visa costs;", " –   Compulsory orientation programme before ", "How to Apply", "– Complete both the ", "DHET application form", " and the Chinese Government online application on", "  ", "www.campuschina.org.", "– Submit both the DHET application form and a PDF of the Chinese Government Scholarship online application with supporting documents listed below to ", "[email protected]", " by ", "15 January 2020.", "– Applicants MUST apply to a Chinese university and submit proof of university application with their scholarship application.", "– ", "All PhD applicants", " must identify and make contact with a supervisor at their university of choice and submit proof of this engagement with the application form.", "– Applicants are not required to do a health examination at this stage of the application, but will be requested to do a medical test only if they are nominated.", "For More Information:", "Visit the Official Webpage of the Chinese Government Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/chinese-government-scholarships-2020-2021/"], [["Japanese Government (MEXT) Scholarship 2020 for young Nigerian Teacher Training Students (Fully Funded to Japan)", "date announced:December 20, 2019", "Application Deadline:14th February 2020"], ["Application Deadline:", "14", "th", " February 2020", " ", "The Embassy of Japan", " is pleased to inform you that the Government of Japan will provide scholarship for Nigerian Primary/Secondary school teachers who desire to take teacher training course and Japanese language training in Japan.", " ", "The Japanese Government (MEXT) scholarship", " ", "is open to graduates of universities and teachers training colleges no more than thirty-four (34) years of age (must be born on or after April 2, 1985), who have taught as teachers at primary/secondary schools or teacher training colleges for at least five years in their home countries at the time of application. The Embassy will like to use this opportunity to attract Nigerian Schools that wish to start Japanese Language class or course at their school. Beneficiaries shall upon their return, help to promote Japanese Language education in Nigeria. ", "\nQUALIFICATIONS AND CONDITIONS ", "MEXT\naccepts applications from international students for study in Japan who\nsatisfy the following qualifications and conditions. Its aim is to\nfoster human resources who will become bridges of friendship between the\ngrantee’s country and Japan through study in Japan and who\nwill contribute to the development of both countries and the\nwider world.", " (1) Nationality: ", "\nApplicants must have the nationality of a country that has\ndiplomatic relations with Japan. An applicant who has Japanese\nnationality at the time of application is not eligible.\nHowever, persons with dual nationality who hold Japanese nationality\nand whose place of residence at the time of application is outside of\nJapan are eligible to apply as long as they choose the\nnationality of the other country and renounce their Japanese\nnationality by the date of their arrival in Japan. The First\nScreening must be conducted at the Japanese diplomatic mission in\nthe country of which the applicant chooses the nationality. ", "(2) Age: Applicants must be born on or after April 2, 1985. Exceptions are limited to cases in which MEXT deems that the applicant could not apply within the eligible age limit due to the situation or circumstances of the applicant’s country (military service obligation, loss of educational opportunities due to disturbances of war, etc.). Personal circumstances (financial situation, family circumstances, state of health, circumstances related to applicant’s university or place of employment etc.) will not be considered for exceptions.", " (3) Academic and Career Background: ", "Applicants must be graduates of universities or teacher training schools and have worked as teachers at primary/secondary educational institutions or teacher training schools (excluding universities) in their home countries for a total period of five years or more as of October 1, 2020. In-service faculty members in a higher education institution are not eligible.", " (4) Japanese Language Ability: ", "Applicants\nmust be willing to learn Japanese. Applicants must be\ninterested in Japan and be willing to deepen their understanding of\nJapan after arriving in Japan. Applicants must also have the ability to\ndo research and adapt to living in Japan.", " (5) Health: ", "\nApplicants must submit a health certificate in the prescribed\nformat signed by a physician attesting that the applicant has no\nphysical or mental conditions hindering the applicant’s study in Japan. ", "(6) Arrival in Japan:", " In principle, applicants must be able to arrive in Japan by the designated period (usually September or October) between the day two weeks before the course starts and the starting date of the course. If the applicant cannot arrive in Japan during the specified period for personal reasons, travel expenses to Japan will not be paid. Excluding cases in which MEXT deems as unavoidable circumstances, the applicant must withdraw from this scholarship program if the applicant cannot arrive in Japan by the end of the specified period above which decided by MEXT or the accepting university. ", "\nSCHOLARSHIP BENEFITS ", "(1)\nAllowance: 143,000 yen per month. A supplemental regional allowance of\n2,000 or 3,000 yen per month will be added to the monthly\nscholarship amount for the grantees studying or conducting\nresearch in specially designated regions. Due to the situation of the\nJapanese Government’s budget, the amount of payment may be subject to\nchange each fiscal year. If a grantee is absent from the\nuniversity for an extended period, the scholarship shall be\nsuspended for that period. ", "(2)\nEducation Fees: Fees for the entrance examination, matriculation\nand tuition at universities will be paid by MEXT. ", "(3) Travel Expenses ①Transportation to Japan: In principle, MEXT stipulates the travel schedule and route, and provides an economy-class airline ticket for the flight from the international airport closest to the grantee’s residence (in principle, the country of nationality) to an international airport in Japan used on the normal route to the accepting university. The grantee shall bear at his/her own expense all costs related to domestic travel from the grantee’s residence to the nearest international airport, airport taxes, airport usage fees, special taxes necessary for travel, travel expenses within Japan (including airline transit costs), travel insurance expenses, carry-on luggage or unaccompanied baggage expenses, etc. ", "Transportation\nfrom Japan: Based on the application by the grantee, MEXT will provide\nan airline ticket to grantees who shall complete the training course at\nthe accepting university and return to the home country by the end of\nthe final month of the scholarship period (See “3. PERIOD OF\nSCHOLARSHIP”) designated by MEXT. MEXT, in principle, shall\nprovide an economy-class airline ticket from an international\nairport in Japan used for the normal route to and from the accepting\nuniversity to the international airport (inprinciple, in the country of\nnationality) nearest to the returning grantee’s residence.\n", " Application Procedure", "Important Information for 2020 MEXT Teachers Training scholarship applicants ", " For further details of the application guidelines and download the application forms, please visit the website below.", " ", "https://www.studyinjapan.go.jp/en/smap_stopj-applications_teacher.html", " ", " The list of ", "Course Guide of TEACHER TRAINING STUDENTS PROGRAM 2020:", " ", "https://www.mext.go.jp/content/1423052_10.pdf", "  ", "Note: Please read the Guidelines carefully.", "The Embassy of Japan will inform successful applicants", " whom application has passed the first screening, as well as time, date of examination & interviews. ", "All application documents must be fully completed upon submission to the Embassy of Japan, before the deadline", "For More Information:", "Visit the Official Webpage of the Japanese Government (MEXT) Scholarship 2020"], "url : https://www.opportunitiesforafricans.com/japanese-government-mext-scholarship-2020-for-young-nigerian-teacher-training-students/"], [["Government of Turkey (Türkiye Burslari) Undergraduate & Postgraduate Scholarships 2020/2021 for study in Turkey (Fully Funded)", "date announced:January 10, 2020", "Application Deadline:20 February 2020"], ["Application Deadline:", "20 February 2020", "Türkiye Scholarships", " is a government-funded, competitive scholarship program, awarded to outstanding students and researchers to pursue full-time or short-term program at the top universities in Turkey.", "Türkiye Scholarships aims to build a network of future leaders committed to strengthening cooperation among countries and mutual understanding among societies. ", "Programs and Levels of Study", "Programs open for application are: Undergraduate and Postgraduate Programs ", "Applications will be open to applicants who wish to study at bachelor’s, master’s and doctoral levels. ", "Other programs such as Research Scholarships, Success Scholarships, and KATİP have different application periods and are announced regularly on our website and social media channels.", "Requirements", "Minimum Academic Criteria:", "Minimum academic achievement for Bachelor’s degree applicants: 70%", "Minimum academic achievement for Master’s and Doctorate degree applicants: 75%", "Minimum academic achievement for Health Science (Medicine, Dentistry and Pharmacy) applicants: 90%", "Age Criteria:", "To be under the age of 21 for Undergraduate programs ", "To be under the age of 30 for Master’s programs", "To be under the age of 35 for Doctorate programs", "Eligibility", "Eligible Groups:", "Citizens of all countries", "Graduates or applicants who are able to graduate at the end of the current academic year (before September 2019)", "Researchers and academicians", "Scholarships Worth", "Full-Time Programs", "Undergraduate Scholarship Program", "University and program placement", "Monthly Stipend: 700 TL per month", "Tuition Fee", "Once-off Return Flight Ticket", "Health Insurance", "Accomodation", "One year Turkish Language Course", "Length of award: 1 year Turkish Language course + 4-6 years (depending on the normal duration of the program)", "Postgraduate Scholarship Program", "University and program placement", "Monthly Stipend:", "Master’s: 950 TL per month", "PhD: 1400 TL per month", "Tuition Fee", "Once-off Return Flight Ticket", "Health Insurance", "Accomodation", "One year Turkish Language Course", "Length of award:", "Master’s: 1 year Turkish Language course + 2 years", "PhD: 1 year Turkish Language course + 4 years", "Short-Term Programs", "Success Scholarship Program (1 year)", "Monthly Stipend:", "Bahcelor’s: 440 TL per month", "Master’s: 590 TL per month", "Phd: 880 TL per month", "Success scholarship program does not cover accomodation and other amenities", "Research Scholarship Program (3-10 months)", "Monthly Stipend: 3.000 TL per month", "Research scholarship does not cover accomodation and other amenities", "Turkish Language & Culture Programs", "Turkish Language Programme for Public Officials and Academicians [KATİP] (8-10 months)", "Monthly Stipend: 2.000 TL per month", "Once-off Return Flight Ticket", "Accomodation", "Turkish Language Course", "Required Documents", "All candidates must submit the following documents during online application:", "A valid National Identification Document OR a valid Passport", "A recent Photo of the candidate (Please note that the photo you upload into the Application system must be a proper portrait of yourself, candidate photos which are not identifiable will undermine the evaluation of your application)", "National exam scores (required for candidates who do not possess any international qualification or certification)", "Diploma or temporary certificate of Graduation", "Academic transcripts (online screenshots and uncertified transcripts will undermine the evaluation of your application)", "International exam scores (GRE, GMAT, DELF, YDS, YÖS …etc. if required by the chosen university & program)", "Language test scores (if required by the chosen university & program)", "A research proposal and an example of your written work (for PhD applicants only)", "For More Information:", "Visit the Official Webpage of the Government of Turkey (Türkiye Burslari) Undergraduate & Postgraduate Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/turkiye-burslari-undergraduate-postgraduate-scholarships-2020-2021/"], [["Edinburgh Global Undergraduate Mathematics Scholarships 2020/2021", "date announced:December 29, 2019", "Application Deadline:23:59 GMT 31st March 2020."], ["Application Deadline:", "23:59 GMT 31st March 2020.", "Scholarships are available to Mathematics students of outstanding ability from countries outside the European Union for the academic session 2020-2021.", "Award", "The scholarships are worth £5,000 per year and are tenable for the duration of the programme of study, subject to satisfactory academic progress.", " A student is deemed to have made Satisfactory Progress in each year if there has been a formal School decision of either “Progress” or “Conditional Progression”, without the student needing to repeat a year. If a student does not make satisfactory progress in any one year, the award will terminate from that point onwards.", "Eligibility", "Scholarships are awarded to applicants from countries outside the European Union who are accepted for full-time admission to an undergraduate degree programme offered by the School of Mathematics at the University of Edinburgh.", "The scholarship is not available to students already on programme. It is also not available to students studying Mathematics as part of a degree programme hosted by another School within the University. ", "Applicants should have applied to the University of Edinburgh through the University and Colleges Admissions Service (UCAS) but do not need to have received an offer in order to begin the scholarship application process.", "Criteria", "This scholarship is competitive and based on academic merit.", "Applying", "Eligible applicants should complete an online scholarship application", "The scholarship deadline is ", "23:59 GMT 31st March 2020.", "In order to gain access to the scholarship application system applicants must have applied for admission to the University of Edinburgh.  Please note that, following the submission of an application for admission, it can take up to five working days for all system checks to be completed and for access to be granted.", "The online scholarship application form is located in EUCLID and can be accessed via MyEd our web based information portal at ", "https://www.myed.ed.ac.uk", "When logging in to MyEd, you will need your University User Name and password. If you require assistance, please go to ", "http://www.ed.ac.uk/student-systems/support-guidance", "Notification of award", "All applicants will be notified in April 2020.  Please contact ", "[email protected]", " ", "if you have any queries.", "For More Information:", "Visit the Official Webpage of the Edinburgh Global Undergraduate Mathematics Scholarships"], "url : https://www.opportunitiesforafricans.com/edinburgh-global-undergraduate-mathematics-scholarships-2020-2021/"], [["FIG Foundation PhD Scholarships 2020 for Surveying/Geomatics PhD Candidates ( 4,000 euros grant)", "date announced:January 2, 2020", "Application Deadline: 1 February 2020."], ["Application Deadline:", " 1 February 2020.", "The FIG Foundation", " will be providing scholarships of up to 4,000 euros plus possible funding for conference travel to  PhD students.", "Applicants shall:", "be studying for a PhD degree and registered solely in a surveying/geomatics academic programme that teaches surveying in a country listed by the World Bank as a low-income, lower-middle or upper-middle income economy,", "have had a paper accepted by a ", "peer reviewed international journal ", "based on their doctoral research project; applicants should be the lead author, and the paper should be co-authored with their supervisor,", "should not have submitted their final thesis at the application deadline.", "DOCUMENTATION", "Applicants should submit the following set of documents in English as a single file in PDF format using. A4 size paper using 25 mm (1” margins). Each item should ", "begin on a new pag", "e. Ensure that you adhere to the requirements to avoid disqualification.", "A completed check list – see the end of this document. Note that if one item on the checklist is missing or disqualifies the candidate, the application is unlikely to be considered.", "A cover sheet showing the candidate’s personal details and those of his/her institution.", "A brief description and argument as to how the applicant’s academic programme addresses the “teaches surveying and graduates surveyors” component of Qualification Criterion 1 above. Provide web links to programme descriptions, course outlines and details of courses.", "A 200 word abstract. This should be written in terms understandable to the lay person; similar to a press release and which the FIG Foundation could actually use as a press release in the event of a successful application.", "A one page research proposal as per the template below on A4 size paper. Note that the ", "one page limit will be strictly enforced", "; material that extends beyond one page will be deleted.", "A copy of the paper that has been re-submitted to the journal after corrections have been completed.", "A letter from the editor of the journal indicating that the paper has been accepted and that the necessary corrections have been completed satisfactorily.", "The journal paper’s referees’ reports.", "A list of peer reviewed journal publications over the last 6 years using the International Journal of GIS reference list format. Use the following headings: Peer Reviewed Journal Papers, Peer Reviewed Conference Papers, Non- Peer Reviewed Conference Papers, Non- Peer Reviewed Journal  Papers, Books, Book Chapters and so forth. See Notes for Authors on the IJGIS website.", "A list of research funding obtained over the past 5 years, indicating which grants are peer reviewed or not.", "A description of research compliance, the research account and activity auditing structures and processes in their institution. For example, if a scientist spends money inappropriately, are there structures in place to refund the granting agency? Provide the names and web addresses of the administration departments and official organisation descriptions dealing with research compliance.", "A description of the structures and processes in their institution that pertain to research ethics, in particular ethics relating to research involving human subjects, if that is relevant to the grant application. Provide the names and web addresses of the administration departments and official organisation descriptions dealing with research compliance.", "A budget indicating how the funds will be spent and a one page justification of the budget. Note that as a general rule, equipment will not be funded. Travel to FIG Conferences to present results and tuition fees may be included in the budget. Per diems for field work will not be funded, but reasonable actual costs of field work are refundable.", "A brief letter from the applicant’s PhD supervisor indicating that they have read this document, that they confirm that the applicant has viewed the videos on How to Write Grant Proposals to the FIG Foundation, and that they have read the applicant’s proposal and recommend (or not) that the FIG Foundation Board of Directors consider the proposal.", "For transparency purposes, successful proposals, grantees’ final reports and progress reports on their activities and use funds will be published on the Foundation web page, and perhaps elsewhere, where appropriate. Please indicate your consent or otherwise for your proposal(s) and reports to be published. Grantees should provide compelling reasons for these documents not to be published.", "For More Information:", " ", " ", "Visit the Official Webpage of the FIG Foundation PhD Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/fig-foundation-phd-scholarships-2020/"], [["The American University of Beirut (AUB) Mastercard Foundation Scholars Program 2020/2021 for Graduate & Undergraduate study in Lebanon (Fully Funded)", "date announced:January 6, 2020", "Application Deadline:18th March, 2020"], ["Application Deadline:18th March, 2020", "The American University of Beirut (AUB) is offering full scholarships for ", "graduate", " and ", "undergraduate", " education for the academic year ", "2020-21​", " in partnership with the Mastercard Foundation.", " ", "The Mastercard Foundation Scholars Program at AUB", " aims to prepare young people to be agents of change in their communities, countries, and regions. ", "The program requires scholars to attend a series of workshops, courses and field work in addition to the courses for their degree.", "Eligibility and Admission Criteria", "Graduate scholarships are open to:", "Nationals of Africa", "Nationals of Lebanon", "R​​​efugee and displaced living in Lebanon ", " Undergraduate scholarships are open to ", "nationals of Lebanon ", "or", " refugee and displaced living in Lebanon", " ", "Selection and admission are based on: ", "Academic promise", "Financial disadvantage", "Leadership potential", "Desire to give back and go back to one’s community", "For More Information:", "Visit the Official Webpage of the AUB Mastercard Foundation Scholars Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/aub-mastercard-foundation-scholars-program-2020-2021/"], [["Orange Tulip Scholarship programme 2020/2021 for young South Africans", "date announced:January 6, 2020", "Application Deadline: April 1, 2020. "], ["Application Deadline: April 1, 2020. ", "The Orange Tulip Scholarship programme", " gives talented South Africans the opportunity to study in the Netherlands. It is offered by higher education institutions and coordinated by ", "Nuffic Neso South Africa.", "Requirements", "If you are a SADC national and intend to study in the Netherlands at the Bachelor or Master level and if you have been admitted to a participating Dutch university or are in the process of enrollment, you can apply for this scholarship.", "OTS is open to all SADC nationals;", "Not currently studying or working in the Netherlands;", "Currently in the admission process or (conditionally) admitted to one of the participating universities.", "Benefits:", "The benefits offered by each university within OTS differ. Some universities might offer a 100% tuition fee waiver, while other colleges may offer a 50% reduction. It is possible to offer only live expenses or visa fees, etc. ", "Application process", "Check the institutions and eligible courses in the ", "OTS Scheme List", "Carefully check the information on the scholarship scheme of the university you wish to register for. If you meet the requirements, start the registration process to the university of your choice as soon as possible. Follow the instructions on the university website and send the requested university files directly to the university.", "Wait for confirmation from the university that your application is in process or (conditionally) accepted. This is usually done via an e-mail and/or the online application system. This is proof that you have started the university enrolment process or that you have been (conditionally accepted). ", "After confirmation of the university you can start the application process for the Orange Tulip Scholarship. Please send a soft copy of the duly filled out and signed ", "Orange Tulip Scholarship Application Form(111 kB)", " and required attachments to ", "[email protected]", "africa.org. ", "The general deadline for submission of registration files is April 1, 2020. However, some universities follow different deadlines.", "Within 1-2 weeks after your application you will receive a confirmation via e-mail from Nuffic Neso South Africa. Please contact us via ", "[email protected]", " or or +27 (0)12 346 0982 to check if you do not hear from us or if you would like to ask any questions on your applications.", "After the deadline and an eligibility check, the Dutch institutions will be informing all applicants individually in writing about the outcome of the selection and agree on the further terms and conditions under which the scholarship is awarded to the scholarship holder.", "IMPORTANT: Each scheme/course may have its own terms and deadlines. Please read the explanation on the", " respective institutional pages. ", " Please note that admission to the university of your choice and the Orange Tulip Schola", "For More Information:", "Visit the Official Webpage of the Orange Tulip Scholarship programme 2020/2021"], "url : https://www.opportunitiesforafricans.com/orange-tulip-scholarship-programme-2020-2021/"], [["Government of Mauritius Africa Scholarships 2020/2021 for Study in Mauritius (Fully Funded)", "date announced:January 9, 2020", "Application Deadline: 30th April 2020"], ["Application Deadline: 30th April 2020", "The Government of Mauritius", " is awarding scholarships to deserving students who are resident citizens of member states of the African Union or of African Commonwealth countries as per the following criteria:", "For undergraduate programmes, applicants should be above 18 years of age and should not have reached their 26th birthday by the closing date of application.", "For Master’s programmes, applicants should not have reached 35 years and, for PhD programmes, applicants should not have reached 40 years by the closing date of application.", "Applicants must have already applied for a full-time on-campus programme (Diploma, Degree, Master’s or PhD) at a public Higher Education Institution in Mauritius (listed in Section 8 in the Guidelines for Applicants) for academic year starting in 2020.", "The scholarship will be for a maximum duration as indicated in the table below or the minimum course duration whichever is lesser. ", "SN Programme of Studies Maximum Duration", " 1 Undergraduate Diploma Three (3) years", " 2 Undergraduate Degree Four (4) years", " 3 Master Two (2) years", " 4 MPhil / PhD Four (4) years + 6 months for the transfer", " from MPhil to PhD", " 5 PhD Three (3) years", " ", "Benefit", "The Scholarship will support successful candidates in meeting their tuition fees and in contributing to their living expenses during their studies in Mauritius. Furthermore, the scholarship also covers a return airfare by the most economical route. ", "This will be valid for travel from the country of origin at the beginning of the studies and back to the country of origin upon successful completion of studies. The following documents are available for download from the Ministry’s website (http://ministry-education.govmu.org)", " I. Guidelines for Applicants", " ➢ This document contains important information regarding the conditions attached to the scholarship, the application procedure, and a list of public Higher Education Institutions in Mauritius where the applicants must have applied for full-time on-campus studies.", " II. Application Form (Applicants are invited to fill in the form electronically before printing)", " ➢ Application for the scholarship can only be made on the application form, duly filled-in. Section 5 of the application form should be endorsed and completed by the Nominating Agency in the country of citizenship of the applicant. Applications which are not made through the Nominating Agency of the respective countries will not be entertained.", " An application under this Scheme is to be made solely through the Nominating Agency responsible for the processing of scholarships in the country of citizenship of the applicant. Such a Nominating Agency, which may typically be part of the Ministry of Education in the country of the applicant, will then shortlist and endorse the applications of a maximum of FIFTEEN (15) eligible candidates (five in each category of Undergraduate, Masters and MPhil/PhD and submit the duly completed application forms for the two intakes of 2020 as per the table below:", " ", "SN Intake Deadline for electronic submission", " Deadline for submission of hard", " copy", " 1 March 2020 21 February 2020 28 February 2020", " 2 August 2020 30 April 2020 15 May 2020", " All documents to be submitted to the Ministry of Education, Tertiary Education, Science and Technology of", " Mauritius at the address mentioned below for a final selection.", " The Senior Chief Executive,", " Ministry of Education, Tertiary Education, Science and Technology", " (Attn: Tertiary Education, Science and Technology Division)", " MITD House, Pont Fer, Phoenix 73544. ", "Apply Now for the 2020 Government of Mauritius Africa Scholarships", "For More Information: ", "Visit the Official Webpage of the Government of Mauritius Africa Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/government-of-mauritius-africa-scholarships-2020-2021/"], [["Fulbright Teaching Excellence and Achievement Program 2020/2021 (Fulbright TEA) for Teachers (Fully Funded to USA)", "date announced:January 3, 2020", "Application Deadline: Varying by Country"], ["Application Deadline: Varying by Country", "The ", "Fulbright Teaching Excellence and Achievement Program (Fulbright TEA)", " brings international teachers to the United States for a six-week program that offers academic seminars for professional development at a host university. Participants observe classrooms and share their expertise with teachers and students at the host university and at local secondary schools.", "Depending on country of origin, international teachers have the opportunity to apply to either the Fulbright TEA General Pedagogy Cohort or the Media Literacy Cohort.", "The Fulbright TEA Program is sponsored by the ", "U.S. Department of State’s Bureau of Educational and Cultural Affairs", ", with funding provided by the U.S. Government and administered by IREX.", "The Fulbright Teaching Excellence and Achievement (Fulbright TEA) Program, General Pedagogy Cohort, will provide approximately 160 fellowships to international secondary school teachers from around the world to participate in a six-week non-degree, non-credit academic program at a U.S. university. The international participants will travel to the United States for one of two six-week professional development programs in either ", "spring of 2021 ", "or", "fall of 2021.", "Eligible countries and territories", ":", " Algeria, Argentina, Armenia, Bangladesh, Belarus, Bolivia,  Burkina Faso,  Burma, Cambodia, Cameroon, Chile, Colombia, Costa Rica, Cote d’Ivoire, Ecuador, Egypt, El Salvador, Ethiopia, Georgia, Ghana, Guatemala, Haiti, Honduras, India, Iraq, Jordan, Kazakhstan, Kyrgyzstan, Laos, Latvia, Malawi, Malaysia, Mali, Moldova, Mongolia, Mozambique, Nepal, Nicaragua, Nigeria, Panama, Peru, Russia, Rwanda, South Africa, Sri Lanka, Sudan, Tajikistan, Tanzania, Thailand, Tunisia, Turkmenistan, Uruguay, Uzbekistan, Venezuela, Vietnam, West Bank/Gaza, Zambia, Zimbabwe", "Eligible disciplines:", "English or English as a Foreign Language", "Social Studies (civics, history, geography, global studies, etc.)", "Math", "Science​", "Special Education in the disciplines listed above", "How to apply to the General Pedagogy Cohort: ", "Consult the list of eligibility requirements. Then use the following button to apply:", "APPLY NOW", "For application deadlines, please contact the U.S. Embassy or Fulbright Commission in your country.", "Contact", "Contact information: Email: ", "[email protected]", ".", "For More Information:", " ", " ", "Visit the Official Webpage of the Fulbright Teaching Excellence and Achievement Program 2020 "], "url : https://www.opportunitiesforafricans.com/fulbright-teaching-excellence-and-achievement-program-2020-2021/"], [["MultiChoice Talent Factory South Africa (formerly M-Net Magic in Motion) 2020 Bursaries for young South Africans", "date announced:December 29, 2019", "Application Deadline:31 January 2020"], ["Application Deadline:", "31 January 2020", "Applications are now open for the ", "MultiChoice Talent Factory South Africa (formerly M-Net Magic in Motion) 2020 bursaries", "If you’re a 2nd year or higher university student studying towards a diploma or degree in film and TV or related qualification in need of financial assistance, you are invited to apply for the MTFza one year bursary. ", "2nd year or higher of diploma/degree in film and TV or related qualification", "South African citizens", "Be 18 years and older", "Achieved at least a C+ aggregate in the previous academic year", "How to apply?", "Required documents:", "CV – not more than 2 pages", "Personal motivation letter of not more than 500 words (why should you be chosen?)", "Copy of South African Identity Document – certified", "Copy of academic transcripts / Tertiary qualification Certificate – certified", "Proof of registration", "Proof of income of parents or guardians", "Important information", "Applicants must ensure that all information included in their entry is valid and true", "Every application must be accompanied by a certified copy of the learner’s ID document, the application form, motivation letter, proof of parent (s) or guardian’s income and expenses", "together with the registration form and the pro-forma invoice from the training institution (on the institution’s letterhead).", "Every application form must be completed fully, with all relevant motivation and signatures", "Complete in black ink, all signatories to sign where required and initial at the bottom right hand corner of each page.", "All applicant information will be subject to credit, criminal and verification checks", "MultiChoice Talent Factory South Africa (MTFza) decision in the selection of the MTFza Bursary recipients is final.", "MTFza shall not be responsible for any electronic system failure that results in any particular entry not being received for consideration.", "MTFza is not liable for the costs any applicant incurs during the process of their electronic application (example: airtime usage or payment at Wi-Fi café)", "MTFza has the right to expand, limit, downscale and/or terminate the bursary scheme at its discretion.", "There is no employment on offer at the end of the student’s studies", "Bursary recipients have to send quarterly results of performance", "Bursary awards are for a ONE year of study and applicants are required to apply annually when advertised.", "Closing date: ", "31 January 2020", "Download Application", "For More Information:", " ", " ", "Visit the Official Webpage of the MultiChoice Talent Factory South Africa 2020 Bursaries "], "url : https://www.opportunitiesforafricans.com/multichoice-talent-factory-south-africa-2020-bursaries/"], [["2020 DAAD sponsored KWTRP/IDeAL – Strathmore University PhD in Health Care Management", "date announced:January 7, 2020", "Application Deadline:Friday 31st January 2020 at 5.00pm East African Time."], ["Application Deadline:", "Friday 31st January 2020 at 5.00pm East African Time.", "The German Academic Exchange Service (", "DAAD", "), in collaboration with the Initiative to Develop African Research Leaders (IDeAL), KEMRI-Wellcome Trust Research Program (KWTRP) and Strathmore University’s Institute of Healthcare Management, are offering DAAD In-Country/In-Region Ph.D. Scholarships for year 2020. This scholarship is available to the citizens of a country in Sub-Saharan Africa who have a Masters degree qualification with above average (at least Second Class/Upper division) results.", "Description:", "Applications Deadline", ": 31st January 2020", "Course Level", " and Subject", ": Ph.D. in Healthcare Management", "They will also have access to various generic skills training offered by IDEAL.", "Nationality", ": Citizens of a country in Sub-Saharan Africa.", "Number of Awards", ": Up to 5 scholarships available.", "Award", ": The winners will receive:", "The award includes full tuition fees, a monthly stipend at DAAD rates and some contribution towards research costs. Please note that this is not a fully-funded position, as DAAD will only provide funding as stated in the program information sheet.", "The successful applicant will be registered at Strathmore University and supervised by renowned health systems researchers from Strathmore and KWTRP.", "Duration:", " PhD-scholarships are initially granted for one year and can be extended to a maximum of the regular period of study upon receipt of an application for extension. Scholars must demonstrate satisfactory progress before an extension is granted. The maximum period for the PhD is three years.", "Additional benefits:", "DAAD In-Country/In-Region scholarship holders are also", "a) encouraged to apply for a research grant in Germany for 3 up to 6 months.", "Please note: The short-term research stay in Germany should preferably be announced in the application for the regular scholarship and can only be awarded if the necessary financial means are available.", "The short-term research scholarship includes:", "A monthly scholarship payment for living costs", "Health/accident/personal liability insurance", "A flat-rate travel allowance", "b) invited to apply for different Summer Schools in Germany (four weeks).", "All further details regarding additional benefits and the additional application processes will be provided after admission to the scholarship programme.", "Eligibility:", "Eligible Countries", ": Students of a country in Sub-Saharan Africa.", "Entrance Requirements: ", "Candidates must meet following eligibility criteria:", "Be a national of a country in Sub-Saharan Africa.", "Must have a Masters degree qualification with above average results.", "Must have proof of admission to Strathmore University for the PhD program or official letter assuring admission.", "Female candidates and candidates from less privileged regions or groups as well as candidates with disabilities are especially encouraged to apply.", "Application Procedure:", "Applications for these opportunities are will be managed jointly by IDeAL and Strathmore University.", "Please fill in this KWTRP online PhD application form. You can edit the application form many times as you wish. However, the information submitted at the lapse of the deadline will be considered as the final submission.", "In addition to filling in the form, Upload the following as a single document (under upload CV), name the file with your initial and surname as follows – if you are John Doe –  filename will be jdoe_DAAD_CV", "Hand signed curriculum vitae (please use the European specimen form at (", "http://europass.cedefop.Europa.eu", "), including a list of publications (if applicable).", "2 recommendation letters from a previous university or universities", "Certified copies of university degree certificates including transcripts", "If available, information on the recognition of you university degree", "certificates by the Kenyan Commission for University Education  country", "Copy of the identity card or passport", "If applicable, information on the UNHCR registration as refugee", "Letter of motivation (if applicable: mentioning the planned research stay in Germany, see “Additional benefits”)", " Abstract of the proposal on one page (include name and title of proposal", "Detailed and precise PhD proposal (10-15 pages), including detailed work and time table (if applicable: mentioning the planned research stay in Germany, see “Additional benefits”). Additionally, a word format of the proposal (10-15 pages) has to be submitted to the institution for plagiarism check.", "Applications should be submitted no later than ", "Friday 31st January 2020 ", "at 5.00pm", " East African Time", ".", "Once the deadline lapses a number of candidates will be shortlisted based on their suitability for the PhD programme. If you are shortlisted your will be expected to submit the documents below before being invited for a face-face or teleconference interview.", "DAAD application form duly filled (available in the DAAD-Portal)", "Letter of admission to Strathmore/commitment to admit", "Declaration of acceptance from the academic supervisor", "For More Information:", "Visit the Official Webpage of the 2020 DAAD sponsored KWTRP/IDeAL – Strathmore University PhD in Health Care Management"], "url : https://www.opportunitiesforafricans.com/2020-daad-sponsored-kwtrp-ideal-strathmore-university-phd-in-health-care-management/"], [["Government of India (ICCR) Undergraduate & Postgraduate Scholarships 2020/2021 for Africans to study in India (Fully Funded)", "date announced:December 29, 2019", "Application Deadline: February 29th 2020"], ["Application Deadline: February 29th 2020", "At the inaugural plenary of the", " India – Africa Forum Summit ", "held in New Delhi in April 2008, the Hon’ble Prime Minister of India announced the Government of India’s initiative to enhance the academic opportunities for students of African countries in India by increasing the number of scholarships for them to pursue undergraduate, postgraduate and higher courses.", "The", " ", "ICCR – Indian Council for Cultural Relations ", "– implements this scheme on behalf of the Ministry of External Affairs.", "Eligibility:", "Students applying for doctoral/ post doctoral courses should include a synopsis of the proposed area of research.", "Students wishing to study performing arts should, if possible, enclose video/ audio cassettes of their recorded performances.", "Candidates must have adequate knowledge of English.", "ICCR will not entertain applications which are sent to ICCR directly by the students or which are sent by local Embassies/High Commissions in New Delhi.", "Priority will be given to students who have never studied in India before.", "No application will be accepted for admission to courses in MBBS/MD or Dentistry/Nursing.", "Candidates may note that Indian universities/educational institution are autonomous and independent and hence have their own eligibility criteria which have to be fulfilled. Please also note that acceptance of application by the University is also not a guarantee of admission. A scholarship is awarded only when admission is confirmed by ICCR.", "Student must carry a proper visa. Students should ensure that they get the correct visa from the Indian Embassy/High Commission. Government of India guideline stipulate that if a scholar arrives without proper visa and his/her actual admission at the University/Institute does not materialize, he/she will be deported to his/her country.", "Before departing for India the scholars should seek a full briefing from the Indian Diplomatic Mission in their country about living conditions in India/the details of scholarship/the type and duration of the course to which he/she is admitted. Scholars should inform the Indian Embassy/High Commission of their travel schedule well in advance so that ICCR can make reception and other arrangements for them.", "Scholars are advised to bring some money with them to meet incidental expenditures on arrival in India.", "The scholars who are awarded scholarships should bring with them all documents relating to their qualification in original for verification by the respective college/university at the time of admission", "Eligible Countries:", " ", "Under this Scheme, the Council offers 900 scholarships to the following African countries:", "Algeria, Angola, Benin, Burkina Faso, Burundi, Cameroon, Central African Republic, Cape Verde, Chad, Cote d’Ivoire, Comoros, Congo (Republic of), Djibouti, Democratic Republic of Congo, Egypt, Equatorial Guinea, Eritrea (concurrent from Nairobi), Ethiopia, Gabon, Gambia, Ghana, Guinea-Bissau, Guinea, Kenya, Libya, Lesotho, Liberia, Madagascar, Mali, Malawi, Mauritania, Mauritius, Morocco, Mozambique, Namibia, Nigeria, Rwanda, South Africa, South Sudan (Republic of), Senegal, Seychelles, Sierra Leone, Somalia, Sao Tame & Principe, Sudan, Swaziland, Tanzania, Togo, Tunisia, Uganda, Zambia and Zimbabwe.", "Benefits", "Living allowance (Stipend) (Per Month)", "Undergraduate -5,500 , Postgraduate-6,000 M.Phil / Ph.D 7,000, Post-doctoral Fellow-7,500", "-House Rent Allowance (Per Month)", "In Grade 1 cities-5,000 and In other cities-4,500", "-Contingent Grant (per annum)", "Undergraduate-5,000, Postgraduate-7,000, M/Phil / Ph.D and M.Tech./ME-12,500, Postdoctoral studies-15,500, Tuition Fee/Other Compulsory Fee-As per actual (excluding refundable amount) –Thesis and dissertation Expenses (Once in entire duration of course)", "D Scholar-10,000 and for BBA/BCA/MBA/MCA/M.Tech and other course required submission of Project-7.000", "-Medical Benefits", "Under the scheme scholars are expected to seek treatment only at medical centre or dispensary attached to universities / Institutes where they enrolled or in the nearest Government hospital (Bill are settled as admissible according to AMA/CGHS norms)", "How to Apply", "Please read the instruction before filling out the application form.", "Please also read the financial terms and conditions.", "Detailed guidelines on the process of applying for ICCR Scholarships online on the A2A Portal and procedure and norms governing the same is given on the ", "www.a2ascholarships.iccr.gov.in", " .", "Students must read instructions and apply through the same website and no hard copy of the application form is required at the Mission.", "For More Information:", " ", " ", "Visit the Official Webpage of the Government of India (ICCR) Undergraduate & Postgraduate Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/government-of-india-iccr-undergraduate-postgraduate-scholarships-2020-2021/"], [["Fulbright Foreign Student Program 2020/2021 Scholarships for young South Africans (Fully Funded to USA)", "date announced:January 3, 2020", "Application Deadline: March 31st 2020"], ["Application Deadline: March 31st 2020", "The South African Fulbright Foreign Student Program ", "provides grants for South African university graduates to pursue post-graduate studies at a United States university in any subject (excludes MBA and studies that require contact with patients).", "The following opportunities are available:", "South African PhD students enrolled with a South African University may apply to conduct one year’s research at a U.S. University as a ", "Visiting Student Researcher", ".", "Post-graduate students may apply for scholarships towards Master’s or Doctorate degrees. Scholarships are awarded for two years towards one degree – Master’s or Doctorate (renewable each year).", "Students are selected through a rigorous application and interview process and receive a high level of support ranging from visa processing and health insurance to a comprehensive pre-departure orientation and re-entry session.", "Eligibility", "Be a South African citizen OR a permanent resident with a minimum of 5 years of permanent residency status in South Africa (Please note: S.A. nationals with dual citizenship from the U.S. are not eligible for the program)", "For Non-Degree (Visiting Student Researcher) studies: Must be registered for a PhD with a South African university", "Have a four-year bachelor’s degree, or a three-year bachelor’s degree plus honors year, or a four-year B-Tech degree when applying for Master’s", "Have a Master’s degree when applying for a Doctoral degree", "What do we look for in our applicants?", "Academic excellence", "Required scores for the Graduate Record Exam (GRE) and Test of English as a Foreign Language (TOEFL) for each specific field of study", "Clearly written study objectives", "Demonstrable interpersonal skills with evidence of cultural sensitivity and a genuine desire to learn more about the United States and share with American citizens aspects of South African culture", "Experience and interest in extracurricular and community activities", "Evidence of leadership potential", "A desire to further the Fulbright Program and give back to your home country upon returning", "The Selection Committee and the Interview Panel will also be looking for clear reasons for selecting your U.S. university preferences. The Fulbright Program expects candidates to conduct a thorough university search and to identify institutions which are a strong fit for their academic, personal and professional goals.", "Benefits", "Master’s or Doctoral Degree: 2 years of funding towards one degree.  For Doctoral degrees, at least 2-3 years of study are required beyond the initial two years.  Doctoral candidates need to secure their own personal or other funding to continue studying in the United States.", "Non-Degree: Participation in a visiting research program for one academic year (9-10 months).", "Fully funded awards generally cover the following, but can vary according to each grantee’s program:", "Travel allowance and transportation from South Africa to the authorized U.S. destination", "Health benefits", "Settling in allowance upon arrival in the U.S.", "Monthly maintenance allowance (to cover living expenses)", "Tuition and fees", "Book and computer allowance", "J-1 visa sponsorship", "For more information on the Fulbright Program visit: ", "https://apply.iie.org/ffsp202", "1", "For questions on the application process, please contact the Fulbright Office: ", "[email protected]", " Guidance for applications ", "South Africa Fulbright Foreign Student Program Application Guidelines and Instructions (PDF 265KB)", "How to Write a Reference Letter for Scholarship Application (PDF 102KB)", "Writing a Research Proposal for Scholarship Application (PDF 95 KB)", "University Admission Exams", "Additional Frequently Asked Questions", "For More Information:", "Visit the Official Webpage of the Fulbright Foreign Student Program 2020/2021"], "url : https://www.opportunitiesforafricans.com/fulbright-foreign-student-program-2020-2021-scholarships/"], [["Master’s degree (LLM/MPhil) in Human Rights and Democratisation in Africa Scholarships 2020 (Scholarships Available)", "date announced:December 22, 2019", "Application Deadline:  15 April 2020 "], ["Application Deadline: ", " 15 April 2020", " ", " ", "The LLM/MPhil in Human Rights and Democratisation in Africa (HRDA)", " is a prestigious one-year intensive course where 25-30 exceptional individuals spend six months in Pretoria and six months at one of the ", "12 partner universities", " all over Africa. They are taught by eminent lecturers in the field of human rights and undergo many practical training exercises. It is the only course of its kind in Africa. Graduates become members of the HRDA Alumni Association whose 537 members are currently active in the full spectrum of human rights work: from grassroots, through civil service, to international organisations including the African Union and the United Nations. ", "Individuals from all African countries are invited to apply for admission to study for the Master’s degree (LLM/MPhil) in Human Rights and Democratisation in Africa at the ", "Centre for Human Rights", ", ", "University of Pretoria", ", South Africa. ", "Course details", "This premier course, the only one of its kind, focuses specifically\non human rights as seen from the African perspective. The course is\npresented full-time over one academic year (two semesters) that runs\nfrom the end of January to early December and comprises eight modules.", "Instruction is by way of formal lectures and practical exercises. The\nlecturers are some of the most prominent human rights experts in the\nworld. Emphasis is placed on classroom participation and there is ample\nopportunity for informal interaction between the students and lecturers.\nStudents can make use of extensive library facilities.", "A substantial part of the course is dedicated to the use of the\nInternet in research on human rights law. The medium of instruction is\nEnglish, of which students must have good working knowledge in order to\nfollow lectures and participate fully in class discussions and practical\nexercises. Students who did not undertake their studies in English are\nrequired to write the Test of English as a Foreign Language. Upon\nadmission to the programme advanced English is provided for students\nfrom non-English speaking countries and French is taught to students\nfrom English speaking countries. Students who are fluent in both English\nand French study another language. Admission is on a competitive basis\nand bursaries are available.", "Scholarships", "A limited number of up to 30 students are selected per year.\nDepending on the availability of funding, full-scholarships covering at\nleast tuition, accommodation and official programme activities are\ncovered for up to 25 citizens of Africa. Students who do not receive\nscholarships may be admitted as self-funding or partial-self funding\nstudents, provided they meet all the minimum admission criteria and\nprovided they guarantee payment of all or at least a significant part of\ntuition, accommodation and official programme activities, to an amount\nset by the Centre annually.", "For More Information:", "Visit the Official Webpage of the Master’s degree (LLM/MPhil) in Human Rights and Democratisation in Africa Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/masters-degree-llm-mphil-in-human-rights-and-democratisation-in-africa-scholarships-2020/"], [["Eni Scholarships 2020/2021 for Africans to study in the University of Oxford, United Kingdom (Fully Funded)", "date announced:January 2, 2020", "Application Deadline:Monday 9 March 2020."], ["Application Deadline:", "Monday 9 March 2020.", "St Antony’s College, University of Oxford,", " in partnership with the international integrated energy company ", "Eni", ", is offering up to three students from Angola, Ghana, Mozambique, Nigeria, or the Republic of the Congo (Congo-Brazzaville) the opportunity to study for a fully funded degree in 2020/21.", "This scholarships will allow St Antony’s to admit up to three of the best African students irrespective of means and will add immeasurably to the diverse and intellectual character of the College. This is part of a joint initiative between Eni & St Antony’s College to invest in and strengthen African leadership.", "St Antony’s and Eni are equally keen to provide encouragement and where possible, structured incentives for Eni Scholars to continue their studies or find useful employment back in their home country after graduating from Oxford. Discussions about this are ongoing and scholars will be informed of relevant contacts and partnerships as they emerge.", "Requirements", "The scholarships are open to applicants who are ", "ordinarily resident in Angola, Ghana, Mozambique, Nigeria, and the Republic of the Congo (Congo-Brazzaville)", ". Preference will be given to applicants whose first degree is from an African university.", "The scholarships will be awarded on the basis of both ", "academic merit and potential and financial need", ". Preference will be given to applicants who have clear ambitions to use their accumulated learning to benefit their home country after graduation.", "Please ensure you meet the requirements for entry to your course, including English language requirements. See the University’s course guide for more information.", "Applicants must apply for admission to one of the following eligible courses:", "1 year Master’s courses", "MSc African Studies", "MSc Economic & Social History", "MSc Economics for Development", "MSc Global Governance and Diplomacy", "Benefits", "100% of university and college fees, and an annual grant for living costs of £14,553 for 12 month courses and £10,915 for 9 month courses. The stipend for courses with different durations will be adjusted accordingly. ", "The scholarship also covers one economy return airfare from your home country to the UK at the start and end of your course.", "In order to be considered for the scholarship, please follow these three steps:  ", "Read the information on this webpage carefully.   ", "Apply online to the University of Oxford", " for one of the eligible courses as listed above. You must submit your application for graduate study to the University by the January deadline (", "10 or 24 January 2020", " depending on the programme you apply to – please check the University’s guidance on application deadlines) and you must have secured a place on your chosen programme of study by the final completion date (", "9 March 2020", "). It would help if you select St Antony’s College in the college choice section of the application form, though this is not compulsory.", "Once you have applied to the University, please ", "complete the online Eni Scholarship application form ", "which is available at the bottom of this page The deadline for submission of the form is 5pm, UK time, on ", "Monday 9 March 2020.", "Downloads", " ", "Eni Scholarship Application Form 2020-21", "For More Information:", " ", " ", "Visit the Official Webpage of the Eni Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/eni-scholarships-2020-2021/"], [["Government of ​Brunei Darussalam Scholarships 2020/2021 for Foreign Students (Fully Funded to Brunei)", "date announced:January 4, 2020", "Application Deadline: February 14th 2020"], ["Application Deadline: February 14th 2020", "The Ministry of Foreign Affairs is pleased to invite applications for the ", "Government of Brunei Darussalam Scholarship", " under the above Scholarship Award Scheme for the 2020 / 2021 academic session.", "Tenable in Brunei Darussalam, the scholarship award provides applicants with the opportunity to undertake Diploma, Undergraduate Degree and Postgraduate Master’s Degree at any one of the following institutions of higher education:", "·       Universiti Brunei Darussalam (UBD),", "·       Universiti Islam Sultan Sharif Ali (UNISSA),", "·       Universiti Teknologi Brunei (UTB) and", "·       Politeknik Brunei (PB).", "The academic year commences July/August 2020.", "ELIGIBILITY", "Applications are open to citizens of, but not limited to, ASEAN, Commonwealth and OIC member countries.", "Applicants must be, between the ages of 18-25 for Undergraduate and Diploma programmes and must not exceed the age of 35 for Postgraduate Master’s Degree programmes on the 31", "st", " July 2020.", "The award is NOT eligible to Brunei Darussalam Permanent Residents.", "PROGRAMMES OFFERED AND ENTRY QUALIFICATIONS", "Programmes offered and entry qualifications are available from the following:", "i)    ", "Universiti Brunei Darussalam", "ii)   ", "Universiti Islam Sultan Sharif Ali", "iii)  ", "Universiti Teknologi Brunei", "iv)  ", "Politeknik Brunei ", "TERMS AND CONDITIONS OF THE SCHOLARSHIP ", "The full listing of the terms and conditions of the scholarship will be provided to the applicant once the application is successful and a scholarship is offered. A declaration will be required to be signed confirming understanding and agreement to these terms and conditions upon acceptance of the scholarship.", "The general terms and conditions are as follows:", " The scholarship recipient will be facilitated with the benefits of the scholarship as follows:", "i)      exemption from paying tuition fees including acceptance, examination, registration and orientation fees for the duration of the programme;", "ii)     an economy class air-ticket to Brunei Darussalam from the scholarship recipient’s country of origin/ country of domicile prior to the commencement of the course and an economy class air-ticket from Brunei Darussalam to the scholarship recipient’s country of origin/country of domicile upon completion of the course;", "iii)    a monthly personal allowance of BND$500.00;", "iv)    a monthly meals allowance of BND$150.00;", "v)     an annual book allowance of BND$600.00;", "vi)    accommodation at the residential college of the University/ Polytechnic;", "vii)  baggage allowance for shipment of the scholarship recipient’s personal effects to his country of origin/country of domicile upon completion of the programme, at a maximum amount of:", "·       BND$250.00 to a country within the ASEAN region; or", "·       BND$500.00 to a country outside the ASEAN region;", "viii)  comprehensive insurance cover for the whole duration of the Scholarship. The scholarship recipient is urged to obtain additional insurance prior to his travel to Brunei Darussalam and for the whole duration of the Scholarship at his own expense.", "A scholarship recipient is required to:i)      conform to all the rules and regulations underlying this Scholarship;", "ii)     abide by the rules and regulations of his University/ Polytechnic;", "iii)    respect the customs, culture and official religion of Brunei Darussalam;", "iv)    obey all the laws and regulations of Brunei Darussalam;", "v)     refrain from engaging in political activities;", "vi)    undergo health screening in Brunei Darussalam if deemed necessary by the Ministry of Foreign Affair.", "Upon completion of the programme, the scholarship recipient will be required to leave Brunei Darussalam with immediate effect", "APPLICATION PROCEDURE AND CLOSING DATES", "Application forms can be downloaded from the following link:", "APPLICATION FORM 2020/2021", "Application forms must be duly completed and endorsed by the Ministry of Foreign Affairs or the National Focal Point for scholarships of the applicant’s country.", "Applicants are required to also submit a security clearance statement from their National Security Agency(ies)/ Police Station (i.e. a statement/ report certifying that applicants are clear from any civil and criminal charges).", "Completed application forms are to be emailed to the following address:", "[email protected]", "(NOTE: Maximum size allowed for e-mail and attachment files is 10MB)", " ", "Please take note, all application forms and supporting documents are to be submitted in  Word Document / PDF / JPG format (compressed ( .zip ) folder) ", "Applicants applying to Universiti Brunei Darussalam must also complete an online application through ", "https://apply.ubd.edu.bn/orbeon/uis-welcome/", "Incomplete application forms will not be considered.", "The closing date for the reception of completed application forms, together with certified copies of relevant certificates and documents is, ", "not later than 1600 hrs (Brunei time) on 14 February 2020.", "An applicant may be required to appear for an interview at such place(s) as may be determined by the institutions offering the programmes, and to sit a written examination to assess the applicant’s proficiency in the English/ Malay/ Arabic Language (where applicable).", " The Government of Brunei Darussalam reserves the right to reject any applications. The decision on the selection of candidates is final. Any disputes or enquiries pertaining to the decision made will not be entertained. Only successful applicants will be notified via email.", "For further enquiries please contact:          ", "Technical Assistance Division", "Department of Administration", "Ministry of Foreign Affairs", "Bandar Seri Begawan BD2710", "Brunei Darussalam", "For More Information:", "Visit the Official Webpage of the Government of ​Brunei Darussalam Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/government-of-%e2%80%8bbrunei-darussalam-scholarships-2020-2021/"], [["African Institute for Mathematical Sciences (AIMS) Master’s degree in mathematical sciences (Fully Funded)", "date announced:December 24, 2019", "Application Deadline: March 31, 2020 "], ["Application Deadline: ", "March 31, 2020", " ", "The AIMS Master’s degree in mathematical sciences", " is unique and at the forefront of innovation. Focusing on computer problem-solving and programming skills, it offers the opportunity to compete in the most advanced areas of mathematical sciences.", "Main characteristics :", "Classes are taught by renowned African and international teachers and supported by a team of resident tutors.", "Students and teachers cohabit in a permanent learning environment.", "A highly interactive teaching environment where students are encouraged to learn together through questions and discoveries.", "An emphasis on computing with a 24 hour access to computer rooms and the internet.", "A Pan-African student body made up of at least 30% women.", "AIMS graduates embark on outstanding graduate programs and professional careers in Africa and around the world.", "Conditions:", "Applicants must hold or expect to obtain by the date of commencement\nof AIMS training a 4-year university degree in mathematics or any other\nscience / engineering discipline with a significant mathematics\ncomponent.", "Candidate records must demonstrate strong mathematics, leadership and community service skills.", "Women are strongly encouraged to apply.", "Selection process:", "Each candidate’s file will be assessed in light of the available\ntraining opportunities. Potential candidates must demonstrate both a\nhigh level of motivation and the potential to a satisfactory completion\nof  the training.", "Applications start on 1 December and Master’s degree applicants are\nstrongly encouraged to submit their applications by 31 March for the\nAugust session. Successful applicants will be notified by May. Master’s\ndegrees are awarded in partnership with leading local academic\ninstitutions affiliated with AIMS centers.", "Financial aid:", "\nNo registration fees are required for the candidates selected for the\nMaster’s degree. Full scholarships covering tuition, accommodation,\nmeals and travel expenses are also awarded to successful applicants.", "For More Information:", "Visit the Official Webpage of the AIMS Master’s Program 2020 "], "url : https://www.opportunitiesforafricans.com/aims-masters-degree-in-mathematical-sciences/"], [["Kristianstad University Scholarships 2020/2021 for study in Sweden", "date announced:December 29, 2019", "Application Deadline:February 1, 2020."], ["Application Deadline:", "February 1, 2020.", "Each year Kristianstad University offers a number of scholarships to qualified students from outside the EU/EEA and Switzerland.", "Kristianstad University Scholarship", "The scholarship will be awarded to citizens of a country outside the EU/EEA with the requirement of paying tuition fee for studies at Kristianstad University. If granted a scholarship, it will include a full or partial reduction of the tuition fee. Keep in mind that these scholarships do not cover your", " living costs.", "Some students also have the possibility to apply for ", "The Swedish Institute Study Scholarships.", "How and when to apply", "Applications for Autumn 2020 is now open! ", "Deadline is February 1, 2020.", "Apply for scholarship ", "here", ".", "Tuition fee paying students can apply for reduction of tuition fee for the academic year 2020/2021.", "Selection process", "The Kristianstad University Scholarship is completely merit based. The assessment of scholarship applications is made on the basis of the merits and documents sent to Universityadmissions.se when applying for a programme. NB. Merits and documents registered after the 1 February 2020 will not be taken into consideration.", "You are not eligible for a Kristianstad University Scholarship if you have not paid the application fee to Universityadmissons.se for the programme you wish to study.", "Priority will be given to students who:", "applied in the first instance to Kristianstad University and on time in accordance with the national admission round", "have Kristianstad University as their first choice", "have studied at Bachelor’s level at Kristianstad University and are applying for Master programmes", "have excellent study merits and good proficiency in English", "Applications that are not filled in correctly will not be taken into consideration.", "No consideration is taken of the students’ financial needs in the selection process.", "For More Information:", "Visit the Official Webpage of the Kristianstad University Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/kristianstad-university-scholarships-2020-2021/"]]