[[["9th Media Sound Hamburg Scholarships 2019 for Filmmusic, Gamemusic and Sounddesign (Funded to Hamburg, Germany)", "date announced:October 6, 2018", "Application Deadline: November 4th 2018"], ["Application Deadline: November 4th 2018", "MediaSoundHamburg", " is an is an ", "international summerschool for Filmmusic, Gamemusic and Sounddesign,", " which takes place annually in Hamburg since 2011. For ten days, national and international film composers, game musicians and sound designers meet international professionals and renowned experts. In various workshops, master classes and forums, the participants work on specific projects and get new ideas for their artistic work.", "Media Sound Hamburg", "  is calling on ", "young film music composers, video game music composers and sound designers", " to apply for a summer school that will take place in Hamburg, Germany, between 9 and 18 August 2019.", "With further attractive special events such as the presentation of the Young Talent Awards Media Music with the support of the renowned Kaiser Quartet and workshop discussions with directors and film composers MediaSoundHamburg opens its offers also for an interested audience. Venue is the Elsa Brändström House in Hamburg-Blankenese.", "Benefits:", "Young film composers, game musicians, sound designers and interested people from all over the world up to the age of 35 can apply for a scholarship.", "A scholarship includes free participation in all MasterClasses, Workshops, Forums and", "Special events as well as accommodation and board worth 3.000,00 Euro.", "Decisive is the motivation to participate in the International Summerschool, which must be submitted in writing with the application form.", "For More Information:", "Visit the Official Webpage of the MediaSoundHamburg Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/9th-media-sound-hamburg-scholarships-2019/"], [["Holland Government Scholarship 2019/2020 for study at Rotterdam School of Management, Erasmus University", "date announced:October 8, 2018", "Application Deadline: 31 January 2019."], ["Application Deadline: ", "31 January 2019.", "The Holland Scholarship", " is financed by the Dutch Ministry of Education, Culture and Science as well as", " Rotterdam School of Management, Erasmus University.", " This scholarship is meant for international students from outside the European Economic Area (EEA) who want to start their ", "bachelor’s or master’s", " at RSM.", "Requirements:", "Your nationality is non-EEA;", "You are a prospective student, starting your studies in the academic year 2019/2020;", "You are applying for a full-time bachelor’s or master’s programme at RSM;", "You meet the specific requirements of the programme you are applying for;", "You do not have a degree from an educational institution in the Netherlands (excluding exchange programmes in the Netherlands).", "In principle, a fair distribution of scholarships over the various programmes will take place. This principle may be deviated from and priority may be given to applicants for certain programmes. Additionally, the school may strive for a certain distribution over the continents.", "Amount", "The scholarship amounts to ", "€ 5,000", " for maximum 12 months, one academic year;", "You will receive this in the first year of your studies;", "The scholarship amount will be paid separately in two instalments (November 2019 and February 2020) ", "after", " you have paid the full tuition fee amount;", "Selection criteria", "Prospective students for the IBA programme at RSM need to prove their excellence. Excellence in previous education is proven if the grade point average achieved at secondary school (measured to date) is at least the equivalent of the Dutch grade of 8.0 on the Dutch grading scale 1 – 10;", "For prospective students who have also attended higher education after secondary education grades obtained in higher education will be considered as well. The RSM Scholarship Committee will decide on the local grade equivalents for the Dutch grade of 8.0 using (a.o.) the grade information included in the ", "Nuffic country modules", ";", "Only students who are not recipients of any other scholarships exceeding the amount € 5,000 in total in that same academic year can apply for the scholarship;", "By accepting this scholarship you agree to assist the RSM Recruitment and Admissions Office in the role of an Ambassador with promotional and support activities for approximately 8 hours per month during the academic year;", "By accepting this scholarship, you agree to start your visa procedure before 1 June 2019. RSM holds the right to cancel your scholarship if you have not started your visa procedure and holds the right to offer the scholarship to a student on the waiting list.", "Application procedure", "First step is to register for the Bachelor International Business Administration programme in ", "Studielink", ". Once you have registered yourself, you will receive a link to our Online Application Form (OLAF).", "It is not possible to choose a specific scholarship in OLAF. RSM will choose recipients for specific scholarships. RSM will take your scholarship application into consideration as long as you meet the minimum requirements and meet the deadline(s).", "Required documents:", "A scholarship application letter in OLAF of maximum 1 A4 size page, including the following information:", "an explanation why you would ", "need", " a scholarship, comprising a description of your current financial situation", "an explanation why you would deserve a scholarship, comprising a description of academic excellence and if applicable other merits;", "A ", "clear", " financial plan of how you are going to finance year 2 and 3 of the IBA programme;", "If applicable: certified copies of other scholarships granted.", "Deadline", "Applicants can apply from 10 October 2018 until ", "31 January 2019.", "What next?", "The RSM Scholarship Committee will determine award recipient(s) on 15 April 2019.", "Practical information", "Should you have any questions, the RSM Scholarship Committee can be contacted through our contact form: ", "www.rsm.nl/contact", "For More Information:", "Visit the Official Webpage of the RSM Holland Government Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/holland-government-scholarship-2019-2020-for-study-at-rotterdam-school-of-management-erasmus-university/"], [["Kader Asmal Fellowship Programme Scholarships 2019/2020 for Postgraduate Study in Ireland (Fully Funded)", "date announced:October 16, 2018", "Application Deadline: Friday 21st December 2018 at 17:00 SA time."], ["Application Deadline: ", "Friday 21st December 2018 at 17:00 SA time.", "The Embassy of Ireland in South Africa", " in partnership with", " Canon Collins Trust", " invites applications for", " scholarships for postgraduate study in Ireland", " commencing in September 2019.", "The fellowship programme has two strands:", "A) Annual awards for postgraduate study in:", "1. Business Managemenr; Economics and Finance", "2. Agriculture, Food Science; Environment and Rural development", "3. Gender and Human Rights", "4. Engineering; Sustainable Technology and Resource Management", "5. Information system and Communications Technology", "6. Tourism", "B) One annual award will be made for a fellowship in:", "LLM in International and Comparative Law at Trinity College Dublin.", " This will be selected by ", "the Council for the Advancement of the South African Constitution (CASAC).", "Eligibility Requirements:", "Applicants must:", "be a South African citizen holding a South African Permanent Residence Permit", "have achieved the necessary standard to be accepted onto a postgraduate course in an institute of higher education in Ireland", "be seeking funding for a full-time postgraduate programme in one of the above listed subject areas", "be able to take up fellowship in the academic year 2018/2019", "Not have already applied for a course at an institution in Ireland", " – if you have already been admitted to a university you are ", "not eligible", "Please note applicants already in possession of a Master’s degree are not eligible", "Benefits:", "The Kader Asmal Fellowships", " will cover:", "university application fees", "tuition fees", "examination and other fees", "economy travel to and from your country of residence to Ireland;", "settling in allowance, book allowance and study allowance", "accommodation", "a monthly personal living allowance (stipend) to cover other living expense for you only and", "the costs of an entry clearance (student visitor visa) application", "How to apply", "Applications are now open. Please ", "click here", " to apply for this scholarship. Applications will close on ", "Friday 21st December 2018 at 17:00 SA time.", " Shortlisted applicants will be interviewed in February 2019.", "For More Information:", "Visit the Official Webpage of the Kader Asmal Fellowship Programme Scholarships 2019 "], "url : https://www.opportunitiesforafricans.com/kader-asmal-fellowship-programme-scholarships-2019-2020/"], [["US-MEPI Student Leaders Program 2019 for undergraduate & graduate Students from the Middle East and North Africa (Fully Funded to USA)", "date announced:October 9, 2018", "Application Deadline:December 31, 2018."], ["Application Deadline:", "December 31, 2018.", "The US-MEPI Student Leaders Program", " offers outstanding undergraduates from across the MENA region an intensive leadership training course of approximately 5 weeks in the United States from June 26 – July 31, 2019. The program emphasizes lessons in participatory governance and the application of leadership skills.", "The Student Leaders program", " is a rigorous leadership program for up to 60 undergraduate and graduate students from the Middle East and North Africa. Students are divided among U.S. academic institutions where they develop leadership skills and expand their understanding of civil society and participatory governance and how both may be applied in their home communities. Participants have the opportunity to meet their American peers, engage in local community service activities, and observe and take part in the governmental process on the local, state, and federal levels. The program includes academic coursework, as well as study tours to various regions of the United States.", "Upon completion of the U.S.-based program, participants are mentored by the program implementer to leverage their experiences through sponsored alumni activities designed to effect positive social change in their home countries approximately 6 months after the U.S. portion of the program. A competitive follow-on accelerator workshop may be held in the region upon completion of the U.S.-based program.", "Eligibility Requirements:", "Students from the following countries are eligible to apply:", " Algeria,", " Israel, Jordan, Lebanon, ", "Libya, Morocco, and Tunisia.", "This program is open to university students between the ages of 20 and 24. US-MEPI seek a gender-balanced pool of candidates and give preference to traditionally under-served participants. While nominees may be undergraduate or graduate students in any field of academic specialization, it is critical that they exhibit a serious interest in pursuing leadership opportunities in their home countries and demonstrate a desire to deepen their civic engagement.", "Those who have previously traveled to the U.S. or studied abroad are ineligible. Applicants should demonstrate sufficient English-language skills to participate in U.S. university-level classes and must be enrolled in and attending a university in their home countries. At the time of application and while participating in the program, participants cannot hold U.S. citizenship or be a U.S. Legal Permanent Resident.", "Benefits:", "Expenses for the program are fully paid by the U.S. Department of State.", "Apply Now for the 2019 US-MEPI Student Leaders Program", "For More Information:", "Visit the Official Webpage of the US-MEPI Student Leaders Program 2019"], "url : https://www.opportunitiesforafricans.com/us-mepi-student-leaders-program-2019/"], [["DAAD Call for Scholarship Applications 2019 at the African Institute for Mathematical Sciences (AIMS)", "date announced:October 8, 2018", "Application Deadline: November 15th 2018"], ["Application Deadline: November 15th 2018", "DAAD (German Academic Exchange Service),", " as a publicly funded, selfgoverning", "\norganisation of the institutions of higher education in Germany, promotes", "\ninternational academic exchange as well as educational co-operation with", "\ndeveloping countries through a variety of funding and scholarship programmes.", "\nAs part of the ", "„ /In-Region Scholarship Progamme” DAAD offers scholarships for", "PhD studies.", "The programme is funded by the German Federal Ministry of", "\nEconomic Cooperation and Development (BMZ) and aims at university staff in the", "\nfirst line, without neglecting the public sector demand of academically trained", "\npersonnel.", "The target group for scholarships are postgraduates from Sub-Saharan Africa", "\n(excluding South Africa) with a Master’s degree who want to pursue PhD courses", "\nin South Africa (In-Region scholarships). It has been agreed upon that DAAD cooperates with the African Institute for Mathematical Sciences (AIMS) by offering up to six In-Region Scholarships for PhD studies at AIMS for the intake 2019.", "Applicants", "have successfully completed generally a two-year university degree", "\n(doctoral candidates) with above average results (upper forth of class)", "clearly show motivation and strong commitment", "have thorough knowledge of the language of instruction", "have completed their last university degree not more than 6 years ago at", "\nthe time of application", "must be nationals or permanent resident of a Sub-Saharan African", "\nCountry, excluding South Africa", "should generally be a) staff member of a public university, b) candidate", "\nconsidered for teaching or research staff recruitment, c) from the public", "\nsector", "Female applicants and candidates from less privileged regions or groups are", "\nespecially encouraged to participate in the programme.", "Eligible Field", "The /In-Region Scholarship Programme supports studies in subject areas with", "\nstrong relevance to national development.", "\nThe scholarships at AIMS are available in the following fields:", "Mathematical Sciences", "Place of tenure", "The African Institute for Mathematical Sciences", ", 6-8 Melrose Road, Muizenberg", "\n7945, South Africa; Stellenbosch University, University of Cape Town, University", "\nof the Western Cape", "Duration and Commencement", "The duration of the PhD programme is generally three years generally starting in January 2019", "Applicaion and Selection Procedure", "\nThe application process contains two steps.", "First step:", "Applicants must apply for their studies at AIMS using the contacts and the method", "\nthat is prescribed by the institution. AIMS has set its own deadlines. AIMS will screen, pre-select (according to DAAD selection criteria) and short-list", "\nthe applicants.", "A detailed report consisting of the shortlisting procedure, the entire", "\nlist of applicants, the ranked shortlist and the shortlisting panel members will also", "\nbe availed to DAAD. The ranked shortlist will contain preferably triple (at least", "\ndouble) the number of scholarships that have been attributed to the institution.", "\nDAAD reserves the right of final selection.", "Second step:", "Pre-selected candidates are asked to log into the DAAD portal and register", "\nthemselves and submit an DAAD application.", "\n1. Register online via the DAAD-Portal (if not already registered):", "\nhttps://portal.daad.de, Deadline: 15.11.2018", "\n2. Apply online via the DAAD-Portal under the tab “Personal Funding“/", "\n“Application“", "\nDocuments to be submitted:", "\n– DAAD application form duly filled in (available in the DAAD-Portal)", "\n– Hand signed curriculum vitae (please use the European specimen", "\nform at http://europass.cedefop. Europa.eu), including a list of", "\npublications (if applicable).", "\n– Recommendation letter by university teachers (PhD 2)", "\n– Letter of admission of the host university / institution / network", "\n– Certified copies of university degree certificates including transcripts", "\n– Letter of motivation (if applicable: mentioning the planned research", "\nstay in Germany, see “Additional benefits”)", "\n– Copy of the passport", "\n– Declaration of acceptance from the academic supervisor", "\n– Detailed and precise PhD proposal, including detailed work and time", "\ntable (if applicable: mentioning the planned research stay in", "\nGermany, see “Additional benefits”)", "\n– Abstract of the proposal on one page (please include name and title", "\nof proposal", "For More Information:", "Visit the Official Webpage of the DAAD-AIMS Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/daad-call-for-scholarship-applications-2019-at-the-african-institute-for-mathematical-sciences-aims/"], [["Japan Africa Dream Scholarship (JADS) Program 2019 for young Africans to study in Japan (Fully Funded)", "date announced:October 4, 2018", "Application Deadline : October 31st 2018"], ["Application Deadline : October 31st 2018", "The Japan Africa Scholarship (JADS) Program", " – capacity building in energy sector through skills development for sustainable development– is a joint initiative by the AfDB and Japan that aims at providing two-year scholarship awards to highly achieving African graduate students to enable them to undergo post-graduate studies (i.e. a two-year Master’s degree program) in priority development areas on the continent and abroad (including in Japan). This JADS program is funded by the Government of Japan. The overarching goal that the AfDB and the Government of Japan seeks to attain is to enhance skills and human resources development in Africa in a number of priority areas pertaining to science and technology with a special focus on the energy sector.", "JADS’s objectives are aligned with the Bank’s High 5 agenda (i.e. Light up and power Africa, Feed Africa, Industrialize Africa, Integrate Africa and Improve the quality of life for the people of Africa) and key Japanese development assistance initiatives to Africa and the ", "6", "th", " Tokyo International Conference for African Development (TICAD VI) outcomes.", "The JADS Program", " is open to applicants from AfDB member countries with relevant professional experience and a history of supporting their countries’ development efforts who are applying to a graduate degree program in energy development and related discipline.  The program does not provide scholarships to any other graduate degree program.", "The scholarship program provides tuition, a monthly living stipend, round-trip airfare, health insurance, and travel allowance.", "Upon completion of their studies, the beneficiary scholars are expected to return to their home countries to apply and disseminate their newly acquired knowledge and skills, and contribute to the promotion of sustainable development of their countries.", "Eligibility Requirements:", "The program is open to those who have gained admission to an approved Masters degree course at a Japanese partner university. Candidates should be 35 years old or younger; in good health; with a Bachelor’s degree or its equivalent in the energy area or related area; and have a superior academic record. Upon completion of their study programs, scholars are expected to return to their home country to contribute to its economic and social development.", "Details on Eligibility Criteria are provided in that call’s Application Guidelines, and these detailed eligibility criteria are strictly adhered to. No exceptions are made.", "Broadly speaking, nationals of African countries must:", "Be a national of a AfDB member country;", "Be in good health;", "Hold a Bachelor (or equivalent) degree in the energy area (or related field) earned at least 1 years prior to the application deadline date;", "Have 1 years or more of recent development-related experience after earning a Bachelor (or equivalent) degree;", "Be accepted unconditionally to enroll in the upcoming academic year in at least one of the JADS partner universities for a Master’s degree;", "Applicants living or working in a country other than his or her home country are not eligible for scholarships.", "JADS does not support applicants who are already enrolled in graduate degree programs.", "Not be an Executive Director, his/her alternate, and/or staff of all types of appointments of the African Development Bank Group or a close relative of the aforementioned by blood or adoption with the term “close relative” defined as: Mother, Father, Sister, Half-sister, Brother, Half-brother, Son, Daughter, Aunt, Uncle, Niece, or Nephew.", "Scholarship Benefits:", "The JADS Scholarship provides the recipient with the following benefits:", "Economy class air travel between your home country and the host university at the start of the study program and immediately following the end of the scholarship period.", "Tuition for a graduate program and the cost of basic medical insurance usually obtained through the university.", "A monthly subsistence allowance to cover living expenses, including books.", "The JADS Scholarship does not cover:", "VISA application(s) costs", "Expenses to bring and/or support scholar’s family members;", "Extra-curricular courses or training;", "Language training not provided by the graduate program;", "Additional travel during the course of the study program;", "Expenses related to supplementary educational materials, field trips, participation in workshops/seminars, or internships; or", "Educational equipment such as computers.", "Selection Process:", "The JADS Secretariat uses the following criteria to select the finalists:", "Maintaining a reasonably wide geographical distribution of awards, that takes into account the geographic distribution of eligible applications;", "Maintaining a reasonable distribution of awards across gender that takes into account the distribution of eligible applications across gender;", "Giving scholarships to those applicants who, other things being equal, appear to have limited financial resources", "Unusual circumstances / hardships, when assessing the employment experience and other aspects of an application.", "Application Procedure:", "1.  Applicant completes JADS ", "application form", "2.  Applicant sends documents (application form, university transcripts and certificate, CV, professional references and research proposal), to the JADS Secretariat for first screening", "3.  JADS Secretariat sends shortlist of candidates to selected Japanese universities", "4.  Universities does second screening and share selected students with JADS Secretariat", "5.  JADS Secretariat recommends awardees based on its selection criteria to the Japanese Executive Director for approval.", "6.  AfDB contacts selected awardees, and informs partner universities.", "For More Information:", "Visit the Official Webpage of the Japan Africa Dream Scholarship (JADS) Program 2019"], "url : https://www.opportunitiesforafricans.com/japan-africa-dream-scholarship-jads-program-2019/"], [["VLIR-UOS Scholarships 2019 International Training Programme (ITP) for post-graduate students & researchers in urban studies and planning (Funded to Belgium)", "date announced:October 12, 2018", "Application Deadline:23rd of November 2018"], ["Application Deadline:23rd of November 2018", "International Training Programmes (ITP)", " are short to medium-term, intensive, interactive, and practical trainings organised at a university or university college in Belgium/Flanders.", "The trainings target participants from 31 scholarship countries with relevant professional experience in the ITP’s subject and who will be able to transfer the obtained knowledge and skills to a wider audience in their home countries.", "The IMSDP programme is an intensive three months teaching and research programme for ", "post-graduate students and researchers in urban studies and planning.", " It is offered by the KU Leuven Departments of Architecture and Earth and Environmental Sciences, in collaboration with the research units P&D, OSA and Geography and Tourism and over twenty academic partners.", "The programme is organised from ", "March 1st until Tuesday May 28th 2019", ".", "VLIR-UOS", " supports the programme with 12 scholarships for participants from the global South (please consult the eligible country list).", "Requirements:", "You can only apply for an ITP scholarship if you meet the following requirements:", "Nationality and country of residence:", "  A candidate should be both a national and a resident of one of the 31 eligible countries (not necessarily the same country) at the time of the application.", "Relevant professional experience and a support letter:", " Priority is given to candidates who are employed in academic institutions, research institutes, governments, the social economy or NGOs, or to those who aim to have a career in one of these sectors. The training candidate should have relevant professional experience and a support letter confirming (re)integration in a professional context where the acquired knowledge and skills will be immediately applicable.", "Fungibility with other VLIR-UOS funding:", " Candidates who are working at a university where we already fund IUC, TEAM or SI projects, can receive an ITP-ICP scholarship if they clearly motivate the reason for their application and if they clarify why the participation at the ICP or ITP programme cannot be funded as part of the IUC, TEAM or SI programme or project funds that already exist.", " Other VLIR-UOS scholarship applications and previously awarded scholarships: ", "A potential candidate can only submit one scholarship application with us per year – irrespective of the scholarship type – and can, therefore, only be selected for one VLIR-UOS scholarship every year. Candidates who already received one of our scholarships to participate in another ITP, will not be eligible. Candidates who already received one of our scholarship to participate in an ICP (or vice versa) can only be selected if the previously attended course is thematically linked to the ITP.", "Benefits:", "VLIR-UOS only provide scholarships for the full duration of the training programme. It is not possible to apply for a partial scholarship.", "The detailed current amounts and more information on the different allowances can be found in the document ", "‘Allowances and guidelines for VLIR-UOS scholarships’", ".", "There are two categories of allowances:", "Lump sum: this is an allowance for which the amount has been determined on the basis of former expenses and international benchmarking, the justification of which consists of (i) the scholarship guidelines and (ii) the agreement signed between VLIR-UOS, the Flemish host university, the possible partner university and the scholar. However, in the framework of financial control, the university must be able to present proof of bank transactions to or a declaration of receipt from the respective scholar, upon request;", "Expenses that must be accounted for: these expenses must be accounted for individually with receipts, invoices, bank transactions and / or other supporting documents (e.g. airline tickets, in-surance).", "For More Information:", "Visit the Official Webpage of the VLIR-UOS Scholarships 2019 International Training Programme (ITP)"], "url : https://www.opportunitiesforafricans.com/vlir-uos-scholarships-2019-international-training-programme-2019/"], [["University of California Berkeley MasterCard Foundation Scholars Program 2019/2020 for Study in U.S.A (Fully Funded)", "date announced:October 3, 2018", "Application Deadline: Varying by Course"], ["Application Deadline: Varying by Course", "The University of California, Berkeley", " ", "has partnered with ", "The MasterCard Foundation", " in a collaborative, global network of education institutions and non-profit organizations that believe education is a catalyst for social and economic advancement. The Program aims to benefit 15,000 young people over 10 years, mostly in Sub-Saharan Africa.", "Prospective undergraduate students from Sub-Saharan African countries are welcome to ", "apply ", "to the University of California, Berkeley. Information on the process can be found on the ", "Admissions", " site and below. However, ", "The MasterCard Foundation Scholars Program", " at UC Berkeley will not be soliciting applications for undergraduate scholarships for fall 2017 or beyond.", "As an eight year program from 2012 to 2020, the undergraduate recruitment phase has ended. The UC Berkeley MasterCard Foundation Scholars Program will continue to recruit ", "Graduate Scholars", " for two-year degree programs that begin in Fall 2017 and Fall 2018.", "Eligibility Requirements:", "Being a citizen of a Sub-Saharan African country –", " If you have refugee status, are stateless, or have other questions regarding your citizenship, you may still be eligible. Please contact us directly to clarify. This scholarship is not intended for citizens of North African countries.", "Excelling academically –", " All prospective Scholars must first be admitted to UC Berkeley to be considered for the Scholarship. An important criteria for admission to the University is demonstrated academic excellence.", "Coming from an economically disadvantaged background", " – We aim to admit those from the bottom two income quintiles per country. This Scholarship is designed for those extremely talented individuals who have no other means of acquiring the further education required to help realize their dreams and ambitions.", "Having demonstrated the will to give back to your community, country, or continent", " – We are looking for well-rounded students who are engaged in activities beyond the classroom. Some may be directly related to your field of study, but this may also include other issues (social, economic, political) that you are working on and passionate about. Applicants should elaborate on their achievements both in their application to UC Berkeley, and then later on the Scholarship application.", "Having expressed the desire and intention to return to your home country after completing your studies", " – We are looking for students who are engaged with and passionate about issues affecting their communities, and who will take advantage of their education at UC Berkeley to better equip themselves with the knowledge and training to address these issues upon return. While important work can be done from abroad, the intention of this Program is to enable Scholars to return home, after forming valuable professional connections through internship and job placements.", "Master’s Degree programs:", "**Please note that PhD and doctoral programs do not qualify for the Scholarship.", "UC Berkeley offers the following Master’s programs", "Architecture (M.Arch)", " – For Fall 2018 admissions, only the two year, not three year program, is eligible for the MCF Scholarship", "Art (MFA)", "Business Administration (MBA)", "*", "City & Regional Planning (MCP)", "Development Practice (MDP)", "Education (DMS, EMST, or MUSE) ", "Energy & Resources (ERG) ", "Engineering (M.Eng, MS)\n", "Master of Engineering (M.Eng), various concentrations ", "Master of Science Civil and Environmental Engineering (MS) ", "Electrical Engineering and Computer Science (MS)", "Mechanical Engineering (MS) ", "Folklore (MA)", "Journalism (MJ) ", "Information Management & Systems (MIMS)", "Public Health (MPH), various concentrations", "Public Policy (MPP)", "Social Welfare (MSW)", "*MBA students need to secure additional funding from Haas Business School through obtaining ", "Haas scholarships", ", which requires meeting the ", "Round One or Two application deadline", ". We encourage you to contact us if you are interested to learn more details about this unique process.", "Application Sequence", "Master’s degree prospective applicants must first apply to the University through the regular admissions process before they will be considered for the MasterCard Foundations Program Scholarship.", "After the graduate degree program admissions process is underway, ", "the UCB MCF Scholars Program", " will invite prospective candidates to apply for the Scholarship.", "For More Information:", "Visit the Official Webpage of the University of California Berkeley MasterCard Foundation Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/university-of-california-berkeley-mastercard-foundation-scholars-program-2019-2020/"], [["U.S. Department of State’s U.S.-Middle East Partnership Initiative (MEPI) Tomorrow’s Leaders Undergraduate Scholarship Program 2019 for North Africans (Fully Funded)", "date announced:October 9, 2018", "Application Deadline: November 15th 2018"], ["Application Deadline: November 15th 2018", "U.S. Department of State’s U.S.-Middle East Partnership Initiative (MEPI) Tomorrow’s Leaders Scholarship Program", " supports academically qualified, financially disadvantaged high school graduates in the Middle East and North Africa by providing a four-year academic matriculation, civic education, and leadership development through American accredited institutions in the region.", "The program covers university tuition and fees, a study abroad experience in the U.S., insurance, housing, and monthly allowance. Students requiring English preparatory work may be enrolled in one to two semesters of college preparatory English classes before entering degree programs.", "In addition to receiving undergraduate education, students will benefit from mentoring, career development, internship, and micro-grant opportunities with local civil society, business, and non-governmental organizations and networks. Facilitated by each host institution, students participate in initiatives throughout their ‎academic program that go beyond the traditional classroom to foster leadership development and encourage civic engagement.", "Eligibility Requirements:", "This program is open to high school graduates in the Middle East and North Africa, who are qualified but unable to afford a college education.  Students enroll at the undergraduate level in a four-year program.  For the Fall 2019 enrollment class, applicants must be citizens of ", "Algeria, ", "Jordan, Lebanon, ", "Morocco, Tunisia, Libya", ", Syria, and Yemen, and cannot hold U.S. citizenship or be a U.S. Legal Permanent Resident.", "Applicants must meet the following criteria:", "Be a high school senior or recent high school graduate at the time of application;", "Demonstrate strong leadership potential;", "Be proficient in written and spoken English;", "Demonstrate strong academic performance;", "Ability to start the program in August/September 2019.", "How to Apply:", "Interested candidates can access the online application through Tomorrow’s Leaders website at ", "www.amideast.org/tl", ".", "For More Information:", "Visit the Official Webpage of the MEPI Tomorrow’s Leaders Scholarship Program 2019"], "url : https://www.opportunitiesforafricans.com/u-s-mepi-tomorrows-leaders-scholarship-program-2019/"], [["Heinz-Kühn-Foundation 2019 Scholarships for young Journalists from developing countries (Fully Funded to Germany)", "date announced:October 11, 2018", "Application Deadline: November 30th 2018"], ["Application Deadline: November 30th 2018", "The aim of the ", "Heinz-Kühn-Foundation", " ", "is to support the training and professional development of junior journalists.", "The foundation awards scholarships to young journalists from North-Rhine-Westphalia for ", "six-week or three-month", " reporting trips in developing countries in ", "Africa, Asia and Latin America", ".", "The foundation also provides funds to enable candidates from developing countries to gain professional journalism experience in ", "North-Rhine-Westphalia for up to three months", ".", "Heinz-Kühn-Foundation scholarships are intended to enable junior journalists ", "to further their professional development and continue training in new surroundings, and to gain a first-hand and in-depth knowledge of the customs, opinions and way of life in other countries", ".", "Eligibility Requirements:", "Young journalists from North-Rhine-Westphalia and developing countries are eligible for a scholarship if they satisfy the following requirements:", "have a keen interest in development issues;", "have already gained substantial professional experience in journalism (a completed college education is desirable);", "are not older than 35 years of age; and,", "have a good command of the official language of their host country (", "candidates from abroad must at least have a basic knowledge of the German language", ").", "Scholarship Worth:", "Scholarship holders get", "a lump-sum contribution towards living expenses in the host country (with scholarship payments covering training and living expenses in the host country);", "a lump-sum allowance for flight and travelling expenses (the foundation pays a return air ticket for candidates from abroad);", "an allowance to cover costs of research materials (e.g. literature);", "an allowance for trips within the host country; and,", "(if neccessary, for scholarship holders from abroad) a German language course of up to four months at the Düsseldorf or Bonn based Goethe-Institut.", "In the lead up to the scholarship and throughout the duration of the scholarship, the Heinz-Kühn-Foundation will provide support.", "How to apply", "Journalists who meet the requirements for a scholarship should first contact the foundation to discuss possible host countries and their topics of interest.", "Applications for the following year must be received by 30 November.", "The foundation’s postal address is:", "Ministerpräsident des Landes Nordrhein-Westfalen", "Heinz-Kühn-Stiftung", "Stadttor 1", "40190 Düsseldorf", " ", "The following documents should be enclosed with the application:", "curriculum vitae in tabular form and a photograph;", "certificates of vocational training and present occupation; ", "foreign languages certificates;", "German candidates should provide a detailed statement explaining their reasons for applying, their choice of host country and proposed topic of research.", " ", "Candidates from abroad should provide a letter of motivation in German.", "For More Information:", "Visit the Official Webpage of the Heinz-Kühn-Foundation 2019 Scholarships for young Journalists "], "url : https://www.opportunitiesforafricans.com/heinz-kuhn-foundation-2019-scholarships-for-young-journalists/"], [["The Petroleum Technology Development Fund (PTDF) Undergraduate & Postgraduate Scholarships 2018/2019 for study in Nigerian Federal Universities", "date announced:October 8, 2018", "Application Deadline: Friday November 16, 2018 "], ["Application Deadline: ", "Friday November 16, 2018 ", "View Larger Imag", "APPLICATION FOR ", "2018/19 PETROLEUM TECHNOLOGY DEVELOPMENT FUND (PTDF) SCHOLARSHIP FOR UNDERGRADUATE & POSTGRADUATE AWARDS IN NIGERIAN FEDERAL UNIVERSITIES", " ", "APPLICATION FOR 2018/19 PETROLEUM TECHNOLOGY DEVELOPMENT FUND (PTDF) SCHOLARSHIP FOR UNDERGRADUATE & POSTGRADUATE AWARDS IN NIGERIAN FEDERAL UNIVERSITIES.", "APPLICATION FOR 2018/19 PETROLEUM TECHNOLOGY DEVELOPMENT FUND (PTDF) SCHOLARSHIP FOR UNDERGRADUATE & POSTGRADUATE AWARDS IN NIGERIAN FEDERAL UNIVERSITIES", "The Petroleum Technology Development Fund (PTDF)", " is the Federal Government agency with the mandate of developing indigenous human capacity and petroleum technology to meet the needs of the oil and gas industry. The Fund hereby invites applications from qualified Nigerians to apply for the 2018/19 Undergraduate, Masters and PhD scholarships for students in Nigerian Federal Universities.", "Method of application ", "Online application form can be accessed from the ", "APPLICATION WEBSITE: www.ptdf.gov.ng", " at no cost to applicants. Instructions on how to access the online form is stated on the PTDF website. Applicants are advised to read through the requirements before applying. To start the application process, applicants are required to key-in their email address and select a password for a pin to be generated. The generated pin would enable applicants to access the form and complete their bio data.", "APPLICANTS ARE TO PLEASE NOTE THE FOLLOWING:", "\nApplication is restricted to Federal Universities ", "only", "Possession of valid admission letter into the University is compulsory for all applicants", "Postgraduate applicant’s admission letter should be within a validity period of 12 months", "Postgraduate applicants who meet the requirements shall be shortlisted for interviews before final selection of successful candidates", "Undergraduate applicants must have completed their first year and are currently in their second year of studies", "Only undergraduate applicants undertaking studies in oil and gas related fields will be considered and the final selection shall be based on the grades on their transcripts", "Admission for part-time studies shall not be considered for all category of applications", "The scholarship is highly competitive and merit driven. Selection of candidates shall be based on equitable representation of the 36 States of the Federation and Federal Capital Territory (FCT)", "CRITERIA, REQUIREMENTS AND SELECTION PROCESS FOR LSS POST GRADUATE:", "A selection panel will be constituted to assess applications using the following criteria;", "Academic merit as evidenced by quality of degrees, full academic transcripts, other professional qualifications acquired and relevant publications to be referenced by applicants", "Membership of professional bodies", "The viability of the study/research plan (", "PhD applicants only", ")", "All applicants are required to make a case for their scholarship by submitting a statement of purpose stating the reason(s) they wish to undertake the study, the relevance of the proposed study to the industry and its expected impact on national development", "ELIGIBILITY REQUIREMENTS:", "A). ", "(LSS) Undergraduate:", "Applicants must be full time students in any of the Federal Universities", "Applicants ", "must", " be in their second year of study", "Course of study should be related to oil and gas industry", "Students must have been admitted into the University in ", "2017/18", " ", "academic year", " ", "only", "Possess 5 credits in WAEC/SSCE/NECO including English Language and Mathematics", "Possess a minimum Cumulative Grade Point Average (CGPA) of 3.5 on scale of 5 or 3.0 on a scale of 4 which is equivalent to 2.1 in the first year for the ", "2017/18 batch of students", "Applicants should provide their transcripts for the first year of study", "Undergraduate applicants who meet the above requirements are to upload the following documents:", "Evidence of statement of WAEC/SSCE/NECO results with at least 5 credits, including English Language and Mathematics", "Letter of admission into the University", "First year academic transcript(s)", "Evidence of state of origin and local government", "Personal statement of a minimum of 100 words stating reasons for undertaking the course of study", "Recent passport photograph", "B). ", "(LSS) MSc. ", "(Requirements for application):", "Applicants must possess full time admission letter into any of the Federal Universities", "A minimum of Second Class Upper (2.1) in an oil and gas related field or a 2.2 with a minimum working experience of 2 years in the oil and gas industry;", "Possess at least 5 credits in WAEC/SSCE/NECO results;", "National Youth Service Corps (NYSC) certificate or Letter of exemption;", "Applicants must be computer literate;", "Letter of admission into the University;", "Academic transcript;", "Evidence of state of origin and local government;", "Personal statement of a minimum of 1000 words stating reasons for undertaking the course of study;", "Recent passport photograph", "C). ", "PhD (LSS)", " (Requirements for application):", "Applicants must possess full time admission letter into any of the Federal Universities", "A minimum of Second Class Upper (2.1) in an Oil and Gas related field or a 2.2 with a minimum working experience of 2 years in the oil and gas industry;", "Possess at least 5 credits in WAEC/SSCE/NECO results,", "National Youth Service Corps (NYSC) certificate or Letter of exemption;", "Applicants must be computer literate;", "A minimum of 2.2 in their first degree and a minimum of merit as a second degree certificate in an oil and gas related discipline;", "Valid admission letter of not more than one year;", "Academic transcripts;", "Evidence of state of origin and local government;", "Research area must be relevant to the oil and gas industry;", "PhD research proposal of not more than 6 pages to include topic, introduction, literature review, research question(s), novelty, methodology, mode of data collection(s), expected outcome(s), relevance to the industry and appropriate references", "Recent passport photograph", "DOCUMENTS TO BE UPLOADED BY POST GRADUATE APPLICANTS:", "Applicants are advised to scan copies of the following documents and attach to their online application forms:", "First Degree Certificates or Statement of Results", "NYSC Certificate or letter of exemption", "WAEC/GCE/SSCE/NECO Results", "Academic Transcript(s)", "Admission Letter", "Personal Statement", "State and Local Government Identification Letters", "Recent Passport Photograph", "Additional scanned documents required from PhD applicants:", "Second Degree Certificates or Statement of Results", "PhD research proposal", "PhD Applicants are to follow the link provided below on the format of organization and structure for proposal write up", "Organization and Structure of PHD Proposal", "PhD RESEARCH AREAS:", "PhD research areas have been provided to enable applicants chose areas of research (see application drop box)", "DEADLINES FOR APPLICATION:", "Application will open from Monday October 8 to Friday November 16, 2018 for 6 weeks     ", " ", "For More Information:", "Visit the Official Webpage of the PTDF Undergraduate & Postgraduate Scholarships 2018/2019 "], "url : https://www.opportunitiesforafricans.com/ptdf-undergraduate-postgraduate-scholarships-2018-2019/"], [["Yale Young Global Scholars Program 2019 for outstanding High School Students worldwide (Scholarships/Financial Aid Available)", "date announced:October 11, 2018", "Application Deadline: February 6, 2019 at 11:59PM EST"], ["Application Deadline: ", "February 6, 2019 at 11:59PM EST", "Yale Young Global Scholars (YYGS)", " is a summer academic enrichment and leadership program for outstanding high school students from around the world. Each summer, students from over 100 countries participate in one of nine interdisciplinary sessions and immerse themselves in a global learning community.", "YYGS-Beijing", ": Asia in the 21st Century (ATC) is administered by ", "Yale Center Beijing", " and takes place in Beijing, China.", "Eligibility Requirements:", "In order to apply to YYGS, applicants MUST fulfill all of the following requirements:", "Age:", " Be at least 15 years old by February 6, 2019 (application deadline).", "English Fluency:", " Be able to participate in a rigorous academic curriculum conducted in English.", "Grade Level:", " Be a current high school sophomore or junior (or international equivalent).", "Graduation Date:", " Be graduating in May/June 2020 or 2021 from the Northern Hemisphere, or in Nov./Dec. 2019 or 2020 from the Southern Hemisphere.", "YYGS accepts applications from ALL countries.", "Required Components", "YYGS reviews all applications holistically. Our staff understands that students come from a wide variety of backgrounds and with different educational and extracurricular opportunities. As a result, the essays and letters of recommendation are the most important parts of the application.", "YYGS Application – Required Components:", "Activities list", "One 500-word essay and two 200-word responses", "Official school transcript", "Two letters of recommendation", "Unofficial standardized test scores, if available (submit or waive)", "Need-based financial aid (submit or waive)", "$60 application fee", "You must click the Finalize & Pay button on the “Review” page for your application to be considered.", "Tuition/Scholarships:", "Tuition for each session of the ", "2019 Yale Young Global Scholars (YYGS) program", " is ", "$6,250 USD", ", which includes instruction, housing on one of Yale’s historic residential colleges in New Haven or a hotel conveniently located near the Yale Center Beijing in China, three meals per day, and optional health insurance. ", "TRAVEL COSTS ARE NOT INCLUDED", " in program tuition", "Thanks to generous donors, YYGS is able to offer various ", "Scholarships", ", which are ", "Need-Based Financial Aid", " packages that cover full-tuition ($6,250 USD) and may also cover travel costs.", "In order to be considered for one of these scholarships (below), ", "you MUST complete the entire online ", "YYGS Application", ", including the", " ", "Need-Based Financial Aid", " ", "portion, by February 6, 2019", ". YYGS staff will then automatically review whether or not you meet any of our 2019 scholarships’ eligibility requirements and contact you when decisions are released in late March or early April.", "How to Apply:", "Step 1:", " Review the ", "YYGS eligibility criteria", ".", "Step 2: ", "Review the ", "YYGS application required components", ".", "Step 3: ", "Review a ", "PDF of a sample blank application", ", and start preparing to answer as many application questions as possible.", "Step 4: ", "You will need to submit contact information for a ", "parent/guardian, teacher, and/or official at your school", ". Reach out to them as soon as possible to ", "review the PDF of a sample blank application", " with you, and be sure to collect the information you need.", "Step 5:", " Click ", "APPLY NOW", " and start your 2019 application. ", "Be sure to write down the email and password you use", " in case you need to login again to continue the application.", "Step 6:", " ", "Contact YYGS Staff", " with ANY/ALL questions as you complete the application. The earlier you contact us, the more likely that we can help you by the deadline.", "Step 7: Check the “Review” page", " of the application to see if you are missing any required components, and go back into any pages that require further information.", "Step 8:", " Once your application is complete, on the “Review” page please ", "click on the “Finalize & Pay” button ", "at the bottom of the page.", "Step 9:", " ", "Pay the $60 USD application fee. ", "If you submitted a ", "Fee Waiver Request", "*, this page will automatically skip.", "\n*YYGS staff will contact you if your Fee Waiver Request is denied to let you know that your application will not be reviewed until the $60 YYGS application fee is paid.", "Step 10:", " Keep an eye out for an ", "email from YYGS that confirms receipt", " of your completed application. Please note that confirmation emails usually arrive within 24-48 hours of submission, as there are sometimes delays in payment processing. Questions? Please ", "contact us", ".", "Decision Notification", ":", "\nApplicants will be notified electronically of admissions decisions by late March or early April.", "For More Information:", "Visit the Official Webpage of the Yale Young Global Scholars Program 2019"], "url : https://www.opportunitiesforafricans.com/yale-young-global-scholars-program-2019/"], [["Sciences Po Mastercard Foundation Scholars Program 2019/2020 for study in France (Fully Funded)", "date announced:October 8, 2018", "Application Deadline: February 18th 2019"], ["Application Deadline: February 18th 2019", "The Mastercard Foundation Scholars Program at Sciences Po", " aims to support ", "120 talented African students", " through their studies and to offer the next generation of leaders a world-class social science education, so they can go on to become ", "changemakers in their home countries", ".", "Over six years (2017 – 2022), the Scholars Program will fund:", "20 scholarships ", "to complete the ", "Sciences Po Bachelor of Arts programme", ", ", "Africa specialisation", "40 scholarships", " to complete a Master’s programme at one of our seven ", "graduate schools", "60 scholarships", " reserved for Mastercard Foundation Scholars studying at other partner universities and who would like to attend Sciences Po ", "Summer School", ".", "The Mastercard Foundation created this ", "merit-based scholarship program", " to give the most talented African students the chance to benefit from a quality education and pursue their ambitions, whatever their background. The scholars are supported throughout their university education in the social sciences so they can go on to become changemakers in their home countries.", "Finance your studies", "\nThe program offers scholarships:", "\n• to complete the Sciences Po Bachelor of Arts programme,Africa specialisation", "\n• to complete a two-year Master’s programme at one of the seven graduate schools", "\n• to attend Sciences Po Summer School", "Requirements:", "The scholarships are awarded to students from sub-Saharan African countries with an ", "outstanding academic record", " and ", "strong leadership potential", ", but who face financial and other barriers to higher education.", "The scholarships are awarded for a period of three years for the Bachelor’s degree, two years for the Master’s degree and one month for the Summer School. They cover the full cost of tuition fees at Sciences Po and living costs in France during the study period.", "As well as funding their studies, Sciences Po will offer scholars a specific suite of resources to ensure they have appropriate academic support and to facilitate their transition from education to employment:", "An orientation programme", " and ", "individualised academic advising", " throughout their studies at Sciences Po", "A mentor programme", " offered in collaboration with the ", "Africa Division of Sciences Po Alumni", "Career guidance and support", ": an online job platform dedicated to professional opportunities in Africa (internships and first jobs), access to our ", "business incubator", " and the network of employers and alumni working in Africa, and specific career workshops.", "Benefits:", "The scholarships cover the full cost of tuition fees at Sciences Po and living costs in France during the study period.", "Prepare to launch your career and train in entrepreneurship", "\nScholars participate in career workshops and training modules in entrepreneurship focused on the African market.", "Return to Africa and contribute to the continent’s development", "\nUndergraduate Scholars complete the civic internship and spend their third year studying in Africa. Graduate Scholars complete an internship related to African issues.", "Join the network of Mastercard Foundation Scholars", "\nEach year, five Scholars take part in a summit organised by the Mastercard Foundation where they get to meet their counterparts studying at other leading universities in North America, Europe and Africa, and debate the issues facing Africa today.", "Succeed academically", "\nIn addition to funding, Scholars benefit from individual academic support throughout their studies", "2019-2020 Deadlines", "Application deadlines", " for the Mastercard Foundation Scholarships are:", "Bachelor: January 31, 2019", "Master: January 15, 2019", "Summer School: February 18, 2019", "Application Procedure:", "Apply to the scholarship : To apply, go to www.sciencespo.fr/students, “Fees & Funding” then “Bursaries and Financial Aid” Contact: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Sciences Po Mastercard Foundation Scholars Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/sciences-po-mastercard-foundation-scholars-program-2019-2020/"], [["DAAD University Summer Course Grants Scholarships 2018/2019 for Study in Germany", "date announced:October 15, 2018", "Application Deadline: December 1st 2018"], ["Application Deadline: December 1st 2018", "The DAAD University Summer Course Grants Scholarships", " ", " aims to help students and graduates improve their knowledge of German (general language, special language) and their cultural knowledge of the country.", "Requirements:", "Applications are open to students in Bachelor’s and Master’s degree programmes in any subject area.", "Bachelor students must have completed at least two academic years at the start of the scholarship period.", "What can be Funded", "The programme funds attendance of language and area studies courses as well as special language / terminology courses that are offered by state or state-recognised German universities and by affiliated language schools.", "You can find out about course providers and programmes on the DAAD website under: ", "www.daad.de/hsk-kursliste", ".", "The courses are taught exclusively in German.", "Duration of the funding", "The courses run for at least 18 teaching days (max. 5 days/week, excluding days of arrival and departure) with a minimum of 25 hours of teaching a week.", "The grants are non-renewable.", "The courses usually take place in the period from June to December.", "Value", "One-off scholarship payment of 950 euros; scholarship holders from ", "“Least Developed Countries”", " receive a scholarship of 1,125 euros.", "Payment of a country-specific travel allowance (exception: Western Europe), see: ", "travel allowance", ")", "Payments towards health, accident and personal liability insurance cover", "Please note:", "\nCourse fees and accommodation expenses are usually deducted directly from scholarship payments by the language course provider so that the grant holder is possibly paid only the difference to the full amount of the scholarship by the course provider.", "\nThe above mentioned payments (including travel allowance) will not be transferred abroad.", "Selection", "A selection committee reviews applications", "The most important selection criteria are:", "\n– previous academic achievements", "\n– convincing arguments for choice of study programme and subject", "\n– knowledge of German", "Application Procedure:", "The application procedure occurs online through the DAAD Portal.", "\nYou are also required to send 1 copy of the “Application summary” (PDF file), which is generated in the DAAD portal after the online application procedure has been completed, by post to the application address.", "Application documents", "Certificates, proof of credits, certifications and translations may be submitted in non-certified form. The DAAD Head Office in Bonn reserves the right to also request certified copies of the submitted documents.", "Documents to be uploaded to the DAAD Portal:", "Online application form", "Full curriculum vitae in tabular form (in German)", "Letter of motivation (in German)", "Copy of university degree certificate with final grade(s), if available (with German or English translation)", "Proof of credits of the last two years (in German or in English)", "Language certificates", "To be submitted by post", "\nA recent reference from a university teacher which provides information about your qualifications. Please regard the instructions given on the tab “Submitting an application“.", "\nYou are also required to send 1 copy of the “Application summary” (PDF file), which is generated in the DAAD portal after the online application procedure has been completed, by post to the application address.", "For More Information:", "Visit the Official Webpage of the DAAD University Summer Course Grants Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/daad-university-summer-course-grants-scholarships-2018-2019-for-study-in-germany/"], [["Sciences Po Effiel Scholarships 2019/2020 for study in France (Funded)", "date announced:October 10, 2018", "Application Deadline:November 6th, 2018"], ["Application Deadline:", "November 6th, 2018", "The Ministry of Foreign Affairs gives priority to candidates from emerging countries and above all to those who are underrepresented in French universities and higher education institutions: Asia, Latin America, Eastern Europe and new members of the EU and the Middle East.", "Sciences Po", " only presents applications from candidates ", "with profiles that match the priorities of the Eiffel scholarship", ". If you are offered a place to study at Sciences Po, we will inform you whether your application will be proposed to ", "Campus France", " (the organisation in charge of this scholarship).", "Applications received from students currently studying abroad are prioritised over those from students already living in France.", "Students cannot apply directly for the Eiffel Scholarship. Applications must be made through a higher education institution.", "  If you are studying in two higher education institutions, you can only submit a single application. In order to apply, you must have already been accepted to a programme at Sciences Po. For your application to be successful, it is essential that you respect our deadlines.", "\nThe Eiffel scholarship programme, launched in January 1999 by the French Ministry of Foreign and European Affairs, is aimed at foreign students whose outstanding ability has been recognised by French institutions of higher education who wish to sponsor these students for the rest of their studies.", "\nThe programme is primarily designed to provide an education in France to future decision makers in both the private sector and in the national administrations of emerging countries.", "Eligibility", "Are eligible to the Eiffel Scholarship", "Candidates must be ", "under 30 years old", ".", "Sciences Po candidates", "Applicants for our graduate programmes", "Applicants for the dual degree in Journalism / Columbia (BAMA) (who are already first year students at Columbia’s university School of Journalism)", "Sciences Po students", "Third year Sciences Po students", "Second year undergraduate students in one of our partnership programmes at Poitiers campus", "First year graduate student at Science Po", "Students admitted last year in their first year as a graduate student who requested a deferral", "Students admitted last year who have received a conditional offer of admission if they submit an English test before the scholarship application deadline.", "PhD students who are co-supervised or presenting a joint thesis with a partner university", "Students admitted to the following dual degree programme (other Sciences Po dual degree programme are not eligible for this scholarship):\n", "Journalism Sciences Po/Columbia University (candidates for this programme are eligible)", "Sciences et Politiques de l’Environnement Sciences Po/Sorbonne Université (only first year students are eligible)", "Quantitative Economics Sciences Po/Panthéon Sorbonne Paris I (only first year students are eligible)", "The Eiffel laureates who graduated in June 2018 and wish to submit an Eiffel application for the PhD.", "Scholarship Worth", "The ", "monthly grant amount for Master programmes ", "will be confirmed soon by Campus France", ".", "The Eiffel Scholarship ", "does not cover tuition fees", ".  Students offered a place to study at Sciences Po who receive the scholarship are therefore responsible for paying the annual tuition fees.", "Application Procedure:", "Required documents", "All candidates must attach the following documents to their scholarship application :", "CV, including information on the applicant’s level (distinction/honours, ranking or position in the promotion, number of students in the promotion, diploma with information on specialisation, date of the diploma, final grades)", "professional project, one or two pages. The applicant must explain the reasons for studying in France as opposed to their home country, their interest for the selected programme and how this will help them achieve their career goals and objectives.", "academic transcripts all of the years of higher education (including periods spent abroad on exchange programmes)", "ID/passport.", "Language test certificates (french and/or english) if necessary", "Deadlines", "Students already admitted at Sciences Po (including applicants who deferred their arrival or those who received conditional offer last year)", " ", ": ", "October 20th, 2018", "First time applicants:", " November 6th, 2018", "The deadline for applications set by Sciences Po ", "is not the date at which applications must be received by Campus France.", " Indeed, it is necessary to have been offered a place at Sciences Po in order to be eligible for the Eiffel Scholarship. Applications received after this date will not be processed.", " ", "These dates are mandatory and cannot be modified.", "Students already admitted at Sciences Po must send their Eiffel Scholarship application by email, directly to the Admissions department by October 20th, 2018", " ", "at the latest: ", "Admissions contact form", "Information on the selection of your application will be communicated in January 2019.", "For More Information:", "Visit the Official Webpage of the Sciences Po Effiel Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/sciences-po-effiel-scholarships-2019-2020-for-study-in-france-funded/"], [["The Bank of Namibia postgraduate studies (Masters Degree) Scholarships 2018 for young Namibians", "date announced:October 4, 2018", "Application Deadline: 30 November 2018."], ["Application Deadline: ", "30 November 2018", ".", "The Bank of Namibia", " offers a unique opportunity to Namibians who want to pursue ", "postgraduate studies (Masters Degree)", " at recognized and reputable universities in SADC and internationally. The Bank will sponsor studies in the following fields:", "• International Finance and Trade", "• Economics", "• International Banking", "• Econometrics", "• Forensic Accounting", "Persons who are interested in seizing this opportunity are required to meet the following criteria:", "• A Namibian citizen;", "• 40 years of age and younger;", "• Be in possesion of a Undergraduate Degree.", "You are required to submit the following:", "• A comprehensive CV inclusive of certified copies of the following: identification document; all qualifications obtained, study transcripts and motivation letter;", "• Proof of provisional acceptance at a reputable university;", "• A provisional study programme, course outline and dissertation theme;", "• A timeframe of your study.", "The sponsorship amongst others can include cost of registration, tuition, accommodation, books, travel and living related cost for the duration of studies. Successful candidates will be required to enter into a Contract with the Bank before commencement of studies.", "Benefits:", "The sponsorship can cover accommodation, tuition, registration, travel and living related costs for the duration of studies. Upon acceptance of the sponsorship, successful candidates will be expected to enter into a contract with the Bank before commencing their studies.", "Closing Date", "The Closing Date for applications is ", "30 November 2018", ". Please ensure that you have completed and submitted your application before the closing date to be eligible for consideration. The bursary will be offered at the sole discretion of Bank of Namibia, whose decision is final", "How do I apply:", "To apply for a fellowship online, ", "Register as a new applicant", " (please ensure that you have a ", "valid email address", ").", "Once you have registered as a new user, ", "login and complete your application", ".", " ", "For More Information:", "Visit the Official Webpage of the The Bank of Namibia postgraduate studies (Masters Degree) Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/the-bank-of-namibia-postgraduate-studies-masters-degree-scholarships-2018-for-young-namibians/"], [["ARES Belgian Government Masters and Training Scholarships 2019/2020 for study in Belgium", "date announced:October 5, 2018", "Application Deadline:  8 February 2019"], ["Application Deadline:  ", "8 February 2019", "Are you a national of a developing country? Do you already hold a master’s degree?", "Do you have professional experience and are you looking to further develop your skills in a development-related topic?", "Scholarships for masters and training courses", " offer you the chance to pursue a one-year specialised master’s degree programme or a 4-to-6-month advanced training course within a higher education institution of the ", "Wallonia-Brussels Federation, Belgium.", "Which trainings are eligible?", "Are you interested in obtaining more information about the training courses available? Have a look at the list of master’s programs and training courses financed by ARES.", "Specialized master’s programs for 2019-2020", " ", "Master de spécialisation en développement, environnement et sociétés", "Master de spécialisation en droits de l’homme", "Master de spécialisation en gestion des ressources aquatiques et aquaculture", "Master de spécialisation en gestion des risques et des catastrophes", "Specialised Master in Integrated Management of Health Risks in the Global South (IManHR)", "Specialised Master in International and development Economics", "Master de spécialisation en médecine transfusionnelle", "Specialised Master in Microfinance", "Master de spécialisation en production intégrée et préservation des ressources naturelles en milieu urbain et péri-urbain", "Specialised Master in Public Health Methodology", "Master de spécialisation en sciences de la santé publique – méthodes de recherche appliquées à la santé globale", "Master de spécialisation en sciences et gestion de l’environnement dans les pays en développement", "Master de spécialisation en transport et logistique", " Training courses for 2019", " ", "Stage en contrôle et assurance qualité des médicaments et produits de santé", "Stage d’initiation à la recherche pour le renforcement des systèmes de santé", "Stage en système d’information géographique", "Stage en valorisation des ressources secondaires pour une construction durable", "Stage méthodologique en appui à l’innovation en agriculture familiale", "Financial Support", "Each year, ARES grants an average of 150 scholarships as part of the master’s program, and 70 grants for training courses, to citizens from countries in the global South.", "Application Procedure:", "It must be carefully completed and sent to ARES (rue Royale 180, 1000 Brussels, Belgium) ", "BY POST or EXPRESS DELIVERY SERVICE ONLY", ", which must have received it by ", "8", " ", "FEBRUARY 2019*", " at the latest (", "we do not take into consideration the postmarked date; we only consider application files received on our offices by the deadline, at the latest", ");", "NO return receipt for applications will be signed nor delivered", ";", "Only applications presented on the relevant forms will be considered, in the language in which the training course is given;", "All elements necessary for the application file (", "application form AND additional information requested", ") must be included in the ", "same mailing AND correctly stapled or bound", " so that no documents are lost. ", "No additional elements for the application sent later will be considered", ";", "All applicants selected and on reserve status will receive an e-mail when selections are made (June 2019). Applicants who are not selected will receive an e-mail by the end of June 2019 at the latest;", "Documents submitted to ARES will not be returned to applicants", ";", "No response will be given to applications that do not follow the admissibility criteria clearly mentioned on the website (certified diploma, age, professional experience, etc.).", "* before 11 JANUARY 2019", " for the following training courses:", "Stage en valorisation des ressources secondaires pour une construction durable", "Stage en contrôle de qualité et assurance qualité des médicaments et produits de santé", "contact Maryvonne Aubry – ", "scholarships-", "[email protected]", "For More Information:", "Visit the Official Webpage of the ARES Belgian Government Masters and Training Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/ares-belgian-government-masters-and-training-scholarships-2019-2020-for-study-in-belgium/"], [["Open Society Foundation Disability Rights Scholarship Program 2019 for Africans (Funded)", "date announced:October 16, 2018", "Application Deadline: December 3rd 2018"], ["Application Deadline: December 3rd 2018", "The Open Society Foundation Disability Rights Scholarship Program", " provides yearlong awards for master’s degree study to disability rights advocates, lawyers, and educators to develop new legislation, jurisprudence, policy, research, and scholarship to harness the innovations and opportunities offered by the ", "United Nations Convention on the Rights of Persons with Disabilities (CRPD).", "With the knowledge and networks gained through the program, we expect that fellows will deepen their understanding of international law and education, with a focus on disability rights, and gain the tools necessary to engage in a range of CRPD implementation strategies, such as: challenging rights violations in their home countries by drafting enforceable legislation consistent with the CRPD; utilizing enforcement mechanisms set forth in the Convention; taking forward disability rights litigation requesting CRPD-compliant remedies; engaging in disability rights advocacy; and developing law, education, or other academic curricula informed by the CRPD.", "Eligibility Requirements:", "The competition is merit-based and open to those meeting the following criteria:", "be a citizen and legal resident Mozambique, Sudan, South Sudan, Tanzania; Mexico, Czech Republic, Georgia, or Ukraine at the time of application", "have work experience in the legal profession or advocacy focusing on human/disability rights", "have an excellent academic record with a bachelor of laws (LLB; in exceptional circumstances, those without a LLB but with substantial relevant experience may be considered)—a degree must be awarded by the application deadline", "have demonstrated leadership in the field of disability rights", "be proficient in spoken and written English or French and able to meet university-designated minimum scores on standardized language tests", "be able to participate in an intensive academic writing program in August or September 2019", "be able to begin the graduate program in August or September 2019", "be able to receive and maintain visa or study permit required by host country", "demonstrate a clear commitment to return to home country to contribute to advancing the inclusion and full participation of persons with disabilities in their communities", "Guidelines", "For further details, see the complete guidelines and ", "submit an application online", ", or contact the appropriate regional coordinator below.", "Residents of  Mozambique, Sudan, South Sudan, Tanzania:", "Jehoshaphat Njau", "\nProject Coordinator, Disability Rights Unit Centre for Human Rights", "\nFaculty of Law, University of Pretoria", "\nPretoria, 002, South Africa", "\nTel:  +27 (0)12 420 6345", "\nFax: +27 (0)86 580 5743", "\nEmail: ", "[email protected]", "\nWebsite: ", "www.chr.up.ac.za", "For More Information:", "Visit the Official Webpage of the Disability Rights Scholarship Program"], "url : https://www.opportunitiesforafricans.com/open-society-foundation-disability-rights-scholarship-program-2019/"], [["Loeries® Creative Future Scholarship 2018 for Young South Africans (Fully Funded)", "date announced:October 3, 2018", "Application Deadline:Friday 19 October 2018"], ["Application Deadline:Friday 19 October 2018", "If you are a talented young creative in need of financial support to further your education, you are eligible to apply for ", "the Loeries Creative Future Scholarship.", "The scholarship provides an opportunity for an aspiring Grade 12 learner, with financial need, to study a three-year degree in Brand Communication in Johannesburg.", "The Loeries Creative Future scholarship", " was launched 10 years ago in 2008 to encourage and enable creativity at grassroots levels, by assisting learners from disadvantaged backgrounds to study brand communication at a tertiary institution. The scholarship is now the creative industry’s richest bursary, covering everything a learner requires, including fees, study materials, accommodation and living expenses as well as mentorship, internship and employment in the advertising and brand communication industry.", "In its ongoing support of young talent development, the Loeries is working in partnership with the ", "AAA School of Advertising", " Johannesburg and ", "TBWA Hunt Lascaris Johannesburg", " who, together, are contributing to the Creative Future Scholarship.", "Worth:", "The Creative Future Scholarship is to study 3-year degree in Brand Communication or Copywriting beginning in the 2019 academic year.", "To help streamline this selection process it is vital for you, as the educator, to identify a Grade 12 learner that is showing strong potential and talent in the creative arts and/or design, and who is in need of financial support. This can include talent in writing, design, photography, animation, film, drawing, etc.", "For More Information:", "Visit the Official Webpage of the ", "Loeries Creative Future Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/loeries-creative-future-scholarship-2018-for-young-south-africans/"], [["Commonwealth PhD Scholarships 2019 (for low and middle income countries) to Study in the UK (Fully Funded)", "date announced:October 12, 2018", "Application Deadline:16:00 (GMT) on 19 December 2018"], ["Application Deadline:", "16:00 (GMT) ", "on ", "19 December 2018", "Commonwealth PhD Scholarships", " are for candidates from low and middle income Commonwealth countries, for full-time doctoral study at a UK university.", "Funded by the ", "UK Department for International Development (DFID)", ", Commonwealth PhD Scholarships enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those who could not otherwise afford to study in the UK. These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2019", "By October 2019, hold a first degree of at least upper second class (2:1) honours standard, or a second class degree and a relevant postgraduate qualification (usually a Master’s degree)", "NOT be registered for a PhD, or an MPhil leading to a PhD, at a UK university before September/October 2019", "NOT have commenced and be currently registered for a PhD, or an MPhil leading to a PhD, in your home country or elsewhere", "Be unable to afford to study in the UK without this scholarship", "Scholarship Worth:", "Each scholarship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor the cost of journeys made before your award is confirmed)", "Approved tuition fees Stipend (living allowance) at the rate of £1,084 per month, or £1,330 per month for those at universities in the London metropolitan area (rates quoted at 2018-2019 levels)", "Warm clothing allowance, where applicable Study travel grant towards the cost of study-related travel within the UK or overseas", "Provision towards the cost of fieldwork undertaken overseas (usually the cost of one economy class return airfare to your fieldwork location), where approved Paid mid-term visit (airfare) to your home country (unless you have claimed (or intend to claim) spouse and/or child allowances during your scholarship, or have received a return airfare to your home country for fieldwork)", "Family allowances, as follows (rates quoted at 2018-2019 levels):", " If you are accompanied by your spouse but no children: spouse allowance of £233 per month for a maximum period of nine months, if you and your spouse are living together at the same address in the UK (unless your spouse is also in receipt of a scholarship; other conditions also apply)", "If you are accompanied by your spouse and children: spouse allowance of £233 per month and child allowance of £233 per month for the first child, and £114 per month for the second and third child under the age of 16, if your spouse and children are living with you at the same address in the UK (unless your spouse is also in receipt of a scholarship; other conditions also apply)", " If you are accompanied by your children but no spouse: child allowance of £465 per month for the first child, and £114 per month for the second and third child under the age of 16, if your children are living with you at the same address in the UK", "Eligible Commonwealth countries", "Antigua and Barbuda", "\nBangladesh", "\nBelize", "\nBotswana", "\nCameroon", "\nDominica", "\nEswatini", "\nFiji", "\nThe Gambia", "\nGhana", "\nGrenada", "\nGuyana", "\nIndia", "\nJamaica", "\nKenya", "\nKiribati", "\nLesotho", "\nMalawi", "\nMalaysia", "\nMauritius", "\nMontserrat", "\nMozambique", "\nNamibia", "\nNauru", "\nNigeria", "\nPakistan", "\nPapua New Guinea", "\nRwanda", "\nSamoa", "\nSierra Leone", "\nSolomon Islands", "\nSouth Africa", "\nSri Lanka", "\nSt Helena", "\nSt Lucia", "\nSt Vincent and the Grenadines", "\nTanzania", "\nTonga", "\nTuvalu", "\nUganda", "\nVanuatu", "\nZambia", "Selection process", "Each year, the CSC invites selected nominating bodies to submit a specific number of nominations. The deadline for nominating bodies to submit nominations to the CSC is 25 January 2019.", "The CSC invites around three times more nominations than scholarships available – therefore, nominated candidates are not guaranteed to be awarded a scholarship. There are no quotas for scholarships for any individual country. Candidates nominated by national nominating agencies are in competition with those nominated by other nominating bodies, and the same standards will be applied to applications made through either channel.", "Applications will be considered according to the following selection criteria:", "Academic merit of the candidate", "Quality of the plan of study", "Potential impact of the work on the development of the candidate’s home country", "How to apply", "You must apply to one of the following nominating bodies in the first instance – ", "the CSC does not accept direct applications for these scholarships", ":", "National nominating agencies", " – this is the main route of application", "Selected universities/university bodies", ", which can nominate their own academic staff", "Selected non-governmental organisations and charitable bodies", "All applications ", "must", " be made through one of these nominating bodies. Each nominating body is responsible for its own selection process and may have additional eligibility criteria. ", "You must check with your nominating body for their specific advice and rules for applying, their own eligibility criteria, and their own closing date for applications.", "You must make your application using the CSC’s online application system, in addition to any other application that you are required to complete by your nominating body. ", "The CSC will not accept any applications that are not submitted via the online application system", ".", "All applications must be submitted by ", "16:00 (GMT) ", "on ", "19 December 2018", " at the latest.", "For More Information:", "Visit the Official Webpage of the Commonwealth PhD Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-phd-scholarships-2019/"], [["Dan David Prize/Scholarships 2018 for Students & Researchers around the world.", "date announced:October 12, 2018", "Application Deadline: March 10th 2019"], ["Application Deadline: March 10th 2019", "The Dan David Prize awards scholarships", " to", " doctoral and post-doctoral", " researchers, carrying out research in one of ", "the selected fields", " for the current year. ", "Registered", " doctoral and post-doctoral researchers who study at recognized universities throughout the world, and whose ", "research has been approved", ", are eligible to apply.", "The Dan David Prize", " is an international award, endowed by the ", "Dan David Foundation", " and headquartered at Tel Aviv University.", "The Dan David Prize recognizes and encourages innovative and interdisciplinary research that cuts across traditional boundaries and paradigms. It aims to foster universal values of excellence, creativity, justice, democracy, and progress and to promote the scientific, technological and humanistic achievements that advance and improve our world.", "Benefits:", "The Dan David Prize laureates annually donate twenty scholarships of US$15,000 each to outstanding doctoral students and postdoctoral researchers of exceptional promise in the ", "selected fields for the current year. ", "Ten scholarships are awarded to students at universities throughout the world and ten scholarships to students at", "\nTel Aviv University.", "The Dan David Prize scholarships are granted according to merit, without discrimination based on gender, race, religion, nationality, or political affiliation.", "Application Form Information", " ", "The application process, including the uploading of required documents, must be completed ", "online", " ", "only", " via the Dan David Prize website.", "The requested Application Form and all documentation must be completed in ", "English only", ".", "For inquiries, please contact ", "[email protected]", ", tel: +972-3-6406614", " ", "The following information/documentation is required for the completion of the Scholarship Application process:", "Applicant’s Details", "Title, First Name, Middle Name, Last Name", "Applicant’s institution and department of study", "Postal address of institution of study", "Educational Status: Ph.D. student or postdoctoral researcher", "Commencement date of Ph.D. studies or postdoctoral research period", "Date of approval of Ph.D. research project (Postdoc: Not Applicable)", "Title of Ph.D./postdoctoral research project", "Postal address of applicant", "Telephone numbers: work, home and mobile", "Email", "Supervisor’s Details", "Title, First Name, Last Name", "Supervisor’s institution and department of affiliation", "Work telephone number", "Email", "Attachments ", "(Supported formats: doc|rtf|docx|pdf, max size: 5MB)", "A full curriculum vitae of the applicant including a list of publications.", "A ", "one to two page", " description of the applicant’s doctoral/postdoctoral research project.", "Three", " separate letters of recommendation, on official letterhead and signed by recognized scholars in the field, one of which must be the doctoral/postdoctoral supervisor.", "\nAll Recommendation Letters must be uploaded via the online ", "Recommendation Submission Form ", "link", ".", "In addition, originals must mailed", " to", ": Ms. Smadar Fisher, Director, Dan David Prize, P.O.Box 39040, Tel Aviv University, Tel Aviv 6997801, Israel. ", "Signed", " authorization by the university, on official letterhead, stating that the applicant is a registered doctoral student/postdoctoral researcher, ", "whose research has been approved", ".", "In addition, originals must mailed", " to", ": Ms. Smadar Fisher, Director, Dan David Prize, P.O.Box 39040, Tel Aviv University, Tel Aviv 6997801, Israel. ", "For More Information:", "Visit the Official Webpage of the Dan David Prize/Scholarships 2018 "], "url : https://www.opportunitiesforafricans.com/dan-david-prize-scholarships-2018-for-students-researchers-around-the-world/"], [["Commonwealth Master’s Scholarships 2019 for full-time Master’s study at a UK university (Fully Funded)", "date announced:October 12, 2018", "Application Deadline: 16:00 (GMT) on 19 December 2018"], ["Application Deadline: ", "16:00 (GMT)", " on ", "19 December 2018", "Commonwealth Master’s Scholarships", " ", "are for candidates from low and middle income Commonwealth countries, for full-time Master’s study at a UK university.", "Funded by the ", "UK Department for International Development (DFID)", ", ", "Commonwealth Master’s Scholarships", " enable talented and motivated individuals to gain the knowledge and skills required for sustainable development, and are aimed at those who could not otherwise afford to study in the UK.", "These scholarships are offered under six themes:", "Science and technology for development", "Strengthening health systems and capacity", "Promoting global prosperity", "Strengthening global peace, security and governance", "Strengthening resilience and response to crises", "Access, inclusion and opportunity", "Eligibility", "To apply for these scholarships, you must:", "Be a citizen of or have been granted refugee status by an ", "eligible Commonwealth country", ", or be a British Protected Person", "Be permanently resident in an ", "eligible Commonwealth country", "Be available to start your academic studies in the UK by the start of the UK academic year in September/October 2019", "By October 2019, hold a first degree of at least upper second class (2:1) honours standard, or a second class degree and a relevant postgraduate qualification (usually a Master’s degree). The CSC would not normally fund a second UK Master’s degree. If you are applying for a second UK Master’s degree, you will need to provide justification as to why you wish to undertake this study Be unable to afford to study in the UK without this scholarship", "Scholarship Worth:", "Each scholarship provides:", "Approved airfare from your home country to the UK and return at the end of your award (the CSC will not reimburse the cost of fares for dependants, nor the cost of journeys made before your award is confirmed)", "Approved tuition fees Stipend (living allowance) at the rate of £1,084 per month, or £1,330 per month for those at universities in the London metropolitan area (rates quoted at 2018-2019 levels)", "Warm clothing allowance, where applicable Thesis grant towards the cost of preparing a thesis or dissertation, where applicable", "Study travel grant towards the cost of study-related travel within the UK or overseas If you are widowed, divorced, or a single parent, child allowance of £465 per month for the first child, and £114 per month for the second and third child under the age of 16, if you are accompanied by your children and they are living with you at the same address in the UK (rates quoted at 2018-2019 levels)", "Eligible Commonwealth countries", "Antigua and Barbuda", "\nBangladesh", "\nBelize", "\nBotswana", "\nCameroon", "\nDominica", "\nEswatini", "\nFiji", "\nThe Gambia", "\nGhana", "\nGrenada", "\nGuyana", "\nIndia", "\nJamaica", "\nKenya", "\nKiribati", "\nLesotho", "\nMalawi", "\nMalaysia", "\nMauritius", "\nMontserrat", "\nMozambique", "\nNamibia", "\nNauru", "\nNigeria", "\nPakistan", "\nPapua New Guinea", "\nRwanda", "\nSamoa", "\nSierra Leone", "\nSolomon Islands", "\nSouth Africa", "\nSri Lanka", "\nSt Helena", "\nSt Lucia", "\nSt Vincent and the Grenadines", "\nTanzania", "\nTonga", "\nTuvalu", "\nUganda", "\nVanuatu", "\nZambia", "How to apply", "You must apply to one of the following nominating bodies in the first instance – ", "the CSC does not accept direct applications for these scholarships", ":", "National nominating agencies", " – this is the main route of application", "Selected non-governmental organisations and charitable bodies", "All applications ", "must", " be made through one of these nominating bodies. Each nominating body is responsible for its own selection process and may have additional eligibility criteria. ", "You must check with your nominating body for their specific advice and rules for applying, their own eligibility criteria, and their own closing date for applications.", "You must make your application using the CSC’s online application system, in addition to any other application that you are required to complete by your nominating body. ", "The CSC will not accept any applications that are not submitted via the online application system.", "All applications, must be submitted by ", "16:00 (GMT)", " on ", "19 December 2018", " at the latest.", "\nYou are advised to complete and submit your application as soon as possible, as the online application system will be very busy in the days leading up to the application deadline.", "Your application must include the following supporting documentation by ", "16:00 (GMT)", " on ", "4 January 2019", " in order for your application to be eligible for consideration:", "Proof of citizenship or refugee status – uploaded to the online application system", "Full transcripts detailing ", "all", " your higher education qualifications (with certified translations if not in English) – uploaded to the online application system", "References from at least two individuals – submitted directly by the referees to the online application system (referees will be sent an email request)", "Choosing a university/course", "You may find the following resources useful when researching your choices of institution and course of study in the UK:", "Study UK", " – British Council website, with guidance for international students and a course and institution search", "Steps to Postgraduate Study", " – a guide to asking the right questions about taught postgraduate study in the UK", "Postgrad.com", " – information for postgraduate students, with a course search", "Prospects", " – information on postgraduate study in the UK", "Research Excellent Framework 2014 results", " – results of a system for assessing the quality of research in UK higher education institutions", "Steps to Postgraduate Study", " – a guide to asking the right questions about taught postgraduate study in the UK", "UCAS Postgraduate", " – guidance on how to find and apply for a postgraduate course", "Unistats", " – the official website for comparing UK higher education course data", "UKCISA", " (UK Council for International Student Affairs) – advice for international students on choosing a course of study", "For More Information:", "Visit the Official Webpage of the Commonwealth Master’s Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/commonwealth-masters-scholarships-2019/"], [["Yale Young African Scholars Program 2019 for African secondary school Students (Fully Funded)", "date announced:October 11, 2018", "Application Deadline:06 February 2019 at 11:59pm EST"], ["Application Deadline:06 February 2019 at 11:59pm EST", "The Yale Young African Scholars Program (YYAS)", " ", "is an intensive academic and enrichment program designed for African secondary school students planning to pursue tertiary education and who wish to make meaningful impact as young leaders on the continent.", "Participants will enhance their academic skills, receive university admission and financial aid application guidance, and join a network of young leaders from across Africa. Following the program, students will be paired with mentors who will help advise them throughout the university application process. There is no tuition cost to students to participate in YYAS.", "YYAS 2019 will be held in three locations:", "Ghana ", "|", " ", "25 July – 01 August", "Kenya ", "|", " ", "07 August – 14 August", "Zimbabwe ", "| 18 August – 25 August", "Eligibility Requirements:", "YYAS accepts applications from current secondary school (i.e. high school) students in Africa, typically between the ages of 15 and 18. All applicants must be citizens or permanent residents of an African country ", "AND ", "currently be attending a school in Africa.", "Students who will graduate secondary school before November/December 2019, or who have already graduated secondary school, are NOT eligible to apply. YYAS will also not accept applications from students who are younger than 14 years of age by the application deadline", "Student Profile:", "A typical YYAS participant has:", "Excellent academic records", "Demonstrated leadership potential", "Strong written and verbal communication skills", "A desire and ability to work cooperatively with peers", "Persistence and determination when facing challenges", "High standards of personal and professional conduct", "The ability to read, analyze, and reflect on large quantities of difficult material ", "in English", "Demonstrated maturity and interest in engaging in discussions about intellectual, moral, and political issues in Africa", "Please note that ", "YYAS is a university access program that gives preference to high-achieving, low-income (HALI) students who do not have university guidance in their schools or communities.", "Application Requirements:", "Completed application form ", "– The application can be found ", "online", " and must be filled out by the applicant. Students will be asked to complete one 500-word essay and two short responses, and must provide information on their extracurricular activities and the school that they currently attend. ", "Please be sure to write down the email and password you use to create your account so you may log back in. ", "You may preview the application ", "here", ".", "Official transcript or grade report(s)", " – A student transcript is an official document provided by the school and includes the applicant’s list of courses and grades received. Students must upload their official transcript or grade report(s) for each year of secondary school. National exam scores, if available, should also be submitted but are not required. ", "If a student has changed secondary schools at any point, they must include records both from their previous AND their current school.", " Please refrain from uploading certificates or transcripts from primary school.", "One teacher recommendation", " – The recommendation must be written and submitted by a teacher who knows the student well. They may do so through a link that will be provided by the applicant on the online portal. Alternatively, the teacher may email a letter of recommendation in PDF (.pdf) format to ", "[email protected]", " and our staff will upload it to the student’s application. Recommendations from parents/guardians, siblings, relatives, family friends, and/or paid private tutors/counselors will ", "NOT", " be accepted.", "If you have any specific questions about your eligibility, please email ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the Yale Young African Scholars Program 2019"], "url : https://www.opportunitiesforafricans.com/yale-young-african-scholars-program-2019/"], [["The University of Nebraska-Lincoln CASNR Undergraduate Scholarship Program (CUSP) 2019/2020 for Rwandan students", "date announced:October 16, 2018", "Application Deadline: December 21, 2018"], ["Application Deadline: December 21, 2018", "The University of Nebraska-Lincoln", " (“Nebraska” or “the university”) in the USA seeks to recruit up to 50 qualified Rwandan students to enroll in the ", "College of Agricultural Sciences and Natural Resources (CASNR)", " for the Fall 2018 term. Students selected to participate in the ", "CASNR Undergraduate Scholarship Program (CUSP)", " will pursue a Bachelor of Science degree in Integrated Science that is focused on conservation agriculture, entrepreneurship, leadership, and innovative thinking and is aligned with the areas of need as identified by the Rwandan Ministry of Agriculture and Animal Resources.", "Students will also have the opportunity to explore other areas of agriculture including: food production – animal, plant and food systems; soils, water quantity and availability, energy and environmental stewardship; nutrition, food safety, food engineering and processing; business, communication, public service and extension education; ecology, conservation biology and climate; and engineering, irrigation, mechanization and technology. Upon completion of the program, participants will return to Rwanda and commit a minimum of 5 years of their career to advancing the Rwanda agricultural sector.", "Benefits:", "Students selected to participate in the program will receive full scholarships, to include tuition, fees, living expenses, and travel costs.", "Requirements:", "The CUSP Scholarship is a full scholarship that covers all tuition, books, living expenses, and fees for a 4-year (120 credit hour) bachelor’s degree in Integrated Sciences.", "At the time of completing the scholarship application, an applicant must:", "Hold Rwandan citizenship.", "Have graduated from high school by the start of the academic year the applicant is applying for or be a transfer student from university. If you have completed a Bachelor degree program, you are not eligible to apply for the scholarship. If you have ", "not ", "completed a Bachelor degree program, you may apply. Cambridge International curriculum and exam results are accepted.", "Have an interest in the agricultural field of study (food production – animal, plant and food systems; conservation agriculture, soils, water quantity and availability; energy and environmental stewardship; business, entrepreneurship and leadership; nutrition, food safety, food engineering and processing; communication, public service and extension education; ecology, conservation biology and climate; and engineering, irrigation, mechanization and technology)", "Write a 500-word essay answering “Describe your future role as a leader to develop the agriculture sector in Rwanda.”", "By April 2019", ", finalists", " must be able to :", "Apply for and meet all University of Nebraska-Lincoln admission requirements.", "Provide a stamped copy of S4, S5 and S6 academic transcripts with class ranking.", "Provide a copy of national exam results after interview selection (March 2019).", "Meet University of Nebraska-Lincoln English proficiency requirements for full admission\n", "TOEFL score of 70 with a written subscore of 20", "IELTS score of 6.0 with a written subscore of 5.5", "An English Proficiency Exam will be offered to students selected for an interview who have not taken the TOEFL or IELTS", "Timeline:", "Key Dates", "Scholarship Application Open", "October, 2018", "Last Day to Submit Scholarship Application", "December 21, 2018", "Interview Notifications Sent to Finalists", "Sent by February 28, 2019", "Finalists Interviews", "March 2019", "Offers for Scholarship Awards are Sent", "By May 2019", "If you have any questions, please contact the CUSP Scholarship Committee at ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the CASNR Undergraduate Scholarship Program (CUSP) 2019/2020"], "url : https://www.opportunitiesforafricans.com/the-university-of-nebraska-lincoln-casnr-undergraduate-scholarship-program-cusp-2019-2020/"]]