[[["Rotary/UNESCO-IHE Scholarships 2020/2022 for Water and Sanitation Professionals", "date announced:November 27, 2019", "Application Deadline: 15 April 2020. "], ["Application Deadline: ", "15 April 2020", ". ", "The strategic partnership between ", "The Rotary Foundation (TRF) ", "and IHE Delft Institute for Water Education aims to tackle the world’s water and sanitation crisis by increasing the number of trained professionals to devise, plan, and implement solutions in developing and emerging countries.", "Through this partnership, a limited number of scholarships are\nawarded annually for graduate students at IHE Delft Institute for Water\nEducation’s campus in the Netherlands. These scholarships are designed\nto promote long-term productive relationships between Rotarians and\nhighly skilled water and sanitation professionals in their communities.", "Rotarians interview and select from local candidates who have already\nbeen admitted to one of IHE Delft Institute for Water Education’s\neligible 18-month Master of Science degree programs.", "The specializations of the following IHE Delft MSc programs are eligible for a 2020-2022 Rotary Scholarship:", "Water Management and Governance", "Urban Water and Sanitation", "Water Science and Engineering", "Important note:", " information about the application\nprocess/dates for the 2020-2022 Rotary Scholarships will be published on\nthis page soon (expected by the end of November 2020). Application\ndeadlines are expected be in March/April 2020.", "Students admitted to IHE Delft Institute for Water Education’s\neligible programs can be nominated by a local Rotary club in their home\ncommunity by submitting the application form for a scholarship to the\nRotary/IHE Delft committee in the Netherlands, together with the\nstudent’s resume and the IHE Delft admission letter. Only fully\ncompleted application forms submitted by the sponsoring Rotary club will\nbe considered. You can consult this website to find your nearest Rotary\nclub: ", "https://my.rotary.org/en/search/club-finder", "Only specializations of the following IHE Delft MSc programs are\neligible for a 2020-2022 Rotary Scholarship: Urban Water and Sanitation,\nWater Management and Governance, Water Science and Engineering. Joint\nspecializations of these programmes are not eligible.", "The application form has to be submitted by email to the Rotary/IHE Delft committee in the Netherlands: ", "[email protected]", "The deadline for applying for admission to one of the IHE eligible MSc programs is ", "01 April 2020", " and for submitting Rotary-scholarship applications is ", "15 April 2020", ". Any application forms submitted after this date will not be considered.", "In the document: ", "2020 – 2022 Rotary Scholarship for Water and Sanitation Professionals at IHE Delft – application form", ", you will find more information on the application process and the terms and conditions. This document is also the application form, which needs to be submitted by e-mail to the Rotary/IHE Delft committee in The Netherlands. ", "Application procedure in short:", "Apply for admission for one of the IHE Delft eligible Master programmes before 1 April 2020", "Search for your nearest Rotary club", "Approach nearest Rotary club and ask if they are willing to nominate you for a Rotary scholarship", "The application form needs to be completed by you and by the Rotary club", "After full completion the sponsoring Rotary club submits your\napplication to the Rotary/IHE Delft selection committee in the\nNetherlands before 15 April 2020", "After the selection all candidates will be informed about the outcome (before 01 July 2020).", "For More Information:", "Visit the Official Webpage of the Rotary/UNESCO-IHE Scholarships 2020/2022 "], "url : https://www.opportunitiesforafricans.com/rotary-unesco-ihe-scholarships-2020-2022-for-water-and-sanitation-professionals/"], [["Wells Mountain Foundation Empowerment Through Education Scholarship 2020 for Developing Country Nationals", "date announced:December 1, 2019", "Application Deadline: March 1, 2020 "], ["Application Deadline: March 1, 2020 ", " ", "WMF’s signature program, Empowerment Through Education (ETE),", " provides undergraduate scholarships to ", "developing country nationals", " to study in their home country or a neighboring country. WMF believes it is important to educate people locally and to encourage WMF Scholars to become change agents in their local communities. ", "Ideal Candidate – A student, male or female, from a country in the developing world who:", "Successfully completed a secondary education, with good to excellent grades", "Is 35 or under on March 1, 2020", "Will be studying in his or her country or another country in the developing world*", "Is pursuing his or her first bachelor’s degree or diploma", "Will be enrolled in a program of study that will benefit the community and/or contribute to the continued growth and advancement of his or her home country ", "Plans to live and work in his or her own country after graduation", "Has demonstrated his or her commitment to giving back and has volunteered prior to applying", "May have some other funds available for his or her education, but will not be able to go to pursue his or her tertiary degree without financial assistance", "WMI Scholars Program 2020", "Applications\nfrom qualified applicants will be accepted until March 1, 2020. Before\napplying, we strongly encourage you to read the ", "WMI Scholar Program Information Sheet", " and also the ", "Frequently Asked Questions for Prospective Scholars", " document. These two documents will assist you in determining your eligibility and guide you in the application process. ", "The following are required elements for an application to be considered complete:", "Clear personal photo", "Essay (topic is stated on application form)", "2020 application form", "Personal essay statement", "Two recommendation letters*", "Official transcript of grades from secondary school", "Official grading key to interpret secondary school grades**", "Official transcript of grades from tertiary studies (if applicable)", "Official grading key to interpret tertiary grades**", "Official results from your national exam", "Official grading key to interpret scores on your national exam**", "*Recommendation letters vary throughout cultures. We have created ", "Guidelines for Effective Application-Recommendation Letters", "\nto assist applicants in seeking letters that will be supportive of\ntheir application. Read this document and share it with the individuals\nwho will be writing your letters of support.", "For More Information:", "Visit the Official Webpage of the Wells Mountain Foundation Empowerment Through Education Scholarship 2020", " "], "url : https://www.opportunitiesforafricans.com/wells-mountain-foundation-empowerment-through-education-scholarship-2020/"], [["Queen Elizabeth Commonwealth Scholarships Scheme 2020/2021 for students in Commonwealth Nations (Fully Funded)", "date announced:November 21, 2019", "Application Deadline: 15 January 2020 "], ["Application Deadline: 15 January 2020 ", "A", " ", "Queen Elizabeth Commonwealth Scholarship ", "is a unique opportunity to study for a two-years Master’s degree in low or middle-income country of the Commonwealth.", "Aimed at students who are committed to creating change in their\ncommunities, the scholarships are a life-changing opportunity to\nexperience a new country and culture, to broaden horizons, and to build a\nglobal network that will last a lifetime.", "Through cultural exchange and academic collaboration, Queen Elizabeth Commonwealth Scholars help bring about positive change and find solutions to the shared challenges we face – both in their home countries and those that host them. As an active part of the Commonwealth network, scholars will help shape its future.", " The following universities will be hosting a QECS award: ", "Kwame Nkrumah University of Technology and Technology, Ghana ", "Mbarara University of Science and Technology, Uganda ", "Technical University of Kenya ", "The University of Ghana ", "University of Nairobi, Kenya – Migration Studies ", " ", "University of Mauritius ", "University of Rwanda ", "State University of Zanzibar, Tanzania ", "University of Zambia ", "For More Information:", "Visit the Official Webpage of the Queen Elizabeth Commonwealth Scholarships Scheme 2020/2021"], "url : https://www.opportunitiesforafricans.com/queen-elizabeth-commonwealth-scholarships-scheme-2020-2021/"], [["2019/2020 University of Utrecht Excellence Scholarships in Netherlands for Undergraduate and Masters Studies.", "date announced:November 19, 2019", "Application Deadline:  31 January 2020 (23:59 CET), "], ["Application Deadline:  ", "31 January 2020 (23:59 CET)", ", ", " Every year, approximately 1,500 international students come to the ", "university", " to take English-taught degree programmes and other courses. Students work and study closely together, learning to operate in an international environment from the outset. This is essential for scientists and scholars in our increasingly globalised world. ", "Eligibility Criteria", "To be eligible for an Utrecht Excellence Scholarship, the following criteria must be met:", "Belong to the top 10% of your graduating class:", " an official document issued by your university that proves you are among the top 10% of your graduating class, such as a statement signed and stamped by your University, a reference letter, a class ranking certificate, etc.", "Not hold an EU/EEA passport and not be eligible for support under the Dutch system of study grants and loans;", "Have completed your secondary school and/or Bachelor degree outside the Netherlands;", "Have applied for an international master’s programme with a start date of 1 September, 2020. Not all programmes participate, please check ", "www.uu.nl/masters", " > master’s programme > Tuition fees and financial support to see if the Utrecht Excellence Scholarship is mentioned as a scholarship opportunity;", "The international master’s programme at Utrecht University is not a Distance Learning/Online Programme;", "Be able to comply with the conditions to obtain a Dutch visa/residence permit.", "Scholarship amount", "The Utrecht Excellence scholarship can be awarded as:", "tuition fees", "\nor", "tuition fees plus 11.000 euro living expenses", "As the grant is not automatically a full scholarship, it may be\nnecessary to find additional funding to be able to finance your studies\nand stay completely. Students requiring a residence permit in the\nNetherlands must prove to the IND (Immigration and Naturalisation\nOffice) that they have sufficient financial means. Read more about the ", "budget", " the University advises.", "Number of scholarships", "20-25 scholarships will be available for 2020-2021, distributed across the 6 Graduate Schools.", "Selection criteria", "Eligible candidates are selected for a scholarship on the basis of the following criteria:", "Academic excellence and promise in the proposed field of study;", "The academic quality and results of preceding qualifications, as\nevidenced by proof of belonging to the top 10% of the class, grades,\ntest scores, a writing sample, letters of recommendation;", "The quality and relevance of the motivation letter for the Master’s\nprogramme (academic content, intercultural and communication skills,\npersonal motivation);", "The quality of the application for the Master’s programme itself (completeness, accuracy, consistency).", "How to apply", "After submitting an application for the Master’s programme,\nnon-EU/EEA students will have the option to submit an application for an\nUtrecht Excellence Scholarship ", "from", " ", "1 November", ".", "You will need to upload the following document:", "Proof of belonging to the top 10% of your graduating class:", "\nan official document issued by your university that proves you are\namong the top 10% of your graduating class, such as a statement signed\nand stamped by your University, a reference letter, a class ranking\ncertificate, etc.", "For More Information:", "Visit the Official Webpage of the 2019/2020 University of Utrecht Excellence Scholarships"], "url : https://www.opportunitiesforafricans.com/2019-2020-university-of-utrecht-excellence-scholarships/"], [["CIFAR Azrieli Global Scholars program 2020 for Early Career Researchers (Funded to Toronto, Canada & CDN $100,000 in Funding)", "date announced:December 18, 2019", "Application Deadline: February 5, 2020 – 11:59 PM Pacific Time Zone (UTC -8) "], ["Application Deadline: February 5, 2020 – 11:59 PM Pacific Time Zone (UTC -8) ", " The CIFAR Azrieli Global Scholars program", " supports exceptional early-career researchers with funding, mentorship, a global network, and professional skills development. ", "\nEach CIFAR Azrieli Global Scholar receives:", "A two-year term in a CIFAR research program, a global, interdisciplinary network of top-tier research leaders. ", "$100,000 CAD in unrestricted research support ", "Mentorship from a senior researcher within a CIFAR research program", "Opportunities to network, collaborate and form a community with peers from diverse disciplines across CIFAR’s research programs", "Specialized leadership and\ncommunication skills training, and support to put their skills into\naction, through participation in two cross-cohort annual meetings. ", "Eligibility", "Applicants may be based anywhere in the\nworld, must hold a PhD (or equivalent) and be within the first five\nyears of starting a full-time research position at an institution of\nhigher education or research. Scholars’ research interests must\ncomplement or contribute to the themes and goals of an eligible CIFAR\nresearch program. In 2020, the CIFAR research programs eligible to\naccept applications are:", "Child & Brain Development", "Learning in Machines & Brains", "Quantum Information Science", "Quantum Materials", " DURATION", "CIFAR Azrieli Global Scholars are provided research funding and participate in a CIFAR research program over a two-year term. The term will begin on July 1, 2020 and end on June 30, 2022. At the end of the term, Scholars retain the title ‘CIFAR Azrieli Global Scholar’ and are encouraged to remain connected to CIFAR through CIFAR’s Next Generation Initiatives and research programs. ", "For More Information:", "Visit the Official Webpage of the CIFAR Azrieli Global Scholars program 2020"], "url : https://www.opportunitiesforafricans.com/cifar-azrieli-global-scholars-program-2020/"], [["IFAS Call for applications 2020 : Master’s students – Doctoral students – Post-doctoral students – Senior researchers", "date announced:December 16, 2019", "Application Deadline: December 31st 2019"], ["Application Deadline: December 31st 2019", " ", "The French Institute of South Africa-Research ", "(IFAS-Research) has a regional mandate covering twelve countries in Southern Africa (Angola,Botswana, Congo, Democratic Republic of Congo,Lesotho,Malawi, Mozambique,Namibia, South Africa,Swaziland,Zambia and Zimbabwe).", " IFAS-Research promotes and supports research projects in the Humanities and Social Sciences dealing with this area.Within the framework of its research programs, IFAS-Research funds each year a number of research projects: collective projects, fieldworks, scientific events, publications. ", "Within the framework of its research programs, IFAS-Research funds\neach year a number of research projects: collective projects,\nfieldworks, scientific events, publications.", "Nationality will not be a condition for application, although the\nexistence or prospect of a long-lasting partnership between France and\nSouthern Africa is essential, particularly actual bilateral projects.", "All applications will be taken into consideration. However, priority\nwill be given to applicants whose research is in line with the research\nprograms of the Institute:", " Archaeology and Prehistory", " Heritage and Medieval, Early Modern and Contemporary History of Southern African Societies", " Contemporary Dynamics: Urban Studies, Social, Political, Economic and Cultural Transformations.", " Financial contribution from another institution is mandatory. ", " In all cases, funds allocated by IFAS-Research will be between EUR. 500-2000 according to the project (maximum EUR. 1000 for individual fieldwork). Applicants will receive replies by email during the first trimester of 2020. ", " •Migration studies, borders, xenophobia, ", "•Political mutations in Southern Africa, electoral dynamics, citizenship and its transformation, identity policies, nation-building processes,|", "•Resources, economic policy, comparative development economics, labour,", "•Education, youth, social movement,", "•Ecology and society.", "A specific interest will be shown intransregional projects,inprojects that challenge disciplinary bordersand proposals dealing with Lusophone Africa. Nevertheless, scientific excellence will remain the main criteria of selection.", "List of documents to enclose in the application:", "1.A short introduction letter from the applicant;", "2.A detailed description of the research project not exceeding 5 pages and containing the scientific project, a research agenda, institutional partnerships, indications regarding the dissemination of results", "3.A provisional budget indicating the amount of total funding, other sources of funding applied for and/orobtained, funding required from IFAS-Research (nature of expenses);", "4.The applicant’s CV(2 pages maximum);", "5.A reference letter from the research supervisor (for students);", "6.The application form filled in electronically.Selection process of applications:", "Please, send the application by email with a single .pdf document attached, containing all the enclosures (including the form and the reference letter) to Sophie Dulucq, IFAS-Research Director,at ", "[email protected]", " ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the IFAS Call for applications 2020"], "url : https://www.opportunitiesforafricans.com/ifas-call-for-applications-2020/"], [["Invest Your Talent in Italy Scholarships 2020/2021 for International students (Funded to study in Italy)", "date announced:December 19, 2019", "Application Deadline: February 27, 2020. "], ["Application Deadline: February 27, 2020. ", " Recognizing the importance of the international students as a fundamental instrument for the internationalization of the Country, the Ministry of Foreign Affairs and International Cooperation -Directorate General for Cultural and Economic Promotion and Innovation, ITA –", "Italian", " Trade Agency, and Uni-Italia,with the support of Unioncamere (Italian Chambers of Commerce), and Confindustria (Confederation of Italian Industries),will award scholarships for the academic year 2020-2021 in favor of international students interested in attending higher education courses in Italy within the framework of the “Invest Your Talent in Italy”Program.", "Scholarships are awarded for courses of Master’s degree (Laurea Magistrale or Master universitario) at Italian Higher Education Institutes (state-owned institutions or institutions legally recognized by the relevant State authorities)partners of the “Invest Your Talent in Italy”Program. The program includes the attendance of a mandatory internship at selected Italian companies which are partners of the initiative. ", " The aim of the Program is to foster cooperation among Italian Universities and Italian companies in order to promote their internationalization by sustaining higher education courses tailored to the needs of the labor market. Thanks to this Program, young foreigners, educated in Italy and properly trained in their specific fields of expertise, will have the opportunity to make a working experience at selected Italian companies, partners of the “Invest Your Talent in Italy” Program. ", " ELIGIBILITY CRITERIA", "Applications may be submitted only by those who meet the following requirements by the deadline of this call.", "Academic qualifications ", "Applications may only be submitted by those candidates referred to in Articles 1 and 2 who hold the required academic qualifications (Bachelor’s Degree) to enrolling the chosen Master’s Degree Program (Laurea Magistrale or Master Universitario).", "Candidates must have completed their Bachelor’s Degree. Students who are currently studying at an Italian university and those who have obtained an Italian University Degree are not eligible for the IYT in Italy program.", " Age requirements", "Applicants must have been born on or after January 1st 1994, except for the only renewal scholarships.", "Language skills ", " Candidates should submit an English language certificate as proof of their proficiency in English.", "Candidates should hold at least a B2 level certificate within the Common European Framework of Reference for Languages (CEFR).", "A candidate who has obtained an English-taught Bachelor’s Degree can submit a certificate issued by his/her university, stating that English is the medium of instruction in that university/course/faculty.", "This certificate can be accepted as the proof of proficiency in English.Proof of proficiency in Italian is not mandatory but it will be taken into consideration in the selection process.", " DURATION OF THE SCHOLARSHIP", "The scholarship will cover a period of study of 9 (nine) months starting fromOctober 1, 2020.", "SUBMISSION OF APPLICATIONS", "Candidates must complete and submit the on-line application formavailable at the following link: http://investyourtalentapplication.esteri.it/SitoInvestYourTalentApplication/signin.asp", "Full surname and all the given names must be included in the personal information section of the on-line application form (as stated in the candidate’s passport).", " Applications must be submitted from December 18, 2019 to February 27, 2020 until 12:00 (Midday,Italian Time).", " Candidates must provide the following documents:", "The final transcript of all previous exams as well as the final grade(Bachelor’s Degree). ", "Students who have completed their Bachelor’s studies but have not yet received their Degree Diploma -along with the final transcript of all previous exams-must also submit a document from their University certifying that they have completed their Bachelor’s program and are waiting for the Degree Diploma to be issued.", " This document must be issued through and signed by a representative of the Academic Registrar’s Office.", "•English language certificate (IELTS or TOEFL);•Italian language certificate. It is not mandatory, but if submitted, it will receive a score.A video no more than one minute long about their motivations;", "CV/Resume;", "Valid Passport.An official translation into English is required if the documents are in a language other than English, French and Spanish. ", "Both the translated documents and the original copies must be provided. ", "For More Information:", "Visit the Official Webpage of the Invest Your Talent in Italy Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/invest-your-talent-in-italy-scholarships-2020-2021/"], [["DAAD In-Country/In-Region Scholarship Programmes 2019/2020 for graduates & postgraduates from Sub-Saharan Africa", "date announced:November 22, 2019", "Application Deadline: Varying"], ["Application Deadline: Varying", " The DAAD Scholarship programme", " aims at fostering strong, internationally oriented higher education systems in Sub-Saharan Africa with the capacity to contribute to sustainable development. To this end, scholarships are granted for development-related Master or doctoral studies for individuals who plan to pursue a career in teaching and / or research at a higher education institution in Sub-Saharan Africa. ", " By training future academic and professional leaders, the programme contributes to the following long-term impacts:", "Qualified professionals’ involvement in the solution of development-related problems in Sub-Saharan Africa", "Graduates strengthening education and research in Sub-Saharan Africa", "Structural strengthening and regional networking of partner institutions and partner universities", " To achieve these long-term impacts, the following outcomes have been formulated as programme objectives: ", " Programme objective 1: Graduates have qualified to take over responsible positions in their, or for their, region of origin", " Programme objective 2: The participation of women and underprivileged groups is reinforced", " Programme objective 3: Organizational, financial and personal capacities of partner institutions are strengthened", "Requirements:", "\nAs part of the „In-Country/In-Region Scholarship Programme“ DAAD\noffers scholarships for PhD and Master studies. The programme is funded\nby the German Federal Ministry of Economic Cooperation and Development\n(BMZ) and aims at university staff in the first line, without neglecting\nthe public sector demand of academically trained personnel.\n", "Requirements:", "The target group for scholarships are ", "graduates and postgraduates from Sub-Saharan Africa", " with a first academic degree if applying for a Master’s programme, or with a Master’s degree if applying for a doctoral programme who want to pursue Master’s or PhD courses in their home country (so called In-Country scholarships) or in another Sub-Saharan African country (In-Region scholarships).", " Female applicants and candidates from less privileged regions or groups are especially encouraged to participate in the programme. ", "\nMaster and PhD studies\n", "Duration of funding", " Funding is provided for the usual duration of a course – generally, up to two years for Masters and up to three years for the PhD degree programmes ", "Value", " Generally:", "Monthly allowance", "Study and research allowance", "Printing allowance", "Tuition fees", " Only applicable for In-Region scholarship holders:", "Travel allowance", "Health insurance", "Selection", "The selection process differs between the individual degree programmes. Please see the call for applications for further information.", " Usually, the application procedure follows a two-step process. First, applicants submit their scholarship application to the host institution. After a pre-selection has been conducted, shortlisted applicants will be asked to submit their application again via the DAAD portal for the final selection. ", "\nPlease find below the list of degree programmes funded within this\nscholarship programme in the regions West and Central Africa, Eastern\nAfrica and Southern Africa, including the links to the respective calls\nfor applications. ", "West and Central Africa", "\nBenin", "University of Abomey – Calavi ", "(UAC)", "Faculty of Agronomic Sciences, Subject field: Mathematics (Master, PhD)", "\nas well as", "International Chair in Mathematical Physics and Applications ", "(CIPMA)", ", Subject fields: Natural Sciences (Master, PhD)", "\nBurkina Faso", "International Institute for Water and Environmental Engineering ", "(2iE)", ", Subject field: Engineering (Master, PhD)", "\nGhana", "University for Development Studies ", "(UDS)", ", Department of Public Health, Subject field: Medicine – Public Health (Master Phil, Master Sc)", "University of Ghana", ", Regional Institute for Population Studies (RIPS)", ", Subject field: Humanities / Political Science (Master, PhD)", "\nas well as", "West African Center for Crop Improvement ", "(WACCI)", ", University of Ghana, Subject field: Agricultural Sciences (Master, PhD)", "\nNigeria", "University of Ibadan", ", Subject fields: Engineering/Agricultural Science (Master Energy Studies, Master Fisheries Management)", "\nNetwork", "Centre d ‘Etudes Régional pour l’Amélioration de l’Adaptation à la Sécheresse ", "(CERAAS)", ", Subject field: Agricultural Sciences (Master, PhD)", "Eastern Africa", "\nEthiopia", "Addis Ababa University – IPSS", ", Subject field: Global & Area Studies (PhD)", "Hawassa University – Wondo Genet College of Forestry and Natural Resources ", "(WGCF)", ", Subject field: Agro-Forestry (Master)", "\nKenya", "Jomo Kenyatta University of Agriculture and Technology ", "(JKUAT)", ", Subject fields: Information Technology (PhD), Mechanical Engineering (PhD)", "Kenya Medical Research Institute ", "(KEMRI)", ", Subject field: Health Management (taught at Strathmore University) (PhD)", "Kenyatta University", ", Subject fields: Biotechnology (PhD)", ", Environmental Planning (PhD), Renewable Energy (Master)", "Moi University", ", Subject field: Mathematics (PhD)", "\nas well as", "East and South African-German Centre of Excellence for Educational Research Methodologies and Management ", "(CERM-ESA)", " – Moi University, Subject fields: Education (Master), Sociology of Education (PhD)", "Mount Kenya University", ", Subject fields: Medical Surgical Nursing (Master), Public Health (Master)", "Strathmore University", ", Subject fields: Computer Science/IT (PhD), Mathematics (Master, PhD)", "\nSudan", "Alzaiem Alazhari University", ", Subject field: Family Medicine (Master)", "\nTanzania", "Ardhi University", ", Subject fields: Built Environment Analysis (PhD), Housing and Settlement Studies (PhD), Urban Planning and Management (PhD)", "Tanzanian-German Centre for East African Legal Studies ", "(TGCL)", ", University of Dar es Salaam, Subject field: Law (Master)", "\nUganda", "Busitema University", ", Subject field: Public Health (Master)", "Makerere University", ", Subject fields: Environment and Natural Ressource (Master), Plant Breeding (PhD)", "\nNetworks", "African Economic Research Consortium ", "(AERC)", ", Subject field: Agriculture Economics (PhD)", "International Centre of Insect Physiology and Ecology ", "(ICIPE)", ", Subject field: Insect Science (PhD)", "Southern Africa", "\nKindly note that the programmes with DAAD scholarships offered in the\nregion of Southern Africa are currently being revised; the list will be\nupdated as soon as the final decision has been made (approximately March\n2020).", "\nMalawi", "Lilongwe University of Agriculture and Natural Resources ", "(LUANAR)", ", Subject field: Aquaculture and Fisheries Science (PhD)", "\nMauritius", "University of Mauritius", ", open to all development-related subject fields (PhD, Master full-time as well as part-time)", "\nNamibia", "Namibia University of Science and Technology (NUST), Subject fields: Computer Science (Master), Informatics (Master)", "\nSouth Africa (In-Region scholarships only; In-Country scholarships for\nSouth Africa are addressed in a separate call for applications -> ", "daad.de/go/de/stipa10000279)", "African Institute for Mathematical Sciences ", "(AIMS)", ", Subject field: Mathematical Sciences (PhD)", "African Paediatric Fellowship Programme ", "(APFP)", ", Subject field: Pediatrics, Medicine (Master)", "Centre for Human Rights ", "(CHR)", ", Subject field: Human Rights (Master, PhD)", "Rhodes University", ", Subject field: Biochemistry and Microbiology/Science (PhD)", "Stellenbosch University ", "(SUN)", ", Subject field: Economic and Management Sciences (PhD)", "University of South Africa ", "(UNISA)", ", Subject field: Nanosciences (Master, PhD)", "University of Pretoria", " – Agriculture and Environmental Studies, Subject field: Agriculture and Environmental Studies (Master, PhD)", "Others", " See also: In-Country/In-Region Scholarship Programme “Strengthening Capacities for Land Governance in Africa” ", "(SLGA)", ", further information: ", "https://www2.daad.de/deutschland/stipendium/datenbank/de/21148-stipendiendatenbank/?detail=57314592", "For More Information:", "Visit tbe Official Webpage of the DAAD In-Country/In-Region Programme Sub-Saharan Africa"], "url : https://www.opportunitiesforafricans.com/daad-in-country-in-region-scholarship-programmes-2019-2020/"], [["International Brain Research Organization African Regional Committee (IBRO-ARC) Bursaries 2020 for young African Researchers", "date announced:November 29, 2019", "Application Deadline: February 20, 2020 (11:59 p.m. CET) "], ["Application Deadline: ", "February 20, 2020 (11:59 p.m. CET)", " ", "The IBRO African Regional Committee (IBRO-ARC)", " ", "offers awards of up to €4000 each to young African researchers who have graduated with a Ph.D. or equivalent degree (in fundamental or clinical research) and who have demonstrated their ability to carry out independent research.", "Potential candidates should look for a host institution (within\nAfrica or abroad) and provide a research proposal and detailed\ninformation on how the funds will be spent. Selection criteria include\nacademic credentials of the applicant and the host, as well as the\nquality of the research proposal (complete with a structured research\nplan). The duration of such exchanges should be a ", "minimum of four weeks", ".", "Strong justification must be provided ensuring the applicant will\nreturn home after the exchange, in addition to an explanation of how the\nnewly gained knowledge and skills will be used to advance neuroscience\nresearch in their home country.", "Eligibility", "The candidate should be:", " – resident in Africa", " – 45 years or younger", " – have published significant research achievements in fundamental or clinical neuroscience", "For More Information:", "Visit the Official Webpage of the IBRO-ARC Bursaries 2020"], "url : https://www.opportunitiesforafricans.com/ibro-arc-bursaries-2020/"], [["23rd International AIDS Conference (AIDS 2020) Scholarship Programme – San Francisco & Oakland, USA (Scholarships Available to Attend)", "date announced:December 16, 2019", "Application Deadline: 15 January 2020, 23:59 Central European Time (CET). "], ["Application Deadline: 15 January 2020, 23:59 Central European Time (CET). ", " Through the Scholarship Programme, conference organizers aim to make AIDS 2020 accessible to people actively contributing to the conference programme, living with HIV, young people and those who belong to key or vulnerable populations. ", " ", "The AIDS 2020 Scholarship Programme", " will be the largest ever, aiming to support 1,600 delegates to attend the conference in San Francisco and Oakland. Conference organizers are committed to ensuring that resource-constrained settings and individuals are represented at AIDS 2020. In prioritizing the participation in the programme of groups and individuals from these settings, the conference creates pathways for the direct dissemination of scientific knowledge and best practices from the conference to local programmes and individuals in communities where it can be actively and effectively implemented. ", "Eligibility", "The\nAIDS 2020 Scholarship Programme is open to everyone with experience in\nHIV and AIDS who is at least 16 years of age by 6 July 2020. This\nprogramme provides financial assistance to help people who would\notherwise be unable to benefit from the conference.", "Only applicants who completed an individual scholarship application\nin English via our online application platform are eligible for a\nscholarship to attend AIDS 2020.", "Priority will be given to:", "Abstract presenters, workshop facilitators or Global Village and Youth Programme activity organizers whose submission has been selected", "People living with HIV (particularly women living with HIV), young people and those who belong to key or vulnerable populations and who demonstrate capacity and willingness to transfer the skills and knowledge acquired at the conference to help enhance projects in their own communities", "Applicants who did not previously receive a scholarship for an International AIDS Conference.", "An AIDS 2020 Scholarship Working Group, made up of five AIDS 2020\ncommittee members, is guiding this programme process and will help\nreview and score scholarship applications.", "A limited number of scholarships will be available to media representatives. Media scholarship applicants will be asked to provide media accreditation and supporting documents, such as samples of their work and a letter from their editor.", "Process", "The application process is entirely free.", "Scholarship applicants can request one or more of the following grants:", "Conference registration", " (includes access to all sessions and exhibitions)", "Travel", " (pre-paid airfare at the lowest fare available, from the nearest international airport and for the conference dates only)", "Accommodation", " (shared room in a budget hotel for the conference dates only)", "Modest daily ", "living allowance", " during the conference (6-10 July 2020).", "Attention: ", "Only a limited number of scholarships is available, and partial scholarships may also be given. Applicants are therefore strongly encouraged to also seek other/additional funding.", "Timeline", "Applications will be accepted through an online platform until 15 January 2020, 23:59 Central European Time (CET).", "We highly recommend that you investigate and start immigration\nprocedures well in advance of scholarship notifications. Read more on\nour ", "visa webpage", ".", "All applicants will be notified in early April 2020.", "For More Information:", "Visit the Official Webpage of the AIDS 2020 Scholarship Programme"], "url : https://www.opportunitiesforafricans.com/23rd-international-aids-conference-aids-2020-scholarship-programme/"], [["FirstRand International Postgraduate Scholarships 2020 for young South Africans", "date announced:December 17, 2019", "Application Deadline: February 20th 2020"], ["Application Deadline: February 20th 2020", "There are five scholarships available to South African citizens, all of which are for international postgraduate study. These are: ", "FirstRand Laurie Dippenaar scholarship;", "FirstRand Foundation scholarship;", "FirstRand Oxford African Studies scholarship to the University of Oxford;", "FirstRand FNB Fund Oxford education scholarship; and", "FirstRand FNB Fund scholarship for international postgraduate study in education.", " Applications, including all attachments and reference letters, must be completed online and applicants must have applied directly to the university of their choice by the time the application is submitted. ", "Criteria", "\nThe successful candidates will have excelled academically in their chosen field and will have\nbeen\nable to demonstrate:\n", "leadership qualities;", "strength of character;", "community involvement; and", "the potential to be a destiny changer in his or her chosen field.", "\ncandidates who are currently, or have been studying overseas, will not be considered for\nthis scholarship; and.\n", "\nsuccessful candidates are required to return to South Africa for at least five years after\ncompleting their studies.\n", "Process", "\nConfirmation of each received application will be emailed to the applicant upon receipt of his\nor her application.\n", "\nAll applications are evaluated by at least three preliminary evaluators from FirstRand, FNB,\nRMB, TSI and previous winners of the scholarship. A long list of around 40 applicants is then\ndrawn up and interviewed in person in Cape Town or Sandton.\n", " Four shortlisted candidates are selected for the two education scholarships and should be available for final interviews held in Sandton on Wednesday 17 April 2020. ", "Ten shortlisted candidates are selected for the FirstRand Laurie Dippenaar and ", "FirstRand Foundation international postgraduate scholarships", " and the FirstRand Oxford African Studies scholarship and should be available for final interviews held in Sandton on Tuesday 21 April 2020. ", "A final announcement will be made before the end of June 2020.", " Email queries can be sent for attention Beth van Heerden at ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the FirstRand International Postgraduate Scholarships 2020 "], "url : https://www.opportunitiesforafricans.com/firstrand-international-postgraduate-scholarships-2020/"], [["Tanzanian-German Centre for Eastern African Legal Studies (LLM) Scholarships 2020/2021 for East African Lawyers (Funded)", "date announced:November 27, 2019", "Application Deadline: 31 January 2020 "], ["Application Deadline: 31 January 2020 ", " The Tanzanian-German Centre for Eastern African Legal Studies", " (TGCL", ") is a cooperation projectof the University of Dar es Salaam, Tanzania,and the University of Bayreuth,Germany. It is funded by the German Federal Foreign Office through the German Academic Exchange Service (DAAD). The TGCL offers a structured LLM study programme at the University of Dar es Salaam School of Law and trains aspiring young East African lawyers, qualifying them for leading positions in the regionand beyond. ", " Application Requirements", " TGCL invites applications from candidates from the East African Community Partner States (i.e. Burundi, Kenya, Rwanda, South Sudan, Tanzania and Uganda) for LLM studies starting on 1 November 2020.", "The minimum requirement for admission to the LLM programme is a Bachelor’s degree in law (LLB) with a minimum GPA of 3.0 or its equivalent from a recognised higher learning institution. ", "The language of instruction at the University of Dar es Salaam School of Law is English. Those who are not conversant with it should not apply. ", "Candidates who have received theirlast University degree more than six years a goat the time of the application can be admitted as self-paying students but do not qualify for scholarships ", " Content of the Programme ", "The candidates will pursue an LLM programme on East African Community Law and Regional Integration Law. The programme takes one yearof full-time attendance. On successful completion of the programme, a student will obtain a Master ofLawsdegree from the University of Dar es Salaam and an additional TGCL Certificate. ", " Research Agenda of the TGCL ", "There is a significant research component to the LLM programme in the form of a dissertation. ", "All LLM dissertations must focus on selected aspects of East African Community law (EAC law), if possible in relation to the student’s national law. ", " Scholarships", "The TGCL will award scholarships to applicants from EAC Partner States only,which will cover: ", "•the tuition fees for the LLM programme at the TGCL", "•a cost of living stipend of 2,880 EUR for one year", "•an accommodation subsidy of 360 EUR for one year", "•a reasonable health insurance for one year", "•a research allowance lump-sum of 460 EUR ", " Mode of Application", " The applicant must register online through the TGCL website,using the online application form provided, and submit the following documents electronically: •asigned curriculum vitae(please use the Europass CV template,http://europass.cedefop.europa.eu)", "•a one-page letter of motivation", "•all relevant certificates(birth certificate, secondary education academic certificates, academic transcripts, certificates of legal or other professional education(or provisional results for applicants who are in the final year of their LLB studies); in the case of documents not written in English,an official translation should be attached.", "•a recent passport size photo", "•the data page of the passport or any other proof of identity", "•a letter of recommendation by a University teacher ", " a release letter from your employer (if you are employed) ", "•a proposal of the intended research(please see the annexed guidelines) ", "For More Information:", "Visit the Official Webpage of the Tanzanian-German Centre for Eastern African Legal Studies (LLM) Scholarships 2020/2021 "], "url : https://www.opportunitiesforafricans.com/tanzanian-german-centre-for-eastern-african-legal-studies-llm-scholarships-2020-2021/"], [["Ghent University Doctoral Scholarships 2020 for Candidates from Developing Countries to study in Belgium (Funded)", "date announced:November 25, 2019", "Application Deadline: 4 February 2020 "], ["Application Deadline: ", "4 February 2020", " ", " With support from its ", "“", "Special Research Fund”", " (BOF), Ghent University grants ", "PhD scholarships", " to promising PhD students from developing countries who wish to carry out ", "half of their PhD research at Ghent University and half in a university in a developing country.", " ", "Duration and start date of the scholarship:", "The", " earliest starting date", " of the scholarship at Ghent University is ", "1 October 2020", ";", "The candidate obtains a scholarship for ", "24 months to study at Ghent university (North)", ";", "24 months", " of the PhD research/study must be ", "cofinanced ", "at the partner ", "university in the South", ";", "Students are obliged to divide the Ghent University scholarship into minimum ", "2 different research stays", " in Ghent (North) and need to return at least ", "once to their home university (South) ", " in between (= ", "‘sandwich- schedule’", ");", "The following ", "mobility scheme is mandatory", ":", "Students need to ", "start and end", " with a ", "research stay of minimum 3 up to maximum 12 months in Ghent.", "The", " first research stay in Ghent ", "needs to", " start", " between", " 1 October 2020 and 28 February 2021.", "At least ", "24 months", " of locally funded ", "research stay in the South must be scheduled in between the first and last research stay in Ghent.", "The average duration of PhD studies in Belgium (Ghent University) is 4 years. ", "Requirements:", "The proposals must be ", "jointly", " submitted by a ", "candidate, a promoter (supervisor) at Ghent University and a supervisor at the partner university.", "No restrictions are imposed on the field of research, nevertheless  preference will be given to topics that are", " relevant for development", "\nDevelopment relevance relates to the extent to\nwhich the proposals’ objectives are consistent with beneficiaries’\nrequirements, country needs, synergy opportunities, global priorities\nand partners’ and donors’ policies.\n", "Candidates", " need to come from – and have the ", "nationality", " of – a ", "developing country", " (see country list);", "There must be a ", "guarantee that the candidate will be able to\nwork fulltime on the PhD project for a period of 24 months at the\npartner university", " ", "in a selected developing country (South)", ". This implies that the following conditions needs to be fulfilled:", "there must be a ", "local PhD supervisor", " at the partner university or research center in the South;", "A ", "written statement", " is requested stating that the candidate will be/is either a funded ", "fulltime PhD student or a staff member", " at this partner university", "and will be ", "sufficiently exempted", "\nfrom teaching or other assignments as to be able to fully concentrate\non the PhD research in the South. Applicants can dedicate maximum 10 %\nof their time (fulltime appointment) to other tasks (teaching and other\ntasks)", "This statement should also mention that the ", "candidate receives a local PhD scholarship or salary for a period of 24 months", " when working on the PhD at the partner university in the South.", "This cofunding is only open for students who intend to obtain a ", "(joint ) PhD degree at Ghent University", "How to apply for this scholarship", "Applications must be submitted on the application forms provided for this purpose.", "The Research Council makes a selection of the applications based in\npart on the recommendations obtained from members of the Council for\nDevelopment Cooperation.", "Selection criteria:", "Please note that this call is highly competitive. The success\nrate for this call is 19% (based on the results of the previous calls\n2017-2019). The first selection criterion in this call are the study\nresults of the candidate (both Bachelor and Master Level).", "the qualifications of the applicant;", "the doctoral project;", "the relevance of the research topic for development & capacity building", "the scientific/scholarly potential of the promoter’s research\ngroup(s); the partnership between Ghent University and the local\ninstitute; the scientific/scholarly potential of the local institute.", "Scholarship funding", "PhD scholarship", " at Ghent University  (", "24 months", ").", "24 months of PhD research will be executed at the partner university in the South", ", for which ", "no", " funding is provided", " through this scholarship.", "\nThis part of the research (24 months) must be funded (e.g. local PhD\nscholarship or salary) at the partner institution in the South.", "\nThe ", "Ghent University promoter", " receives a ", "bench fee of €310/per month of research in Ghent + €8000 travel budget", "\nto cover (part of) the operational costs, as well as part of the\ntravelling costs of the student and both the Ghent University and the\nlocal promoter.\n", "For More Information:", "Visit the Official Webpage of the Ghent University Doctoral Scholarships 2020 "], "url : https://www.opportunitiesforafricans.com/ghent-university-doctoral-scholarships-2020/"], [["VLIR-UOS Oceans & Lakes Masters Scholarship Programme 2020/2021 for study in Belgium", "date announced:November 22, 2019", "Application Deadline: February 1st 2020"], ["Application Deadline: February 1st 2020", " The 2-year master programme in “Master of Science in Marine and Lacustrine Science and Management” (Oceans & Lakes) addresses students with a background in Sciences.", " Oceans & Lakes is an ", "inter-university", " programme organized by the Faculty of Sciences of ", "Vrije Universiteit Brussel", " (VUB, Free University of Brussels), ", "Universiteit Antwerpen", " (UAntwerpen, Antwerp University) and ", "Universiteit Gent", " (UGent, Ghent University). The students are provided with a strong ", "fundamental and applied", " knowledge and prepared for an ", "active role", " in the scientific research and management of marine and lacustrine systems. ", "The programme adopts a ", "multidisciplinary", " approach\nintegrating physical, chemical geological, ecological and societal\naspects and including nature conservation and sustainable development.", "Opportunities offered by Oceans & Lakes", "– A ", "wide spectrum of ", "disciplines", " related to marine and lacustrine science and management are covered.", "– Since admission is allowed to ", "various science related bachelor degrees", ", it may offer a unique opportunity to re-orientate your study career.", "– All classes are ", "expertise", "-based ", "as guaranteed by the large numbers of renowned research groups related to the programme.", "– A ", "wide spectrum of", "thesis subjects ", "will\nbe offered by the various research groups associated with the programme\nincluding the NIOZ and UCL (associated as visiting professors).", "– You study together with students from all continents providing the ", "global", " context ", "of future marine and lacustrine research and management.", "– The ", "highest standard ", "of education and research", " is guaranteed by the three universities.", "– Classes are organized at all ", "three universities ", "in an efficient way to ", "minimize travelling and maximize acquaintance", " with existing facilities, research groups and infrastructure.", "– Strong focus on ", "practical and field ", "work", ".", "For More Information:", "Visit the Official Webpage of the VLIR-UOS Oceans & Lakes Masters Scholarship Programme 2020/2021 "], "url : https://www.opportunitiesforafricans.com/vlir-uos-oceans-lakes-masters-scholarship-programme-2020-2021/"], [["ICTP Postgraduate Diploma Scholarship Programme 2020/2021 for young physicists and mathematicians for Developing Countries", "date announced:December 19, 2019", "Application Deadline:  29 February 2020, "], ["Application Deadline: ", " 29 February 2020,", " ", "ICTP is ", "now accepting applications", " from young physicists and mathematicians for the 2020-2021 class of the ", "Postgraduate Diploma Programme", ".\nThe one year course of study prepares talented students for PhD\nstudies, as part of the Centre’s efforts to promote advanced scientific\nresearch in developing countries. Each successful class of Postgraduate\nDiploma students helps bring this dream to life.", "Students have gone on to PhD programmes all over the world, launching\nthem into successful scientific careers. Two semesters of classes are\nfollowed by a research project and dissertation. Interested students can\napply to study in one of five subject areas:", "High Energy, Cosmology and Astroparticle Physics", "Condensed Matter Physics", "Earth System Physics", "Mathematics", "Quantitative Life Sciences ", "The deadline to apply is 29 February 2020, and you can ", "apply online", ".", " ", "The Programme is open to young (generally below 28 years of age) qualified graduates, with a degree equivilent to an MSc in physics, mathematics, or in a related field, and fluency in English. In each Postgraduate Diploma Programme subject area, scholarships and travel grants will be awarded to those 10 students selected from developing countries. There are no course fees.", "For More Information:", "Visit the Official Webpage of the ICTP Postgraduate Diploma Scholarship Programme 2020/2021"], "url : https://www.opportunitiesforafricans.com/ictp-postgraduate-diploma-scholarship-programme-2020-2021/"], [["Islamic Development Bank (IsDB) Undergraduate, Masters & PhD Scholarship Programme 2020/2021 (Fully Funded)", "date announced:December 20, 2019", "Application Deadline: February 28th, 2020. "], ["Application Deadline: ", "February 28", "th", ", 2020.", " ", " The Call for New Applications for the", " IsDB Scholarship Programmes f", "or the Year 2020-2021 is Now Open.", "Recognizing the importance of qualified human resources for social\nadvancement and sustainable development, the IsDB has been addressing\nhuman resources development in member countries alongside its\ndevelopment financing activities. ", "The IsDB has been funding the following Scholarship Programmes for\ncitizens from IsDB member countries and Muslim communities worldwide:", "Undergraduate Programme ", "Master’s Programme", "PhD Programme and Post-doctoral Research Programme", "IsDB-ISFD for Vocational Education & Training (VET)", "Bachelor studies for the IsDB 21 Least Developed Member Countries (LDMCs)", "Undergraduate Scholarship Programme", "The Programme was launched with the objective to provide educational opportunities to academically meritorious young students from Member Countries and Muslim communities in non-member countries to pursue undergraduate or first-degree study at a public/government university and to train them in specific fields to empower communities to support the achievement of the Sustainable Development Goals (SDGs) and the Presidency 5-Year Plan (P5P).", "Eligibility Criteria", "The Programme is open for academically meritorious students with\nstrong desire to engage in social services and community development\nafter graduation.  The prospective candidates must meet the following\neligibility criteria:", "Citizens of any of the IsDB member countries or Muslim communities in non-member countries;", "Completed high school with minimum good grades in major subjects ", "or", " currently studying in first year at one of the top public/government universities in their own countries or in member countries having agreement with the IsDB (Malaysia, Morocco and Turkey);", "Not in receipt of any other scholarship; and ", "Be medically fit and willing to undergo medical tests after selection.", "Master Scholarship Programme", "Eligibility Criteria", "The Programme is open for academically meritorious students and\nmid-career professionals from member countries and Muslim Communities in\nnon-member countries who meet the following eligibility criteria:", "Citizens of any of the IsDB member countries or Muslim communities in non-member countries;", "Be a graduate with a grade above “Good” in his/her bachelor studies.", "Not in receipt of any other scholarship; and ", "Be medically fit and willing to undergo medical tests after selection.", "B", "enefits and facilities", "The programme covers the following items:", "Monthly stipend commensurate with the cost of living of the country of study;", "Tuition fees, if any, subject to IsDB’s approval;", "Cost of medical treatment at university/government hospital; ", "Economy class return air tickets (once at the time of joining and on completion of study) and installation and equipment allowance for the students selected to study abroad at partnered universities/countries; and", "Thesis preparation Allowance.", "PhD and Post-Doctoral Research Programme", " The Programme was launched with the objective to produce technically qualified human resources in the IsDB member countries and Muslim Communities in non-member countries by providing scholarships to promising and outstanding scholars and researchers to undertake PhD studies and Post-Doctoral research in development related fields with a special focus on “", "Sustainability Science”", " and to achieve Sustainable Development Goals (SDGs) and the Presidency 5-Year Plan (P5P). ", "Eligibility Criteria", "The Programme is designed to help promising and outstanding scholars\nfrom member countries and Muslim communities in non-member countries who\nmeet the following criteria:", "1. PhD study", "Have Master’s degree in one of the fields of study of the programme.", "Have minimum (“Very Good”) academic standing;", "Preferably have work and/or research experience.", "Have a research proposal in one of the fields of study of the\nprogramme stating its scientific and development relevance to the\ncommunity / country.", "Be medically fit and be willing to undergo medical tests after selection.", "2. Post-doctoral research", "Have PhD degree in one of approved fields of the programme.", "Have minimum (“Very Good”) academic standing.", "Have not less than two (2) years of experience in the field of research. ", "Must have a record of publications/research in the same field.", "Have a research proposal in one of the fields of study of the\nprogramme stating its scientific and development relevance to the\ncommunity / country.", "Be medically fit and be willing to undergo medical tests after selection", "Benefits and Facilities", "PhD study", "The programme covers the following items:", "Monthly stipend commensurate with the cost of living of the country of study;", "Tuition fees, if any, subject to IsDB’s approval;", "Cost of medical treatment at university/government hospital.", "Economy class return air tickets (once at the time of joining and on\ncompletion of study) and installation and equipment allowance for the\nstudents selected to study abroad at partnered universities/countries.", "Thesis preparation allowance ", "Scientific papers’ preparation allowance ", "Post-doctoral research", "The programme covers the following items:", "Monthly stipend commensurate with the cost of living of the country of study;", "Cost of medical treatment at university/government hospital.", "Economy class return air tickets (once at the time of joining and on\ncompletion of study) and installation and equipment allowance for the\nstudents selected to study abroad at partnered universities/countries.", "Scientific papers’ preparation allowance ", "For More Information:", "Visit the Official Webpage of the IsDB Undergraduate, Masters & PhD Scholarship Programme 2020/2021 "], "url : https://www.opportunitiesforafricans.com/isdb-undergraduate-masters-phd-scholarship-programme-2020-2021/"], [["Petroleum Technology Development Fund (PTDF) 2020/2021 Overseas Postgraduate (Masters & PhD) Scholarship Scheme for study in France,Germany,China & Malaysia", "date announced:December 5, 2019", "2020/2021 OVERSEAS POSTGRADUATE SCHOLARSHIP SCHEME UNDER PTDF STRATEGIC PARTNERSHIPS IN FRANCE, GERMANY, CHINA & MALAYSIA"], ["2020/2021 OVERSEAS POSTGRADUATE SCHOLARSHIP SCHEME UNDER PTDF STRATEGIC PARTNERSHIPS IN FRANCE, GERMANY, CHINA & MALAYSIA", "Application Process", "Application Forms can be obtained on the scholarship portal (", "scholarship.ptdf.gov.ng", ").", "Selection Process, Criteria & Requirements", "PTDF scholarships are highly competitive and only applicants who are\noutstanding across board are selected. A selection committee will be\nconstituted to assess applications using the following criteria;", "Academic merit as evidenced by quality of degrees, full academic\ntranscripts, other professional qualifications acquired, and relevant\npublications to be referenced by applicants", "Membership of professional bodies", "The viability of the study/research plan ", "(PhD Applicants only).", "Applicants are required to make a case for their scholarship by\nsubmitting a statement of purpose (maximum 500 words) stating the\nreason(s) they want to undertake the study, the relevance of the\nproposed study to the oil & gas industry and its expected impact on\nnational development ", "(MSc Applicants only).", "Requirements", "MSc", "A minimum of Second Class Upper (2.1) qualification in their first degree or a Second Class Lower (2.2) with relevant industry experience", "Must have completed the mandatory National Youth Service (NYSC)", "Must be computer literate", "Possession of 5 O/level credits including English Language.", "PhD ", "Must have completed the mandatory National Youth Service (NYSC)", "Must be computer literate", "A minimum of Second Class Lower (2.2) in their first degree and a good second-degree certificate;", "Must submit a research proposal relevant to the oil and gas industry\n(of not more than 5 pages) to include: Topic, introduction, objective,\nmethodology and mode of data collection (sample template of the proposal\nis available on the scholarship portal (", "scholarship.ptdf.gov.ng", ");", "Applicants must also include their master’s degree project", "Required Documents ", "Applicants are advised to scan copies of the following documents and attach to their online application forms:", "First Degree Certificate or Statement of Result", "NYSC discharge certificate", "WAEC/GCE/SSCE/NECO results as well as the PIN numbers on the\napplication forms to enable PTDF view the O’level results on the\nrelevant website).", "Recent Passport Photograph", "Local Government Identification Letter", "Master’s Degree Certificate ", "(PhD Applicants only)", "Evidence of membership of professional associations", "NOTE:", "Applicants must have a National Identity Number (NIN) before\napplying for the scholarship. Applicants are also expected to upload a\nNIN Verification Report before completing the application. The report\ncan be obtained from ", "www.verifyme.ng", " ", "(charges may apply)", ".", "Ongoing PhD Applicants could only apply provided their Universities are among the PTDF Partnership Universities as listed above;", "Applicants who have benefitted from any of the PTDF scholarships in\nthe past cannot apply for the same category of degree, except a higher\ndegree;", "Applicants who are in possession of a higher degree cannot apply for the same type of degree;", "Applicants interested in German Institutions should choose Abuja as their preferred interview location;", "Applicants who are beneficiaries of any other scholarship need not apply;", "Applicants who successfully scale through the first round of\nscreening will be requested to submit their transcripts; all applicants\nare therefore advised to prepare their transcripts for submission in\nanticipation of such a request.", "For More Information:", "Visit the Official Webpage of the 2020/2021 PTDF Overseas Postgraduate Scholarships"], "url : https://www.opportunitiesforafricans.com/ptdf-2020-2021-overseas-postgraduate-msc-phd-scholarship-scheme/"], [["Swedish Institute Study Scholarships (SISS) 2020/2021 for South African Citizens (Fully Funded to Sweden)", "date announced:December 12, 2019", "Application Deadline: 20 February 2020"], ["Application Deadline: 20 February 2020", " Are you a talented and ambitious citizen of South Africa and want to study for a master’s degree in Sweden on a fully-funded scholarship? Find out if you can apply to the ", "Swedish Institute Scholarships for South Africa. ", "The Swedish Institute Scholarships for South Africa (SISSA) programme is part of the Swedish government’s international awards scheme aimed at developing global leaders who will contribute to ", "the United Nations 2030 Agenda for Sustainable Development", ". It is funded by the Ministry for Foreign Affairs of Sweden and administered by the Swedish Institute (SI). ", "The programme offers a unique opportunity for future leaders to develop professionally and academically, to experience Swedish society and culture, and to build a long-lasting relationship with Sweden and with each other. SISSA is a special initiative in connection with the Binational Commission agreement between Sweden and South Africa.", " Up to 10 scholarships will be awarded to South African citizens attending master’s degree studies starting in the autumn semester 2020. ", "Requirements:", "Criteria", " Country of citizenship ", "Only citizens of South Africa are eligible for SISSA.", "Read more about country of citizenship", " ", "Master’s programmes ", "The master’s studies must be eligible for SI scholarships. We give greatest priority to certain subject areas.", "Read more about the eligible master’s programmes", " ", " University admissions ", "You must be liable to pay\ntuition fees to Swedish universities, followed the steps of university\nadmission, and be admitted to one of the eligible master’s programmes by\n3 April 2020.", "Read more about our criteria regarding University Admissions", "\nOther eligibility criteria\n", "There are also conditions regarding dual citizenships, previous residence and studies in Sweden, and more.", "Read more about other eligibility criteria", "Priority will be given to applicants who", "have completed bachelor’s with honours or equivalent from a South African university,", "have demonstrated work and leadership experience, and", "choosing study programmes with an emphasis on one of the following\nsubject areas (listed in alphabetical order, no priority or ranking is\nimplied):", "Computer science and IT", "Design (industrial design, architecture, urban/regional planning)", "Engineering", "Environmental technology/Sustainable development", "Gender studies", "Nanotechnology", "Public health", "Benefits:", "The scholarship covers", "Tuition fees: pay directly to the Swedish university by SI", "Living expenses of SEK 10,000/month", "Travel grant of SEK 15,000 *", "Insurance against illness and accident", "Membership of ", "the SI Network for Future Global Leaders (NFGL)", " – a platform to help you grow professionally and build your network and experience, while in Sweden", "Membership of ", "the SI Alumni Network", " after your scholarship period – a platform for continued networking and further professional development", "Scholarship period", "The scholarship is intended for full-time one-year or two-year\nmaster’s programmes, and is only awarded for programmes starting in the\nautumn semester. The tuition fee will be paid directly to the Swedish\nuniversities in the beginning of each semester. The stipend for living\nexpenses is paid monthly during the scholarship period.", "The scholarship period cannot be changed or extended beyond the\nawarded scholarship period, nor can the scholarship be transferred to a\nstudy programme other than the awarded master’s programme.", "For More Information:", "Visit the Official Webpage of the Swedish Institute Study Scholarships (SISS) 2020/2021 "], "url : https://www.opportunitiesforafricans.com/swedish-institute-study-scholarships-siss-2020-2021/"], [["International Journalists‘ Programmes (IJP) Southern African Journalists’ Bursary Programme 2020 in Germany (3.000 Euro Stipend)", "date announced:November 19, 2019", "Application Deadline: February 15th, 2020 "], ["Application Deadline: February 15th, 2020 ", "International Journalists’ Programmes (IJP)", " ", "offer a bursary to up to six young Southern African (SADC-Member States: Angola, Botswana, Democratic Republic of Congo, Lesotho, Madagascar, Malawi, Mauritius, Mozambique, Namibia, South Africa, Swaziland, United Republic of Tanzania, Zambia and Zimbabwe + Kenia) and up to five young German journalists. For two months the Southern African delegates will have the chance to work in Germany. They will be integrated into the day-to-day journalism of their host newsroom while also researching stories for their home media. ", " It is assumed that all candidates have a strong command of the\nEnglish language. German language abilities are an advantage but are not\nmandatory.\n", " The Southern African-German Journalists’ Programme is a multiyear\neffort to shape an integrated understanding of the other country and\nregion and to foster relations between Africa and Germany. It has been\noffered as a response to concerns about an increasing political and\ncultural detachment between Africa and Europe. The bursary is intended\nto enable young journalists to gain valuable insights into the\npolitical, economical, cultural as well as the social fabric of the host\ncountry.\n", " The bursary is named in honour of the former Federal President Horst Köhler and his exemplary dedication to the intensification of German-African relations.", "Requirements", " For all selected IJP fellows the programme starts with an introductory conference for all delegates. This will allow the participants from Southern Africa to familiarise themselves with the host country. ", "After that they will work for several weeks with media houses before going out to undertake individual research within Germany. ", "Applicants are asked to submit their preferences for the newspaper, radio or TV station or news agency they would like to work with. The possible location will be chosen by the IJP organisers in dialogue with each delegate. It is expected that former and new participants assist one another with regard to accommodation and contacts. ", "Benefits:", " The Southern African delegates receive a fixed payment of 3,000 Euro. This is expected to cover most of their travel, accommodation and living expenses. No further payments will be made: delegates are expected to use their own funds for any further costs. Payment for their work with the host media is not envisaged. To receive the full grant participants are obliged to write a report of at least three pages and provide copies of their published journalistic work after returning home. ", "Application Procedure:", "All\njournalists from Southern Africa (SADC Member States and Kenia) between\nthe age of 25 and 40 who regularly work for a media organisation can\napply.\n", "1. Enclose a CV with a passport photograph.", "2. Write a 800 word essay addressing the following topics: ", "Why you would like to work in Germany", "What you expect from IJP and what you think you can contribute to it?", "What are the 3 research topics you want to pursue during the fellowship? ", "What role you expect to play at your home media in the future?", "How you will spend the bursary?", "3. Include\na one-page resume detailing your education and work experience, your\nstandard of German and English (copies of certificates/ e.g. Goethe\nInstitut/Toefel), plus 2 copies of articles written by you (TV and radio\njournalists must type up their reports since no audio or video tapes\ncan be considered)\n", "4. A journalistic\nreference from your editor or head of department is required\n(freelancers should submit a reference from a senior journalist). It\nshould also guarantee your leave of absence for the duration of the\nprogram.\n", "Applicants are asked to send the application\ndocuments (E-Mail) not before December 15th, 2019 and until February\n15th, 2020 to the following address:\n", "[email protected]", "[email protected]", "For More Information:", "Visit the Official Webpage of the IJP Southern African Journalists’ Bursary Programme 2020"], "url : https://www.opportunitiesforafricans.com/international-journalijp-southern-african-journalists-bursary-programme-2020/"], [["DAAD University of Ghana Masters & PhD Scholarships 2020/2021 for young Africans", "date announced:December 10, 2019", "Application Deadline: 7th February 2020. "], ["Application Deadline: 7th February 2020. ", "The Regional Institute for Population Studies (RIPS) at the University of Ghana", " is accepting applications for the award of the 2020/2021 German Academic Exchange Service (DAAD) Scholarships to pursue Master of Arts (MA) and Doctor of Philosophy (PhD) degrees in Population Studies at RIPS.", "RIPS is an important institution in Anglophone Africa for the training of population scientists and generation of high-quality research in population and related disciplines in order to provide solutions for solving development challenges in Ghana and beyond.", " The DAAD scholarship will cover tuition, stipends and accommodation for one-year Master of Arts (MA) and four-year Doctor of Philosophy (PhD) students.", "Eligibility-MA", "Applicants must have successfully completed generally a three-year/four-year university degreeand obtained above average results (minimum of second class upper division)", "• clearly show motivation and strong commitment", "• have thorough knowledge of the language of instruction", "• have completed their last university degree not more than 6 years ago atthe time of application", "• must be nationals or permanent resident of a Sub-Sahara African country", "• should generally be a staff member of a public university, ", "b) candidateconsidered for teaching or research staff recruitment, c) from the publicsector", " Applicants must be nationals or permanent residents of a West African country(Inclusive Cameroon).", "Documents to be submitted to RIPS:", "-Undergraduate Certificate-Undergraduate Transcript", "-One-page motivation statement-TOEFLscore (70 and above) or IELTS score (6.0 and above)not more than two years at the time of application (if applying as national or permanent resident of Francophone/Lusophone country)", "Email the filled application form with scanned copies of required documents to ", "[email protected]", " ", "[email protected]", " ", " Eligibility -PhD", "Applicants must have successfully completed a Master’s degree with a minimum GPA of 3.0to qualify for the PhD programme. ", "• clearly show motivation and strong commitment", "• have thorough knowledge of the language of instruction", "• have completed their last university degree not more than 6 years ago atthe time of application", "• must be nationals or permanent resident of a Sub-Sahara African country", "• should generally be ", "a) staff member of a public university, ", "b) candidate considered for teaching or research staff recruitment, ", "c) from the public sector ", "Applicants must be nationals or permanent residents of a West African country(Inclusive Cameroon). ", " Documents to be submitted to RIPS:", "-Graduate and Undergraduate Certificates-Graduate and Undergraduate Transcripts-One-page motivation statement -Research proposal (this must include a research background, proposed research objective(s)/question(s) and methods sections) (3-page maximum, 1.5 line spaced minimum)", "-Master’s degree obtained with a Master’s dissertation/thesis written in English (if applying as national or permanent resident of Francophone/Lusophone country) OR TOEFL score (70 and above) or IELTS score (6.0 and above)not more than two years at the time of application (if applying as national or permanent resident of Francophone/Lusophone country)", "Email the filled application form with scanned copiesof required documents to ", "[email protected]", " ", "[email protected]", "Female applicants and candidates from less privileged regions or groups are especially encouraged to participate in the programme. Women and people working in population-related sectors are encouraged to apply. ", " The duration", "• PhD programme is generally four years", "• Master programme is generally one year", "PLEASEFINDHERETHELINKTOTHEFORMFORTHEAPPLICATIONTOTHEDAADSCHOLARSHIPhttp://bit.ly/DAAD_SCHOLARSHIP_FORM", "Application process", "The application process contains two steps. Please be aware of the twoapplication deadlines. ", " First step:", "Applicants must apply for their studies at Regional Institute for Population Studies,University of Ghana. Please take note of deadlines below:", "1.Candidate’s application submitted to RIPS for shortlisting by January 10th, 20202. Shortlisted candidates to be notified about status by January 17th, 20203.", "Shortlisted candidates to submit their applications via DAAD portal by February 7th, 2020", "4.Scholarship awardees to receive notification by April/May 20205.", "All shortlisted candidates are to apply to the University of Ghana for admissions when admissions open. Please check the University of Ghana website for more information at www.ug.edu.gh", "Regional Institute for Population Studies, University of Ghana will screen, preselect (according to DAAD selection criteria) and short-list the applicants. DAAD reserves the right of final selection.", "Second step:", "Regional Institute for Population Studies, University of Ghana will provide the shortlisted candidates with the link to the DAAD-Portal. Only the pre-selected candidates will be asked to log into the DAAD portal,register themselves and submit aDAAD application.", " DAAD Deadline: 7th February 2020. ", " Documents to be uploaded on DAAD platform:", "• DAAD application form duly filled in (available in the DAAD-Portal)", "• Hand signed curriculum vitae (please use the European specimen form at http://europass.cedefop. Europa.eu), including a list of publications (if applicable).", "• Recommendation letter by university teachers (Master 1, PhD 2)", "• Letter of admission for the host university / institution / network", "• Certified copies of university degree certificates including transcripts", "• Letter of motivation (if applicable: mentioning the planned research stay in Germany, see “Additional benefits”)", "• Copy of applicant’s passport ", "For More Information:", "Visit the Official Webpage of the DAAD University of Ghana Masters & PhD Scholarships 2020/2021"], "url : https://www.opportunitiesforafricans.com/daad-university-of-ghana-masters-phd-scholarships-2020-2021/"], [["British Academy Global Professorships 2020 Program for outstanding overseas scholars to work & collaborate in the UK (£750,000 per awardee)", "date announced:November 29, 2019", "Application Deadline:  17.00 (UK time) on Wednesday 19 February 2020. "], ["Application Deadline:  ", "17.00 (UK time) on Wednesday 19 February 2020.", " ", "Funded by the UK’s Department for Business, Energy and Industrial Strategy (through the ", "National Productivity Investment Fund)", "This ", "programme ", "provides mid-career to senior scholars in any discipline within the humanities and social sciences, who are currently employed outside the United Kingdom, with the opportunity to be based for four years in the UK and make a contribution to UK research and higher education.", "Each appointment is intended to be a complete project in itself and is expected to involve a specific research focus, although the British Academy does not have a preferred model for the balance of time to be spent between research and teaching (which may vary over the course of the award and will depend on the UK host institution’s needs).", "The Global Professorships are expected to add significant value to\nthe UK host institutions and vice versa, and thus the projects must be\nsignificant, leading to novel and innovative collaborations. With the\nGlobal Professorships, the Academy is looking to support academics that\nare proposing ambitious, beyond the state-of-the-art applications that\nbreak new ground. The Academy views the Global Professorships as an\nopportunity to apply to undertake high-risk, curiosity-driven research\nin the humanities and social sciences that enables the award-holders and\ntheir UK host institutions to achieve a step change in their respective\nresearch programmes.", "Awards will not be made retrospectively: the work for which support\nis requested must not have commenced before the award is announced.", "The Academy welcomes applications from a diverse range of UK host institutions. In the current competition round, the Academy wishes to particularly encourage applications from historically and / or structurally disadvantaged groups, low-income countries and from female applicants.", "Eligibility requirements", "Applicants must:", "Be recognised scholars or researchers with exceptional promise who are on a permanent contract outside the UK (which may be part-time or full-time) or, if temporary, would normally be on a contract that will not end during the course of the grant unless expressly agreed with the Academy prior to the application being submitted that such an application would be considered eligible, in any field of the humanities or the social sciences.", "Hold a doctoral degree (or have equivalent research experience).", "Be available to take up an unpaid leave of absence, a long-term secondment or employment at an eligible UK host institution. Eligible institutions include but are not limited to the British International Research Institutes.", "Provide a formal statement of support from a senior member of their proposed host institution in the UK (normally expected to be a Pro-Vice-Chancellor or equivalent, or at minimum Head of Department/Faculty/Institute).", "Nominate one academic referee who is not based at the UK host institution or at the overseas institution at which the applicant is currently based at the time of application and is not involved in the programme of research and other activities submitted as part of the application.", "Value and duration", "Awards are for a period of four years and must be taken up between 1 August 2020 and 1 February 2021.", "The British Academy will provide funding of up to £187,500 per annum, and up to £750,000 over four years.", "The host UK institution is expected to contribute up to £37,500 per annum (or 20% of the Academy’s annual contribution) towards the costs of the Professorship, excluding indirect and estate costs.", "Application process", "Applications must be submitted online using the British Academy’s grants application system, ", "Flexi-Grant", ".", "Application, reference, supporting statement and UK host institution application approval deadline: ", "17.00 (UK time) on Wednesday 19 February 2020.", "For More Information:", "Visit the Official Webpage of the British Academy Global Professorships 2020 Program"], "url : https://www.opportunitiesforafricans.com/british-academy-global-professorships-2020-program/"], [["GSK Scholarships 2020/2021 for Future Health Leaders to study in the United Kingdom (Funded)", "date announced:November 22, 2019", "Application Deadline: 23:59 (GMT) on Wednesday 12 February 2020.  "], ["Application Deadline: ", "23:59 (GMT) on Wednesday 12 February 2020", ".  ", "Three scholarships are offered to support the\ntraining and development of the next generation of leaders in global\nhealth, and strengthen the capacity of health systems and health-related\nresearch in Africa.", "These highly competitive scholarships are available to applicants intending to study on a one-year, full-time, London-based MSc programme at the ", "London School of Hygiene & Tropical Medicine (LSHTM).", "Award details", "Each scholarship will cover: ", "tuition fees, including any mandatory field trip fees; and", "a tax-free stipend (living allowance) of GBP 17,175.00.", "Eligibility for funding", "To be eligible for these scholarships, applicants must: ", "be nationals of, and resident in, countries in sub-Saharan Africa; ", "intend to return to sub-Saharan Africa on completion of their MSc year at LSHTM; ", "confirm that they would not otherwise be able to pay for the proposed programme of study by submitting the supplementary questions form with tick-box checked; ", "meet LSHTM’s minimum English language requirements; ", "hold a first degree at either a first or upper second class equivalency level; and", "hold an offer of admission for 2020-21 for one of LSHTM’s 18 London-based MSc programmes of study.", "Preference will be given to applicants who\ndemonstrate (in their application documentation) the potential to make\nsignificant contributions to public health and/or health-related\nresearch in Africa.", "How to apply", "Applicants should complete both steps below by the scholarship deadline.", "Step 1", "Submit an application for 2020-21 for a ", "London-based MSc programme of study", ",\nas per instructions under the ‘How to Apply’ tab on the relevant\nprogramme of study page. Applicants should ensure that all necessary\nsupplementary documents (including references) are submitted via LSHTM’s\nadmissions portal by the scholarship deadline. (Where possible, we\nwould encourage applicants to submit a complete application for study as\nfar in advance of the scholarship deadline as possible, to allow for\ntimely processing.)", "Please note that if you are applying for\nadmission to LSHTM and are accepted, you will be asked to pay a deposit\nwithin 28 days. If you are applying for a scholarship at LSHTM, please\nemail the ", "Admissions Team", "\nwithin this 28 day period, specifying the name of this scholarship and\nthe expected decision date. This must be repeated for every scholarship\nfor which you are applying. The admissions team will then apply an\nextension to the deposit deadline to match the decision deadline of the\nscholarship.", "Step 2", "Submit an ", "online scholarships application", ", selecting this scholarship option from the drop-down menu. A completed ", "supplementary questions form", "\nfor this scholarship must be uploaded as part of this application. This\nis the only attachment required in Step 2 (as applicants should have\nalready submitted references; transcripts; a CV etc with their\napplication for study).", "If you have any queries about the application\nprocess, scholarship requirements or application deadline, please\ncontact our Scholarships team: ", "[email protected]", "If you encounter any technical difficulties whilst using the online\nscholarships application form, in the first instance please try ", "clearing your browser cache", "\nand ensure that you are using the latest version of Chrome, Firefox,\nInternet Explorer or Safari. If this does not fix your technical issue,\nplease contact LSHTM’s IT Services team, providing your full name; the\nscholarship that you are applying for; and the technical issue that you\nhave encountered. Please also attach a screen shot where possible. ", "[email protected]", ".", "Application notes", "Applicants who have already submitted a\ncompleted 2020-21 London-based MSc application and/or have been made an\nOffer of admission should apply for the scholarship by completing the\nscholarship application (Step 2 above) and submitting this by the\nscholarship deadline.", "Each applicant should submit ", "only one", "\napplication for GSK Scholarships for Future Health Leaders for 2020-21.\nWe would therefore encourage applicants to check carefully their online\napplication and attachment before submission, as the first application\nsubmitted will be the one considered and there will be no opportunity to\nupload the supplementary questions form after submission.", "Incomplete applications will not be considered\nfor this funding. Incomplete applications include those with missing\nsupplementary documentation at either/both Steps 1 and 2 above. Both the\napplication to study and the scholarship application must be complete\nby the scholarship deadline.", "These scholarships are open to applicants for\nany of the 18 non-distance learning Masters programmes offered by LSHTM\n(including our joint programmes: MSc Global Mental Health; MSc Health\nPolicy, Planning & Financing; MSc One Health; MSc Veterinary\nEpidemiology).", "\nPlease note that for the following programmes you will be directed to\nthe joint provider to complete your application to study as LSHTM does\nnot administer the admissions for these courses: MSc Global Mental\nHealth; MSc One Health; MSc Veterinary Epidemiology. ", "By applying for this funding applicants agree to its ", "terms and conditions", ".", "Deadline", "The scholarship deadline is ", "23:59 (GMT) on ", "Wednesday 12 February 2020", ". ", "Decisions are expected to be reached, and the successful applicants notified, by 29 May 2020.", "For More Information:", "Visit the Official Webpage of the GSK Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/gsk-scholarships-2020-2021/"], [["Standard Bank Derek Cooper Africa Scholarships 2020/2021 for Young Africans to study in the UK (Fully Funded)", "date announced:November 28, 2019", "Application Deadline: 27 April 2020. "], ["Application Deadline: ", "27 April 2020.", " ", "LSE is pleased to confirm three ", "Standard Bank Derek Cooper Africa Scholarships for the 2020/21 session.", "These scholarships are generously supported by ", "Standard Bank of South Africa PLC", ".", "These scholarships are to support academically gifted students who do\nnot have the financial means to pursue further studies of this nature.", "The successful candidates will need to demonstrate a combination of exceptional academic merit and financial need.", "The scholarships are for offer holders on the following LSE master’s programmes:", "MSc Environment and Development", "MSc Environmental Economics and Climate Change", "MSc Finance (full-time)", "MSc Finance and Private Equity", "MSc Risk and Finance", "MSc Real Estate Economics and Finance", "MSc Law and Accounting", "MSc Economics and Management", "MSc Management Information Systems and Digital Innovation", "MSc Management and Strategy", "MSc Financial Mathematics", "MSc Economics and Philosophy", "Applicants will ordinarily be resident in one of Standard Bank’s African presence countries, with a preference for residents of South Africa, Ghana, Kenya, Nigeria, Angola, Mozambique and South Sudan.", "Benefits:", " The three scholarships will each provide the cost of full fees for the eligible programmes and provide a maintenance stipend for living costs. ", "How to Apply", "To apply for LSE funding for programmes beginning in September 2020, you must:", "– Submit your application for the programme ", "(See how to apply for graduate study at LSE)", " ", "– Submit your Graduate Financial Support Application Form via the", " Graduate application tracker", " including completing Section G: Personal Statement.", "– ", "and", " receive an offer of a place (conditional or unconditional) by ", "5pm UK time on 27 April 2020.", "If you only wish to be considered for the Graduate Support Scheme, you do not need to complete Section G: Personal statement.", "The outcome to your Graduate Support Scheme application will be\ndisplayed on the application tracker after you have received an offer.\nSuccessful applicants selected for other LSE Scholarships or awards like\nthis one will be contacted by email thoughout May, June and July 2020.", "For More Information:", "Visit the Official Webpage of the Standard Bank Derek Cooper Africa Scholarships 2020/2021 "], "url : https://www.opportunitiesforafricans.com/standard-bank-derek-cooper-africa-scholarships-2020-2021/"], [["Equity Group WingsToFly Mastercard Foundation Scholarships 2020 for young (financially challenged students ) Kenyan students", "date announced:December 6, 2019", "The #WingsToFly program will provide comprehensive Secondary School scholarships in 2020 with funding from Mastercard Foundation, and the German Government through KfW and other partners."], ["The #WingsToFly program", " will provide comprehensive Secondary School scholarships in 2020 with funding from Mastercard Foundation, and the German Government through KfW and other partners.", "If you know a bright but financially challenged child, encourage them to apply. Forms can also be picked and dropped at any Equity Bank branch or agent countrywide.", "Instructions", "Applicant should create a new account through the portal ", "https://egfdmis.equitybank.co.ke/register_w2f", " and fill in the 2020 application form for consideration.", "Only 2019", " KCPE candidates are viable to make an application for this scholarship.", "The information provided in this\nform is intended to help Equity Group Foundation Community Scholarship\nSelection Board (CSSB) understand the applicant’s academic and financial\nposition for the purpose of assessment for scholarship/award.", "All fields with asterisk (*) are mandatory fields and ", "must", " be filled accordingly.", "This application form must be filled accurately, honestly and completely. Equity Group Foundation will ", "reject", " any applications without relevant documents.", "Please review the following\ndocuments and if required have soft/scanned copies for ease of\ncompleting the online application form:\n", "KCPE Results Slip\n(official KNEC slip or signed & stamped paper from the school). For\nearly bird applications, you will be allowed to complete the application\nform without KCPE marks and Result Slip until submission.", "Copy of Death Certificate (if father/mother deceased).", "Evidence of financial support (if they have received support in the past).", "Evidence of special needs (if they have indicated special needs).", "Copy of Pay Slip/ Bank Statement (if parents/guardians are employed/business).", "Signed declaration by Applicant and Parent/Guardian", "Filled application and recommendation form by Head Teacher, Provincial Adm., Religious Leader and any other.", "The completion and submission of this form is ", "not a guarantee for sponsorship", ".", "Only shortlisted candidates will be invited for interviews.", "Any false statements, omissions or forged documents will lead to ", "automatic disqualification.", "For More Information:", "Visit the Official Webpage of the Equity Group Foundation Mastercard Foundation Scholarships 2020"], "url : https://www.opportunitiesforafricans.com/equity-group-wingstofly-mastercard-foundation-scholarships-2020/"]]