[[["Reporters without Borders Rest and Refuge Scholarship 2018 for Journalists from countries in crisis or war (Fully Funded to Berlin, Germany)", "date announced:June 6, 2018", "Application Deadline: June 22nd 2018"], ["Application Deadline: June 22nd 2018", "Rest and Refuge Scholarship", " is a project run by ", "Reporters without Borders Germany", " and", " taz Panter Foundation", ",", " a non-profit organization linked to", " die tageszeitung", " (", "taz", "),", " a daily newspaper in Berlin.", " Reporters without Borders", " invite two journalists from countries in crisis or war to stay in Berlin. We offer them a time of refuge and rest up to three months. The first journalist will be invited from ", "September to November 2018", ", the second from ", "March to May 2019", ".", "Requirements:", "Journalists who need a time out from their difficult working conditions. This might be the case after covering stories in an oppressive environment or after covering stories in war or unrest.", "Journalists who feel the need to lie low awhile and get out of the view of state security because of their journalistic work.", "Benefits:", "Travel expenses, a decent apartment, pocket money and free transportation in Berlin for up to three months.", "Participants may completely withdraw from public life, use the time for writing or thinking, or they may want to explore political life in Berlin. Off course we would be of help in that.", "Conditions", "Participants have to be able to communicate in basic English or in German. Participants should have a relevant working-experience as journalists. They must have the intention to return to their country after three months.", "How to apply", "Please use the application form and send the other requested documents ", "via Mail", ". The deadline for applications is ", "17. June 2018", ". / ", "GnuPG/GPG-Schlüssel", ".", "Please send us the application form, your CV and the text of your current situation, ", "each as an individual PDF document attached in one e-mail", " (3 PDFs in total).", "For More Information:", "Visit the Official Webpage of the Reporters without Borders Rest and Refuge Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/reporters-without-borders-rest-and-refuge-scholarship-2018-for-journalists-from-countries-in-crisis-or-war/"], [["Rhodes Southern Africa Scholarships Programme 2018/2019 for study in the University of Oxford (Fully Funded)", "date announced:June 1, 2018", "Application Deadline: 3:59 SAST, Wednesday, 15 August 2018."], ["Application Deadline: 3:59 SAST, Wednesday, 15 August 2018.", "The Rhodes Scholarships for Southern Africa", " (inc. South Africa, Botswana, Lesotho, Malawi, Namibia and Swaziland)", "This page provides constituency-specific information on Rhodes Scholarships to Oxford for applicants from South Africa, Botswana, Lesotho, Malawi, Namibia and Swaziland.", "The Scholarships for these countries are administered from a regional secretariat based in Johannesburg.", "\nThere are:", "four Scholarships every year for applicants from South Africa-at-Large,", "one for applicants from KwaZulu-Natal,", "one for an applicant from one of: Botswana, Lesotho, Malawi, Namibia and Swaziland, and", "one each for applicants of or from Diocesan College, Rondebosch; South African College School, Newlands; Paul Roos Gymnasium, Stellenbosch; and St Andrew’s College, Grahamstown (including their identified partner schools, which are listed ", "here", ").", "The Rhodes Scholarship programme", " is the oldest (established 1903), and perhaps the most prestigious, international scholarship programme in the world. Administered by the Rhodes Trust in Oxford, the programme offers more than 100 fully-funded Scholarships each year", "for postgraduate study at the University of Oxford in the UK- one of the world’s leading universities.", "Selection Committees for the Scholarships are looking for young leaders of outstanding intellect and character who are motivated to engage with global challenges, committed to the service of others and show promise of becoming value-driven, principled leaders for the world’s future. The Selection Committees are looking for the following:", "• academic excellence (e.g. First Class Honours or GPA of minimum 3.7/4.0, or equivalent).", "energy to use your talents to the full (as demonstrated by mastery in areas such as sports, music, debate, dance, theatre, and artistic pursuits, particularly where teamwork is involved)", " truth, courage, devotion to duty, sympathy for and protection of the weak, kindliness, unselfishness and fellowship", "• moral force of character and instincts to lead, and to take an interest in your fellow human beings", "Countries, regions and schools", "Scholarships in Southern Africa are distributed as follows:", "South Africa-at-Large Scholarships: You should apply to the committee (the “Regional Selection Committee”) in whose area you permanently live or in which you have received, or are currently receiving, any considerable part of your education. Save for KwaZul", "Natal as explained below, all successful candidates from Regional Selection Committees are sent to the South Africa-at-Large Selection Committee, for the final round of interviews. The South Africa-at-Large Selection Committee selects successful candidates and recommends them to the Rhodes Trust, which ultimately makes the scholarship awards. There are four regional selection committees, namely:", "i. Eastern Cape and Free State;", "ii. KwaZulu-Natal;", "iii. Gauteng, Limpopo, Mpumalanga and North-West; and", "iv. Western Cape and Northern Cape.", "b. KwaZulu", "-Natal Scholarship: You may apply for the KwaZulu", "-Natal Scholarship if you live permanently or have", "received, or are currently receiving, a considerabl", "e part of your education in KwaZulu-Natal (KZN). The KZN Selection", "Committee may make one direct recommendation (similar to those of the South Africa-at-Large Selection Committee) to the Rhodes Trust each year, and also acts as a Regional Selection Committee.", "c. Botswana, Lesotho, Malawi, Namibia and Swaziland Scholarship (BLMNS): You may apply to the BLMNS selection committee if you fulfil the citizenship or legal residence requirement in one of the mentioned countries. The procedure is the same as that for the South Africa-at-Large Scholarships.", "d. Named and partner schools: Former pupils of the four named schools and their partner schools, namely:", "i. Diocesan College (Bishops), St Cyprian’s School, St George’s Grammar School, Herschel Girls School, and LEAP 1 School (all in Rondebosch);", "ii. Paul Roos Gymnasium, Rhenish Girls’ High School and Bloemhof Girls’ High School (all in Stellenbosch);", "iii. South African College School (SACS), Sans Souci Girls’ High School and Rustenburg High School for Girls (all in Newlands); and", "iv. St Andrew’s College and Diocesan School for Girls (DSG) (both in Grahamstown), may apply for their relevant school Scholarship, or for the South Africa-at-Large (including KZN) or BLMNS Scholarships", "Eligibility Criteria", "Nationality/citizenship:", "You must be a citizen or legal permanent resident of South Africa, Botswana, Lesotho,", "Malawi, Namibia or Swaziland.", "Education/residency: You must", "have resided for at least five years within the period of ten years immediately", "preceding your application in South Africa, Botswana, Lesotho, Malawi, Namibia or Swaziland.", "Age:", "You must have reached your 19th and not have passed your 25th birthday on 01 O", "ctober 2019, which means you must have been born after 30 September 1994 and on or before 01 October 2000. For medical students and medical doctors the age limit is extended by up to three years to allow them to complete internship and", "community service.", "Academic achievement:", "You must have completed (or will have completed by 30 June 2019) an undergraduate", "degree from a college or university (normally a Bachelor’s degree) to a sufficiently high standard to be admitted to postgraduate study at the University of Oxford. In this respect, please note carefully the requirements for your chosen course at Oxford.", "Application Procedure:", "Application Procedure", "You can apply online from 01 June 2018 at http://www.rhodeshouse.ox.ac.uk via the scholarships tab.", "You must submit your application online, with all supporting documents, by 23:59 SAST, Wednesday, 15 August 2018.", "In preparation for making your application, you should read carefully the general information for candidates on the Rhodes website, the Conditions of Tenure for the Rhodes Scholarship, the information in this document and the graduate admissions pages of the University of Oxford: www.ox.ac.uk/admissions/graduate.", "Shortlisted candidates will be invited to a social reception (e.g. a lunch or dinner reception) and an interview. No candidate will be selected without interview. You must be available to attend the interview and social reception, in person, as no accommodations can be made on date and time of these events. Interviews will be held in the region to which you have applied, all interviews will have taken place by mid-December. The regional and school selection committees usually meet in October/November. The BLMNS selection committee will hold its interviews towards the end of November. The South Africa-at-Large selections are usually held on the last weekend of November or the first weekend of December. Reasonable travel expenses to the nearest selection committee (and for those shortlisted by the KZN committee) for the purposes of interviews will be paid. The Trust will not be responsible for the cost of overseas travel. Accommodation within South Af rica will, where necessary, be provided.", "All applicants will be emailed with the outcome of their application.", "Documents:", "Information for Candidates – Southern Africa", "Guidance for Referees – Southern Africa ", "National Secretary for South Africa", "Ndumiso Luthuli", "Email:", " ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Rhodes Scholarships for Southern Africa"], "url : https://www.opportunitiesforafricans.com/rhodes-southern-africa-scholarship-programme-2018-2019/"], [["Association of Commonwealth Universities (ACU) 2018/2019 Commonwealth Master’s Scholarships in South Africa (Fully Funded)", "date announced:May 26, 2018", "Application Deadline: 13 July 2018 at 17:00 South Africa Standard Time."], ["Application Deadline: ", "13 July 2018 ", "at", " 17:00 ", "South Africa Standard Time.", "These Commonwealth Master’s Scholarships allow successful applicants to benefit from the expertise provided by member universities in low and middle income countries around the Commonwealth.", "The scheme, which will be expanded from 2019 and become known as the ", "Queen Elizabeth Commonwealth Scholarships", ", ", "is majority funded through the ", "Commonwealth Scholarship and Fellowship Plan (CSFP)", " endowment fund.", "The scholarships give talented students – who can be from any Commonwealth country other than the host country – the opportunity to gain a Master’s degree while developing new skills and experiencing life in another country.", "The scholarships", "The scholarships are fully-funded, providing full tuition fees, a return economy flight, an arrival allowance, and a regular stipend (living allowance).", "They are for Master’s courses only and are not applicable to distance learning courses.", "The Department of Higher Education and Training in South Africa", " says:", "South Africa’s universities present a wide variety of academic and research opportunities at well-resourced, multi-cultural campuses, as well as numerous opportunities for extra-curricular activities. South African university qualifications are internationally recognised. South Africa is a preferred destination for international students; international students make up about 10% of students at public universities. All of South Africa’s universities welcome international students, and institutions have a dedicated international office to support this.", "Universities", "Scholarships are tenable at:", "North-West University", "Rhodes University", "Stellenbosch University", "University of Cape Town", "University of Johannesburg", "University of KwaZulu-Natal", "University of Pretoria", "University of South Africa", "Subjects", "Please ", "see this document for a list of applicable subjects", ". The scholarships are only tenable in the subjects listed for each university.", "Support for Commonwealth Scholars", "All Commonwealth Scholars have a dedicated contact person at the ACU who can be contacted by email and phone.", "Eligibility", "Applicants must be a citizen of a ", "Commonwealth country", " ", "other than", " South Africa and must not be currently resident in South Africa", "Applicants must hold an Honours degree or a four-year degree, equivalent to NQF 8 on the South African National Qualifications Framework, and with an average mark of at least 70%, and meet the minimum entry criteria of the proposed course of study", "Applicants must not be a current DHET-supported scholarship recipient", "Applicants must have applied for the identified study programme at the chosen university in South Africa on a full-time basis", "Applicants’ academic background should be aligned to the proposed field of study", "The scholarships", "Four scholarships are available, starting in January/February 2019", "The scholarships provide full tuition fees, a return economy flight, an arrival allowance and a regular stipend (living allowance)", "The scholarships are for Master’s study only and are not applicable to distance learning courses", "The scholarships are for new students only and cannot be used to fund a course you have already started", "No additional funding will be provided for applicants with families", "Scholarships are for a maximum of two years", "How to apply", "First, you must apply for your chosen course directly with the university. Applicants are advised to arrange for their qualifications to be validated by the ", "South African Qualifications Authority", " before applying to a university.", "Separately, ", "download this scholarship application form", ", and complete it in as much detail as possible.", "As well as the application form, applicants must submit the following:", "A 500-word research proposal summary, containing:\n", "Scientific elements of the proposal: research rationale, problem identification, aims and objectives of research, theoretical framework and research methodology", "Social relevance of proposed study", "High school certificates", "Undergraduate transcripts and graduation certificate", "At least one academic reference", "Scan of passport or national ID card", "Proof of English language ability if English is not your first language", "Proof that you have applied for the relevant course at your university of choice", "Please submit all the required documents above by email to ", "[email protected]", "Applications close on ", "13 July 2018 ", "at", " 17:00 ", "South Africa Standard Time.", "For More Information:", "Visit the Official Webpage of the ACU 2018/2019 Commonwealth Master’s Scholarships"], "url : https://www.opportunitiesforafricans.com/acu-2018-2019-commonwealth-masters-scholarships-in-south-africa/"], [["Rhodes West Africa Scholarship 2018/2019 for study in the University of Oxford (Fully Funded)", "date announced:June 1, 2018", "Application Deadline: 23:59 Greenwich Mean Time (GMT), Sunday, 30 September 2018."], ["Application Deadline: 23:59 Greenwich Mean Time (GMT), Sunday, 30 September 2018.", "In conjunction with the ", "Oxford-Morland-West Africa Graduate Scholarship", "West Africa includes: Benin, Burkina Faso, Cape Verde, Gambia, Ghana, Guinea, Guinea-Bissau, Ivory Coast, Liberia, Mali, Mauritania, Niger, Nigeria, the island of Saint Helena, Senegal, Sierra Leone, São Tomé and Principe and Togo.", "There is one ", "Rhodes Scholarship for West Africa", " each year. The Scholarship for West Africa was announced in 2017 and the first Scholar will arrive in October 2018. There had previously been Scholarships for certain countries within this grouping, including Nigeria and Ghana.", "The Rhodes Scholarship programme", " is the oldest (established 1903), and perhaps the most prestigious, international scholarship programme in the world. Administered by the Rhodes Trust in Oxford, the programme offers more than 100 fully-funded Scholarships each year", "for postgraduate study at the University of Oxford in the UK- one of the world’s leading universities.", "Selection Committees for the Scholarships are looking for young leaders of outstanding intellect and character who are motivated to engage with global challenges, committed to the service of others and show promise of becoming value-driven, principled leaders for the world’s future. The Selection Committees are looking for the following:", "• academic excellence (e.g. First Class Honours or GPA of minimum 3.7/4.0, or equivalent).", "energy to use your talents to the full (as demonstrated by mastery in areas such as sports, music, debate, dance, theatre, and artistic pursuits, particularly where teamwork is involved)", " truth, courage, devotion to duty, sympathy for and protection of the weak, kindliness, unselfishness and fellowship", "• moral force of character and instincts to lead, and to take an interest in your fellow human beings", "Eligibility Criteria:", "• energy to use your talents to the full (as demonstrated by mastery in areas such as sports, music, debate, dance, theatre, and artistic pursuits, particularly where teamwork is involved)", "• truth, courage, devotion to duty, sympathy for and protection of the weak, kindliness, unselfishness and fellowship", "• moral force of character and instincts to lead, and to take an interest in your fel low human beings.", "Eligibility Criteria", "a. Nationality/citizenship:", "You must be a citizen of one of the following countries:", "b. Benin, Burkina Faso, Cape Verde, Gambia, Ghana, Guinea, Guinea-Bissau, Ivory Coast, Liberia, Mali, Mauritania, Niger, Nigeria, the island of Saint Helena, Senegal, Sierra Leone, São Tomé and Principe and Togo.", "c. Education/residency: You must have been resident in one or more of the countries listed above for at least five of the last ten years.", "d. Age:", "You must have reached your 19th and not have passed your 26th birthday on 1 October 2019. This means candidates must have been born after 30 September 1993 and on or before 1 October 2000.", "e. Academic achievement:", "You must have completed an undergraduate degree from a college or university", "(normally a Bachelor’s degree) with the highest classification your University awards, e.g. First Class or Upper Second Class Honours, or a Distinction in the case of Medicine, Dentistry and Pharmacy courses.", "f. English language: You must have a sufficiently high standard of English to meet the English language proficiency requirements (at the Higher Level listed) of the University of Oxford.", "Application Procedure", "You can apply online from 01 June 2018 at http://www.rhodeshouse.ox.ac.uk via the scholarships tab.", "You must submit your application online, with all supporting documents, by 23:59 Greenwich Mean Time (GMT), Sunday, 30 September 2018.", "In preparation for making your application, you should read carefully the general information for candidates on the Rhodes website, the Conditions of Tenure for the Rhodes Scholarship, the information in this document and the graduate admissions pages of the University of Oxford: www.ox.ac.uk/admissions/graduate.", "Shortlisted candidates will be invited to a social reception (e.g. a lunch or dinner reception) and an interview. No candidate will be selected without interview. You must be available to attend the interview and social reception,in person, as no accommodations can be made on date and time of these events. Interviews will be held in Lagos, on a Saturday between mid- November and early December, with a Dinner with the Selection Committee on thepreceding evening. Overnight accommodation will be provided if necessary. Travel expenses are not normally provided. However, candidates who need to travel to the interview location from their country of origin within the West Africa region, may apply to the National Secretary for financial assistance to travel.", "All applicants will be emailed with the outcome of their application.", "Documents:", " ", "Information for Candidates – West Africa", " ", " ", "Guidance for Referees – West Africa ", "National Secretary", ": Mr Ike Chioke", "Strategic Adviser for West Africa", ": Mr Topé Folarin", "Email", ": ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Rhodes Scholarship for West Africa"], "url : https://www.opportunitiesforafricans.com/rhodes-west-africa-scholarship-2018-2019/"], [["University of the Witwatersrand’s WHO/TDR 2019 Postgraduate Training Scholarships in Implementation Science (Fully Funded)", "date announced:May 25, 2018", "Application Deadline: 31 July 2018"], ["Application Deadline: 31 July 2018", "The University of the Witwatersrand’s School of Public Health,", " in conjunction with ", "the Special  Programme for Research and Training in Tropical Diseases (TDR),", " hosted at the ", "World Health  Organization in Geneva, Switzerland, i", "nvites suitably qualified candidates to apply for a full scholarship supported by TDR to undertake the ", "full-time Master Degree Programme in the field of Implementation Science.", "The degree programme is open to candidates from a range of disciplines including clinical", "\nand other health-relatedfields; statistics and other quantitative fields,as well as demography and social sciences. The degree programme should also appeal to candidates who want to become more involved in research in health-related fields.", "The University of the Witwatersrand is one of seven universities around the world participating in the  TDR Postgraduate Training Scheme, which aims to strengthen capacity in implementation research.  Implementation  research1 is a growing field that supports the identification of health system bottlenecks and approaches to address them, and is particularly useful in low-and middle-income countries where  many health interventions do not reach those who need them.", "The goal of strengthening capacity in implementation research on infectious diseases of poverty  (in particular, the neglected tropical  diseases", "\n2, malaria and  tuberculosis)  and boosting the number of researchers  and  practitioners in low  and middle-income countries is  in line with  the TDR focus on improving the health and well- being of people burdened by infectious diseases of poverty through research and innovation.", "ELIGIBILITY FOR THE SCHOLARSHIP", "Be resident in and a national of a low-or middle-income country in the WHO African Region.", "Applicants should normally be 35 or younger for the Master Programme.  Women", "\nare encouraged to apply.", "Be interested in developing a career in implementation research on infectious diseases of", "\npoverty.", "Be proficient in English.", "Meet the Programme’s requirements: http://www.wits.ac.za/publichealth/academic-programmes/postgraduate/master-of-science-in-epidemiology/", "SCHOLARSHIP PACKAGE", "The scheme will provide full scholarships for seven  Masters in the  2019  academic year and covers the  following:", "Return economy air fare.", "Tuition fees.", "Basic medical and accident insurance.", "Monthly stipend to cover living expenses including accommodation.", "Support for the research project expenses.", "HOW TO APPLY", "The application process is two-fold.", "\n1.Application to the University of the Witwatersrand", "\nApply by completing a University of the Witwatersrand postgraduate application form online", "\nat: http://www.wits.ac.za/postgraduate/applications/ Application fee is R200 for both international and local applications.", "Application deadline is 31 July 2018.", "Applicants should note to apply for accommodation also.", "\nFor more information on applications, please go to:", "www.wits.ac.za/askwits", "\nfor general application queries or Mrs.  Gloria Bowe (", "[email protected]", ") for the", "\nMSc Programme related queries.", "Application for the TDR scholarship", "The application for the TDR scholarship should be made separately in writing and should", "include the following documents:", "a. A letter of motivation for applying for the scholarship.", "b. A certified copy of the bio-data page of the passport.", "c. Evidence of application to study Implementation Science as the field of study in", "the MSc Epidemiology Programme at the University of the Witwatersrand of the School of Public Health commencing in the 2019 academic year.", "d. A comprehensive curriculum vitae including a description of relevant research and work", "experience.", "e. Two confidential referee reports should be sent directly by the referees to Mrs Gloria Bowes ( ", "[email protected]", "). The application deadline for TDR scholarships is 31 July 2018. Scholarship applications should be sent to: Mrs Gloria Bowes (", "[email protected]", ") and copied to Prof. Latifat Ibisomi (", "[email protected]", ").", "For More Information:", "Visit the Official Webpage of the University of the Witwatersrand’s 2019 Postgraduate Training Scholarships ", " "], "url : https://www.opportunitiesforafricans.com/university-of-the-witwatersrands-who-tdr-2019-postgraduate-training-scholarships-in-implementation-science/"], [["Study an Online or Blended MBA with EMAS Business School, Russia!", "date announced:May 18, 2018", "Sponsored Post"], ["Sponsored Post", "An MBA from Eurasian Management and Administration School (EMAS Business School) in Russia is more than about learning – it is about making breakthrough improvement in your career and business. Whether you want to focus in General Management, Marketing & Sales or Finance – EMAS has an MBA program for you (purely online or through blended learning):", "● MBA: General Management", "\n● MBA: Marketing and Sales", "\n● MBA: Finance", "Eligibility Criteria:", "\n● Bachelor’s or professional degree complete", "\n● Good level of English", "\nProgram starts: Earliest class begins 26 March 2018, more to come in the coming months.", "Duration : 1 – 1,5 years", "BONUS : EMAS is offering 50 scholarships of up to 60% today ! You could be on your way to studying for an MBA online.", "What you have to do:", "1. ", "Take this online challenge", " for a chance to win a scholarship:", "\n● Sign up on ", "Sqore website", "\n● Take a short quiz to learn more about EMAS Business School", "\n● Explain why you would like to join the program", "\n2. Apply with EMAS Business School once you have completed the Sqore challenge", "For More Information:", "Visit the Official Webpage of the Study an Online or Blended MBA with EMAS Business School, Russia!"], "url : https://www.opportunitiesforafricans.com/study-an-online-or-blended-mba-with-emas-business-school-russia/"], [["Business School Netherlands/Orange Knowledge Programme Scholarship 2018 (Fully- Funded International Action Learning MBA)", "date announced:June 7, 2018", "Application Deadline: 15 July 2018."], ["Application Deadline: 15 July 2018.", "The International Action Learning MBA programme", " is ideal for the busy manager or for the business traveller considering a part-time, distance learning MBA. With their MBA structure, you can now save time on your studies as all your projects are real-time based, meaning that you use a portion of your time at work to focus and implement your projects on real-life problems.", "The ", "Orange Knowledge Programme (OKP)", " aims to advance the development of the capacity, knowledge and quality of both individuals and institutions in higher and vocational education.  Applicants from the 52 OKP countries are now able to apply for this fantastic MBA", "opportunity through Business School Netherlands, as the International Action Learning MBA is an OKP approved course.", "Benefits ", "Successful applicants to both BSN and the OKP will receive a full MBA scholarship that covers the total cost of tuition fees, prescribed textbooks, flights and accommodation at the two conferences held in the Netherlands, subsistence and internet costs.", "Eligibility", "Applicants must first meet the following eligibility criteria for the International Action Learning MBA programme:", "The applicant:", "holds a Bachelor’s degree or equivalent qualification,", "is a manager or management trainee,", "has a minimum of 2 years appropriate and relevant post graduate work experience,", "has approval from his or her organisation to do research and execute practical assignments within their work environment,", "has internet and e-mail access,", "should the applicants mother-tongue not be English, a TOEFL or IELTS language test will be required. The minimum pass mark for the TOEFL is 550 (paper); 213 (computer) or 79/80 (internet based) and IELTS 6.0", "Applicants must then meet the following eligibility criteria for the OKP scholarship:", "must be a professional and national of, and working and living in one of the 52 countries on the OKP country list,\n", "must have an employer’s statement that complies with the format Nuffic has provided. All information must be provided and all commitments that are included in the format must be endorsed in the statement,", "must not be employed by an organisation that has its own means of staff development. Organisations that are considered to have their own means for staff development are for example:  multinational organisations (e.g. Shell, Unilever, Microsoft), large national and/or a large commercial organisation, bilateral donor organisations (e.g. USAID, DFID, Danida, Sida, Dutch Ministry of Foreign Affairs, FinAid, AusAid, ADC, SwissAid), multilateral donor organisations (e.g. UN organisation, the World Bank, the IMP, Asian Development Bank, African Development Bank, IADB), international NGO’s (e.g. Oxfam, Plan, Care),", "must have an official and valid passport,", "must not receive more than one fellowship for courses that take place at the same time,", "must have a government statement that meets the requirements of the country in which the employer is established (if applicable).", "To apply, send an email to ", "[email protected]", "For More Information:", "Visit the Official Webpage of the Business School Netherlands/Orange Knowledge Programme Scholarship 2018"], "url : https://www.opportunitiesforafricans.com/business-school-netherlands-orange-knowledge-programme-scholarship/"], [["Global Scholarships to study online at UNICAF University (Start building your future. Win scholarships of up to 75% to study online at UNICAF University)", "date announced:May 31, 2018", "Pursuing higher level international education is a huge commitment. But what if there was an internationally accredited program that is both flexible and affordable ?"], ["Pursuing higher level international education is a huge commitment. But what if there was an internationally accredited program that is both flexible and affordable ?", "Recognised for its outstanding contribution to research and learning, UNICAF University offers programmes that are either available fully online or use the blended learning approach, which integrates e-learning with traditional classroom sessions. Available programmes included:", "Undergraduate", "BSc in Computer Science", "BA in Hospitality Management", "BA in Business Administration", "BSc in Accounting & Finance", "Level 6 Diploma in Accounting & Financial Management", "Master’s", "MA Education", "MPA – Master of Public Administration", "LLM – Master of Laws", "MSc Healthcare Management", "MSc Managerial Psychology", "MSc Web Design & Development", "MBA", "MBA (Business Administration, Finance, Management, Management Information Systems,Oil&Gas Management, Health Management", "Postgraduate", "DBA – Doctorate of Business Administration", "EdD – Doctorate of Education in Organisational Change & Leadership", "PhD – Doctorate of Philosphy", "A UNICAF Scholarship can change your life! $70 million have already been awarded – don’t miss your", "\nchance!", "Here’s what you need to do to secure the scholarship:", "Sign up on sqore", "\n1.", " fill in your details", "\n● Take a short quiz to learn more about the UNICAF Scholarship Programme", "\n● Fill in your details", "The Scholarships will be awarded on a rolling basis, so don’t wait, sign up now!", " ", "For More Information:", "Visit the Official Webpage of the Global Scholarships to study online at UNICAF University"], "url : https://www.opportunitiesforafricans.com/global-scholarships-to-study-online-at-unicaf-university/"], [["Western Union Foundation One Young World Delegate Scholarship 2018 (Fully Funded to attend the 2018 One Young World Summit in The Hague, The Netherlands)", "date announced:May 16, 2018", "Application Deadline: 4th June 2018"], ["Application Deadline: ", "4th June 2018", "Across the globe, more than 65 million people have been forced to leave their homes and start over, and all too often it’s these circumstances that come to define them. But these global citizens are so much more.", "Through partnerships with NGOs around the world, the Western Union Foundation works to empower migrants and refugees to create better lives for themselves, their families and their communities.", "Now the Western Union Foundation is partnering with One Young World to offer the", " Western Union Foundation One Young World Delegate Scholarship", " for three (3) young people to attend the ", "One Young World Summit 2018 in The Hague, the Netherlands.", "Requirements:", "The Scholarship is open to young leaders (ages 18-30) who deliver extraordinary impact in migrant or refugee communities. They may be a social entrepreneur dedicated to support refugees, or working to support refugee causes, or a leader dedicated to migrant, refugee, and underserved communities.", "Benefits", "The Western Union Foundation One Young World Delegate Scholarship provides:", "The cost of travel to and from The Hague (flights in economy), plus a stipend for ground transportation to/from the airport, hotel and Summit venue.", "Hotel accommodation on a shared basis (twin rooms) between 16 and 20 (inclusive) October 2018. (Arrangements may be made for delegates to avail of an additional night’s accommodation on 15 October, should their travel itinerary require.)", "Catering which includes breakfast, lunch and dinner during the Summit.", "Transport between the Summit accommodation and the Summit venue.", "Summit hand-outs and support materials.", "Discretionary funds to provide for emergency out of pocket expenses while in The Hague up to a maximum of £250.00 per delegate.", "Eligibility criteria", "Candidates of any background between the ages of 18 and 30 who are working to support refugee and/or migrant communities are eligible for this scholarship.", "Successful sponsored delegates will demonstrate:", "Evidenced commitment to creating social impact within migrant or refugee communities.", "Leadership ability in their chosen cause or issue.", "Capacity for innovation and values-driven problem solving.", "Concern for local and global issues.", "Ability to generate and articulate impactful ideas.", "Ability to work towards a shared goal through teamwork and collaboration", "For More Information:", "Visit the Official Webpage of the ", " Western Union Foundation One Young World Delegate Scholarship"], "url : https://www.opportunitiesforafricans.com/western-union-foundation-one-young-world-delegate-scholarship-2018/"], [["University of Gondar Mastercard Foundation Scholars Program (MCFSP) 2019/2020 for East African Students (Funded)", "date announced:June 4, 2018", "Application Deadline: Ongoing"], ["Application Deadline: Ongoing", "The ", "Mastercard Foundation Scholars Program (MCFSP) at the University of Gondar", " awards a total of 160 graduate scholarships in the coming eight years, starting from 2018/19. The scholarship will directly benefit academically talented but disadvantaged youth from five East African countries – Ethiopia, Somalia, Eritrea (refugees in camps located in Ethiopia), Djibouti and South Sudan.", "The Graduate Scholars Program is designed to help Scholars to acquire transformational and leadership skills and demonstrate high professional and scholarly competencies to effectively influence global, regional, national and local socioeconomic development trends. The Program is technically and financially supported by Mastercard Foundation and will avail excellent academic and nonacademic support to Scholars during their stay at University of Gondar.", "THE ELIGIBLE PROGRAMS ARE:", "Law", "Sociology", "Psychology", "Physiotherapy", "Nursing", "How to Apply", "Please complete and sign the under graduate ", "online application form", " and send it along with required documents to the ", "Project Office", ". Please note that applications submitted to other organizations or after the deadline will not be accepted.", "The following documents are required to be submitted ", "with", " your application:", "A medical paper signed by the Health/Hospital Board attesting to your disability type and degree, if you have been assessed by a health professional", "A copy of your Kebele ID or Passport", "A copy of your Grade 11 and 12 student transcripts", "A copy of your EHEECE registration form", "Three reference letters: teacher, director and community service supervisor", "Download a Paper Application (English)", "Graduate Referee Forms", "If you do not want to submit your application form online, please e-mail it to or send it to: ", "[email protected]", "Scholars Program", "\nUniversity of Gondar", "\nP.O. Box 1082", "\nGondar, Ethiopia", "For More Information:", "Visit the Official Webpage of the University of Gondar Mastercard Foundation Scholars Program (MCFSP) 2018/2019"], "url : https://www.opportunitiesforafricans.com/university-of-gondar-mastercard-foundation-scholars-program-mcfsp-2019-2020/"], [["Rhodes East Africa Scholarship Programme 2018/2019 for study in the University of Oxford (Fully Funded)", "date announced:June 1, 2018", "Application Deadline: 23:59 East Africa Time (EAT) , Friday, 31 August 2018"], ["Application Deadline: 23:59 East Africa Time (EAT) , Friday, 31 August 2018", "East Africa covers Uganda, Tanzania, Rwanda, South Sudan and Burundi.", "There is one ", "Rhodes Scholarship for East Africa", " ", "each year. The Scholarship for East Africa was announced in 2018 and the first Scholar will arrive in October 2019.", "Kenyan citizens are not eligible for the Scholarship for East Africa but should apply instead for the Scholarship for Kenya.", "The Rhodes Scholarship programme", " is the oldest (established 1903), and perhaps the most prestigious, international scholarship programme in the world. Administered by the Rhodes Trust in Oxford, the programme offers more than 100 fully-funded Scholarships each year", "for postgraduate study at the University of Oxford in the UK- one of the world’s leading universities.", "Selection Committees for the Scholarships are looking for young leaders of outstanding intellect and character who are motivated to engage with global challenges, committed to the service of others and show promise of becoming value-driven, principled leaders for the world’s future. The Selection Committees are looking for the following:", "• academic excellence (e.g. First Class Honours or GPA of minimum 3.7/4.0, or equivalent).", "energy to use your talents to the full (as demonstrated by mastery in areas such as sports, music, debate, dance, theatre, and artistic pursuits, particularly where teamwork is involved)", " truth, courage, devotion to duty, sympathy for and protection of the weak, kindliness, unselfishness and fellowship", "• moral force of character and instincts to lead, and to take an interest in your fellow human beings", "Eligibility Requirements:", "Nationality/citizenship:", "You must be a citizen of Burundi, Rwanda, South Sudan, Tanzania or Uganda.", "Education/residency: You must have been resident in one or more of the countries listed above, or Kenya, for at least five of the last ten years.", "Age:", "You must have reached your 19th and not have passed your 26th birthday on 1 October 2019, which means you must have been born after 30 September 1993 and on or before 1 October 2000. Exceptions, extending the upper age limit by no more than 2 years, may be made for students who have undertaken an undergraduate degree of five years or more, at the discretion of the National Secretary. In such cases, exceptions will only be considered for applicants born after 30 September 1991 and on or before 1 October 2000.", "Academic achievement:", "You must have completed (or will have completed by no later than July 2019) an undergraduate degree from a college or university (normally a Bachelor’s degree) to a sufficiently high standard to be admitted to postgraduate study at the University of Oxford. This would normally be the equivalent of a First Class, or a GPA of 3.7 or more. In this respect, please note carefully the requirements for your chosen course at Oxford.", "English Language requirement: You must have a sufficiently high standard of English to meet the English language proficiency requirements (at the Higher Level listed) of the University of Oxford: ", "www.ox.ac.uk/admissions/graduate/applying-to-oxford/application-guide.", "Given the very intense international competition for places at the University of Oxford, candidates studying in Burundi or South Sudan will have a greater chance of successful admission to Oxford if they have an Honours degree (or have taken an Honours year) from a University outside of the their country or if they have studied to Masters level within their country.", "Application Procedure", "You can apply online from 01 June 2018 at http://www.rhodeshouse.ox.ac.uk via the scholarships tab.", "You must submit your application online, with all supporting documents, by 23:59 East Africa Time (EAT), Friday, 31 August 2018.", "In preparation for making your application, you should read carefully the general information for candidates on the Rhodes website, the Conditions of Tenure for the Rhodes Scholarship, the information in this document and the graduate admissions pages of the University of Oxford: www.ox.ac.uk/admissions/graduate", "Shortlisted candidates will be invited to a social reception (e.g. a lunch or dinner reception) and an interview. No candidate will be selected without interview. You must be available to attend the interview and social reception, in person, as no accommodations can be made on date and time of these events. Interviews will be held in Kigali,Rwanda, in later October / early November. Reasonable travel expenses will be reimbursed for interview candidates traveling from outside of Rwanda. Overnight accommodation will be provided if necessary.", "All applicants will be emailed with the outcome of their application by 15 November 2018", "Documents:", " ", "Information for Candidates – East Africa", " ", " Guidance for Referees – East Africa ", "National Secretary for East Africa", "Mrs Janet Kabiru", "Email:", " ", "[email protected]", "For More Information:", "Visit the Official Webpage of the ", "Rhodes Scholarships for East Africa"], "url : https://www.opportunitiesforafricans.com/rhodes-east-africa-scholarship-programme-2018-2019-for-study-in-the-university-of-oxford/"], [["MasterCard Foundation Microfinance Scholars Program 2018 to attend the School of African Microfinance in Kenya (Scholarships Available)", "date announced:May 18, 2018", "Application Deadline: 30th June 2018"], ["Application Deadline: 30th June 2018", "The ", "MasterCard Foundation Microfinance Scholars Program ", "in collaboration with ", " the School of African Microfinance", " is offering scholarship opportunities to outstanding individuals active in financial inclusion to attend SAM 2018.", "Eligibility Requirements:", "Individuals from Africa who wish to apply to be considered for a scholarship, should demonstrate a passion to make greater impact. In addition, candidates should meet the following eligibility criteria:", "Be in ", " management and/or leadership ", " levels in microfinance institutions or banks with more than seven years industry experience.", " Microfinance Consultants ", " who have in the past provided implementation support to financial institutions and are keen to increase their overall technical skills base.", "Individuals from the ", " financial institutions that apply different models in their service delivery ", " e.g. savings and credit cooperatives.", "Past scholars are ", " not eligible to apply.", "How to Apply:", "All interested and eligible individuals should send their ", "Curriculum Vitae", " and duly completed ", "SAM Application Form", " to ", "[email protected]", " ", " with a copy to ", "[email protected]", " before 30th June 2018 for consideration.", "For More Information:", "Visit the Official Webpage of the MasterCard Foundation Microfinance Scholars Program 2018"], "url : https://www.opportunitiesforafricans.com/mastercard-foundation-microfinance-scholars-program-2018/"], [["Western Union Moving Money For Better Scholarships 2018 (Fully Funded to attend the 2018 One Young World Summit in The Hague, The Netherlands)", "date announced:May 10, 2018", "Application Deadline: June 4th 2018"], ["Application Deadline: June 4th 2018", "Western Union", " is a leader in global financial services with the digital and physical capabilities to move money in more than 200 countries and territories. With 32 transactions being made by Western Union every second, the company helped businesses and other customers move more than £150 billion in 2017.", "Western Union believes that when money moves, better things happen. A business expands. A child goes to college. Emergency aid arrives when it’s needed. An economy prospers, an opportunity opens, a community heals and relationships endure.", "Are you passionate about financial inclusion? Are you a problem-solver who believes in finding innovative solutions? ", "The Moving Money For Better Scholarship", " is an opportunity for creative leaders who believe in our purpose of ", "moving money for better", ".", "The", " Moving Money For Better Scholarship", " will allow three leaders passionate about financial inclusion the opportunity to join the Western Union delegation at the 2018 One Young World Summit in The Hague, The Netherlands. During the Summit they will connect with fellow change makers from more than 190 countries!", "Requirements:", "If you are aged 18 – 30 and passionate about financial inclusion and creative solutions, then this opportunity is for you! Successful scholars will demonstrate:", "A passion for creating social impact through financial inclusion", "Leadership", "Creative and innovative problem solver", "Concern for local and global issues.", "Benefits:", "Scholars will receive:", "Access to the One Young World Summit 2018 in The Hague, Netherlands", "Hotel accommodation on a shared basis (inclusive) October 16-20, 2018", "Provisions for additional accommodations may be made for delegates as needed", "The cost of travel to and from The Hague (flights in economy)", "Catering which includes breakfast, lunch and dinner", "Transport between the Summit accommodation and the Summit venue", "Summit hand-outs and support materials", "Discretionary funds to provide for emergency out of pocket expenses whilst in The Hague.", "For More Information:", "Visit the Official Webpage of the Western Union Moving Money For Better Scholarships 2018"], "url : https://www.opportunitiesforafricans.com/western-union-moving-money-for-better-scholarships-2018/"], [["FINCAD Women in Finance Scholarship Program 2018 (US$10,000 for graduate-level studies)", "date announced:May 17, 2018", "Application Deadline: 11:59 PM ET on June 30, 2018."], ["Application Deadline: 11:59 PM ET on June 30, 2018.", "FINCAD", ", the leading provider of enterprise portfolio and risk analytics for multi-asset derivatives and fixed income, is pleased to announce its ", "2018 Women in Finance Scholarship is now accepting applications", ". The goal of the program is to encourage outstanding women in the field of finance, particularly those pursuing careers in the capital markets and/or financial risk management.", "Now in its fourth year, the ", "FINCAD Women in Finance Scholarship Program", " offers an award of US$10,000 to support graduate-level studies to one recipient each calendar year. This program is open to women of any age and citizenship who are studying finance in a graduate-level program at an accredited institution.", "Application:", "The winner will be notified on or before August 15, 2018.", "APPLICANTS SHOULD NOT ATTEMPT TO CONTACT US WITH ANY QUESTIONS ABOUT THE SCHOLARSHIP. All the information you require to apply is included on this page and on the application form. Please keep this page opened for your reference as you are completing the application form.", "We will send all applicants an email publically announcing the scholarship winner once she has been named. This will likely occur in autumn 2018.", "APPLICATION INSTRUCTIONS:", "Please read these instructions in full before beginning your application:", "Applications will be accepted until ", "June 30, 2018 at 11:59 PM ET", ". Late applications will not be accepted.", "Applications are welcomed from female citizens of all countries who are enrolled in a post-graduate program at a university accredited by the national or international body approved for that purpose in the country where the university is situated. You must be enrolled and attending the program on a full-time basis during the 2018-2019 academic year.", "The scholarship will be awarded to a deserving applicant who is enrolled in a post-graduate program with an emphasis on finance, particularly relating to the use of derivatives in capital markets and/or financial risk management. If your field of study does not meet that description, DO NOT APPLY.", "Applications and all supporting documents, except university transcripts must be in English.", "To submit an application you will need to follow the link below and create a user name and password.", "Remember your user name and password. This will enable you to edit and save your application before finally submitting it. If necessary, you may then log back in to continue working on the application later and then submit it.", "Once you submit your application you will no longer be able to edit it.", "The system will provide a prompt to confirm you have submitted your application. That means your application has been submitted and received by us. You will NOT receive a confirmation that we have received it by email.", "Do not attempt to contact us to confirm that we have received your application. Your account will indicate a submission has been received.", "DO NOT SUBMIT MORE THAN ONE APPLICATION.", "DOCUMENTATION REQUIREMENTS", "You will be required to attach a number of documents in the prescribed file format (jpg, pdf or gif) with the prescribed naming convention (Note: Maximum file size is 20 MB). These include: ", "Your resume or CV", "Two letters of reference for the scholarship from appropriate individuals  (e.g., professors or other relevant university staff, work supervisors and colleagues)", "University transcript(s) from undergraduate program(s)", "Confirmation of acceptance or enrollment in the post-graduate program for the 2018-2019 academic year", "Any authored papers (optional)", "FILE NAMING CONVENTION:  ", "{family name}{given name}{document name}.", "{file extension}", "Document Name(s)", "\nCV", "\nLetter1, Letter2", "\nTranscript1, Transcript2", "\nEnroll", "\nPaper", "\neg.", "smithsarahCV.pdf", ", ", "smithsarahLetter1.pdf", ", etc.", "For More Information:", "Visit the Official Webpage of the FINCAD Women in Finance Scholarship Program 2018"], "url : https://www.opportunitiesforafricans.com/fincad-women-in-finance-scholarship-2018/"], [["DAAD Helmut-Schmidt-Programme (Master’s Scholarships for Public Policy and Good Governance) 2019 for Study in Germany (Fully Funded)", "date announced:May 31, 2018", "Application Deadline: July 31st 2018"], ["Application Deadline: July 31st 2018", "The DAAD Helmut-Schmidt-Programme", " is designed to further qualify future leaders in politics, law, economics and administration according to the principles of good governance and to prepare them in a praxis-oriented course for their professional life. Very good graduates with a first university degree get the chance to obtain a master’s degree in disciplines that are of special relevance to the social, political and economic development of their home country.", "The knowledge and experience acquired in Germany should enable the scholarship holders to later contribute to the establishment of democratically oriented economic and social systems aimed at overcoming social differences. With this programme, DAAD intends to contribute to the support of good governance and civil society structures in selected partner countries and regions.", "Requirements:", "The scholarship scheme is open to graduates in the field of social sciences, political sciences, law, economics and in public administration from Africa, Latin America, South Asia, Southeast Asia and Central Asia, from countries in the Middle East as well as from the Ukraine.", "Target Group:", "The programme is open for very well qualified graduates with a first university degree (bachelor or equivalent) who want to actively contribute to the social and economic development of their home countries. It is offered both for young graduates without professional experience and for mid-career professionals.", "Requirements:", "The main DAAD criteria for selection are the following: the study results so far, knowledge of English (and German), political and social engagement, a convincing description of the subject-related and personal motivation for the study project in Germany and the expected benefit when returning to the home country.", "The latest university degree should have been obtained during the six years prior to the application for the scholarship. Applicants cannot be considered if they have stayed in Germany for more than 15 months at the time of the application deadline.", "All master ́s courses have further additional requirements that must be fulfilled by the applicants in any case.", "Benefits:", "The scholarships are awarded for selected master ́s courses at German institutions of higher education listed below. The study programmes starts in September/October 2019. The courses have an international orientation and are taught in German and/or English.", "Prior to their study programmes all scholarship holders receive a 6-months-German language course from April 2019 to September 2019.", "The language courses take place at selected institutes in Germany and usually not at the universities of the selected master ́s courses. The language course is compulsory also for those who attend a master ́s course taught in English.", "The scholarship holders are offered a special tutoring at their host institutions financed by DAAD. Furthermore, there is the possibility to attend networking events. DAAD pays a monthly scholarship rate of currently 850 €. The scholarship also includes contributions to health insurance in Germany. In addition, DAAD grants an appropriate travel allowance and a study and research subsidy as well as rent subsidies and/or allowances for spouses and/or children where applicable.", " Application Procedure:", "Applications have to be submitted in German or English. Please indicate that you are applying for the DAAD Helmut-Schmidt-Programme (Master’s scholarships for Public Policy and Good Governance).", "Please submit your applications for the selected master`s courses and for the DAAD scholarship to the respective universities only (not to DAAD).", "The application period at all 8 universities lasts from June 1st to July 31st 2018.", "Applications sent to the DAAD will not be forwarded to the respective course/university. They become property of the DAAD and will NOT be returned. The applicant has no right to claim for reimbursement.", "You are allowed to submit your application for up to two master`s courses listed below. Please fill in the DAAD application form only once making clear which study course is your first and which is your second priority. Please send this same application form and the necessary documents listed below to the two universities of your choice. In case your application is sent to more than two universities or if non-specific priorities are given your application will not be accepted.", "Furthermore, we would like to point out that only complete applications can be accepted.", "The necessary documents are:", "DAAD application form for research grants and study scholarships (please fill in electronically and not written by hand)", "Hand-signed Motivation letter with current date containing a precise description of the applicant’s academic/professional and personal reasons for choosing this scholarship programme and the universities, two pages maximum", "Hand-signed full curriculum vitae with current date including information about precise field of study and, if applicable, description of job experience", "Copies of acquired university degrees (an explanation of the grading system has to be attached)", "Copies of the transcript of records", "Copy of the school leaving certificate/high school diploma which entitles holders to study at a university in their home country", "Recent language certificates (German and English)", "Two letters of recommendation by university professors and/or current or former employers of recent date, supplemented by signature, official letterhead, stamp (not in a sealed envelope)", "For More Information:", "Visit the Official Webpage of the DAAD Helmut-Schmidt-Programme 2019"], "url : https://www.opportunitiesforafricans.com/daad-helmut-schmidt-programme-masters-scholarships-for-public-policy-and-good-governance-2019/"], [["University of Pretoria LLM/MPhil (Sexual & Reproductive Rights in Africa) Scholarships 2018 for African citizens (Fully Funded to study in South Africa)", "date announced:June 4, 2018", "Application Deadline: July 31st 2018"], ["Application Deadline: July 31st 2018", "The Centre for Human Rights, University of Pretoria", " ", "now offers a LLM/MPhil (Sexual & Reproductive Rights in Africa) degree.", "This two-year programme is offered as a blended learning course comprising of online interaction and residential block-weeks in Pretoria. Two contact sessions will be scheduled every year (four contact sessions over the period of two years).", "The LLM/MPhil (Sexual & Reproductive Rights in Africa) has short-term as well as long-term goals. In the short-term, it aims to secure the following goals:", "to equip the learner with knowledge and understanding of sexual and reproductive health and rights from domestic, regional and global international perspectives", "to equip the learner with research skills in sexual and reproductive health and rights", "to equip the learner with advocacy skills for promoting sexual and reproductive health and rights", "to equip the learner with practical skills for securing the realization of  sexual and reproductive health and rights", "The goals of the Master’s programme go beyond the mere enrichment of the learner. In the long-term, the LLM/MPhil Programme should yield to individuals, and communities in African region and beyond, tangible social benefits, including:", "grooming of leaders with a capacity to influence the social transformation of societies", "raising of public awareness about sexual and reproductive health and rights", "increasing the public understanding of sexual and reproductive health and rights", "enhancing the capacity of groups, networks or organisations that promote sexual and reproductive health and rights and related rights, including  the rights of women and sexual minorities", "advancing the reproductive and sexual health and rights of individuals and communities", "combating discrimination and stigma surrounding sexual and reproductive health and rights", "influencing interventions in sexual and reproductive health and rights national and regional levels", "influencing policy-making in sexual and reproductive health and rights at the national and regional levels", "Requirements:", "The ", "LLM degree", " is open to individuals with a LLB degree or equivalent.", "The ", "MPhil degree", " is open to non-lawyers with at least an honours degree in an academic discipline relevant to sexual and reproductive rights in AfricaOR any other qualification in an academic discipline relevant to sexual and reproductive rights in Africa that allows admission to a master’s programme at the institution where the undergraduate qualification was obtained. If that qualificatio has duration of less than 4 years, substantial proven practical or professional experience in sexual and reproductive rights in Africa, subject to the discretion of the Dean, is further required.", "Scholarships", "UP TO 15 FULL SCHOLARSHIPS ARE AVAILABLE FOR AFRICAN CITIZENS.", "How to apply", "Click here to read about the ", "application process", "Click here to ", "apply online", " (please note – you must create an account on the Submittable platform before you can apply)", "For More Information:", "Visit the Official Webpage of the University of Pretoria LLM/MPhil (Sexual & Reproductive Rights in Africa) Scholarships"], "url : https://www.opportunitiesforafricans.com/university-of-pretoria-llm-mphil-sexual-reproductive-rights-in-africa-scholarships-2018/"], [["Investec Bursary Programmes 2019 for Young South Africans.", "date announced:May 17, 2018", "Application Deadline: August 31st 2018"], ["Application Deadline: August 31st 2018", "Investec", " CSI strategy is aimed at facilitating the empowerment of talented individuals within a defined continuum of interventions including bursaries and other programmes through school and university to the workplace, so that they may realise their potential.", "Investec Teacher Internship Bursary", "A teacher’s influence never ends. Become a teacher today and create a ripple effect across society.", "Start making waves with a full bursary for a Bachelors or Post Graduate Certificate, specialising in Maths and Science.", "Apply Now for the Investec Teacher Internship Bursary", "Investec Tertiary Bursary Programme", "Investec, in partnership with StudyTrust, provides the funding necessary to see young South Africans with academic potential get to university. With our assistance, they are able to study towards financial sector related degrees at various local universities.", " ", "Requirements:", "If you’re a young South African citizen who is committed to their academic achievements but doesn’t have the financial means to study further, we are interested in speaking to you.", "You must, however, hold or be working towards a matric exemption with a minimum of 70% in English and Mathematics (not Maths Literacy) and a 60% pass rate in all your other subjects.", "Investec High School Bursary Programme", "Investec is involved in initiatives that support learners from township and rural schools, who show good academic potential, particularly in the fields of Maths and Science, to attend top performing high schools.", "For More Information:", "Visit the Official Webpage of the Investec Bursary Programmes 2019"], "url : https://www.opportunitiesforafricans.com/investec-bursary-programmes-2019-for-young-south-africans/"], [["Canon Collins Scholarships 2018/2019 for Postgraduate Study in South Africa (Funded)", "date announced:May 29, 2018", "Application Deadline: 23rd July 2018 at 17.00."], ["Application Deadline: 23rd July 2018 at 17.00.", "Canon Collins Trust", " seeks to support exceptional individuals who are committed to social justice in Southern Africa and for whom a postgraduate qualification is an essential tool in working to create an open and just society.", "In 2015 the Trust revised its South African scholarship awards policy. For the next 3 years we will be offering scholarships only to those studying in three areas:", "Justice", ", which includes Law, Economics, Politics and the Environment", "Education", ": policy and practice", "Humanities", ", which includes Literature, History, Anthropology and the Arts", "Applications for courses that are not within these areas (for example MBAs, medical sciences, sports sciences, applied sciences) will be rejected.", "Eligible Requirements:", "In addition, to be considered for a scholarship under this programme you  must:", "be a national of, or have refugee status in, one of the following countries: Angola, Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Swaziland, Zambia, Zimbabwe", "be normally resident in one of the above countries", "be in possession of a good first degree (minimum second class, upper division or equivalent) or about to graduate in the year of application", "be studying or applying to study at a South African university", "Benefits:", "In 2018 most awards will be valued at R70,000 for each year of study at Masters and PhD level. In exceptional cases we may offer up to R100,000 per year. We support both full and part-time study and will consider applications from those who wish to study by distance learning.", "Canon Collins also organise an annual conference for current scholars, and hold several smaller events throughout the year. Scholarship holders are expected to participate in these activities and to become part of and contribute to our network.", "Eligible applicants will automatically be considered for these named scholarships:", "Ros Moger and Terry Furlong", "Sol Plaatje Canon Collins Scholarships", ".​", "For More Information:", "Visit the Official Webpage of the Canon Collins Scholarships 2018/2019"], "url : https://www.opportunitiesforafricans.com/canon-collins-scholarships-2018-2019-for-postgraduate-study-in-south-africa-funded/"], [["National Research Foundation (NRF) Masters and Doctoral Scholarships 2019 for young South Africans", "date announced:May 12, 2018", "Application Deadline: June 15th 2018"], ["Application Deadline: June 15th 2018", "The Department of Science and Technology (DST) and the ", "National Research Foundation (NRF)", " are pleased to announce a call for applications for ", "Masters and Doctoral Scholarships", " for Full-time Studies in 2019.", "In the process of reducing the high volume of applications received yearly, duplication of applications into different programmes and increasing the turnaround time to informing successful applicants, ", "the NRF has consolidated all the Masters and Doctoral scholarship programmes such as DAAD, Extension Support for Masters and Doctoral studies, NRF Freestanding, Innovation, Scarce Skill Development Fund (SSDF), The World Academy of Sciences (TWAS) Doctoral and The Southern African Systems Analysis Center (SASAC) in this framework document", ".", "Requirements:", "These scholarships are open to ", "South African citizens or permanent residents", " as well as a limited percentage of foreign nationals who will register at a South African public university in 2019 on a ", "full-time basis", " only.", "Scholarships are intended to support Masters and Doctoral candidates to pursue research studies in all areas of Science, Engineering, Technology, Social Sciences and Humanities, including Priority Research Areas at public universities.", "Applicants must apply on the NRF Online system at: ", "https://nrfsubmission.nrf.ac.za", " and follow the application process set out in the attached framework document and funding guide. The application deadline is ", "15 June 2018 for funding in 2019.", "Please refer to the framework document when completing the online application form at every step of the process.", "Please note:", "Institutions are required to set their own internal closing dates to enable validation by institutional DAs prior to submission to the NRF for review.", "Should you have any queries with regards to the call requirements or application procedure, please contact an NRF contact person listed below:", "Ms Fulufhelo Malamatsho", "\nProfessional Officer – HICD", "\nTelephone: 012 481 4166", "\nEmail: ", "[email protected]", "Ms Zethu Ntsoane", "\nProfessional Officer – HICD", "\nTelephone: 012 481 4105.", "\nEmail: ", "[email protected]", "Ms Melissa Govender", "\nProfessional Officer: GMSA", "\nTelephone: 012 481 4311", "\nEmail: ", "[email protected]", "Ms Thandeka Mthethwa", "\nProfessional Officer: GMSA", "\nTelephone: 012 481 4163", "\nEmail address:", "[email protected]", "Mr Sello Moloi", "\nProfessional Officer – Reviews and Evaluation (RE)", "\nTelephone: 012 481 4249", "\nEmail: ", "[email protected]", "Mr Sam Sibiya", "\nProfessional Officer – Reviews and Evaluation (RE)", "\nTelephone: 012 481 4307", "\nEmail: ", "[email protected]", "For SASAC related enquiries, please contact:", "Dr Priscilla Mensah", "\nDirector-HICD", "\nTelephone: 012 481 4396", "\nEmail: ", "[email protected]", "For More Information:", "Visit the Official Webpage of the National Research Foundation (NRF) Masters and Doctoral Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/nrf-masters-and-doctoral-scholarships-2018-2019-for-young-south-africans/"], [["Forum for African Women Educationalists (FAWE) Mastercard Foundation Scholarship Program 2018/2019 for women – Uganda", "date announced:May 24, 2018", "Application Deadline: 8th June 2018"], ["Application Deadline: 8", "th", " June 2018", "The Forum for African Women Educationalists Regional Secretariat (FAWE RS)", " ", "with support from the Mastercard Foundation, is implementing through FAWE Uganda Chapter an eight-year (2016—2024) Higher Education Access Program targeting 300 youth (70% female and 30% male) from economically disadvantaged backgrounds and regions of Eastern, Northern and Western Uganda. The overall goal of the program is to enable a total of 300 young women and men from the disadvantaged regions of Uganda to access, transition through higher education and secure employment in sectors that contribute to the development of their home communities.", "This will be achieved through two (2) specific student-focused objectives:", "To provide bursaries to 300 bright students from economically disadvantaged backgrounds in Eastern, Northern and Western Uganda to access and complete higher education; and,", "To provide academic and psycho-social support and facilitate pathways for the students to internships, industrial practice and employment.", "The program is being implemented in partnership with particular institutions: Busitema University; Mbarara University of Science and Technology; Gulu University; Jinja School of Nursing and Midwifery; and, Medical Laboratory Technology Training School, Jinja with 60% of slots dedicated towards degree courses and 40% towards diploma courses.", "FAWE Uganda is pleased to announce the availability of bursaries to support both undergraduate and diploma studies in the academic year 2018/19. The bursaries come with comprehensive financial, academic and social support to participants for the entire duration of their studies. The bursary support is available to those who meet the eligibility criteria below.", "Eligibility Criteria", "The applicant must be aged between 18 and 25 years;", "The applicant must have sat his/her advanced level (S.6) examinations in 2017;", "The applicant must be applying for direct entry into the partner institutions of learning for the academic year 2018/2019;", "The applicant must have been born in and be a resident of any of the 13 programme districts of Bukwo, Buyende, Katakwi, Mayuge, Buliisa, Bundibugyo, Kanungu, Ntoroko, Adjumani, Amudat, Amuru, Kaabong and Pader;", "The applicant must have attended Ordinary or Advanced Level Education in any of the 13 programme districts;", "Applicants who sat their Advanced Level Education (S6) examinations in schools outside their districts of birth but within the specific regions of Eastern, Northern and Western Uganda qualify to apply for the bursaries;", "The applicant must be qualified for admission into the following programme areas of study: Agricultural Sciences, Medical and Health Sciences and Education courses (Science and Literature, degree only);", "The applicant must not be a current beneficiary of any other bursary scheme or scholarship;", "Other vulnerability aspects to be considered include: young people living with disability, HIV/AIDS–infected or affected, orphaned (total or partial); and,", "The Applicant must be willing to give back to his/her community through development services.", " ", "Note: Female applicants from the 13 districts are encouraged to apply", " ", "How to apply", "Application forms will be available at no cost at the offices of the Academic Registrars of the partner institutions of Mbarara University of Science and Technology, Gulu University, Busitema University, Jinja School of Nursing and Midwifery and Medical Laboratory Training School in Jinja.", "Application forms can also be found at the District Education Offices in the 13 Program districts above and FAWE Uganda Office plot 328, Bukoto – Kisasi Road, P.O. Box 24117 Kampala, Uganda or downloaded from the website through the link below: ", "www.faweuganda.org", ".", "Submit a fully filled-in application form to the office of the District Education Officer (DEO), any of the partner institutions or to FAWE Uganda Office.", "The deadline for applications is ", "11", "th", " June 2018", ", after which no applications will be accepted.", "For further enquiry and assistance, please do not hesitate to contact the Program Coordinator on 0782131713, 0759830023.", "Please note that; ", "i.Application forms are free of charge and ", "NO", " fees/ facilitation or intermediaries required at any stage of the selection process.", "ii.Inaccurate information or misinterpretation of any part of the application, falsification or incomplete application and any attempt to influence the process will lead to automatic disqualification or recommendation for dismissal from the program.", "iii.All documents submitted will be subjected to thorough verification including home visits of successful applicants before final approval and award.", "iv.Only shortlisted applicants will be notified at every stage of the selection process which will be conducted by a team of independent Regional Technical Bursary Committees (RBTCs) supervised by FAWE Uganda.", "Deadlines for the Partner Universities", "1.Busitema University- 18", "th", " May 2018", "2.Gulu University- 31", "st", " May 2018", "3.Mbarara University of Science and Technology- 8", "th", " June 2018", "Attachments:", "ApplicationForm.pdf", "[ ]", "619 Kb", "For More Information:", "Visit the Official Webpage of the FAWE Mastercard Foundation Scholarship Program"], "url : https://www.opportunitiesforafricans.com/forum-for-african-women-educationalists-fawe-mastercard-foundation-scholarship-program-2018-2019/"], [["South African SKA project Doctoral and Masters Bursaries 2019 for young Africans", "date announced:June 4, 2018", "Application Deadline: 1st August 2018."], ["Application Deadline: 1st August 2018.", "The ", "South African SKA project", " offers postgraduate bursaries, grants and fellowships to students who excel in their studies and are interested to join research teams at the cutting edge of technology.", "SARAO will consider applications from academically excellent students who wish to undertake postgraduate-level research relevant to the scientific and technical goals of the SKA and MeerKAT radio telescopes, and who are:", "South African citizens, or permanent residents of South Africa; or", "Citizens of Botswana, Ghana, Kenya, Madagascar, Mauritius, Mozambique, Namibia and Zambia.", "Application Procedure:", "Students may apply online at ", "https://skagrants.nrf.ac.za", "Closing date for applications is 1 August 2018.", "For More Information:", "Visit the Official Webpage of the SKA SA Doctoral and Masters Bursaries 2019"], "url : https://www.opportunitiesforafricans.com/south-african-ska-project-doctoral-and-masters-bursaries-2019-for-young-africans/"], [["2018 Google Impact Challenge Kenya for nonprofits and social enterprises (KES 200M grant and training from Google)", "date announced:May 23, 2018", "Application Deadline: 11:59 p.m. EAT on Wednesday, July 4, 2018."], ["Application Deadline: ", "11:59 p.m. EAT on Wednesday, July 4, 2018", ".", "The Google Impact Challenge Kenya", " supports ", "nonprofits and social enterpris", "es with game-changing ideas to create economic opportunity in their communities.", "Organizations apply with their most innovative proposals.", "Your community. Your ideas to make it better. For the first time, the ", "Google Impact Challenge", " is coming to Kenya! The Challenge asks local innovators how they would make their community–and beyond–an even better place. The public and a panel of local Judges vote for the ideas with the most potential, and Google.org pairs each winner with a package of strategic support, funding and Google volunteers.", "Criteria:", "Community Impact: ", "Does the proposed project create economic opportunity in Kenya? Does it improve the lives of people in our country?", "Innovation: ", "Does the project present unexpected solutions to unmet needs?", "Reach: ", "Does it have the potential to scale directly or to serve as a model for other communities? Will its scope grow over time?", "Feasibility: ", "Is the project plan (or business plan) well thought-out, and the team well-equipped to execute on it?", "How it Works:", "Organizations Apply", "Eligible nonprofits and social enterprises submit their proposals to create economic opportunity in Kenya.", "Finalists Selected", "Google and our partners will review applications and select 12 finalists.", "Public Votes", "From the 12 finalists, the public will have three weeks to vote for their favorite idea.", "Final Event and Winners Announced", "All 12 finalists are invited to pitch their ideas to our panel of Judges at a final event. The Judges will select three Challenge winners from these finalists, and also announce the people’s choice winner.", "Benefits:", "Finalists get access to Google.org funding, mentorship and resources.", "Each of the four winners will receive a $250,000 grant and training from Google. The remaining 8 finalists will receive a $125,000 grant.", "Please contact Google at ", "[email protected]", ".", "For More Information:", "Visit the Official Webpage of the Google Impact Challenge 2018"], "url : https://www.opportunitiesforafricans.com/google-impact-challenge-2018/"], [["Prince Albert of Monaco II Foundation Climate Change Masters Scholarships 2018/2019 for study at the University of Edinburg", "date announced:May 30, 2018", "Application Deadline: June 8th 2018"], ["Application Deadline: June 8th 2018", "Seven Masters Scholarships", " are available to applicants enrolled on eligible online distance learning programmes offered by the University in the 2018-2019 academic session.", "Award", "Each scholarship will cover the full fees relating to the Postgraduate Certificate in Climate Change Management. For successful recipients studying towards the MSc Carbon Management programme, the scholarship will cover the Postgraduate Certificate in Climate Change Management component of the masters programme.", "Eligibility", "The scholarships will be awarded to students who are accepted for admission on to the PgCert Climate Change Management (online) or MSc Carbon Management (online).", "Applicants must be resident in the following countries:", "Afghanistan Cuba Indonesia Myanmar Sudan", "\nAlgeria Democratic People’s Republic of Korea Iraq Namibia Suriname", "\nAngola Democratic Republic of the Congo Jamaica Nauru Swaziland", "\nArgentina Djibouti Jordan Nepal Syria", "\nAzerbaijan Dominican Republic Kenya Nicaragua Tajikistan", "\nBahamas Ecuador Kiribati Niger Tanzania", "\nBangladesh Egypt Laos Nigeria Timor-Leste", "\nBelize El Salvador Lebanon Pakistan Togo", "\nBenin Equatorial Guinea Lesotho Palau Tonga", "\nBhutan Eritrea Liberia Papua New Guinea Tunisia", "\nBolivia Ethiopia Libya Paraguay Turkmenistan", "\nBotswana Fiji Madagascar Peru Tuvalu", "\nBurkina Faso Gabon Malawi Philippines Uganda", "\nBurundi Gambia Maldives Rwanda Uzbekistan", "\nCambodia Ghana Mali Samoa Vanuatu", "\nCameroon Guatemala Marshall Islands Sao Tome & Principe Venezuela", "\nCape Verde Guinea Mauritania Senegal VietNam", "\nCentral African Rep. Guinea-Bissau Micronesia Sierra Leone Yemen", "\nChad Guyana Moldova Solomon Islands Zambia", "\nComoros Haiti Mongolia Somalia Zimbabwe", "\nCongo Honduras Morocco South Africa", "\nCôte d’Ivoire India Mozambique Sri Lanka", "Criteria", "The scholarship will be awarded broadly on the basis of academic merit. Candidates must have, or expect to obtain, a UK first class or 2:1 Honours degree at undergraduate level or the international equivalent. Priority will be given to applicants from those nations most at risk from climate change and who are deemed to have the greatest potential to tackle climate change in their home country.", "Applying", "Eligible applicants should complete an online scholarship application", "\nThe scholarship deadline is 8th June 2018", "In order to gain access to the scholarship application system applicants must have applied for admission to the University of Edinburgh. Please note that, following the submission of an application for admission, it can take up to five working days for all system checks to be completed and for access to be granted.", "The online scholarship application form is located in EUCLID and can be accessed via MyEd our web based information portal at https://www.myed.ed.ac.uk", "When logging in to MyEd, you will need your University User Name and password. If you require assistance, please go to http://www.ed.ac.uk/student-systems/support-guidance", "Notification", "\nAll applicants will be notified of the outcome by the end of June 2018.", "For More Information:", "Visit the Official Webpage of the Prince Albert of Monaco II Foundation Climate Change Masters Scholarships"], "url : https://www.opportunitiesforafricans.com/prince-albert-of-monaco-ii-foundation-climate-change-masters-scholarships-2018-2019/"], [["Macedonian Government Undergraduate Scholarships 2018/2019 for foreign students to study in Macedonia", "date announced:May 24, 2018", "Application Deadline: July 31st 2018"], ["Application Deadline: July 31st 2018", "According to the Article 55 paragraph 1 of the Act for the Organization and Operation of the State Administration (“Official Gazette” br.58/00, 44/02, 82/08, 167/10 and 51/11), Article 49 of the Law on students  standard (“Official Gazette of the Republic of Macedonia” no. 15/13, 30/13, 120/13,  41/14, 146/2015, 30/2016, 178/2016 and 64/2018) and Article 1 of the Rulebook on awarding scholarship for foreign students from nationalities which are of interest to the Republic of Macedonia  (“Official Gazette” br.169/13), and the program for realization of the activities in the field of student standard for 2018 (“Official Gazette of the Republic of Macedonia” no. 17/18) the Ministry of Education and Science of The Republic of Macedonia announces this Call for Applications for full ", "undergraduate scholarships,", " for the academic 2018/2018, at the University of Information Science and Technology “St Paul the Apostle” in Ohrid, Republic of Macedonia (www.uist.edu.mk)", "The scholarships are available to candidates, not older than 22 years old who wish to pursue undergraduate studies in one of the following programmes:", "(1) Faculty of Communication Networks and Security (CNS);", "\n(2) Faculty of Computer Science and Engineering (CSE);", "\n(3) Faculty of Information Systems, Visualization, Multimedia and Animation (ISVMA);", "\n(4) Faculty of Information and Communication Science (ICS)", "\n(5) Study Program of Digital Business Informatics (DBI)", "\n(6) Faculty of Applied IT, Machine Intelligence and Robotics (AITMIR) and", "\n(7) Study Program of E-Government, E-Business and E-Culture.", "One full scholarship will be awarded to a candidate from each of the eligible countries: USA, the Organization of American States (OAS), France, Austria, Germany, Poland, Czech Republic, Slovakia, China, Russia, Ukraine, Hungary, Sweden, Denmark, Norway, Lithuania, Latvia, Estonia, Finland, Mongolia, India, Indonesia, Egypt, Morocco, Kazakhstan, Portugal, Cyprus, Spain, Armenia, Belarus, Thailand, Israel, Jordan, Georgia, Romania, and Greece.", "Benefits", "The scholarship provides for", ":", "\n•    full tuition fees;", "\n•    visa and residence permit fees", "\n•    return air fare from the applicant’s home country;", "\n•    accommodation and food (full board) at the University’s dorm “Nikola Karev” in Ohrid, the Republic of Macedonia for 10 months per year, as well as for the months of July and august if the student does not return  home;", "\n•    a monthly allowance of 5,000 MKD (approximately 82 EUR) for 9 months per year;", "\n•    primary healthcare insurance", "The deadline for submission of applications is July 31, 2018", "Application procedure", "\nAll prospective students should note that the application process will be open until 31.07.2018. All students must send their hard copy applications and documents to the address of the Ministry of Education and Science below.", "Required documents", "\nTo complete the application, the candidates are required to provide electronic copies from the following original documents:", "•    Application Form", "\n•    Official high school diploma or certificate (where applicable);", "\n•    Official transcripts;", "\n•    Proof of English proficiency. All students whose first language is not English are required to provide evidence that their spoken and written command of the English language is appropriate for the programme they are applying.", "The required evidence may take the form of either", ":", "1.    Substantial education (minimum 15 months) conducted in English and undertaken no more than two years prior to the date of enrolment", "\n2.    Acceptable English language qualification or test result. The qualification or test results must have been awarded no more than two years prior to the proposed date of enrolment.", "Accepted results are", ":", "\n-Grade C or better in English Language at GCSE / GCEO", "\n– Grade C or better in English First Language at IGCSE", "\n-Grade B or better in English Second Language at IGCSE", "\n-An overall band of 6.5 or better in IELTS", "\n-A score of 550 or better in the paper-based TOEFL (213 for computer-based, 80for internet-based)", "\n-Subscores of 550 or better in Critical Reading and 550 or better in Writing in SAT", "\n-Grade 4 or better in the Higher Level English Language (B Syllabus); or grade 5 or better in the Standard Level English Language (B Syllabus); or grade 4 or better in the Higher or Standard Level English Language (A1 or A2 Syllabus); or grade 4 or better in the Standard Level English – Text and Performance; or grade 4 or better in the Standard Level English – Literature and Performance (A1 syllabus) at International Baccalaureate", "•    Official document certifying the candidate has no criminal convictions and is not under criminal investigation at the moment of application certified with Apostle Stamp. Candidates should note that with the exception to some countries, these are two separate documents;", "\n•    Official general medical report, including medical tests for HIV and Hepatitis C;", "\n•    An electronic copy of the Passport which must be valid for the next 4 calendar years;", "\n•    In addition, as part of the application, the candidates are required to summit contact details from two academic professors/teachers, who will provide letters of recommendation for the candidate. The candidates are advised to notify the professors ahead of time, in order for the references to be submitted within the application deadline. Both letters are confidential. In case they are sent as hard copy documents, they must be sent in a sealed envelope, signed by the originator of the reference across the seal.", "All submitted documents must be in English or certified translations in English.", "Candidates should submit their application together with all supporting documents to the following address:", "Ministry for Education and Science of the Republic of Macedonia", "\nSv. KiriliI Metodij Street, No.54", "\n1000 Skopje", "\nRepublic of Macedonia", "For More Information:", "Visit the Official Webpage of the Macedonian Government Undergraduate Scholarships"], "url : https://www.opportunitiesforafricans.com/macedonian-government-undergraduate-scholarships-2018-2019-for-foreign-students-to-study-in-macedonia/"]]