[[["FAO–Hungarian Government Scholarship 2019/2020 for Study in Hungary (Fully Funded)", "date announced:January 10, 2019", "Application Deadline: February 28th 2019"], ["Application Deadline: February 28th 2019", "Applications are invited for ", "Hungarian Government Scholarship", " to undertake Master of Science degree courses (MSc) at one of the participating universities. The scholarship will cover application and tuition fees throughout the study period, basic books and notes,dormitory accommodation and subsistence costs.", "The objective of the FAO is to lead international efforts to defeat hunger, contributing to an expanding world economy by promoting sustainable rural development with emphasis on the poorest farmers, promoting food production and self-reliance, and raising nutrition levels.", "All of the costs are financed by the Hungarian Government, according to the Agreement between FAO and Hungary in 2007. Scholarship students are entitled to the same health care coverage offered to Hungarian students during the course of the scholarship. The scholarship covers student costs only, family members are not supported within the frame of this programme", "The following ", "Master of Science degree courses", " are being offered in ", "English", " for the ", "2019-20 Academic Year", ":", "MSc in Plant Protection (University of Pannonia)", "MSc in Rural Development and Agribusiness (Szent István University)", "MSc in Agricultural Biotechnology (Szent István University)", "Universities", "The following universities and faculties are participating:", "University of Pannonia, Georgikon Faculty", "Szent István University, Faculty of Economics and Social Sciences ", "Szent István University, Faculty of Agricultural and Environmental Sciences", "Conditions ", "Courses will be offered provided the minimum number of students is reached.", "The scholarship will cover:", "application and tuition fees throughout the study period with basic books and notes; ", "dormitory accommodation; ", "subsistence costs;", "health insurance.", "All of the above mentioned costs are financed by the Hungarian\nGovernment, according to the Agreement between FAO and Hungary in 2007.", "The scholarship covers student costs only; family members are not supported within the frame of this programme.", " ", "List of eligible countries", "Residents (who must be nationals) of the following countries are eligible to apply for the Scholarship Programme:", "Afghanistan,\nAlbania, Algeria, Angola, Azerbaijan, Armenia, Bangladesh, Belarus,\nBosnia and Herzegovina, Burkina Faso, Cambodia, Chad, Egypt, Ethiopia,\nGambia, Georgia, Ghana, Jordan, Kazakhstan, Kenya, Kosovo*, Kyrgyzstan,\nLaos, Lebanon, The former Yugoslav Republic of Macedonia, Madagascar,\nMali, Myanmar, Moldova, Mongolia, Montenegro, Namibia, Nigeria,\nNorth-Korea, Palestine, the Philippines, Serbia, Somalia, South-Sudan,\nSudan, Tajikistan, Turkmenistan, Uganda, Ukraine, Uzbekistan, Vietnam,\nYemen.", "*References to Kosovo shall be understood to be in the context of Security Council Resolution 1244 (1999).", "Application and selection process", "The selection process as described below applies to scholarships beginning in September 2019.", "Student selection will take place in two phases:", "Phase 1:", " FAO will pre-screen candidates and submit\napplications to the Ministry of Agriculture of Hungary that will send\nthem to the corresponding University as chosen by the applicants.\nStudents must submit only COMPLETE dossiers. Incomplete dossiers will\nnot be considered. Files without names will not be processed.", " ", "Phase 2:", "\nSelected candidates may be asked to take a written or oral English\nexamination as part of the admission procedure. The participating\nUniversities will run a further selection process and inform each of the\nsuccessful candidates. Student selection will be made by the\nUniversities only, without any involvement on the part of FAO. Selected\nstudents will also be notified by the Ministry.", "Candidates will be selected on the basis of the following ", "criteria", ":", "Citizenship and residency of one of the eligible countries ", "Excellent school achievements", "English language proficiency (for courses taught in English)", "Motivation", "Good health", "Age (candidates under 30 are preferred)", "For More Information:", "Visit the Official Webpage of the FAO–Hungarian Government Scholarship 2019/2020"], "url : https://www.opportunitiesforafricans.com/fao-hungarian-government-scholarship-2019-2020/"], [["University of Nottingham Faculty of Engineering Research Excellence PhD Scholarship 2019", "date announced:January 9, 2019", "Application Deadline:8 March 2019."], ["Application Deadline:", "8 March 2019.", "Do you want to be part of Britain’s global university*?", "This highly competitive scholarship is to recognise and reward applications from outstanding international students registering on Engineering research degree programmes.", "In 2019, University of Nottingham is offering full tuition fee scholarships plus a stipend of £1,015 per month for a three-year full-time PhD research degree programme", "Eligibility Requirements:", "University of Nottingham is looking for applications from exceptional students who are seriously committed to pushing the boundaries of engineering, students who are excited about the prospect of working with some of the world’s leading researchers and who aspire to be the best in their profession. ", "The high value of this award reflects the University’s aim to attract the best students from around the world and to support them during their study.", "You can apply for this scholarship if you:", "are classed as an overseas student for fee purposes ", "AND", "already hold an offer to start a full-time PhD research degree\nprogramme at our Nottingham campus with a start date that falls between\n01 October 2019 and 01 February 2020 (inclusive) in the Faculty of\nEngineering ", "AND", "have a first-class undergraduate degree or an MSc with distinction\nin a relevant subject; work experience, journal papers published and\nother esteem indicators (prizes, top-in-class etc.) will be considered", "It is important that you state on your scholarship application the\nspecific topic you are interested in researching and why. Applications\nlisting broad fields of research eg ‘civil engineering’ or ‘mechanical\nengineering’ rarely get supported.", "For More Information:", "Visit the Official Webpage of the University of Nottingham Faculty of Engineering Research Excellence PhD Scholarship 2019"], "url : https://www.opportunitiesforafricans.com/university-of-nottingham-faculty-of-engineering-research-excellence-phd-scholarship-2019/"], [["Orascom Construction Onsi Sawiris Scholarship Program 2019/2020 for Egyptians to Study in USA (Fully Funded)", "date announced:January 4, 2019", "Application Deadline: July 31st 2019"], ["Application Deadline: July 31st 2019", "Orascom Construction", " launched the ", "Onsi Sawiris Program", " ", " in the year 2000 to invest company resources in educational programs to improve the communities in which it works. Through the Onsi ", "Sawiris Scholarship program", ", OC provides full tuition scholarships for Egyptian undergraduate students seeking to pursue their Bachelor’s degree in fields that will enhance the economic prosperity of Egypt at prestigious universities in the United States. ", " The Onsi Sawiris Scholarships will be awarded based on character and merit as demonstrated through academic excellence, extracurricular activities, and entrepreneurial initiative. ", "\nBenefits", "The scholarships include full tuition, a living\nallowance, travel and health insurance.Scholarship recipients will also\nbe given the option of an internship position within the company.\n", "Eligibility Requirements", " GPA 3.5 / 90% in Thanaweyya Amma certification (Secondary year) or equivalent certificates TOEFL iBT: 100 or above [or equivalent] ", "Minimum SAT I Score", ": ", " 1450", " SAT II in 3 subjects: 600 or above Extracurricular Activities Fields of Study: ", "Engineering, Economics, Political Science, Finance and Management. Candidates should: Meet the above criteria ", "Be planning to start their studies in the U.S.A in the year 2020", "Be Egyptian nationals, who are residents of Egypt (preference will not be", " given to dual nationality applicants) ", "Have not lived more than 3 years abroad Be committed to coming back to Egypt for two years directly after the", "successful completion of their bachelor’s degree ", "Important notes:", " Preference will be given to candidates who have not lived, worked, or studied abroad for a significant period of time. The Onsi Sawiris Scholarship Program is only granted to the list of endorsed ", "universities provided in the “", "Approved Universities", "” ", "section of the application. Selection as a nominee for the Onsi Sawiris Scholarship Program does not guarantee university acceptance.", " Applicants will be supported in applying for these universities. If nominated for the scholarship; the Onsi Sawiris Scholarship Program award will be made once university acceptance is obtained. Please submit: Application form ", "Resume ", "Copy of test scores (SAT I / or SAT II) & TOEFL iBT Copy of transcripts ", "Copy of graduation certificate or Thanaweyya Amma certificate (if available) Two recommendation letters  For Inquiries, please contact us at: E-Mail:", "[email protected]", " ", " ", "For More Information:", "Visit the Official Webpage of the Onsi Sawiris Scholarship Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/orascom-construction-onsi-sawiris-scholarship-program-2019-2020/"], [["Foskor Bursary Program 2019 for Graduate Engineering Studies in South Africa.", "date announced:January 5, 2019", "Application Deadline: January 25th 2019"], ["Application Deadline: January 25th 2019", "Foskor,", " the leader in Phosphate beneficiation, as well as an employer of choice, offers exceptional bursary opportunities to talented and deserving students of all race and gender groups for study at a recognized South African University.", "Requirements", "Applicants must meet with the following criteria", "Grade 12 with Mathematics and Science on Higher Grade – 50%", "\n(Undergraduates who are currently studying full time, without a bursary at a recognised South African University in the fields listed below, may also apply:", "Bursaries are for B Degrees ONLY in the following Fields of Engineering:", "Mechanical Engineering", "\nEnvironmental Science", "\nLaw / LLB", "\nChemical Engineering", "\nMining Engineering", "\nElectrical Engineering", "\nChemistry", "\nElectronic Engineering", "\nInstrumentation Engineering", "Applications should contain the following documentation", "Summarised Curriculum Vitae – 1 Page (including contact details)", "\nCertified copy of Grade 12 certificate", "\nCertified copy of your ID document", "\nRegistration of document from a University stipulating field of study", "Applications, including all necessary documentation and quoting reference FOSB2019, should be faxed", " to 035 902 3321/015 789 2364 or via e-mail to ", "[email protected]", "Closing Date for Application : January 25th 2019", "If you have not been contacted by 28th February 2019", " pleas assume that your application was unsuccessful", "For More Information:", "Visit the Official Webpage of the Foskor Bursary Program 2019 "], "url : https://www.opportunitiesforafricans.com/foskor-bursary-program-2019-for-graduate-engineering-studies-in-south-africa/"], [["Call for Application: 2020 Oprah Winfrey Leadership Academy for Girls – South Africa", "date announced:January 14, 2019", "Application Deadline: 15 February 2019."], ["Application Deadline: ", "15 February 2019.", "The Oprah Winfrey Leadership Academy for Girls", " provides students in ", "Grades 8 through 12", " with an opportunity to develop their  full intellectual, social and leadership potential. To be eligible, girls must be South African, demonstrate academic and leadership potential, and come from a disadvantaged background.   ", "The Oprah Winfrey Leadership Academy for Girls – South Africa ", "is a female boarding school founded in January 2007 and located in Johannesburg, South Africa. The academy was founded by ", "Oprah Winfrey", " ", "with the goal of providing educational and leadership opportunities for academically gifted girls from impoverished backgrounds. ", "Admission criteria for 2020", "Scholarship applications for 2020 open on 14 January 2019 and close\non 15 February 2019. Only applications for grade 8 2020 will be\naccepted. All other grades at the Academy have reached their capacity.\nIf you have not heard from the Academy by 15 March 2019 your application\nhas not been successful.", "Students qualify for a scholarship if:", "they are academically talented and have leadership potential", "they are a South African Citizen or permanent resident", "their family or household total income before deductions is less than R10 000 per month", "they are currently in Grade 7", "Application forms are available for download here. An electronic (fill-able form) and printable version are available", "ADMISSION PROCEDURE", "Terms and conditions apply. No correspondence will be entered into. The Academy’s Selection Committee’s decision is final.", "The Selection Process", "Once all applications have been received and screened, testing will\nbe arranged for those applicants who meet the criteria. There are\nseveral stages to the selection process:", "Stage 1: Entrance tests", "Applicants who meet the initial criteria will be invited to write\nentrance tests, which will be held at a number of different venues\nthroughout South Africa.", "Stage 2: More extensive testing – academic and leadership potential", "Further selection and more extensive testing of academic and leadership potential will follow.", "Stage 3: Selection camps – clinical interviews and a range of psychological assessments", "Final selection camps, lasting 2 or 3 days, will be held at the Academy later in the year.", "Stage 4: Home visits and registration", "All successful students will be registered at their homes at the end of the process.", "For More Information:", "Visit the Official Webpage of the 2020 Oprah Winfrey Leadership Academy "], "url : https://www.opportunitiesforafricans.com/2020-oprah-winfrey-leadership-academy-for-girls/"], [["The FirstRand Laurie Dippenaar International postgraduate study Scholarships 2019 for young South Africans", "date announced:January 11, 2019", "Application Deadline: February 21st 2019"], ["Application Deadline: February 21st 2019", "The FirstRand Laurie Dippenaar Scholarship", ",", " to the value of R825, 000 is available to South African citizens for postgraduate study outside South Africa in any discipline at an international university of their choice.", "The successful candidates will have excelled academically in their chosen field and will have been able to demonstrate:", "Leadership qualities;", "\nstrength of character", "\ncommunity involvement, and", "\nthe potential to be a destiny changer in his or her chosen field", "Preference will be given to candidates under the age of 35", " Candidates who are currently, or have been studying overseas, will not be considered for this scholarship.", " Successful candidates are required to return to South Africa for at least five years after completing their studies", " what makes this scholarship different from most is not only the personal interest which Laurie Dippenaar takes in the selection process, but also his interest in the ongoing progress of the recipients.", " 2019 will the 13th year that this prestigious scholarship will be awarded.", "For More Information:", "Visit the Official Webpage of the FirstRand International postgraduate study Scholarships 2019"], "url : https://www.opportunitiesforafricans.com/the-firstrand-laurie-dippenaar-international-postgraduate-study-scholarships-2019/"], [["Abel Visiting Scholar Program 2019/2020 for Mathematicians from Developing Countries (Fully Funded & USD 5,000/Grantee)", "date announced:January 6, 2019", "Application Deadline: December 31st 2019"], ["Application Deadline: December 31st 2019", "The International Mathematical Union Abel Visiting Scholar Program", " ", "invite applications from mathematicians professionally based in developing countries to visit an international research collaborator ", "for a period of one month – ", "In case the length of the visit exceeds one month, the candidate\nshould provide evidence of financial support from the host institution\nto cover the living expenses beyond the first month.", "The program is designed for post doctoral mathematicians in the early\nstages of their professional careers. It is designed to offer the\nopportunity for a ‘research sabbatical,’ a necessary complement to\nteaching and other academic duties for mathematicians desiring to also\nsustain a viable research program.", "Requirements", "Applicants must", "     1.   hold at the time of application a PhD ", "in Mathematics", ",", "     2.   be based in ", "a developing country", " at the time of application", "     3.   ", "hold a position in a university/ research institution", "     4.   be in the ", "early stages of their professional careers", ", more precisely: the applicants  should", "            4. 1) not yet be of full professorial rank but have a working contract in a university/ college", "            4. 2) be under 40 years of age at the day of the application deadline.", "The maximum age may be increased by up to three years in the case of an individual with a broken career pattern", ". This should be noted in the application together with the reason for the broken career pattern.", "Applications from women mathematicians are strongly encouraged.", "Grant Details:", "The grant can cover ", "for one month and only for the applicant up to 4,400 EUR (5,000 EUR):", "Travel costs\n", "from the place of work of the applicant to that of the host to the extent of economy class airfare. ", " The flight will be booked and directly paid by the IMU Secretariat.", "(Public) transport (surface transport by rail or bus between the\nnearest city where the airport is located and the headquarters of the\ncandidate or the city/town where the host institution is located, if\nnecessary). Maximum four (4) Taxi fares (on submission of receipts) may\nbe allowed to travel between the home and the airport/railway station\n(upon arrival and departure).", "In case the applicant has to stay in a hotel before departure or\nupon arrival, this needs to be mentioned in the budget details. Maximum\none (1) night (both arrival and departure) can be paid from the grant.", "Visa fees", "Travel insurance charges ", "Basic living cost  (daily allowance based on living cost of the\nvisiting country/city, This amount includes the cost for public\ntransport and all other living costs). ", "For a list please go here", ".", " If the accommodation includes breakfast or any other meals, the daily amount will be reduced.", "Accommodation cost in the host country (hotel is allowed if the\nhost provides a statement that no guesthouse or rented flat is available\nand max. 4 weeks. If you stay longer than 4 weeks you have to rent a\nsuitable apartment or guesthouse). Receipts for ", "cash payments for accommodation costs can not be accepted!", " You have to pay via a trackable transfer method.", "All invoices for travel cost, visa, insurance, accommodation\nand up to four taxi receipts and all boarding tickets have to be kept\nby the grantee and be sent (original) to the CDC/ IMU Secretariat by\nregular mail. ", "Deadlines:", "Applications must be received at least four months before the desired\nstarting date. The selection committee will review the applications and\naward fellowships every four months. The result is annouced on the ", "Abel Visiting Scholar 2017 Recipients page.", "The following deadlines apply:", "August 31, 2018 is for visits during January 1 – April 30, 2019", "December 31, 2018 for visits between May 1 and August 31, 2019", "April 1, 2019 for research visits between September 1, 2019 – December 31, 2019", "If your application is not complete by the deadline, it cannot be considered for the evaluation round.", "Please send your application at least one week in advance for us to review", "Application Procedure:", "Each application must include:", "The completed ", "Online Application Form", "A curriculum vitae of applicant and host, including a list of recent publications (max. 3 pages each)", "A research plan for the visit", "An official invitation from the institution of the international research partner", "One letter of recommendation ", "If the letter of\nrecommendation is not written by the international research partner (the\nhost), the application should include a statement from the host\napproving the research plan.", "A copy of the PhD certificate", "A statement about the current employment status/ position in the\nhome institution signed and stamped by your employer. The statement\nshould include the duration of your employment. ", "Please use the template attached.", "A budget estimation. Please, use the ", "Tentative Budget Form", ". (for more information see ‘Financial Support’)", "A picture of you for our website (upload separately to the Online\nApplication Form) (The picture will be published on our website (like\nthis: https://www.mathunion.org/cdc/grants/research-travel-grants/abel-visiting-scholar-program/abel-visiting-scholar-2018)\nif the applicant is chosen, so PLEASE upload a NICE picture in good\nquality!)", "In case you are planning to stay for more than one month\nyou must attached a proof of the matching funds for your living costs\nfrom the host institution", "Please merge all required documents (except the picture of\nyou) into one (1) PDF file and upload it in the Online Application Form.", "For More Information:", "Visit the Official Webpage of the Abel Visiting Scholar Program 2019/2020"], "url : https://www.opportunitiesforafricans.com/abel-visiting-scholar-program-2019-2020/"], [["Eni Scholarships 2019/2020 for Africans to study in the University of Oxford, United Kingdom (Fully Funded)", "date announced:January 1, 2019", "Application Deadline:Deadline to Apply to Oxford University – 11th or 25th January 2019Deadline to Apply for Eni Scholarship – Friday 16th March 2019"], ["Application Deadline:", "Deadline to Apply to Oxford University – 11th or 25th January 2019", "Deadline to Apply for Eni Scholarship – Friday 16th March 2019", " ", "St Antony’s College, University of Oxford", ",", " in partnership with the international integrated energy company ", "Eni", ", is offering up to three students from Angola, Ghana, Mozambique, Nigeria, or the Republic of the Congo (Congo-Brazzaville) the opportunity to study for a fully funded degree in 2019/20. ", "This scholarships will allow St Antony’s to admit up to three of the\nbest African students irrespective of means and will add immeasurably to\nthe diverse and intellectual character of the College. This is part of a\njoint initiative between Eni & St Antony’s College to invest in and\nstrengthen African leadership.", "St Antony’s and Eni are equally keen to provide encouragement and where possible, structured incentives for Eni Scholars to continue their studies or find useful employment back in their home country after graduating from Oxford. Discussions about this are ongoing and scholars will be informed of relevant contacts and partnerships as they emerge.", "Eligibility:", "The scholarships are open to applicants who are ", "ordinarily resident in Angola, Ghana, Mozambique, Nigeria, and the Republic of the Congo (Congo-Brazzaville)", ". Preference will be given to applicants whose first degree is from an African university.", "The scholarships will be awarded on the basis of both ", "academic merit and potential and financial need", ".\nPreference will be given to applicants who have clear ambitions to use\ntheir accumulated learning to benefit their home country after\ngraduation.", "Please ensure you meet the requirements for entry to your course,\nincluding English language requirements. See the University’s course\nguide for more information.", "Applicants must apply for admission to one of the following eligible courses:", "1 year Master’s courses", "MSc African Studies", "MSc Economic & Social History", "MSc Economics for Development", "MSc Global Governance and Diplomacy", "Benefit", "100% of university and college fees, and an annual grant for living\ncosts of £14,553 for 12 month courses and £10,915 for 9 month courses.\nThe stipend for courses with different durations will be adjusted\naccordingly. ", "The scholarship also covers one economy return airfare from your home country to the UK at the start and end of your course.", "Application Procedure:", "In order to be considered for the scholarship, please follow these three steps:  ", "Read the information on this webpage carefully.   ", "Apply online to the University of Oxford", "\nfor one of the eligible courses as listed above. You must submit your\napplication for graduate study to the University by the January deadline\n(", "11 or 25 January 2019", " depending on the programme you\napply to – please check the University’s guidance on application\ndeadlines) and you must have secured a place on your chosen programme of\nstudy by the expected final decision date (", "16 March 2018", ").\nIt would help if you select St Antony’s College in the college choice\nsection of the application form, though this is not compulsory.", "Once you have applied to the University, please ", "complete the online Eni Scholarship application form", " (available at: ", "https://weblearn.ox.ac.uk/direct/eval-evaluation/16740", ")  The deadline for submission of the form is 12 noon, UK time, on ", "Friday 15 March 2019", ".", "For More Information:", "Visit the Official Webpage of the Eni Scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/eni-scholarships-2019-2020/"], [["Dancing on the Edge Scholarship Programme 2019 for Dancers from Middle East and North Africa, The Netherlands (Fully Funded)", "date announced:January 7, 2019", "Application Deadline: February 15th 2019. "], ["Application Deadline: February 15th 2019. ", "DOTE is calling the new generation of contemporary ", "dancers from the Middle East and North Africa (MENA region) ", "for the ", "Dancing on the Edge Scholarship Program 2019", ".", " Dancing on the Edge (DOTE) offers scholarships to young talent from the MENA region to attend a three-week summer dance workshop program in Amsterdam, taking place from 6 – 26 July 2019.", " ", "DOTE is the only organization in The Netherlands solely devoted to stimulating artistic exchange in the fields of contemporary dance, theater, and multi-media with the MENA region. The scholarship is offered in collaboration with the ", "Henny Jurriëns Studio (HJS)", ". HJS is the most prominent dance-training institute for professional level dancers in The Netherlands. DOTE and HJS have been collaborating since 2012 offering scholarships. ", "Dancing on the Edge Scholarship Program ", " ", "The scholarship allows dancers to participate in the ", "Amsterdam Summer Intensive.", " For three weeks (from 6-26 July), dancers can take technique classes and participate in workshops, taught by teachers representing the most important companies and styles in today’s contemporary dance world. These include Akram Khan, Kidd Pivot (Crystal Pite), Peeping Tom and Eastman/Sidi Larbi Cherkaoui, and many others. The program is an ideal opportunity for dancers to study in an international atmosphere together with other professionals and professionally oriented dancers. Dancers can also attend performances from the cutting-edge Julidans Festival, which takes place at the same time.  ", "The DOTE Scholarship Program ", "covers travel and visa expenses, accommodation, program fees, and some performance tickets. There is no per diem: participants are expected to pay for their own living and other expenses. They should also pay their own travel/health insurance.  ", "Eligibility", " ", "Dancers applying must", "come from (and be at least partly based in) an Arab country or Iran ", "have at least some (and preferably substantial) training and performance experience in contemporary dance ", "be no older than 27 years ", "be capable of travelling and living independently for this period ", "have enough resources to pay for food and other living expenses that may occur in this period ", "have or be able to acquire health/travel insurance for this period ", "arrange their own visa if necessary (with the help of organizing parties) ", "How to apply:", "Applications happen through ", "this", " form. Please submit your filled in form before February 15th 2019.", "For questions, please write to: ", "[email protected]", " ", "For More Information:", "Visit the Official Webpage of the Dancing on the Edge Scholarship Programme 2019"], "url : https://www.opportunitiesforafricans.com/dancing-on-the-edge-scholarship-programme-2019/"], [["FIG Foundation PhD Scholarships 2019 for Surveying/Geomatics PhD Candidates ( 4,000 euros grant)", "date announced:January 2, 2019", "Application Deadline: 15th February 2019"], ["Application Deadline: 15th February 2019", "The FIG Foundation ", "will be providing scholarships of up to 4,000 euros to PhD students.", "Applicants shall:", "be studying for a PhD degree and registered solely in a surveying/geomatics academic programme that teaches surveying", "[1]", " in a country listed by the World Bank as a low-income, lower-middle or upper-middle income economy", "[2]", ",", "must have had a paper accepted by a peer reviewed international journal based on their doctoral research project; applicants should be the lead author, and the paper should be co-authored with their supervisor,", "should not have submitted their final thesis at the application deadline.", "Benefits:", " Successful applicants will qualify for a further grant of up to 3,000 euros to attend and present a peer reviewed paper at a FIG conference. ", "Application Procedure:", "Applicants should submit the following set of documents in English in the\norder set out below as a single file in PDF format on A4 size paper:", "A cover sheet showing the candidate’s personal details and those of\nhis/her institution.", "A 200 word abstract. This should be written in terms understandable\nto the lay person; similar to a press release and which the FIG\nFoundation could actually use as a press release in the event of a\nsuccessful application.", "A one page research proposal as per the template below on A4 size\npaper. Note that the one page limit will be strictly enforced; material\nthat extends beyond one page will be deleted.", "A copy of the paper that has been re-submitted to the journal after\ncorrections have been completed.", "A letter from the editor of the journal indicating that the paper\nhas been accepted and that the necessary corrections have been completed\nsatisfactorily.", "The journal paper’s referees’ reports. ", "A list of peer reviewed journal publications over the last 6 years\nusing the International Journal of Geographical Information Science\n(IJGIS) reference list format. See Notes for Authors on the IJGIS\nwebsite.", "A list of research funding obtained over the past 5 years,\nindicating which grants are peer reviewed or not.", "A description of research compliance, the research account and\nactivity auditing structures and processes in their institution. For\nexample, if a scientist spends money inappropriately, are there\nstructures in place to refund the granting agency?", "A copy of the ethics approval notice for the research from the\ninstitution if that is relevant to the grant application. If ethics\nclearance is not required, then this should be stated in the\napplication.", "A budget indicating how the funds will be spent and a one page\njustification of the budget. Note that as a general rule, equipment will\nnot be funded. Travel to FIG Conferences to present results and tuition\nfees may be included in the budget. Per diems for field work will not be\nfunded, but reasonable actual costs of field work are refundable.", "For More Information:", "Visit the Official Webpage of the FIG Foundation PhD Scholarships 2019 "], "url : https://www.opportunitiesforafricans.com/fig-foundation-phd-scholarships-2019/"], [["Nordic Africa Institute’s African Guest Researchers’ scholarships 2019/2020 for Africa-based researchers", "date announced:January 14, 2019", "Application Deadline: April 1st 2019"], ["Application Deadline: April 1st 2019", " One of the ", "Nordic Africa Institute’s ", "Strategic goals is to contribute to building capacity in the production of knowledge about Africa. The purpose of the ", "African Guest Researchers’ Scholarship Programme", " is to provide opportunities ", "for Africa-based researchers ", "with a PhD to work and develop their ongoing research at the Nordic Africa Institute. The scholarship offers access to the Institute’s library and other resources that provide for a stimulating research environment.  Through the programme, the Nordic Africa Institute can promote and establish relations with and between African and Nordic research communities.    ", "Requirements:", "The scholarship programme is directed at postdoctoral researchers\nbased in Africa and engaged in Africa-oriented research within the\ndisciplines of Social Sciences and Humanities. The applicant should be\naffiliated to an African university/research center and have a proven\ntrack record of extensive research experience.  ", "The Institute strives to achieve a fair distribution of scholarship positions in regards to gender and geographic focus.", "Financial", " ", "support and other benefits", "The scholarship includes a return air-fare (economy class),\naccommodation, a subsistence allowance of 400 SEK (approx. 45 USD) per\nday plus an installation grant of 2,500 SEK (approx. 280 USD) and access\nto a workspace (including computer) in a shared office at the\nInstitute.", "The maximum duration of the stay is 90 days, minimum is 60\ndays. Please note that the subsistence allowance will be provided only\nfor the days spent in Uppsala", ".", " Also note that most academic\ninstitutions in the Nordic countries, including the Nordic Africa\nInstitute, are closed or at least running at a reduced capacity during\nthe periods 15 June–15 August and 15 December–15 January. Applicants can\nthus not choose these periods for their visit.", "The Institute’s library is specialized in literature on contemporary\nAfrica and focuses on Social Sciences. Furthermore, Guest Researchers\nhave access to the Uppsala University Library and to the Library of the\nSwedish University of Agricultural Sciences.", "Guest Researchers have the possibility to present their research at\nthe Nordic Africa Institute and to visit other institutions in the\nNordic countries.", "The application should contain", "Application form", "Up-to-date CV", ", including list of publications (if available online, please include links)", "Outline of research project", ", 5 pages:", "\n– A well elaborated research proposal; the research topic must relate to ", "the thematic research areas of the Institute", " as outlined in ", "the Strategy 2017 – 2021", ",", "\n– A work plan, including expected results, specific for the time spent at the Institute", "Reference", ": A signed letter of support from the applicant’s\nHead of Department or other senior scholar in the same field,\nwhich confirms current affiliation and field of research. (Scanned\nversions of signed support letters can be emailed by the applicant).", "Please note that incomplete applications will not be considered.\nPersons currently or previously employed by or otherwise professionally\naffiliated with the Nordic Africa Institute are not eligible for\nscholarships. Kindly also note that the application must be in\nEnglish. In the extraordinary event that the Scholarship Programme for\n2020 does not receive full funding, applicants will be informed\nimmediately.", "Submission of applications", "Applications including all supporting documents should be sent by e-mail to:", "Annika Franklin, Research Administrator, e-mail: ", "[email protected]", "Please note", ": On the subject line of your email, write: “Application: Guest Researchers’ Scholarship Programme”.", "Deadline for applications", "The application should be submitted by ", "1 April 2019", ".", "Further information ", "Annika Franklin, ", "annika.franklin", "@nai.uu.se", ", phone +46 (0)18 471 52 45.", "For More Information:", "Visit the Official Webpage of the Nordic Africa Institute’s African Guest Researchers’ scholarships 2019/2020"], "url : https://www.opportunitiesforafricans.com/nordic-africa-institutes-african-guest-researchers-scholarships-2019-2020/"], [["TaiwanICDF’s International Higher Education Scholarship Program 2019 for study in Taiwan (Fully Funded)", "date announced:January 1, 2019", "Application Deadline: March 15, 2019. "], ["Application Deadline: March 15, 2019. ", "International education and training has long been one of the ", "TaiwanICDF’s", " core operations, among many others. Human resources development programs play a vital role in assisting partner countries achieve sustainable development, and education is a crucial mechanism for training workforces in developing countries. The TaiwanICDF provides scholarships for higher education and has developed undergraduate, graduate and Ph.D. programs in cooperation with renowned partner universities in Taiwan. ", "Scholarship Benefits", "Entitlements: The TaiwanICDF provides each scholarship recipient with a full scholarship, including return airfare, housing, tuition and credit fees, insurance, textbook costs and a monthly allowance. ", "Eligibility Requirements:", "An applicant must: ", "Be a citizen of a country on the List of Countries Eligible for TaiwanICDF Scholarship, and satisfy any specific criteria established by his or her country and/or government of citizenship.", "Neither be a national of the Republic of China (Taiwan) nor an overseas compatriot student.", "Satisfy the admission requirements of the partner university to which he or she has applied to study under a", " TaiwanICDF scholarship.", "Be able to satisfy all requirements for a Resident Visa (Code: FS) set by the Bureau of Consular Affairs, Ministry of Foreign Affairs, and an Alien Resident Certificate (ARC) set by the Ministry of the Interior, of the ROC (Taiwan) government (this means that the TaiwanICDF has the right to revoke a scholarship offered if an applicant cannot satisfy the visa requirements).", "Upon accepting a TaiwanICDF scholarship, not hold any other ROC (Taiwan) government-sponsored scholarship (such as the Taiwan Scholarship) in the same academic year in which the TaiwanICDF scholarship would be due to commence.", "Not be applying for another TaiwanICDF scholarship in unbroken succession—to apply for a 2018 scholarship, applicants who have already held a TaiwanICDF scholarship, MOFA’s Taiwan Scholarship or an MOE scholarship must have graduated before July 31, 2017.", "Have never had any scholarship revoked by any ROC (Taiwan) government agency or related institution, nor been expelled from any Taiwanese university.", "Note: All Undergraduate Programs only accept applications submitted by citizens of allied countries of ROC(Taiwan).", "Application Procedure", "The annual application period runs, in principle, from January 1 to March 15. For 2019 Scholarship program, the application period runs from January 1 to March 15, 2019.", "Applicants\nshould submit the documents listed below to the ROC (Taiwan) Embassy/\nConsulate General/ Representative Office in their country. Applicants\nmust ensure that they submit accurate and complete documentation;\nfailure to do so will result in the application not being processed. ", "Please\nalso note: 1. Late submissions will not be accepted and/or processed.\n2. All Undergraduate Programs only accept applications submitted by\ncitizens of allied countries of ROC(Taiwan). ", " ", "A photocopy of applicant’s passport or other document showing proof of nationality.", "A photocopy of applicant’s highest-level diploma and academic transcripts.", "A photocopy of applicant’s English proficiency certificate. ", "Please\nnote: This means a TOEFL test score or that of another recognized\nEnglish proficiency exam, or documents certifying that the applicant has\ngraduated from a program where all courses were taught in English.\nApplicants who are unable to provide such proof of English proficiency\ndue to special circumstances may be assessed for English proficiency by\nan ROC (Taiwan) Embassy/ Consulate General/ Representative Office via\ninterview or other forms of testing. Applicants whose official national\nlanguage is English are exempt from needing to supply these documents. ", "Two letters of reference.", "Any other documents specifically requested by an ROC (Taiwan) Embassy/ Consulate General/ Representative Office. ", "For More Information:", "Visit the Official Webpage of the TaiwanICDF’s International Higher Education Scholarship Program 2019 "], "url : https://www.opportunitiesforafricans.com/taiwanicdfs-international-higher-education-scholarship-program-2019/"], [["Sasol Foundation Undergraduate Bursary Scheme 2019 for young South Africans (Fully Funded)", "date announced:January 5, 2019", "Application Deadline: January 13th 2019"], ["Application Deadline: January 13th 2019", " The Sasol Foundation", " is offering all-inclusive bursaries to talented individuals who are planning to study full-time towards an Undergraduate Degree or Diploma to pursue  Science, Technology, Engineering and Mathematics (STEM) for applicants Nationally. To be considered, you must be a South African citizen and have acceptance or provisional acceptance for studies at a South African ", "public", " University or University of Technology for 2019.  ", "The Sasol Foundation is also offering STEM and Non-STEM  bursaries ", "exclusively", " for qualifying Children of Sasol Employees, Sasol Khanyisa/Inzalo Shareholders as well as applicants from Sasol fenceline communities. To be considered, you must be a South African citizen and have acceptance or provisional acceptance for studies at a South African ", "public", " University or University of Technology or TVET College for 2019.", "Requirements:", "To be considered for the ", "Sasol Foundation bursary, ", "the applicant must meet the following minimum criteria: ", "Be a South African Citizen.", "Must have acceptance or provisional acceptance for studies at a\nSouth African University or University of Technology or TVET College for\n2019.", "Combined Household Income must be less than 600 000 per annum", "Must have obtained a minimum of 50% in all subjects.", "Non-STEM", " bursaries are reserved only for ", "qualifying ", "Children of Sasol Employees, Khanyisa/Inzalo Shareholders or Candidates from Sasol Fenceline communities. ", "Bursary Worth:", "The Sasol Foundation bursary", " is a comprehensive bursary which includes the following:", "100% of the prescribed university tuition fees, registration fees and exam fees.", "An amount equal to the average rate for accommodation in a standard single room at a university residence, at the university at which the Sasol bursar is studying. This rate is determined by Sasol Foundation in conjunction with the university.", "An amount for meals based on three meals per day, as determined by the university.", "An amount for book and pocket money", "Selection Process:", "Applications should be submitted to Sasol by 13 January 2019, for the 2019 academic year", "Applications should be submitted online . For more info go to the ", "How do I Apply", " page", "Applicants, who do not have internet access or access to an internet\ncafe in their area, may contact our Sasol Bursary Application Helpline\nat ", "086 010 6235 ", "for support.", "All applicants will undergo selection based on the following criteria:", "South African Citizenship", "Household Income Verifications", "Acceptance/ Conditional Acceptance to university/ University of technology or TVET College", "Academic perfomance of the applicants", " Selection by Sasol Foundation will take place from 15 – 28 January 2019   The outcome of the selection event will be communicated to applicants ", "by the end-of- January 2019", "For More Information:", "Visit the Official Webpage of the Sasol Foundation Undergraduate Bursary Scheme Programme 2019 "], "url : https://www.opportunitiesforafricans.com/sasol-foundation-undergraduate-bursary-scheme-programme-2019/"], [["Rotterdam School of Management, Erasmus University (RSM) non-EEA Scholarships of Excellence 2019/2020 for Study in the Netherlands", "date announced:January 9, 2019", "Application Deadline: March 1st 2019"], ["Application Deadline: March 1st 2019", "For the academic year ", "2019/2020, ", "Rotterdam School of Management, Erasmus University (RSM)", " will grant several partial scholarships, depending on the quality of the applicants, for selected students from non-EEA countries who are not entitled to pay the EEA tuition fee and whose grades in their previous programmes are considered ‘excellent’. ", "Partial tuition fee waiver", "For the scholarship, no actual transmission of\nmoney takes place. The scholarship part will be subtracted from the full\nnon-EEA tuition fee (€ 18,000) before the start of the academic year\n2019/2020, enabling you to immediately pay the reduced tuition fee;\neither at once or in instalments;", "The student will receive the scholarship for ", "one academic year", ", maximum 12 months. ", "Please note", ",\nfor MSc programmes longer than 12 months you need to have sufficient\nresources to finance your studies for the remaining months of the\nprogramme;", "The value of the partial scholarship is between ", "30-70%", " of the full non-EEA tuition fee.", "Requirements:", "Prospective students from all non-EEA countries, starting their\nstudies in the academic year 2019/2020 of the following MSc programmes,\ncan apply:", "Accounting &", " ", "Financial Management", "Business Information Management", "Finance & Investments", "Finance & Investments Advanced", "Global Business & Sustainability", "Human Resource Management", "International Management/CEMS", "Management of Innovation", "Marketing Management", "Master in Management", "Organisational Change & Consulting", "Strategic Entrepreneurship", "Strategic Management", "Supply Chain Management", "In principle, a fair distribution of scholarships\nover the various MSc programmes will take place. This principle may be\ndeviated from and priority may be given to applicants for certain MSc\nprogrammes.", "The school may strive for a certain distribution\nover the continents. The school may give preference to students with one\nof the following nationalities:", "Brazilian", "Russian", "Indian", "Chinese", "Taiwanese/Korean/Filipino", "Indonesian/Vietnamese/Thai", "Iranian/Iraqi", "Azerbaijani/Georgian", "Turkish", "African (all countries)", "Mexican", "Selection criteria", "Excellence for applicants with a Bachelor of Science from ", "Dutch universities", " is proven if the average grade over the entire programme at the time of application is at least 8.0/10. Additionally, ", "a ", "GMAT score of at least 700", " is required", " – also for applicants from schools and/or programmes exempt for GMAT for admission;", "Excellence for applicants with a Bachelor of Science from ", "non-Dutch universities", "\nis proven if the average grade over the entire programme at the time of\napplication is at least the equivalent of the Dutch grade of 8.0 on the\nDutch grading scale 1 – 10. The Scholarship Committee will decide on\nthe local grade equivalents for the Dutch grade of 8.0 using the grade\ninformation included in (a.o.) the ", "Nuffic country modules", ". ", "Additionally,", " ", "a ", "GMAT score of at least 700", " is required", ";", "Only students who are not recipients of any\nother scholarships exceeding the amount of € 5,000 in total in that same\nacademic year can apply for the scholarship;", "By accepting this scholarship you agree to\nassist the RSM Recruitment and Admissions Office in the role of an\nAmbassador with promotional and support activities for approximately 8\nhours per month during the academic year;", "By accepting this scholarship you agree to start\nyour visa procedure before 1 June 2019. RSM holds the right to cancel\nyour scholarship if you have not started your visa procedure and holds\nthe right to offer the scholarship to a student on the scholarship\nwaiting list.", "Application procedure", " ", "First step is to register for the Master programme in ", "Studielink", ". Once you have registered yourself, you will receive a link to our Online Application Form (OLAF).", "It is not possible to choose for a specific\nscholarship in OLAF. RSM will choose recipients for specific\nscholarships. RSM will take your scholarship application into\nconsideration as long as you meet the minimum requirements and meet the\ndeadline(s).", "In OLAF you are required to upload a scholarship\napplication letter. The application letter (max 1 A4 size page) should\ninclude the following information:", "an explanation why you would ", "need", " a scholarship, comprising a description of the students financial situation;", "an explanation why you would ", "deserve", " a scholarship, comprising a description of academic excellence and if applicable other merits;", "if applicable: scanned copies of other scholarships granted (later on you will be asked to provide a certified copy);", "Please note that we can only take the scholarship\napplication into consideration when it is complete and meets all of the\nrequirements. This includes a minimum GMAT test score of 700, sufficient English test results and a scholarship application letter.", "When to apply?", " ", "Applicants for the MSc International Management/CEMS can apply for the scholarships between 10 October 2018 and 31 January 2019.", "Applicants for MSc programmes (except for the MSc\nInternational Management-CEMS) can apply for the scholarship between 10\nOctober 2018 and 1 March 2019.", "For More Information:", "Visit the Official Webpage of the RSM non-EEA Scholarships of Excellence 2019/2020"], "url : https://www.opportunitiesforafricans.com/rsm-non-eea-scholarships-of-excellence-2019-2020/"], [["The MINDS Diamond Empowerment Fund Scholarships 2019 for young Africans", "date announced:January 8, 2019", "Application Deadline: May 31st 2019"], ["Application Deadline: May 31st 2019", "The Mandela Institute for Development Studies (MINDS)", " has partnered with the ", "Diamond Empowerment Fund (DEF)", " to establish the first in a series of Diamond Empowerment Fund Scholarships. The Fund was inspired by Nelson Mandela who encouraged DEF’s co-founders to tell the world the positive impact Africa’s diamonds were having in building healthy and educated communities on the continent.", "MINDS’ unique approach develops Pan-African\nleaders who have a lived understanding and experience on the continent\nand who, in turn, can facilitate regional economic integration and\nsocial cohesion.  DEF is interested in contributing to creating a pool\nof young leaders committed to playing a critical role in achieving a\nmore integrated African economy.", "The MINDS Diamond Empowerment Fund Scholarship", " will be earmarked for students from a diamond producing country whose chosen post-graduate study will be in a field that meets the needs for improving the quality of life for Africans. Preference will be given to students who want to gain critical skills in short supply on the continent, e.g. in STEM areas like biotechnology, robotics, aerospace, nanotechnology, neuroscience, artificial intelligence, ICT law, mining taxation, agriculture technology, etc.", "Applications are invited from qualifying students in eligible countries, namely Angola, Botswana, Central African Republic, Democratic Republic of Congo, Lesotho, Liberia, Namibia, Sierra Leone, South Africa, Tanzania and Zimbabwe.", "Eligibility Criteria", "MINDS Scholarships are awarded to meritorious applicants following a\nrigorous selection process.  To be considered for a MINDS Scholarship,\nyou must:", "Be a national of an African country, residing in any African country", "Have been formally accepted by one or more MINDS preferred\ninstitution/s outside of your country of citizenship and/ or residency", "Have been formally accepted by one or more MINDS preferred\ninstitution/s to pursue postgraduate studies within the following year", "Have obtained at least 70% in each subject/ course in the last two completed years of study", "Produce evidence of demonstrated leadership abilities or potential\nguided by the questions/ requirements set out in the application form", "Submit a complete online application form (see below) with the required supporting documentation.", "For More Information:", "Visit the Official Webpage of the MINDS Diamond Empowerment Fund Scholarship "], "url : https://www.opportunitiesforafricans.com/the-minds-diamond-empowerment-fund-scholarship-2019/"], [["Marshal Papworth Scholarships Programme 2019/2020 at the University of Reading", "date announced:January 9, 2019", "Application Deadline: 21st February 2019, 4:00 PM GMT (Greenwich Mean Time). "], ["Application Deadline: ", "21", "st", " ", "February 2019, 4:00 PM GMT", " (Greenwich Mean Time). ", "The Marshal Papworth Scholarships Programme at Reading", " ", "is a merit and experience-based award, given to talented individuals who demonstrate that they have the potential, at the end of their Master’s programme, to motivate people and communities in their home country towards positive change. The Scholarships are offered in collaboration with the Wallace and Muriel Hurst Fund.", "Applications must meet the Eligibility Criteria outlined below. ", "Candidates\nwho fully meet the criteria will then be shortlisted against three main\nfactors: academic excellence, professional experience (includes\nexperience gained in a voluntary capacity), and the potential for\ncontribution to development in their home country after completion of\ntheir degree programme. Shortlisted applicants will then be reviewed by a\nselection panel chaired by the Director of GIIDAE.", "All applicants holding an offer of admission with GIIDAE on one of\nthe eligible programs will be sent an application form. If you want to\napply for this Scholarship, you must hold an offer of admission prior to\nthe Scholarship application deadline. Please submit your application\nfor admission well in advance in order to ensure that your application\nhas been processed prior to the Scholarship deadline. ", "Eligibility Criteria", "1. Candidates must have demonstrable work or voluntary experience\nworking in community development and/or agricultural development. ", "2. Candidates must have a 2:1 or 1", "st", " class degree at the undergraduate level (we use ", "NARIC", " to assess degree equivalency).", "3. The awards enable Scholars to study on any one of the following\none-year postgraduate Master’s courses offered by the Graduate Institute\nof International Development and Applied Economics (GIIDAE) at the\nUniversity of Reading:", "Agriculture and Development\n", "Applied International Development \n", "Climate Change and Development\n", "Communication for Development\n", "Environment and Development\n", "Food Security and Development", "At least one scholarship will be awarded to the MSc Agriculture and\nDevelopment. The remaining scholarships will be awarded to applicants\nacross a range of the remaining degree programmes.", "4. The candidate should usually be from one of the countries listed\nin Appendix 2 and be domiciled in that country at the time of their\napplication. These have been derived based on countries with a GNI per\ncapita below $11500 USD, and be residing in that country at the time of\napplication.", "5. Candidates must demonstrate that they have achieved the English\nlanguage requirements stipulated by the University of Reading – ", "www.reading.ac.uk/ad-Englishtests.aspx", " ", "6. Those who have already pursued study at the Master’s level will\nnot normally be considered unless this forms part of the entry level\ncriteria.", "7. Candidates should normally have an unconditional offer from the\nUniversity of Reading by the time they apply for the scholarship. If\ntheir offer is conditional, it will be considered, but all conditions\nmust be successfully met immediately upon request by GIIDAE. ", "8. Receipt of an application form in and of itself DOES NOT mean that\nthe candidate is eligible to apply; you must meet all of the\neligibility criteria listed above.", "9. The deadline for applications ", "21", "st", " ", "February 2019, 4:00 PM GMT", " (Greenwich Mean Time). All applications received after this date will be disqualified.", "For More Information:", "Visit the Official Webpage of the Marshal Papworth Scholarships Programme 2019/2020 "], "url : https://www.opportunitiesforafricans.com/marshal-papworth-scholarships-programme-2019-2020/"], [["Nedbank Namibia Bursary Programme 2019 for young Namibians", "date announced:January 5, 2019", "Application Deadline: January 15th 2019"], ["Application Deadline: January 15th 2019", "\nJob Functions :Banking", "Industries: Banking / Finance & Investment", "Specification: Bursaries Requirements\n", " Nedbank Namibia", " not only contributes a number of Go Green initiatives in Namibia, but also aims to contribute to the socio-economic development of the country by offering bursaries for Higher Education to suitably qualified Namibians.", "This exciting opportunity is available to broaden access to tertiary education, young Namibians who intend on pursuing undergraduate or postgraduate studies are hereby invited to submit their bursary applications ", " Eligibility to apply for a bursary", " Namibian Citizenship", " Grade 12, April and August results (Academic Performance of minimum 30 points)", " Provisional admission letter from a recognized Tertiary Institution", " Academic progress report if already a Tertiary student ", "Requirements: ", "Bursaries are awarded to successful applicants selected on merit who wish to study on a full-time or part-time basis for a first-time Undergraduate Degree, Postgraduate Degree or Diploma (including B-Tech), at an accredited Higher Institution of Learning in the fields listed below:", " Information Technology", " Risk Management", " Data Science", " Treasury", " Finance", " Retail & Business Banking\n", "For More Information:", "Visit the Official Webpage of the Nedbank Namibia Bursary Programme 2019 "], "url : https://www.opportunitiesforafricans.com/nedbank-namibia-bursary-programme-2019-for-young-namibians/"], [["Aga Khan Foundation International Scholarship Programme 2019/2020 for Postgraduate Studies Abroad.", "date announced:January 9, 2019", "Application Deadline: March 31st 2019"], ["Application Deadline: March 31st 2019", "The Aga Khan Foundation 2019-20 International Scholarship Programme application cycle", " is now open. Application forms can be obtained from the Aga Khan Foundation or Aga Khan Education Board/Service office in the applicant’s country of current residence.", "NOTE: For the 2019-20 application\ncycle, the Foundation will not accept applications from students\nplanning to attend universities in UK, Germany, Sweden, Austria,\nDenmark, The Netherlands, Italy, Norway and Ireland.", "The Aga Khan Foundation provides a limited number of scholarships each year for postgraduate studies to outstanding students from select developing countries who have no other means of financing their studies, in order to develop effective scholars and leaders and to prepare them for employment, primarily within the AKDN.  ", "Scholarships are awarded on a 50% grant : 50% loan basis through a competitive application process once a year in June or July.  The Foundation gives priority to requests for Master’s level courses but is willing to consider applications for PhD programmes, only in the case of outstanding students who are highly recommended for doctoral studies by their professors and who need a PhD for the fulfilment of their career objectives (academic or research oriented).", "Applications for short-term courses are not considered; neither are\napplications from students who have already started their course of\nstudy.", "ELIGIBILITY", "Geographic Scope", "The Foundation accepts applications from nationals of the following\ncountries: Bangladesh, India, Pakistan, Afghanistan, Tajikistan,\nKyrgyzstan, Syria, Egypt, Kenya, Tanzania, Uganda, Madagascar and\nMozambique.  In France, Portugal, UK, USA and Canada, applications are\naccepted from those who are originally from one of the above developing\ncountries, are interested in development-related studies and who have no\nother means of financing their education.", "Residency Requirement", "The Foundation only accepts applications of eligible nationals listed\nabove who are residing in one of the countries where there are local\nAga Khan Foundation (AKF), Aga Khan Education Services (AKES), or Aga\nKhan Education Board (AKEB) offices which process applications and\ninterview candidates.", "Age Limit", "Preference is given to students under 30 years of age.", "SELECTION CRITERIA", "The main criteria for selecting award winners are: l) consistently\nexcellent academic records, 2) genuine financial need, 3) admission to a\nhighly reputable university or programme of study and 4) relevance of\nthe field of study to AKDN’s focus areas.  Candidates are also evaluated\non demonstrating thoughtful and coherent educational and career plans,\ntheir extra-curricular interests and achievements, potential to achieve\ntheir goals and likelihood to succeed in a foreign academic\nenvironment.  Applicants are expected to have some years of work\nexperience in their field of interest.", "Financial Assistance", "The Foundation assists students with tuition fees and living expenses only.  The cost of travel is not included in AKF scholarships.  Funding for PhD programmes is only provided for the first two years of study, after which the students are expected to find alternative sources of assistance.  Financial assistance is provided according to the needs of students, but the ISP must be considered a lender of last resort.  ", "Applicants are requested to make every effort to obtain funding from other sources as well, so that the amount requested from the Foundation can be reduced to a minimum.  Preference is given to those who have been able to secure some funding from alternative sources.", "Loan Conditions", "Half of the scholarship amount is considered as a loan, which must be\nreimbursed with an annual service charge of 5%.  A guarantor is\nrequired to co-sign the loan agreement.  The payback period is five\nyears, starting six months after the study period funded by the Aga Khan\nFoundation.", "Application Procedures", "The application procedures of AKF’s International Scholarship\nProgramme are decentralised.  Students may obtain application forms as\nof 1st  January each year from ", "AKF offices", " or ", "Aga Khan Education Services / Boards", "\nin their countries of current residence.  Completed applications should\nbe returned to the agency from which the form was obtained. They should\nnot be sent to Geneva.", "Application Deadline", "The deadline for submission of entire completed applications is 31\nMarch, although in certain countries internal deadlines may be earlier\nin order to process and review applications.  Applicants are advised to\ncontact the local offices for internal deadline dates and requirements\nas these may vary from country to country.  Late or incomplete\napplications will not be accepted.", "Country Offices", "Internal Deadlines", "Aga Khan Foundation (Bangladesh)", "Deadline for submitting pre-application forms:", "8th March, 2019", "           \nDeadline for submitting completed applications:", "31st March, 2019", "Aga Khan Foundation (India)", "Deadline for application distribution:", "15th March, 2019 (7:00 pm IST)", "              \nDeadline for submitting completed applications:", "20th March, 2019 (5:00 pm IST)", "Aga Khan Foundation (Pakistan)", "Aga Khan Education Services (Pakistan)", "Deadline for submitting pre-application forms:", "15th March, 2019 (5.00 pm IST)           ", "\nDeadline for submitting completed applications:", "31st March, 2019", " ", "(5:00 pm IST)", "Aga Khan Foundation (Portugal)", " ", "Deadline for submitting completed applications:", "30th March, 2019", "INTERVIEW AND SELECTION NOTIFICATION", "Applicants should be prepared to be interviewed by local Scholarship\nCommittees about their financial situation, their academic performance,\nextra-curricular achievements and career plans.", "The annual Scholarship Selection Meeting takes place in late June or\nearly July and the Aga Khan Foundation notifies all students of the\noutcome of their application shortly thereafter.", "For More Information:", "Visit the Official Webpage of the Aga Khan Foundation International Scholarship Programme 2019/2020 "], "url : https://www.opportunitiesforafricans.com/aga-khan-foundation-international-scholarship-programme-2019-2020/"], [["Türkiye Undergraduate & Postgraduate Scholarships Program 2019 for Studies in Turkey (Fully Funded)", "date announced:January 15, 2019", "Application Deadline: 20th February 2019 "], ["Application Deadline: 20th February 2019 ", " Apart from providing education opportunities at an international caliber as well as a wealth of knowledge and experience, Turkey offers scholarships to international students from all over the world to study in the most prestigious universities in Turkey.", " Türkiye Scholarships", " is a government-funded, competitive scholarship program, awarded to outstanding students to pursue full-time or short-term program at the top universities in Turkey. ", "Türkiye Scholarships", " aims to build a network of future leaders committed to strengthening cooperation among countries and mutual understanding among societies.  ", "Requirements:", "\nPrograms open for application are: Undergraduate and Postgraduate Programs ", "\nApplications will be open to applicants who wish to study at bachelor’s, master’s and doctoral levels. ", "\nOther programs such as Research Scholarships, Success Scholarships, and\nKATİP have different application periods and are announced regularly on\nour website and social media channels.\n", "Application Period:", "Türkiye Scholarships applications for 2019 will be received in one period, and applications will be open between 15th January- 20th February 2019 for international students from all countries.", "Scholarship Worth:", "Full-Time Programs", "Undergraduate Scholarship Program (akordeon menüler olabilir)", "University and program placement", "Monthly Stipend: 700 TL per month", "Tuition Fee", "Once-off Return Flight Ticket", "Health Insurance", "Accomodation", "One year Turkish Language Course", "Length of award: 1 year Turkish Language course + 4-6 years (depending on the normal duration of the program)", "\n ", "Postgraduate Scholarship Program ", "University and program placement", "Monthly Stipend:\n", "Master’s: 950 TL per month", "PhD: 1400 TL per month", "Tuition Fee", "Once-off Return Flight Ticket", "Health Insurance", "Accomodation", "One year Turkish Language Course", "Length of award:\n", "Master’s: 1 year Turkish Language course + 2 years", "PhD: 1 year Turkish Language course + 4 years", "\n ", "Short-Term Programs", "Success Scholarship Program (1 year)", "Monthly Stipend:\n", "Bahcelor’s: 440 TL per month", "Master’s: 590 TL per month", "Phd: 880 TL per month", "Success scholarship program does not cover accomodation and other amenities", "Research Scholarship Program (3-10 months):", "Monthly Stipend: 3.000 TL per month", "Research scholarship does not cover accomodation and other amenities", "Turkish Language & Culture Programs", "Turkish Language Programme for Public Officials and Academicians [KATİP] (8-10 months)", "Monthly Stipend: 2.000 TL per month", "Once-off Return Flight Ticket", "Accomodation", "Turkish Language Course", "KATİP program does not cover health insruance", "Application Procedure:", "Applications can only be made individually through ", "www.turkiyeburslari.gov.tr", " by the candidates.", " There are no institutions or persons authorized to apply for Türkiye Scholarships. ", "\nCandidates are strongly advised to carefully read the instructions and warnings in the application system.\n", "\nApplicants are required to submit and upload the necessary documents to the application system.\n", "\nApplications delivered by post, courier, or by hand will not be accepted.\n", "\n​Applications\nare free of charge. Please do not entertain any third party\ninstitutions or persons who offer to make an application on behalf of\nyou in exchange for a fee.\n", "\nTürkiye\nScholarships include both scholarship and university placement at the\nsame time. Applicants will be placed in a university and program among\ntheir 12 preferences which they choose in the application system\n", "Required Documents", "All candidates must submit the following documents during online application:", "A valid National Identification Document OR a valid Passport", "A recent Photo of the candidate (Please note that the photo you upload into the Application system must be a proper portrait of yourself, candidate photos which are not identifiable will undermine the evaluation of your application)", "National exam scores (required for candidates who do not possess any international qualification or certification)", " Diploma or temporary certificate of Graduation ", " Academic transcripts (online screenshots and uncertified transcripts will undermine the evaluation of your application) ", " International exam scores (GRE, GMAT, DELF, YDS, YÖS …etc. if required by the chosen university & program) ", " Language test scores (if required by the chosen university & program) ", " A research proposal and an example of your written work (for PhD applicants only) ", "Applications can only be made individually through ", "www.turkiyeburslari.gov.tr", " by the candidates.", " There are no institutions or persons authorized to apply for Türkiye Scholarships. ", "\nCandidates are strongly advised to carefully read the instructions and warnings in the application system.\n", "\nApplicants are required to submit and upload the necessary documents to the application system.\n", "\nApplications delivered by post, courier, or by hand will not be accepted.\n", "\n​Applications\nare free of charge. Please do not entertain any third party\ninstitutions or persons who offer to make an application on behalf of\nyou in exchange for a fee.\n", "\nTürkiye\nScholarships include both scholarship and university placement at the\nsame time. Applicants will be placed in a university and program among\ntheir 12 preferences which they choose in the application system\n", "Required Documents", "All candidates must submit the following documents during online application:", "A valid National Identification Document OR a valid Passport", "A\nrecent Photo of the candidate (Please note that the photo you upload\ninto the Application system must be a proper portrait of yourself,\ncandidate photos which are not identifiable will undermine the\nevaluation of your application)", "National exam scores (required for candidates who do not possess any international qualification or certification)", "\nDiploma or temporary certificate of Graduation\n", "\nAcademic transcripts (online screenshots and uncertified transcripts will undermine the evaluation of your application)\n", "\nInternational exam scores (GRE, GMAT, DELF, YDS, YÖS …etc. if required by the chosen university & program)\n", "\nLanguage test scores (if required by the chosen university & program)\n", "\nA research proposal and an example of your written work (for PhD applicants only)\n", "For More Information:", "Visit the Official Webpage of the Türkiye Undergraduate & Postgraduate Scholarships Program 2019"], "url : https://www.opportunitiesforafricans.com/turkiye-undergraduate-postgraduate-scholarships-program-2019/"], [["ONASSIS FELLOWHIPS PROGRAM 2019/2020 FOR INTERNATIONAL SCHOLARS to Study in Greece (Funded)", "date announced:January 3, 2019", "Application Deadline: February 28th 2019"], ["Application Deadline: February 28th 2019", " ", "The Onasis Fellowship Program for international scholars ", "was introduced in 1995 and is aimed at academics of all ranks – members of national Academies, Ph.D. holders and post-doctoral researchers – to conduct research in Greece in subjects relating to Greek culture and society. The scholarships are also aimed at citizens of Cyprus who are not Greek residents, while the Greek diaspora, second generation Greeks, and Greeks who permanently reside abroad and have been studying or have been employed in foreign Universities for over 10 or 15 years, may also be accepted.", "The Program aims at promoting Greek language and culture abroad, thereby creating and encouraging ties of friendship and cooperation between members of the academic community. The selection is based on the recommendations made by special committees consisting of professors, scientists and former scholars, and is validated by the Foundation’s Board of Directors. ", "Eligible Countries:", "Albania, Argentina, Armenia, Australia, Austria, Belgium, Bosnia-Herzegovina, Brazil, Bulgaria, ", "Cameroon,", " Canada, Chile, China, Congo, Croatia, Cuba, Cyprus, Czech Republic, ", "Egypt,", " Estonia, Finland, France, Georgia, Germany, ", "Ghana,", " Greece, Hungary, Iceland, India, Iran, Ireland, Israel, Italy, Japan, Jordan, Kazakhstan, Latvia,  Lithuania, Mexico, Moldavia, Mongolia, Montenegro, ", "Morocco,", " Pakistan, Peru, Poland, Portugal, Romania, Russia, S. Korea, Serbia, Slovakia, Slovenia, ", "S. Africa,", " Spain, Sri Lanka, Sweden, The Netherlands,", " Tunisia,", " Turkey, Ukraine, United Kingdom, Uruguay, U.S.A., Uzbekistan, Venezuela. ", "GENERAL CONDITIONS OF PARTICIPATION   ", "The Program covers scholarly research in Greece only and in the fields stated above. ", "1. Eligible to participate are the following candidates: ", "a) Persons of non-Greek descent ", "b) Cypriot citizens are also eligible to apply for Category D and E fellowship only, provided they permanently reside and work outside Greece ", "c) Persons of Greek descent (second generation and on) are also eligible to apply for a fellowship or scholarship, provided they permanently reside and work abroad or currently study in foreign Universities ", "d) Category D and E also applies to Scholars of Greek descent or citizenship provided they have a professional academic career of at least ten (10) years in a University or Research Institute abroad ", "e) The above mentioned clarification", " (d) also applies to Ph.D. candidates of Greek descent or citizenship, who pursue post-graduate studies outside of Greece ( Category C – please see below), have conducted their high school studies and have obtained a degree outside Greece and permanently reside outside Greece for more than fifteen (15) years ", "\n    – ", "Announcement", "    – ", "Online application for professors of all academic ranks", "     – ", "Online application for post-doctoral researchers", "For further information, please contact the Onassis Fellowships Program for International Scholars:", "E-mail: ", "[email protected]", "Phone number: +30 210 37 13 018\n", "For More Information:", "Visit the Official Webpage of the ONASSIS FELLOWHIPS PROGRAM 2019/2020"], "url : https://www.opportunitiesforafricans.com/onassis-fellowhips-program-2019-2020/"], [["Invest Your Talent in Italy Scholarships 2019/2020 for International students (Funded to study in Italy)", "date announced:January 1, 2019", "Application Deadline: January 31, 2019 until 12:00 (Midday, Italian time). "], ["Application Deadline: January 31, 2019 until 12:00 (Midday, Italian time). ", "The University of Macerata is partner of the ", "Invest your talent in Italy programme", " which offers the opportunity to students from Azerbaijan, Brazil, Colombia", ", Egypt, Ethiopia, Ghana, ", "India, Indonesia, Iran, Kazakhstan, Mexico", ", ", "People’s Republic of China, ", "Tunisia, ", "Turkey and Vietnam to attend selected Master’s courses in English in prestigious Italian universities. The programme combines university lectures with practical on-the-job training with an Italian company.", "In order to apply for a ", "IYT scholarship", ", students have to:", "submit their ", "pre-admission application", " for one of the selected Master’ course offered in english as ", "GLOBAL POLITICS and INTERNATIONAL RELATIONS / GPR", ", run by the ", "Department of Political Science, Communication and International Relations", ";", "Then candidates must complete and submit the ", "on-line application form", " by January 31, 2019 until 12:00 (Midday, Italian time).", "Once selected, students will have access to scholarships, fee\nexemption, Italian language courses, internship in an Italian company\nand cultural activities.", "For More Information:", "Visit the Official Webpage of the Invest Your Talent in Italy Scholarships 2019/2020 "], "url : https://www.opportunitiesforafricans.com/invest-your-talent-in-italy-scholarships-2019-2020/"], [["2019 University of Nottingham Developing Solutions Masters Scholarship for Study in the UK ( 105 Scholarships Available)", "date announced:January 7, 2019", "Application Deadline:  22 March 2019."], ["Application Deadline: ", " 22 March 2019.", "Do you want to make a difference to the development of your home country? Founded in 2001, ", "Developing Solutions", " is The University of Nottingham’s flagship international scholarship programme for postgraduate masters courses.", "Scholarships are available for 2019 entry:", " 100% tuition fee, and ", " 50% of tuition fees", " *", " ", "Eligibility Requirements:", "\nare a national of (or permanently domiciled in) ", "Africa", ", ", "India,", " ", "OR", " one of the ", "countries of the Commonwealth", " listed below** ", "AND", "\nare classed as an overseas student for fee purposes ", "AND", "\nhave not already studied outside of your home country***", " AND", "\nare not currently studying at a University of Nottingham campus or are not a University of Nottingham graduate", " AND", "hold an offer to start a full-time masters degree programme\n(excluding MRes), at Nottingham for September 2019 in an area of study\nwithin the (click each link below to see which faculty your school /\ndepartment is in):\n", "Faculty of Engineering", ", ", "Faculty of Medicine and Health Sciences", ", ", "Faculty of Science", ", ", "Faculty of Social Sciences", "* Number of award numbers to be confirmed.", "**Anguilla, Antigua and Barbuda, Bangladesh, Barbados, Belize,\nBermuda, British Virgin Islands, Brunei, Cayman Islands, Dominica,\nDominican Republic, Falkland Islands, Fiji, Gibraltar, Grenada, Guyana,\nJamaica, Kiribati, Malaysia, Maldives, Montserrat, Nauru, Nepal,\nPakistan, Papua New Guinea, Pitcairn Islands, Samoa, Solomon Islands,\nSri Lanka, St Helena, St Kitts and Nevis, St Lucia, St Vincent and the\nGrenadines, Tonga, Trinidad and Tobago, Tristan da Cunha, Turks and\nCaicos Islands, Tuvalu, Vanuatu.", "For More Information:", "Visit the Official Webpage of the 2019 Developing Solutions Masters Scholarship"], "url : https://www.opportunitiesforafricans.com/2019-developing-solutions-masters-scholarship/"], [["Open Society Foundation Civil Society Scholar Awards (CSSA) 2019/2020 for Doctoral Students & University Faculty.", "date announced:January 16, 2019", "Application Deadline: March 29th 2019"], ["Application Deadline: March 29th 2019", "The Civil Society Scholar Awards (CSSA)", " support international academic mobility to enable doctoral students and university faculty to access resources that enrich socially-engaged research and critical scholarship in their home country or region.", "Civil Society Scholars are selected on the basis of their outstanding\ncontributions to research or other engagement with local communities,\nto furthering debates on challenging societal questions, and to\nstrengthening critical scholarship and academic networks within their\nfields.", "\nEligibility Criteria ", "The awards are open to the following academic populations:", "doctoral students of eligible fields studying at accredited universities inside or outside of their home country", "full-time faculty members (must have a minimum of a master’s degree) teaching at universities in their home country", "Candidates must be citizens of the following\ncountries: Afghanistan, Albania, Angola, Azerbaijan, Belarus, Bosnia and\nHerzegovina, Cambodia, Democratic Republic of Congo, Republic of Congo,\nEgypt, Equatorial Guinea, Eritrea, Ethiopia, Guinea, Haiti, Kosovo,\nLaos, Libya, Macedonia, Moldova, Mongolia, Myanmar/Burma, Nepal,\nPalestine, Papua New Guinea, Serbia, Sudan, South Sudan, Syria,\nSwaziland, Tajikistan, Tunisia, Turkmenistan, Uzbekistan, or Yemen. ", "Project duration: between two and 12 months", "Project location: projects must take place outside of the country of the applicant’s current residence", "Eligible dates: September 1, 2019–August 31, 2020", "Maximum funding requests: $15,000", "Application Guideline:", "\nGuidelines", "Competition\nfor the CSSA awards is merit-based. Selection will be made on the basis\nof proven academic excellence, a clear and justifiable need for\ninternational travel to complete the research project, and relevance of\nthe project to the development of open society in the applicant’s home\ncountry. ", "Applicants are strongly encouraged to check the visa requirements of\nthe host country (including the minimum level of funding required)\nbefore applying to the program.  ", "Detailed guidelines on the conditions of these awards are available in the Download Files section.", "Online Applications", "Applicants are strongly advised to ", "submit their application online", ".", "Paper Applications", "For those wishing to submit a paper application, an application form\nand budget/timeline template can be downloaded from the Download Files\nsection.", "For More Information:", "Visit the Official Webpage of the Open Society Foundation Civil Society Scholar Awards (CSSA) 2019/2020"], "url : https://www.opportunitiesforafricans.com/open-society-foundation-civil-society-scholar-awards-cssa-2019-2020/"], [["Next Einstein Initiative African Institute of Mathematical Sciences (AIMS) Master’s Program 2019/2020 Scholarships (Fully Funded)", "date announced:January 4, 2019", "Application Deadline: March 31st 2019"], ["Application Deadline: March 31st 2019", "The co-operative version of the ", "AIMS Structured Master’s program, ", " offered only at AIMS Senegal, AIMS Cameroon and AIMS Rwanda builds on the core ", "AIMS Master’s program", " and leads to the same AIMS Structured Master’s degree in mathematical sciences.", "The 18-month program takes a work-integrated learning approach by combining course work with practical industry experience. This allows students to apply their scientific knowledge to real world problems while gaining work experience in an industrial environment. The program enables students to develop the necessary professional skills to transition from academic studies to progressive careers in industry (defined as private or public businesses, government, non-governmental organisations, and civil society). ", "The Co-operative Master’s program ", " includes two work placements of three and four months throughout the regular coursework. Successful completion of all coursework and both work placements is required for graduation.", " The Co-operative Master’s program is designed specifically to prepare students for work in the areas of big data and IT security. Applicants are requested to choose their preferred area of focus. ", "Eligibility requirements include;", "Applicants\nmust have a conferred 4-year university degree in mathematics and\nscience or engineering subject with a significant mathematics component\nor anticipate completing by the start date of the AIMS course.", "Applicants should demonstrate a strong aptitude in mathematics, leadership and community service. ", "Women applicants are strongly encouraged to apply", ". ", "Selection Process", "Potential applicants must demonstrate both a high degree of motivation and the ability to complete the course successfully. Late applications will be considered on a case-by-case basis. Master’s degrees are awarded in partnership with leading local academic institutions affiliated with AIMS centers.", " ", " Financial Assistance", " There are no course fees for successful applicants. Full bursaries covering tuition, accommodation, meals, and travel costs are also awarded to successful applicants.", " ", "Click ", "here", " to apply for AIMS Master’s in Mathematical Sciences", "Click ", "here", " to apply for AIMS Co-operative Master’s in Mathematical Sciences", "For More Information:", "Visit the Official Webpage of the AIMS Co-operative Master’s Program 2019/2020 "], "url : https://www.opportunitiesforafricans.com/aims-co-operative-masters-program-2019-2020-scholarships/"]]